[{"position":"Extraction Technician","labName":"Trulieve","location":"Hancock, MD","age":"5 days ago","type":"Full-time","salaryMin":"$33,000 ","salaryMax":" $43,000 a year","jobDescriptionCopy":"“Trulieve Grows One Patient at a Time”\n\nIf you have an interest in being part of one of the fastest growing industries in the nation in you may consider wanting to work for Trulieve! If you have a desire to help others in need through your efforts, this may be the role for you!\n\nAt Trulieve, we strive to bring our patients the relief they need in a product they can trust. Our plants are hand-grown in an environment specially designed to reduce unwanted chemicals and pests, keeping the process as natural as possible at every turn.\n\nOur products are designed to alleviate seizures, severe and persistent muscle spasms, pain, nausea, loss of appetite, and other symptoms associated with serious medical conditions such as cancer.\n\nOur specially trained staff works hand-in-hand with physicians to provide the right products and the correct dosage to ensure patients get the compassionate care they need.\n\nRequisition ID: 1076\n\nRemote Work Available: No\n\nJob Title: Extraction Technician\n\nDepartment: Manufacturing\n\nLocation: Hancock, MD\n\nShift: 1st, 2nd, 3rd\n\nRole Summary:\nTrulieve is looking for an Extraction Technician to support our extraction and production operations. You should be very technically astute in mechanical, electrical, and computer operated systems utilized in production/manufacturing environments. You need to be proactive, quick thinking and innovative in your approach.\n\nKey Duties and Responsibilities:\nPreparation of equipment and plant materials for extraction\nExecution of extraction and processing in accordance with state and local standards\nOperation of sophisticated extraction equipment\nEnsure consistency and efficiency of product through quality control testing and procedures\nCleaning and maintenance of extraction equipment and manufacturing facility\nMaintaining strict inventory records of all plant materials, chemicals, and equipment used in the facility\nOversee day-to-day operations of the entire extraction space beginning with storing the raw cannabis through the extraction process and all the way to fulfillment of orders\nOperating, maintaining, and making adjustments and repairs to extraction equipment\nStoring supplies and equipment and disposal of waste according to guidelines\nComplete the cleaning and sanitization of all production equipment, work surfaces, and tools\nMaintaining inventory records of supplies, materials, and equipment and preparing requisitions as needed\nMaintaining material safety data sheets for all chemicals and products\nFollowing all standard operating procedures regarding product creation and lab safety\nAssist in packaging and labeling of finished products\nWorks with testing laboratory as defined by state guidelines\nAll other duties as assigned\n\nRequirements\n\nSKILLS AND QUALIFICATIONS:\nBachelor’s or Associate degree or its equivalent, from a recognized college or university, with a major in chemistry or biology preferred\nUnderstanding of state and local laws\nUnderstanding of proper and safe handling of hazardous materials\nFamiliarity with separations, isolations and fractionation\nKnowledge of solvent and non-solvent extraction methods\nStay current of practices and new developments in the cannabis extraction industry\nAbility to work quickly without compromising accuracy\nAbility to discern the quality of plant material and finished products\nStrong computer and social skills\n\nPHYSICAL REQUIREMENTS:\nMust be able to push, pull, move, and/or lift a minimum of 25lbs to a minimum height of 5 feet and able to push, pull, move, and/or carry such weight a minimum distance of 50 feet, with or without mechanical assistance\nMust be able to work seated/standing as appropriate at workstations for extended periods of time, maintain body equilibrium while climbing ladders, stairways, stopping, kneeling, crouching, and reaching, and use hands/fingers to hold, grasp, turn, pick, pinch frequently/constantly to complete tasks\nMust be able to handle organic matter daily, able to wear PPE as appropriate (eye, face, hand, arm, head, foot, body, fall protection), and able to be exposed to hot, cold, wet, humid, or windy conditions while wearing PPE (95 degrees or greater)\nMust have visual acuity with/without job aids to perform activities such as; reading, viewing a computer terminal, visual inspection involving small parts/details. Clarity of vision at 20 ft or more in day and night/dark conditions\nMust be able to speak and communicate verbally at conversation levels with co-workers, vendors, etc. (Moderate noise)\n\nWORK SCHEDULE:\n40+ hours weekly with flexible hours depending on department needs. Must be available to work occasional evenings, weekends, and holidays\n\nEqual Opportunity Employer l Trulieve Supports a Drug Free Workplace\n\nSalary will be commensurate with experience. A comprehensive benefits package including paid time off is offered with this position. This position will work an average of 40 hours per week and will be available “after hours” if an emergency situation should arise.\n\nTrulieve provides equal employment opportunities to all employees and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, pregnancy or any other characteristic protected by federal, state or local laws.","slug":"extraction-technician-a28d1072-b8dc-4ed3-8362-fca4f774d046","benefits":["Paid time off","Flexible schedule","Health insurance"],"selectedSkills":["Computer skills","Bachelor's degree","Associate's degree"],"jobType":"free","applyURL":"https://careers.trulieve.com/job/Hancock-Extraction-Technician-MD-21750/890391100/?feedId=364400&utm_source=Indeed&utm_campaign=Trulieve_Indeed"},{"position":"Extraction Team Lead","labName":"Trulieve","location":"Adel, GA","age":"5 days ago","type":"Full-time","salaryMin":"$40,000 ","salaryMax":" $53,000 a year","jobDescriptionCopy":"“Trulieve Grows One Patient at a Time”\n\nIf you have an interest in being part of one of the fastest growing industries in the nation in you may consider wanting to work for Trulieve! If you have a desire to help others in need through your efforts, this may be the role for you!\n\nAt Trulieve, we strive to bring our patients the relief they need in a product they can trust. Our plants are hand-grown in an environment specially designed to reduce unwanted chemicals and pests, keeping the process as natural as possible at every turn.\n\nOur products are designed to alleviate seizures, severe and persistent muscle spasms, pain, nausea, loss of appetite, and other symptoms associated with serious medical conditions such as cancer.\n\nOur specially trained staff works hand-in-hand with physicians to provide the right products and the correct dosage to ensure patients get the compassionate care they need.\n\nRequisition ID: 1017\n\nRemote Work Available: No\n\nJob Title: Extraction Lead\n\nDepartment: Processing\n\nFLSA Status: Regular- Non-Exempt\n\nLocation: Adel, GA\n\nRole Summary:\nTrulieve is looking for an Extraction Lead to support our extraction and production operations.? You should be very technically astute in mechanical, electrical, and computer operated systems utilized in production/manufacturing environments. You need to be proactive, quick thinking and innovative in your approach.\n\nKey Duties and Responsibilities:\nEnsure that team members are properly communicated the goals of the shift, week, and month\nTraining new team members on extraction equipment and procedures.\nEnsuring policy and procedure compliance across all processes within the department.\nMonitoring employee attendance and performance.\nOversee equipment cleaning and maintenance policies, ensuring equipment is well maintained.\nMaintaining strict inventory records of all plant materials, chemicals, and equipment used in the facility, assisting in improving records when needed\nOversee process flow throughout department, making changes in allocation of resources to meet demand\nOperating, maintaining, and making adjustments and repairs to extraction equipment\nEnsuring team members store supplies and equipment and disposal of waste according to guidelines\nMaintaining inventory records of supplies, materials, and equipment and preparing requisitions as needed\nMaintaining material safety data sheets for all chemicals and products\nFollowing all standard operating procedures regarding product creation and lab safety\nWorks with testing laboratory as defined by state guidelines\nOther duties as assigned\n\nSKILLS AND QUALIFICATIONS:\nBachelor’s or Associate degree or its equivalent, from a recognized college or university, with a major in chemistry or biology preferred\nUnderstanding of state and local laws\nUnderstanding of proper and safe handling of hazardous materials\nFamiliarity with separations, isolations and fractionation\nKnowledge of solvent and solvent free extraction methods\nStay current of practices and new developments in the cannabis extraction industry\nAbility to work quickly without compromising accuracy\nAbility to discern the quality of plant material and finished products\nStrong computer and social skills\nCannabis knowledge including specifically Ethyl extraction\nStrong leadership skills\nStrong communication skills\nManufacturing experience preferred\n\nADDITIONAL MINIMUM QUALIFICATIONS:\nMust be a minimum of 21 years of age\nMust successfully complete a comprehensive background screening\n\nPHYSICAL REQUIREMENTS:\nMust be able to push, pull, move, and/or lift a minimum of 50 lbs to a minimum height of 5 feet and able to push, pull, move, and/or carry such weight a minimum distance of 50 feet, with or without mechanical assistance\nMust be able to work seated/standing as appropriate at workstations for extended periods of time, maintain body equilibrium while climbing ladders, stairways, stopping, kneeling, crouching, and reaching, and use hands/fingers to hold, grasp, turn, pick, pinch frequently/constantly to complete tasks\nMust be able to handle organic matter daily, able to wear PPE as appropriate (eye, face, hand, arm, head, foot, body, fall protection), and able to be exposed to hot, cold, wet, humid, or windy conditions while wearing PPE (95 degrees or greater)\nMust have visual acuity with/without job aids to perform activities such as; reading, viewing a computer terminal, visual inspection involving small parts/details. Clarity of vision at 20 ft or more in day and night/dark conditions\nMust be able to speak and communicate verbally at conversation levels with co-workers, vendors, etc. (Moderate noise)\n\nWORK SCHEDULE:\n40+ hours weekly with flexible hours depending on department needs. Must be available to work occasional evenings, weekends, and holidays\n\nEqual Opportunity Employer l Trulieve Supports a Drug Free Workplace\n\nCustom Fields\n\nSalary will be commensurate with experience. A comprehensive benefits package including paid time off is offered with this position. This position will work an average of 40 hours per week and will be available “after hours” if an emergency situation should arise.\n\nTrulieve provides equal employment opportunities to all employees and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, pregnancy or any other characteristic protected by federal, state or local laws.","slug":"extraction-team-lead-d96d490e-db26-43e3-9f78-bd780d1a2b9f","benefits":["Health insurance","Paid time off","Flexible schedule"],"selectedSkills":["Manufacturing","Computer skills","Leadership","Communication skills","Bachelor's degree","Associate's degree","21 years or older"],"jobType":"free","applyURL":"https://careers.trulieve.com/job/Adel-Extraction-Team-Lead-GA-31620/888908500/?feedId=364400&utm_source=Indeed&utm_campaign=Trulieve_Indeed"},{"position":"Laboratory Technician - SVOA Extraction","labName":"Montrose Environmental Group, Inc.","location":"Orange, CA","age":"2 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 2,500 employees across 70+ locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicity testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Orange, CA facility is currently seeking a Full-Time Laboratory Technician to join our team.\n\nAs a key member of the laboratory team, this role will be responsible for a full range of activities including:\n\nPreparation of samples for analysis\nPreparation of reagents for lab use and/or shipment\nSample extractions\nDetermining the volume of samples\nCleaning of laboratory glassware\nMaintaining clean laboratory areas\nMaintaining organized records of sample preparation and analysis\nCourier supplies to and/or samples from client sites\nOverhead projects designed to improve efficiency of, or accuracy of analyses\nAssisting the Group Leaders and analysts in acquiring and inventorying consumables, chemicals, and parts for instrumentation\nDispose of laboratory waste in a safe manner following prescribed procedures\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Lab Director\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nHigh School diploma or equivalent required\n\nPREFERRED SKILLS\n\nPrior Laboratory experience preferred but not required as this is an entry level position\nKnowledge of analytical method, analytical instruments, general lab practices and lab safety\nAbility to work independently and in a team\nGood organizational skills and strong communication skills\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"laboratory-technician-svoa-extraction-98a9dafe-a367-4f47-92ac-b708e5b97546","benefits":["401(k)","Disability insurance","Parental leave","Tuition reimbursement"],"selectedSkills":["Laboratory experience","Communication skills","Organizational skills","High school diploma or GED"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-CA-Orange/Laboratory-Technician---SVOA-Extraction_R2154?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Manufacturing Manager","labName":"Trulieve","location":"Quincy, FL","age":"2 days ago","salaryMin":"$63,000 ","salaryMax":" $81,000 a year","jobDescriptionCopy":"“Trulieve Grows One Patient at a Time”\n\nIf you have an interest in being part of one of the fastest growing industries in the nation in you may consider wanting to work for Trulieve! If you have a desire to help others in need through your efforts, this may be the role for you!\n\nAt Trulieve, we strive to bring our patients the relief they need in a product they can trust. Our plants are hand-grown in an environment specially designed to reduce unwanted chemicals and pests, keeping the process as natural as possible at every turn.\n\nOur products are designed to alleviate seizures, severe and persistent muscle spasms, pain, nausea, loss of appetite, and other symptoms associated with serious medical conditions such as cancer.\n\nOur specially trained staff works hand-in-hand with physicians to provide the right products and the correct dosage to ensure patients get the compassionate care they need.\n\nRequisition ID: 1081\n\nRemote Work Available: No\n\nPosition Summary\n\nThe Extraction Manager is responsible for leading and navigating day-to-day oil extraction laboratory operations. This includes working with extraction equipment to assist with the extraction process, cleaning equipment, and conducting general extraction lab duties, to ensure products consistently meet specifications. In addition, ensure processes and procedures are optimized, equipment is maintained regularly, and workflow meets the necessary specifications. Our goal is to optimize lab procedures and succeed in producing consistent, safe, and quality products. Communication skills, organization, attention to safety, detail, and time management are critical to the success of our lab.\n\nCore Duties\n\nUnder direction of the Plant Manager and Assistant Plant Processing Manager, the Extraction Manager duties shall include, but not be limited to, the following:\n\nProvide supervision and leadership to the Extraction Lab, regarding production schedules, associated testing, continuously improving quality, reducing waste, and increasing throughput.\nLeading the operation and maintenance of extraction equipment.\nHelp develop and execute Standard Operating Procedures (SOPs).\nOversee the front-end processing of raw materials, including weighing, grinding, cleaning and general lab work.\nEnsure preparation of the workspace, equipment, and materials daily.\nOversee washing and sterilization of laboratory glassware and equipment.\nSchedule and perform regular maintenance, cleaning, and repairs of all equipment.\nDirect administrative tasks, such as documenting all machine maintenance, logging test results, printing labels, and auditing products and supplies with Supervisors.\nEnsure accurate weighing and recording all product weights.\nOversee samples to be sent to lab.\nResponsible for inventory, recordkeeping, quality of product, and maintaining inventory via the ERP System.\nDevelop, discipline, and coach Supervisors, Leads, and team members.\n\nEssential Work Experience and Qualifications:\nStrong knowledge of chemical extraction and distillation/refining theory.\nExperience with extraction, preparation, and purification of cannabinoids via, Ethanol, CO2, and Hydrocarbon extraction methods.\nSupervisory experience, preferably in chemical process operations.\nExperience with detailed record keeping, proper labeling, and data tracking.\nSolid computer skills, including Microsoft and Google Suites (Docs, Sheets, Calendar).\nExcellent written and verbal communication skills.\nIn-depth understanding of compliance laws for the Florida cannabis industry.\nMotivated and self-driven.\nDeep technical knowledge and proven experience in extraction methods and techniques, and a passion for cannabis extracts.\nAbility to work with minimal direction and solid problem-solving skills.\nEmbrace change and new ideas.\nStrict adherence to policies and procedures.\nMust be at least 21 years of age.\n\nMinimum Education and Experience\n\n3 to 4 years’ experience in manufacturing operations.\n2 to 3 years’ experience in a supervisory capacity.\nBachelor’s degree or equivalent experience required.\nWorking knowledge of OSHA and EPA regulations.\nGMP manufacturing experience.\nAbility to coach and mentor employees on a one-on-one basis as well as in a group.\n\nAdditional Requirements\n\nFlorida Driver's License or ability to obtain one.\nMust be a minimum of 21 years of age.\nMust be and remain compliant with all legal or company regulations for working in the cannabis industry.\nAbility to pass a Level 2 Background check.\n\nWorking Conditions\n\nMust be able to push, pull, move, and/or lift a minimum of 50 lbs. to a minimum height of 5 feet and able to push, pull, move, and/or carry such weight a minimum distance of 50 feet, with or without mechanical assistance.\nMust be able to work seated/standing as appropriate at workstations for extended periods of time, maintain body equilibrium while climbing ladders, stairways, stopping, kneeling, crouching, and reaching, and use hands/fingers to hold, grasp, turn, pick, pinch frequently/constantly to complete tasks.\nMust be able to handle organic matter daily, able to wear PPE as appropriate (eye, face, hand, arm, head, foot, body, fall protection).\nMust have visual acuity with/without job aids to perform activities such as reading, viewing a computer terminal, visual inspection involving small parts/details.\nMust be able to speak and communicate verbally at conversation levels with co-workers, vendors, etc., in moderate noise.\n\nSalary will be commensurate with experience. A comprehensive benefits package including paid time off is offered with this position. This position will work an average of 50 hours per week and will be available “after hours” if an emergency should arise. We are an EOE company\n\nSalary will be commensurate with experience. A comprehensive benefits package including paid time off is offered with this position. This position will work an average of 40 hours per week and will be available “after hours” if an emergency situation should arise.\n\nTrulieve provides equal employment opportunities to all employees and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, pregnancy or any other characteristic protected by federal, state or local laws.","slug":"manufacturing-manager-a089e4bc-e6e4-40b5-858e-69fee89d43a9","benefits":["Health insurance","Paid time off"],"selectedSkills":["Manufacturing","Google Docs","Driver's License","Computer skills","CGMP","Bachelor's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://careers.trulieve.com/job/Quincy-Manufacturing-Manager-FL-32351/893395500/?feedId=364400&utm_source=Indeed&utm_campaign=Trulieve_Indeed"},{"position":"Cultivation Safety Technician","labName":"Trulieve","location":"Quincy, FL","age":"3 days ago","type":"Full-time","salaryMin":"$29,000 ","salaryMax":" $42,000 a year","jobDescriptionCopy":"“Trulieve Grows One Patient at a Time”\n\nIf you have an interest in being part of one of the fastest growing industries in the nation in you may consider wanting to work for Trulieve! If you have a desire to help others in need through your efforts, this may be the role for you!\n\nAt Trulieve, we strive to bring our patients the relief they need in a product they can trust. Our plants are hand-grown in an environment specially designed to reduce unwanted chemicals and pests, keeping the process as natural as possible at every turn.\n\nOur products are designed to alleviate seizures, severe and persistent muscle spasms, pain, nausea, loss of appetite, and other symptoms associated with serious medical conditions such as cancer.\n\nOur specially trained staff works hand-in-hand with physicians to provide the right products and the correct dosage to ensure patients get the compassionate care they need.\n\nRequisition ID: 1183\n\nRemote Work Available: No\n\nDescription & Requirements\n\nDescription\n\nJob Title: Safety Tech\n\nDepartment: Cultivation HS&E\n\nReports to: Cultivation Safety Manager\n\nFLSA Status: Regular- Non-Exempt\n\nRole Summary:\nSafety Tech - to assist in the overall supervision and administration of project safety to maintain a safe and healthy work environment. The successful individual will coordinate safety efforts with each business unit and communicate details of safety conditions/behaviors with all levels of management. Responsible for developing, enhancing, inspecting and evaluating the workplace environment, equipment and processes in manufacturing, cultivation, warehouse, grounds, laboratory and office working areas to ensure compliance with safety regulations and industry standards. Maintain applicable records and documentation demonstrable during an inspection or audit. Champions a culture of preparedness and safety.\n\nKey Duties and Responsibilities:\nChampion all safety programs and initiatives\n\nGrow the safety culture by training, personal interaction, and developing relationships with all hourly and salaried team members\n\nParticipate in developing and conducting compliance training\n\nManage Worker Compensation claims\n\nDaily inspection of machinery, equipment, and working conditions to ensure compliance with regulatory requirements and safe work practices\n\nConduct hazard assessments to determine appropriate personal protection equipment. Observe employees to determine appropriate use of prescribed equipment\n\nInspection of specified areas for fire-prevention equipment, first-aid supplies, and other safety devices\n\nTest working areas for hazard exposures (noise, toxic, etc.) using associated testing equipment\n\nPrepare report of findings with recommendations for corrective action\n\nInvestigation of accidents per program procedures to establish root cause for use in recommending preventive safety measures\n\nBuild cross-functional safety teams to drive a world class safety culture\n\nMaintain chemical inventory, SDS and waste inspections per EPA guidelines\n\nDocumenting all accidents, safety violations, unsafe conditions, or behavior\n\nImplement and manage a behavioral based safety program to reduce incidents and drive engagement\n\nAssisting in development of standardized job safety analysis (JSA) as well as project specific safety plans\n\nConduct safety meetings with associates to instruct them on project safety practices and requirements\n\nDemonstrate use of equipment and develop safety related standard operating procedures\n\nOther duties as assigned\n\nSKILLS AND QUALIFICATIONS:\n2 or more years of experience or education in a safety related position. (Preferred)\n\nDemonstrates competency in understanding and correcting data discrepancies; data querying; identifying root cause analysis; understanding and identifying data trends\n\nPossess computer proficiency, speed and knowledge of Microsoft Office applications (Word, Excel, PowerPoint, Outlook)\n\nWorking knowledge of OSHA / EPA regulations and practices.\n\nBasic knowledge of manufacturing / transportation safety a plus\n\nOSHA 10- and 30-hour certifications (Preferred)\n\nMust acquire OSHA 501 Certification within a specified time period\n\nMust possess excellent communication and interpersonal skills\n\nAbility to work a flexible schedule\n\nMust be able to support multiple site locations as necessary\n\nAbility to multi-task and work in a methodical and organized way\n\nHighly Motivated, Attention to detail\n\nStrong Communication Skills\n\nSelf-motivated attitude with excellent work ethic\n\nBi-Lingual is a plus\n\nADDITIONAL MINIMUM QUALIFICATIONS:\nHigh School Diploma / 2- or 4-year Degree (Preferred)\n\nMust possess a valid driver’s license and good driving record\n\nMust be a minimum of 21 years of age\n\nMust successfully complete a comprehensive background screening\n\nPHYSICAL REQUIREMENTS:\nMust be able to push, pull, move, and/or lift a minimum of 50 lbs. to a minimum height of 5 feet and able to push, pull, move, and/or carry such weight a minimum distance of 50 feet, with or without mechanical assistance\n\nMust be able to work seated/standing as appropriate at workstations for extended periods of time, maintain body equilibrium while climbing ladders, stairways, stopping, kneeling, crouching, and reaching, and use hands/fingers to hold, grasp, turn, pick, pinch frequently/constantly to complete tasks\n\nMust be able to handle organic matter daily, able to wear PPE as appropriate (eye, face, hand, arm, head, foot, body, fall protection), and able to be exposed to hot, cold, wet, humid, or windy conditions while wearing PPE (95 degrees or greater)\n\nMust have visual acuity with/without job aids to perform activities such as reading, viewing a computer terminal, visual inspection involving small parts/details. Clarity of vision at 20 ft or more in day and night/dark conditions\n\nMust be able to speak and communicate verbally at conversation levels with co-workers, vendors, etc. (Moderate noise)\n\nWORK SCHEDULE:\n40+ hours weekly with flexible hours depending on department needs. Must be available to work occasional evenings, weekends, and holidays\n\nEqual Opportunity Employer l Trulieve Supports a Drug Free Workplace\n\nSalary will be commensurate with experience. A comprehensive benefits package including paid time off is offered with this position. This position will work an average of 40 hours per week and will be available “after hours” if an emergency situation should arise.\n\nTrulieve provides equal employment opportunities to all employees and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, pregnancy or any other characteristic protected by federal, state or local laws.","slug":"cultivation-safety-technician-97635202-105a-47dc-85d6-ce79b06eb0b2","benefits":["Health insurance","Paid time off","Flexible schedule"],"selectedSkills":["Microsoft Excel","OSHA 10","Driver's License","Computer skills","OSHA","Bachelor's degree","High school diploma or GED","21 years or older","Clean driving record"],"jobType":"free","applyURL":"https://careers.trulieve.com/job/Quincy-Cultivation-Safety-Technician-FL-32351/893157900/?feedId=364400&utm_source=Indeed&utm_campaign=Trulieve_Indeed"},{"position":"Laboratory Technician I","labName":"Montrose Environmental Group, Inc.","location":"Durham, NC","age":"3 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate about the environment and ready to join an inclusive work environment, committed to excellence, to new ideas, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you based in our Durham, NC lab. Who are we? We are Montrose, the premier environmental services provider.\n\nThe Laboratory Technician I will be responsible for various laboratory functions. You’ll need some basic knowledge of a lab environment and welcome the opportunity to make an impact from day one.\n\nWHAT WE CAN OFFER TO YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nCompetitive medical, dental, and vision insurance coverage\nMedical, Dependent Care and Transit Flexible Spending Accounts\nCompany paid Life and Disability Insurance and access to additional voluntary programs\n401k with a competitive employer match\nProgressive vacation policies and company holiday to ensure work/life balance for our people.\nA financial assistance program to help support peers in need.\nAccess to telemedicine and employee assistance programs\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of 10 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nAs a key member of the Durham team, this role will be responsible for a full range of activities including:\n\nPreparation of samples for analysis\nPreparation of reagents for lab use and/or shipment\nSample extractions\nSpectrophotometric analyses\nDetermining the volume of samples\nCleaning of laboratory glassware\nMaintaining clean laboratory areas\nMaintaining organized records of sample preparation and analysis\nOverhead projects designed to improve efficiency of, or accuracy of analyses\nAssisting the Group Leaders and analysts in acquiring and inventorying consumables, chemicals, and parts for instrumentation\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Lab Director\n\nQUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nBachelor's degree in Chemistry, Biology, Environmental Science, or related field preferred\n2 years of relevant lab experience allows direct advancement to Tech II (academic lab counts)\n\nPREFFERED SKILLS\n\nPrior Laboratory experience preferred but not required as this is an entry level position\nKnowledge of analytical method, analytical instruments, general lab practices and lab safety\nAbility to work independently and in a team\nGood organizational skills and strong communication skills","slug":"laboratory-technician-i-def5d699-0a65-485d-a889-7b2bd8da38f9","benefits":["Dental insurance","Health insurance","Employee assistance program","Disability insurance","401(k) matching"],"selectedSkills":["Laboratory experience","Communication skills","Organizational skills","Bachelor's degree"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-NC-Durham-Capitola-Drive/Laboratory-Technician-I_R2143?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Environmental Laboratory Technician I - Extractions","labName":"Montrose Environmental Group, Inc.","location":"Richmond, VA","age":"3 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 2,500 employees across 70+ locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicity testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur South Richmond, VA facility is currently seeking a Full-Time Laboratory Technician to join our team.\n\nAs a key member of the laboratory team, this role will be responsible for a full range of activities including:\n\nPreparation of samples for analysis\nPreparation of reagents for lab use and/or shipment\nSample extractions\nDetermining the volume of samples\nCleaning of laboratory glassware\nMaintaining clean laboratory areas\nMaintaining organized records of sample preparation and analysis\nCourier supplies to and/or samples from client sites\nOverhead projects designed to improve efficiency of, or accuracy of analyses\nAssisting the Group Leaders and analysts in acquiring and inventorying consumables, chemicals, and parts for instrumentation\nDispose of laboratory waste in a safe manner following prescribed procedures\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Lab Director\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nHigh School diploma or equivalent required\n\nPREFERRED SKILLS\n\nPrior Laboratory experience preferred but not required as this is an entry level position\nKnowledge of analytical method, analytical instruments, general lab practices and lab safety\nAbility to work independently and in a team\nGood organizational skills and strong communication skills\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"environmental-laboratory-technician-i-extractions-34984e9c-0feb-4e7f-ac65-f59c6eecb639","benefits":["401(k)","Disability insurance","Parental leave","Tuition reimbursement"],"selectedSkills":["Laboratory experience","Communication skills","Organizational skills","High school diploma or GED"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-VA-Richmond-Reymet-Rd/Environmental-Laboratory-Technician-I_R2140?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Lab Assistant","labName":"Montrose Environmental Group, Inc.","location":"Berkeley, CA","age":"3 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 2,500 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 10 laboratories servicing air, water, soil, tobacco, cannabis, and toxicity testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Berkeley, CA facility is currently seeking a Full-Time Laboratory Assistant to join our team.\n\nAs a key member of our team, this role will be responsible for a full range of activities including:\n\nReceive environmental samples into the laboratory\nLabel the sample containers\nSample bottle preparation\nSample management and disposal\nDriving for sample pickup\nDaily tasks with light labor and cleanup\nBe flexible in work schedule including overtime when needed\nPerform support tasks as needed\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Lab Director\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nHigh School Diploma\nAbility to lift 50lbs to waist height repeatedly\nValid state issued driver's license to drive company vehicles\nMust pass pre-employment drug and background screening\nBasic computer skills Excel & email\nMust have ability to follow directions and work in a team setting\nDetail oriented\n\nPREFERRED SKILLS\n\nAbility to work independently and in a team\nExperience with secure/clean environment is preferred but not required\nGood organizational skills and strong communication skills\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"lab-assistant-5f9f671c-9d22-4904-b1cb-4425b966994d","benefits":["Disability insurance","Tuition reimbursement","401(k)","Parental leave"],"selectedSkills":["Microsoft Excel","Driver's License","Computer skills","Communication skills","Computer literacy","High school diploma or GED"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-CA-Berkeley/Lab-Assistant_R2131?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Project Manager Assistant","labName":"Montrose Environmental Group, Inc.","location":"Richmond, VA","age":"3 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Richmond, VA laboratory is currently seeking a Full-Time Project Management Assistant who will be responsible for is responsible for answering phone, purchasing and reconciling invoices for AP approval. The PMA is also responsible for supporting the Project Manager.\n\nCreates field sampling and bottle order requests\nContacts clients to confirm sampling schedule\nCoordinates with subcontract labs for sample delivery and project status\nGenerates subcontract COCs\nAssists with sample logins\nPuts together sample bottle kits\nReviews work order tickets\nSends client sample receipt confirmation\nReviews draft invoices\nCreates and send preliminary reports to clients\nSetup Electronic Data Deliverables (EDDs) cross tables and checkers\nGenerates and uploads Electronic Data Deliverables (EDDs)\nParticipates in focus teams, if applicable\nGenerates and submit state reporting forms and Self-Monitoring Reports\nManages small, simple accounts\nReviews reports for completeness and accuracy\nGenerates and reviews invoices\nCompletes annual ethic refresher and health and safety training\nOther duties as assigned.\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nHigh school diploma but Associates Degree is highly desirable\n\nPreferred Skills:\nKnowledge of environmental regulations and laboratory methods is a plus\nProficient in Excel, Word, PowerPoint, Adobe\nCommunicate effectively at all levels of the organization\nMaintain professional attitude when interacting with clients\nAble to multi task under strict deadlines\nFlexible in work schedule including overtime\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"project-manager-assistant-0b895819-a33d-496f-9d1a-1d6b61171abd","benefits":["401(k)","Disability insurance","Parental leave","Tuition reimbursement"],"selectedSkills":["Microsoft Excel","Microsoft Powerpoint","High school diploma or GED","Associate's degree"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-VA-Richmond-Reymet-Rd/Project-Manager-Assistant_R2136?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Environment Group Leader - Volatile","labName":"Montrose Environmental Group, Inc.","location":"Richmond, VA","age":"4 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicity testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Richmond, VA facility is currently seeking a Full-Time Group Leader to join our Volatile Team.\n\nThis role will be responsible for a full range of activities including:\n\nPersonnel supervision, time management, and operational efficiency\nHiring, firing, and disciplinary actions\nConflict resolution, personnel skills development and team building\nAccurate and timely communication with internal and external clients\nProject scheduling\nAnalyze samples as needed by using various published methods\nDevelopment of analytical methods\nPreparation of data summaries for inclusion in client reports.\nSample and Standard Preparation as needed\nOccasional split shift and/or weekend duties\nInstrument calibration and maintenance\nTroubleshooting and problem solving\nWrite and assist the QAC with updating related SOPs\nMaintain adequate consumables and parts for analyses\nMaintaining organized records of sample preparation and analysis, and equipment maintenance\nCommunicate with client’s questions or concerns\nInitiate and address non-conformance issues\nOverhead projects designed to improve efficiency of, or accuracy of analyses\nComply with Enthalpy’s Quality Assurance Program and other policies\nOther duties as assigned by the Lab Supervisor or Lab Director\nEnsure staff comply with Enthalpy’s Health and Safety Plan\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nDegree in Chemistry, Biology, Environmental Science, or equivalent\nMinimum of 4 years experience required\nGroup Leaders must be well versed in most of the methods run within their department\nThey must understand the underlying physical or chemical principles that underpin the assays being performed\n\nPREFERRED SKILLS\n\nEffectiveness. Positive outcomes & results of communication skills\nConflict resolution skills: Removes/Breakdown organizational communication barriers\nAssertion Skills-Problem diagnosis, assess corrective action, not blame\nAbility to handle multiple tasks simultaneously and maintain composure during stressful times\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"environment-group-leader-volatile-ee2cc715-a321-4e8c-9277-1acfa8215f7c","benefits":["Disability insurance","Tuition reimbursement","401(k)","Parental leave"],"selectedSkills":["Conflict management","Assays","Communication skills","Safety plans","Project scheduling"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-VA-Richmond-Reymet-Rd/Environment-Group-Leader---Volatile_R2127?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Chemist for cannabis testing lab","labName":"Paradigm Laboratories","location":"Tucson, AZ","age":"2 days ago","type":"Full-time","salaryMin":"$60,000 ","salaryMax":" $80,000 a year","jobDescriptionCopy":"Core Functions:\n\n\nAssists with developing, altering, or updating analytical methods and/or verifying or validating them prior to implementation.\nTests and analyzes a variety of samples, products, or materials for chemical composition or presence of specific substances; follows standardized analytical procedures.\n\n\nUpon request, may oversee the functionality of an assigned section.\n\n\nMonitors turnaround time and adjusts appropriately.\nReviews data prior to approval.\nPerforms procedures in accordance with the SOPs, project-specific requirements, and policies set forth by the laboratory management.\nUnderstands, adheres, and enforces the QA/QC requirements as established by ISO 17025, ADHS, and SOPs.\nMaintains compliance with all state, federal and local laws, ISO standards, and SOPs.\nTrains and orients new employees.\nAnalyzes samples and reviews data.\nMaintains a neat and organized laboratory.\nPerforms related work as assigned.\n\n\n- Salary DOE\n\n\n- Must be at least 21 years of age.\n\n\n- Must be able to pass a state background check.\n\n\nJob Type: Full-time\n\n\nPay: $60,000.00 - $80,000.00 per year\n\n\nBenefits:\n\n\nDental insurance\nFlexible spending account\nHealth insurance\nHealth savings account\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\n\nAbility to commute/relocate:\n\n\nTucson, AZ 85713: Reliably commute or planning to relocate before starting work (Required)\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\ncannabis lab: 2 years (Required)\nLCMS or GCMS analytical: 2 years (Required)\n\nWork Location: One location\n","slug":"chemist-for-cannabis-testing-lab-126c6eb1-4015-4e21-b983-384f6c9585de","benefits":["Health savings account","Dental insurance","Health insurance","Paid time off","Vision insurance"],"selectedSkills":["Laboratory experience","Bachelor's degree","21 years or older","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=olN3_b05dJJEa00tAnMdb7vdVNuJp_3-10HvfQY9sBZrZ0-BrG9Ksw"},{"position":"Laboratory Technician","labName":"Method Testing Laboratories","location":"Tampa, FL","age":"4 days ago","type":"Full-time","salaryMin":"$16 ","salaryMax":" $22 an hour","jobDescriptionCopy":"Laboratory Technician\n\nResponsibilities and Duties:\n\n\nSupport all aspects of laboratory test work including receiving of samples, homogenization, extractions, weighing, dilutions, etc.\nPrepare and Run samples consisting of a variety of matrices using Moisture analyzers, water activity meters, and introduction to LC/MS, GC/MS, ICP-MS, qPCR, etc.\nData entry, sample intake and sample management using the LIMS and word processing as required.\nMaintain inventory of samples, laboratory supplies, sample storage and disposal, cleaning, and other supporting lab processes.\nProperly dispose of chemical and biohazard waste.\nCleaning and maintenance of equipment, laboratory glassware and laboratory facility.\nMaintain, calibrate, and troubleshoot laboratory instrumentation.\nParticipates in training and continuous improvement projects.\nTakes ownership of issues and follows through to resolution.\nParticipate in laboratory investigations and resolution.\nEnsure customer results are reported quickly and accurately, meeting the laboratory performance metrics.\nFollow all regulatory requirements and established SOPs including safety and health, quality assurance and quality control.\nCompliance with all local and state guidelines requiring chain of custody of controlled substances.\nOther duties as assigned.\n\nRequired Qualifications:\n\n\nLab Experience\nInstrument experience required – Analytical balances, pipettes, and centrifuges.\nExcellent computer skills in a Microsoft Windows environment, including Word, Excel, and PowerPoint.\nAbility to prioritize tasks and maintain a strong work ethic.\nMust be willing to be subjected to a background check to be approved by the Florida Department of Health.\nAbility to work in a fast-paced, changing, and challenging environment.\nMust have excellent written and verbal communication and customer support skills.\n\nPreferred Qualifications:\n\n\nMust have a bachelor’s degree in a natural science; or hold a current license as a Clinical Laboratory Personnel, as defined in s. 483.803, F.S., from the Florida Board of Clinical Laboratory Personnel.\nExperience in a highly regulated industry (ex. CLIA, USDA, GLP, FDA and ISO 17025).\nMinimum 2-3 years of relevant industry and laboratory experience in a high production laboratory specialized in fast turnaround times – food safety, clinical, forensic, environmental and cannabis experience preferred.\n\nAbout us: We are a well-capitalized analytical testing lab in the cannabis industry. We believe strongly that analytical testing is one of the most important aspects of the cannabis supply chain. Laboratory testing and analytics enable our customer’s success, ensure consumer safety and create trust in our new industry. Our team brings together diverse backgrounds including fortune 100 companies, successful start-ups and best-in-class laboratories. We provide honest, fast, flawless, technology driven and customer focused testing for the cannabis and hemp industries.\n\n\nWhat We Offer:\n\n\nCompetitive salary\nBenefits package including health, dental and vision\nPaid time off\n\nWork Remotely\n\n\nNo\n\nJob Type: Full-time\n\n\nPay: $16.00 - $22.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\n\nEducation:\n\n\nBachelor's (Preferred)\n\nExperience:\n\n\nLab Technician: 1 year (Preferred)\nRegulated Laboratory: 1 year (Preferred)\nSample Receiving: 1 year (Preferred)\nHPLC: 1 year (Preferred)\nGas chromatography: 1 year (Preferred)\nRT-PCR: 1 year (Preferred)\nWater Activity Analysis: 1 year (Preferred)\nICP-MS: 1 year (Preferred)\nTandem Mass Spectrometry: 1 year (Preferred)\nSample Preparation: 1 year (Preferred)\n\nWork Location: One location\n","slug":"laboratory-technician-92c9f1f1-bff1-4d27-b265-4be9dcdfb523","benefits":["Dental insurance","Health insurance","Paid time off","Vision insurance","Life insurance"],"selectedSkills":["Gas chromatography","Microsoft Excel","Windows","Computer skills","High-performance liquid chromatography","Bachelor's degree","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=y_MUuxGCD_UngFtgDuioNSUu95ABHlrpMif_QLVu6EUOXv53Dn4y1A"},{"position":"Lab Technician (Weekend) Part hour-Full time pay","labName":"Coral Reef Labs","location":"Jonestown, PA","age":"2 days ago","type":"Full-time","salaryMin":"$20 ","salaryMax":" $25 an hour","jobDescriptionCopy":"Job Description\n\n\nA rapidly-growing compliance testing laboratory in Jonestown, PA is seeking a well-organized, detail-oriented Laboratory Technologist to join our lab team. The position is for the day shift on Friday, Saturday, and Sunday. You will work ~30 hours and be paid for 40.\n\n\nYou will be part of an exciting new industry helping to keep cannabis safe. There is excellent growth potential for anyone wanting to work hard and grow with us!\n\n\nPosition: The Molecular/Microbiologist will primarily be responsible for preparing, running, troubleshooting, and analyzing cannabis samples, utilizing standardized and in-house lab methodologies.\n\n\nDuties include:\n\n\n1) Sample preparation for Potency, Pesticides, Terpenes, Heavy Metals, Residual Solvents, etc\n\n\n2) Weighing and recording sample weights.\n\n\n3) Maintain ISO 17025 standards of performance.\n\n\n4) Works independently with little guidance as well as provide support and training for others in a team environment.\n\n\n5) Ensure test equipment is clean, maintained and in good working order.\n\n\n6) Maintain a safe, clean and sanitary work area.\n\n\n7) Ensure high quality standards are met through performing calibrations, quality checks, and proficiency programs\n\n\n8) Maintain an accurate notebook and logbook.\n\n\n9) Strictly follow all safety procedures and documents\n\n\nQualifications:\n\n\n· · 2 years lab experience (Cannabis knowledge/ lab experienced preferred).\n\n\n· · Experience with data analysis and LIMS.\n\n\n· · Excellent analytical skills and attention to detail.\n\n\n· · Proficiency with Microsoft Word, Excel and Outlook.\n\n\n· · Specific training for ISO 17025 Standard.\n\n\n· · Hands-on experience with instrument maintenance and trouble-shooting.\n\n\n· · Experience importing, validating, and exporting electronic data in a variety of formats.\n\n\n· · Proven organizational and problem-solving skills.\n\n\n· · Ability to stand for long periods.\n\n\nTo apply: Send resume and cover letter in PDF format with salary expectations. Please do not call regarding this position.\n\n\nWhat we offer\n\n\n· Medical, dental, vision, and life insurance\n\n\n· Paid holidays/vacation\n\n\n· Opportunities for growth\n\n\n· Work in a fun and fast-growing industry! We are looking for candidates to start ASAP!\n\n\nJob Type: Full-time\n\n\nPay: $17.00 - $25.00 per hour\n\n\nJob Type: Full-time\n\n\nPay: $20.00 - $25.00 per hour\n\n\nBenefits:\n\n\n401(k)\nHealth insurance\n\nSchedule:\n\n\n12 hour shift\nWeekend availability\n\nSupplemental Pay:\n\n\nBonus pay\n\nWork Location: One location\n","slug":"lab-technician-weekend-part-hourfull-time-pay-b6db66d4-8505-4667-9194-eab943716822","benefits":["Dental insurance","Health insurance","401(k)","Vision insurance","Life insurance"],"selectedSkills":["Analysis skills","Microsoft Excel","Microsoft Outlook","Laboratory information management systems","Laboratory experience"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=kE1xAXUgCa_-MN0aAt1IFo9RPv6GQg50a7vMd1ggnOOztbZrY-fnqg"},{"position":"Microbiology Laboratory Technician","labName":"Rm3 Labs","location":"Broomfield, CO","age":"5 days ago","type":"Full-time","salaryMin":"$18 ","salaryMax":" $19 an hour","jobDescriptionCopy":"Company Description:\n\n\nSince our founding in 2009, Rm3 Labs has been a leader in providing scientific analysis for the cannabis community of Colorado. As a fully independent, analytical laboratory located in Broomfield, we bring state-of-the-art scientific expertise and technology to help our clients produce safe, pure, and effective cannabis products. We are ISO/IEC 17025 accredited and licensed and certified by the State.\n\n\nJob Summary:\n\n\nWe are looking for a full-time Microbiology Laboratory Technician to prepare samples for Total Yeast and Mold (TYAM) and qPCR analysis for Salmonella, STEC, and Aspergillus, perform water activity analysis, and assist with other general laboratory tasks and projects.\n\n\nThis position requires being in the lab Tuesdays through Saturdays from 10am - 6:30pm. The person that fills this position may choose to adjust their start time on Saturdays. The schedule for this position is unlikely to change, so the candidate must be comfortable with this schedule.\n\n\nThis is an entry level position with opportunity for growth. Salary is $18/hr for 0 - 1 year of full-time laboratory testing experience and $19/hr for 1 - 2 years of full-time laboratory testing experience. Benefits include three weeks of paid time off, paid holidays, maternity/paternity leave, subsidized healthcare and dental insurance, performance based bonus, and professional development assistance.\n\n\nJob Responsibilities\n\n\nComply with State, Local, OSHA, and ISO 17025 requirements.\nFollow company and laboratory Standard Operating Procedures (SOPs).\nVerify lab equipment before use to ensure they are within acceptable limits.\nPrepare lab reagents, working standards, and/or media and verify them before use.\nWeigh and prepare analytical samples for testing using balances, pipettes, media enrichments, solvent extractions, etc.\nAccurately record data in an organized, legible, and consistent manner on physical documents and in the Laboratory Information Management System (LIMS).\nAdhere to strict reporting deadlines.\nIdentify, investigate, and document departures from the quality system and/or test procedures.\nAssist with cleaning and maintaining laboratory equipment and supplies.\nPerform general laboratory tasks such as inventory, sample archival and disposal, cleaning, and similar lab duties.\nAssist in training new or junior staff; may act an as onboarding buddy to new staff.\nAssist in the development, modification, verification, and validation of methods.\nPerform special projects, as assigned by the Lead Chemist or Lead Microbiologist.\nReport concerns to the Lead Microbiologist.\n\nRequirements\n\n\nMust be comfortable working Tuesdays through Saturdays from 10am - 6:30pm (can adjust start time on Saturdays).\nMust be a Colorado resident and at least 21 years old, no exceptions.\nMust have an Associate Degree in science or higher.\nMust pass an extensive background security check with no felony convictions and must be able to obtain a Colorado Department of Revenue – MED support license prior to or at the time of hire.\nMust be able to work independently and as part of a team.\nMust be able to interact professionally with colleagues.\nMust have good documentation and communication skills.\nMust have strong attention to detail and is accuracy-oriented.\nMust be able to adhere to strict deadlines.\n\nThe Ideal Candidate\n\n\nHas some experience working in a laboratory.\nIs comfortable performing repetitive tasks.\nThrives in a fast-paced environment and adapts well to change.\nHas experience handling large sample loads.\n\nJob Type: Full-time\n\n\nPay: $18.00 - $19.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nParental leave\nProfessional development assistance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nWeekend availability\n\nSupplemental Pay:\n\n\nBonus pay\n\nCOVID-19 considerations:\nWe require employees and visitors to wear masks.\n\n\nApplication Question(s):\n\n\nDo you currently live in Colorado? Unfortunately, we will not be able to consider out of state applicants. No exceptions.\nAre you comfortable with a Tuesday through Saturday 10am - 6:30pm shift (can adjust start time on Saturdays). This schedule is unlikely to change, so we want to make sure all candidates are comfortable with this work schedule.\nList all the times you are available for a 15-30 min phone interview during the next two weeks. Please do not leave this blank.\n\nEducation:\n\n\nAssociate (Required)\n\nWork Location: One location\n","slug":"microbiology-laboratory-technician-292b7592-9144-4f54-9e57-2792e617226f","benefits":["Dental insurance","Health insurance","Paid time off","Professional development assistance","Parental leave"],"selectedSkills":["Laboratory experience","Communication skills","Associate's degree","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=7W6uJakMmyuLUbkaOllJzbAnU4SGw46JFRKsIQNpFWsiM52FY7rr8w"},{"position":"Chemist","labName":"Euphoria Wellness","location":"Las Vegas, NV","age":"4 days ago","type":"Full-time | Part-time","salaryMin":"$39,000 ","salaryMax":" $52,000 a year","jobDescriptionCopy":"Role and Responsibilities:\n\n\nThe Chemist is responsible for the preparation and execution of the extraction process. The Chemist will carry out the day to day tasks including extraction, refining, testing, quality assurance and maintenance. The Chemist is responsible for various duties within the laboratory while working compliantly within State and Federal regulatory frameworks.\n\n\nEssential Functions:\n\n\n- Ability to follow and adhere to strict regulatory protocols and standard operating procedures.\n\n\n- Ensure proper handling of pre- and post- extraction materials.\n\n\n- Process raw cannabis material into a crude concentrate.\n\n\n- Perform wet chemistry techniques, filtration, distillation, crystallization and purging.\n\n\n- Carry out cannabinoid concentrate refining process to completion.\n\n\n- Ensure all processes include clear and well defined labeling to ensure traceability.\n\n\n- Analyze and report on product test results.\n\n\n- Assist with daily, weekly, monthly maintenance of the laboratory area and equipment.\n\n\n- Keep equipment operational by following operating instructions; troubleshooting breakdowns; performing preventative maintenance.\n\n\nJob Types: Full-time, Part-time\n\n\nBenefits:\n\n\nDental insurance\nEmployee discount\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nMonday to Friday\n\nCOVID-19 considerations:\nEmployees are required to provide proof of an FDA-approved vaccination against COVID-19.\n\n\nAbility to commute/relocate:\n\n\nLas Vegas, NV: Reliably commute or planning to relocate before starting work (Preferred)\n\nExperience:\n\n\nLaboratory experience: 1 year (Preferred)\n\nWork Location: One location\n","slug":"chemist-c4333b86-3695-4370-8ecb-1d13b27082f1","benefits":["Dental insurance","Employee discount","Health insurance","Paid time off","Vision insurance"],"selectedSkills":["Laboratory experience"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=kMt7wLAkGhvl_KlHpY6x96VFA7ci0WHP81dLEiuw8qQJQsW_5n6nTQ"},{"position":"Data Reporting Specialist","labName":"Pree Laboratories, LLC","location":"Corvallis, OR","age":"7 days ago","type":"Full-time","salaryMin":"$16 ","salaryMax":" $20 an hour","jobDescriptionCopy":"PREE Laboratories is hiring a Data Reporting Specialist!\n\n\nAbout PREE:\nLocated in the heart of the Willamette Valley, PREE Laboratory is an OLCC licensed and ORELAP accredited high complexity environmental laboratory currently providing cannabis and hemp compliance and R&D testing solutions for our clients. PREE Laboratory prides itself in providing our client-partners with the highest quality technical support and customer service in a prompt and professional manner.\n\n\nThis full time position is anticipated to work 9:00-5:00 Tuesday-Sunday.\n\n\nPosition description:\nSuccessful applicants will be responsible for reporting of various hemp and cannabis products in compliance with regulatory requirements and applicable internal protocols and SOPs.\n\n\nThe Reporter is a client-oriented customer serving role so we are looking for kind, motivated, sociable and friendly type listeners, who care about our family of co-workers and clients.\n\n\nThis job requires attention to detail, customer service skills, and excellent communication know-how.\n\n\nSpecific Duties & Responsibilities:\nReport analysis of cannabis and hemp in compliance with the Oregon Health Authority, OLCC, ODA, and Orelap guidelines.\nFollow all PREE standard operating procedures (SOP'S) and TNI Standards.\nCommunicate with co-workers both in the field and within the laboratory.\nMaintain a safe, clean, well organized, and efficient work environment.\nContinuous Learning-Stay current with SOPs and any changes to the rules/regulations of the listed governing agencies.\nKeep detailed records and documentation while following our sample plan worksheet and chain of custody protocols.\nBe Kind + Professional!\nMust be 21 or older.\n\n\nEducation/Previous Experience:\nPrior Experience in the Cannabis Industry is a huge plus but not a must. Must be able to follow SOPs and document laboratory sampling activities. Excellent oral and written communication skills. BS in a Science related field is preferred but not required. Basic Computer skills are a must!\n\n\nSkill sets:\nWork as part of a team, as well as individually, and maintain strong/prompt communication with coworkers and clients.\nMust be self-motivated to finish tasks on time.\nMUST be proficient in the use of Microsoft Excel and Google Sheets.\n\n\nHow to apply:\nIf interested in joining the PREE team please submit your resume along with a brief description of yourself.\n\n\nWe look forward to meeting you!\n\n\nJob Type: Full-time\n\n\nPay: $16.00 - $20.00 per hour\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nWeekend availability\n\nEducation:\n\n\nHigh school or equivalent (Preferred)\n\nExperience:\n\n\nCustomer Service: 1 year (Preferred)\n\nWork Location: One location\n","slug":"data-reporting-specialist-827e1178-0c12-48a5-85a8-969173658bb2","benefits":["Dental insurance","Health insurance","Employee assistance program","401(k) matching","Paid time off"],"selectedSkills":["Customer service","Computer skills","OLCC Service Permit","Communication skills","Computer literacy","Bachelor of Science","Bachelor's degree","High school diploma or GED","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=H_4714iheyF8UBC5D6e5mCUrOBiFlzmlPaa--Oys6lcvotuooIv0Xg"},{"position":"Sampler(Field Technician)","labName":"SC Laboratories","location":"Moreno Valley, CA","age":"2 days ago","type":"Full-time","jobDescriptionCopy":"SC Laboratories, listed by mg Magazine as one of America’s Top Cannabis Industry Employers for 2021, is an analytical laboratory based in Santa Cruz, California, specializing in safety and quality assurance testing for the Cannabis and Hemp industries. We are seeking to add to our collaborative team within the Southern California region, focusing on hiring a Full-time Sampler who resides in and around the Moreno Valley/San Bernardino.\n\n\nThe Sampler position is responsible for obtaining a representative sample of a batch at the client’s location, completing all relevant documentation and providing excellent customer service, while ensuring all samples are safely and securely transferred to a Courier for delivery to our Santa Cruz Lab for processing.\n\n\nMust be at least 25 years of age\nPrevious customer service experience is required\nMust be comfortable working with and around cannabis products. Previous work experience in the legal cannabis industry is preferred\nIdeal candidate will have 1 year of prior laboratory experience from either college or full-time practical work experience/exposure, and previous customer service experience\n\nAll applicants selected for an interview will need to provide a current DMV print out at the time of the interview, showing a clean driving record of at least the past 6 years.\n\n\nPAY RATE: Starts at $18.00 per hour, and then $20.00 per hour upon successfully passing a performance review after the first 90 -days\n\n\nSCHEDULE: This will be a Full-time position based out of Southern California.\n\n\nDUTIES & RESPONSIBILITIES:\n\n\nInteract with clients/customers on their premises during sample collection and submission (Clients / Customers may require our employees to be fully vaccinated)\nFollow all internal laboratory and State regulations while taking samples and driving to and from a client/customer sampling site or the laboratory\nCoordinate with Manager of Field Operations, as well as, Customer Service Account Managers to maximize sample collection\nStrive to maximize driving route efficiency\nMaintain records of samples and transportation data per relevant procedures\nMaintain sampling supply/equipment inventory\nComplete vehicle operational logs and minor maintenance as needed\nFollow good documentation practices, data integrity principles, and safety behaviors\nPromote a professional company image through exemplary customer relationship skills\nRefer customer inquiries, routing or schedule change requests, and/or complaints to the appropriate Account Manager\nEnsure proper Sample Submission form protocols are followed\nSuggest and implement continuous process improvement initiatives\nSupport laboratory-based functions including sample intake/preparation, etc\nPerform other activities as assigned by management\n\nREQUIREMENTS:\n\n\nMust be at least 25 years of age\nMust have a minimum of 1-year previous Customer Service experience\nMust have a valid driver's license; must have and maintain a clean DMV driving record\nAbility to safely and securely park and keep a Company owned vehicle is required\nAbility to sit for long periods of time while driving\nAbilities: Follow written and verbal instructions and be an effective communicator; work effectively in a collaborative environment\nSkills: Read, write, and speak English; use LIMS, Microsoft Word, Excel, and email applications; must be able to program and follow driving navigation software\nOther characteristics: Strong attention to detail; must possess excellent planning skills\nMust be able to lift up to 50 lbs.\n\nREQUIRED EDUCATION:\n\n\nCompleted 2 years college or university education (preferably in a scientific discipline) OR Hold a High School Diploma or pass a General Educational Development or High School Equivalency exam and have completed 1 year of full-time practical laboratory experience.\n\nAll employment offers will be contingent upon successful completion of a background check, to include the ability to be added by our motor vehicle insurance provider.\n\n\nPositions at SC Labs may require a COVID-19 vaccination. Where permitted by law, applicants who are offered a position may be asked about their vaccination status, which must meet minimum business requirements. All religious, medical, or other legally recognized exemptions regarding vaccination status will be considered.\n\n\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.\n\n\nSC Laboratories provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.\n\n\nThis policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.\n\n\nJob Type: Full-time\n\n\nJob Type: Full-time\n\n\nPay: From $18.00 per hour\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\nMonday to Friday\n\nExperience:\n\n\nCustomer service: 1 year (Preferred)\n\nLicense/Certification:\n\n\nDriver's License (Preferred)\n\nWork Location: Multiple Locations\n","slug":"samplerfield-technician-b00fc292-59f1-4f54-a430-02a55148f17c","benefits":["Dental insurance","Health insurance","Paid time off","401(k)","Vision insurance"],"selectedSkills":["Customer service","Microsoft Excel","Driver's License","Laboratory experience","Communication skills","High school diploma or GED","Clean driving record","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=rsQTGRgytDxn-VbUSlHyebHskLqTposW5Do4Hz2VgTbdQ7X0b54rZQ"},{"position":"Swing Shift Lab Support","labName":"Pree Laboratories, LLC","location":"Clackamas, OR","age":"7 days ago","type":"Full-time","salaryMin":"$16 ","salaryMax":" $19 an hour","jobDescriptionCopy":"Pree Laboratories is hiring a Data Technician!\n\n\nPree Laboratory is a ORELAP accredited, high-complexity environmental laboratory specializing in testing of cannabis products. Pree Laboratory prides itself in providing our partners with the highest quality technical support, accurate and timely reporting, and customer service in a prompt and professional manner.\n\n\nWe are seeking a Data Technician to become an integral part of our team! You will be preparing samples and data for clients in order to increase company production and efficiency.\n\n\nResponsibilities:\n\n\nSample Intake\nSample Preparation (imaging product, sample breakdown, weighing out samples)\nBasic analysis following SOP\nMaintaining work area per SOP\n\nQualifications:\n\n\nDependable, on-time, & available for full shift (Monday-Friday 3:00pm-11:00pm)\nTraining shift begins M-F 9-5 for a month before transitioning to evening shift\nHigh level knowledge of Excel and Google Sheets\nStrong problem solving and critical thinking skills\nAbility to work independently within the confines of existing SOPs\nComfortable asking for help in new situations and confident enough to attempt problem solving first\nAble to work in a fast paced environment\nStrong attention to detail\nAbility to prioritize and multitask\nRespectful of all staff members, office space, and personal work space\nMaintain tidy work areas\n\nBonus Attributes:\n\n\nKnowledge of METRC rules and operations\nAwareness of OLCC rules and operations\nExperience with standard Lab Procedures and Practices\nKnowledge of Marijuana Products and Standards\nPrevious experience in high-paced work environment\n\nJob Type: Full-time\n\n\nPay: $16.00 - $19.00 per hour\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nHealth insurance\nLife insurance\nPaid time off\nParental leave\nVision insurance\n\nSchedule:\n\n\n10 hour shift\n8 hour shift\nNight shift\nWeekend availability\n\nApplication Question(s):\n\n\nDo you have a reliable form of transportation?\nDo you have previous experience working in a laboratory setting?\nAre you willing to work late shifts and a 5 day schedule that includes weekends?\n\nExperience:\n\n\nMicrosoft Excel: 1 year (Preferred)\n\nWork Location: One location\n","slug":"swing-shift-lab-support-f34d3722-60fd-45d4-a801-f8036d0c8b35","benefits":["Dental insurance","Health insurance","Employee assistance program","401(k) matching","Paid time off"],"selectedSkills":["Laboratory procedures","Microsoft Excel","Laboratory experience","OLCC Service Permit","Reliable transportation"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=3zzoBS-7iB1ZEdO9rhLIRyqjtQ_yX5tHxr-me6e6rHjBvPGOapKJiw"},{"position":"Laboratory Chemist II","labName":"ACT Laboratories, LLC","location":"Morton, IL","age":"2 days ago","type":"Full-time","salaryMin":"$23 ","salaryMax":" $26 an hour","jobDescriptionCopy":"ACT Laboratories\n\n\nJob Description\n\n\nJob Title: Laboratory Chemist II\n\n\nReports To: Laboratory Manager\n\n\nDate: June 3, 2022\n\n\nJob Summary:\n\n\nUnder technical supervision, conduct qualitative and quantitative chemical and/or microbiological analyses\n\n\nEssential Duties and Responsibilities:\n\n\nPerform sample testing following documented procedures in order to analyze organic or inorganic compounds to determine chemical or physical properties, composition, structure, relationships or reactions using chromatography, spectroscopy or spectrophotometry techniques\nPerform microbiological sample testing following documented procedures to determine presence/absence of bacteria, or other microorganisms\nConduct quality control tests\nMaintain laboratory instruments to ensure proper working order\nPrepare test solutions, compounds or reagents for conducting tests\nMake interpretations of data from microbiological plates\nPerform review of data entered into Laboratory Information Management System\nFollow laboratory safety procedures to ensure compliance with standards or to suggest improvements as needed\nConfer with others to interpret test results\nEstablish and maintain productive working relationships with people inside the laboratory and people outside the laboratory including customers, regulatory staff and corporate staff\n\nSupervisory Responsibilities:\n\n\nNone\n\n\nAdditional Responsibilities:\n\n\nWork with Technical Services to improve current methods\nPerform other duties as may be assigned\n\nQualifications:\n\n\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skills, and/or abilities required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nEducation and/or Experience:\n\n\nBachelor's degree in Chemistry, Biology or related science required\nMinimum 3-5 years work-related analytical chemistry experience required\nExperience with HPLC-UV, HS-GC-FID, ICP-MS preferred\nGMP/FDA experience preferred\n\nKnowledge, Skills and Abilities Required:\n\n\nKnowledge of elementary principles of microbiology and chemistry\nKnowledge of basic clinical laboratory skills\nAbility to operate laboratory equipment\nAbility to use computers and computer software programs and systems and standard office equipment such as phones, photocopiers and fax machines\nGood written and verbal communication skills to convey and receive information effectively (face-to-face, telephone and electronic)\nGood analytical and judgment skills\nDetail-oriented\nAbility to maintain confidentiality regarding test results\nExcellent organizational skills to work independently, prioritize, handle multiple tasks, manage time\n\nCertifications, Licenses, Registrations:\n\n\nNone\n\n\nSafety Sensitive Position:\n\n\nEquipment or vehicles used and activities performed by this position that could cause serious injury or death to the operator, other employees and/or other individuals if not used properly or safely:\n\n\nWorking with testing equipment with hot surfaces\nHandling chemicals including acids and solvents used in the testing process\n\nPhysical Demands:\n\n\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nProlonged periods of sitting at a desk and working on a computer, walking/moving around and standing, talking and hearing and using hands to handle, control or feel objects, tools or controls\nOccasional periods of stooping/bending\nLifting up to 25 pounds regularly\nClose vision and ability to focus on computer screens and documents; depth perception; color vision\n\nWork Environment:\n\n\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. The employee works in a laboratory environment.\n\n\nWhile performing work-related duties the employee occasionally works with hazardous, toxic or caustic chemicals such as acids and solvents, works around fumes or airborne particles from laboratory chemicals used/fume hoods works with or near moving mechanical parts from laboratory equipment and works with equipment that vibrates. The noise level in the work environment is usually moderate.\n\n\nStressful Conditions in the Work Environment Affecting This Position:\n\n\nChallenging work demands including heavy workload/work quantity or quality demands, time demands, conflicting/multiple deadlines or tasks and interpreting data\n\nWork Schedule:\n\n\n40-hour minimum workweek\nMay require on-call duty and the ability to work outside of scheduled work hours including weekends and holidays when the need arise\n\nJob Type: Full-time\n\n\nPay: $23.00 - $26.00 per hour\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nReferral program\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\n\nAbility to commute/relocate:\n\n\nMorton, IL 61550: Reliably commute or planning to relocate before starting work (Preferred)\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nLaboratory experience: 2 years (Preferred)\nCannabis: 1 year (Preferred)\nSupervisory: 1 year (Preferred)\n\nWork Location: One location\n","slug":"laboratory-chemist-ii-9a698c77-de2b-48e9-9c18-afaaad33a6aa","benefits":["Dental insurance","Health insurance","Referral program","401(k)","Paid time off"],"selectedSkills":["High-performance liquid chromatography","Spectroscopy","Laboratory experience","Communication skills","Microbiology","Bachelor's degree","Master's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=_CDn-xA3F5iIJ_4nLiu1at8qfi0uDmuaIOd5ap1N0ywNUfEloUneVQ"},{"position":"Analytical Chemist","labName":"Advanced Analytical Testing Labs","location":"Santa Rosa, CA","age":"4 days ago","type":"Full-time","salaryMin":"$25 ","salaryMax":" $35 an hour","jobDescriptionCopy":"Job Description\n\n\nA rapidly-growing ISO accredited laboratory in the Santa Rosa, Sonoma County, is seeking a well-organized, detail-oriented and energetic Analytical Chemist to join our awesome lab team. You will be part of an exciting new industry helping to keep cannabis safe. There is excellent growth potential for anyone wanting to work hard and grow with us!\n\n\nPosition: The Analytical Chemist will primarily be responsible for preparing cannabis samples (flowers, edibles etc) running, troubleshooting and analyzing cannabis samples with a GC, HPLC and/or ICP system utilizing standardized and in-house lab methodology; and performing basic and complex laboratory operations.\n\n\nDuties include:\n\n\n· Sample preparation for Potency, Pesticides, Terpenes, Heavy Metals, Residual Solvents, etc\n\n\n· Set up, run and troubleshoot GC/MS, GC-MS/MS, LC/MS/MS and ICP-MS systems.\n\n\n· Maintain validated ISO 17025 standards of performance for analytical chemical testing.\n\n\n· Demonstrate leadership ability and excellent interpersonal skills. Formulate and clearly communicates ideas, both verbally and in writing.\n\n\n· Works independently with little guidance as well as provide support and training for others in a team environment.\n\n\n· Develop procedures for documenting results from data collected.\n\n\n· Ensure test equipment is clean, maintained and in good working order.\n\n\n· Maintain a safe, clean and sanitary work area.\n\n\n· Ensure high quality standards are met through performing calibrations, quality checks, and proficiency programs\n\n\n· Maintain an accurate notebook and logbook.\n\n\n· Strictly follow all safety procedures and documents.\n\n\nQualifications:\n\n\n· · Bachelors/Master of Science Degree.\n\n\n· · 2-4 years analytical lab experience (Cannabis knowledge/ lab experienced preferred).\n\n\n· · Experience with data analysis and LIMS.\n\n\n· · Excellent analytical skills and attention to detail.\n\n\n· · Proficiency with Microsoft Word, Excel and Outlook.\n\n\n· · Specific training for ISO 17025 Standard.\n\n\n· · Experience/knowledge with the analytical instrumentation: HPLC, GCMS, LC-MS/MS, GC-MS/MS, ICPMS.\n\n\n· · Experience with method development and optimization.\n\n\n· · Hands-on experience with instrument maintenance and trouble-shooting.\n\n\n· · Experience importing, validating and exporting electronic data in a variety of formats.\n\n\n· · Proven organizational and problem-solving skills.\n\n\n· · Ability to stand for long periods.\n\n\n· Experience ordering supplies and monitoring consumable inventory.\n\n\nTo apply: Send resume and cover letter in PDF format with salary expectations. Please do not call regarding this position.\n\n\nWhat we offer\n\n\n· Medical, dental, vision, and life insurance\n\n\n· Opportunities for growth\n\n\n· Work in a fun and fast-growing industry!\n\n\nLocation: Santa Rosa, Sonoma County, Ca\n\n\nJob Type: Full-time\n\n\nJob Type: Full-time\n\n\nPay: $25.00 - $35.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nMonday to Friday\nNight shift\nWeekend availability\n\nAbility to commute/relocate:\n\n\nSanta Rosa, CA 95404: Reliably commute or planning to relocate before starting work (Preferred)\n\nEducation:\n\n\nBachelor's (Preferred)\n\nWork Location: One location\n","slug":"analytical-chemist-1c54799a-4b70-4436-8ae6-de2b777c3095","benefits":["Dental insurance","Health insurance","Vision insurance","Life insurance"],"selectedSkills":["Analysis skills","Microsoft Excel","High-performance liquid chromatography","Microsoft Outlook","Laboratory information management systems","Master of Science","Bachelor's degree","Master's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=lIfghy5QAHYmK194DmzI2YLj5QdUAIHah9wm6uSI_PlRnFjYapmLvA"},{"position":"Lab Technician","labName":"Canalyte Laboratories","location":"Riverside, CA","age":"3 days ago","type":"Full-time | Part-time","salaryMin":"$20 ","salaryMax":" $25 an hour","jobDescriptionCopy":"The Lab Technician will be responsible for receiving, batching, preparing, and loading samples on our instruments to ensure the generation of timely and high-quality data.\n\n\nResponsibilities\n\n\n- Perform wet chemistry techniques for sample preparation for both quality and compliance testing\n\n\n- Conduct laboratory analysis of hemp and cannabis products, and recording of laboratory test data and results\n\n\n- Ensure maximum output of the laboratory by improving and optimizing laboratory processes and operations\n\n\n- Perform daily maintenance of team area and equipment being used\n\n\n- Execution of laboratory-specific operations, and implementation of Good Laboratory Practices (GLP)\n\n\n- Remain up-to-date on all SOPs and maintain documentation required for compliance.\n\n\n- Assist in maintaining the laboratory for ISO/NELAC accreditation standards and future audits.\n\n\n- Work on projects assigned by lab management and work in collaboration with other technicians.\n\n\n- Maintain a safe, clean, stocked, well-organized, and efficient laboratory work environment.\n\n\nRequired Skills & Experience\n\n\n- Must be at least 21 years of age.\n\n\n- Bachelor's Degree in biological, chemical, agricultural, environmental, or related sciences from an accredited college or university; or an Associate’s Degree with at least 2 years of lab experience.\n\n\n- Familiarity with data entry and database management (Lab Information Management System).\n\n\n- Excellent oral and written communication skills are required.\n\n\n- Candidates with GC-MS, GC-MS/MS, and/or LC-MS/MS instrumentation and software experience will be given preference.\n\n\nJob Types: Full-time, Part-time\n\n\nPay: $20.00 - $25.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nVision insurance\n\nSchedule:\n\n\n8 hour shift\n\nEducation:\n\n\nBachelor's (Preferred)\n\nExperience:\n\n\nLaboratory Experience: 2 years (Preferred)\n\nWork Location: One location\n","slug":"lab-technician-134d29e6-849e-48a1-8775-8c73689fe4e4","benefits":["Dental insurance","Health insurance","Vision insurance"],"selectedSkills":["Database management","Laboratory experience","Communication skills","Data entry","Bachelor's degree","Associate's degree","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=jcPv9nedl15frFE5Y4zNU9x-ozAco44m_iNoWcAZMQkWpQL5mgWmGg"},{"position":"Microbiology Lab Technician","labName":"Ace Analytical Laboratory","location":"Las Vegas, NV","age":"4 days ago","type":"Full-time | Part-time","salaryMin":"$15 ","salaryMax":" $17 an hour","jobDescriptionCopy":"We are an ISO/IEC 17025:2017 accredited cannabis testing laboratory in Las Vegas seeking for a highly-motivated Microbiology Technician eager to learn and grow in the new, evolving cannabis industry.\n\n\nDUTIES AND RESPONSABILITIES\n\n\nResponsible for conducting qualitative and quantitative microbial analyses of cannabis products using molecular and cellular methodologies. Among several microorganisms, microbial testing includes Yeast and Mold, Salmonella, E. coli, Enterobacteriaceae and Aerobic bacteria.\n\n\n· Perform laboratory procedures according laboratory’s Standard Operating Procedures (SOPs), under the supervision of the team leader in accordance with ISO 17025 standards and state regulatory requirements\n\n\nPrepare samples using sterile technique to prevent contamination of products, growth medias and equipment when preforming cell culture procedures\nAccurately weight samples, pipetting, prepare dilutions to perform sterile microbial plating and Colony Forming Units (CFU) counting following methods described in SOPs\nHandle chemicals and microbial cell cultures safely using appropriate Personal Protective Equipment (PPE) to prevent cross-contamination and exposure to hazardous material\nAccurate data (Weight, CFU counts) entry using Microsoft Excel sheets\nLaboratory maintenance including cleaning, equipment and scheduled environmental microbial testing\nPrepare DNA samples from cannabis products to perform Polymerase Chain Reaction (PCR) microbial testing\n\nEDUCATION\n\n\nBachelor’s degree with major coursework in microbiology, molecular biology, biology or related field. Candidates with an associate degree and professional experience in a microbiology laboratory will be considered.\n\n\nSKILLS\n\n\nAbility to work independently and coordinate activities with team members to effectively complete assigned tasks and deliver analytical results timely according to the team leader expectations.\nFamiliar with sterile procedures and ability to pipet large and small volumes using specific pipets.\nAbility to learn and adapt quickly with knowledge of the mathematical skills required to perform calculations such as dilutions and buffer preparation.\nHighly organized with attention to details, speed, consistency and accuracy in performing assigned tasks to meet the laboratory deadlines.\nAbility to demonstrate flexibility in work environment, performing a variety of tasks as requested by the team leader.\nGood working knowledge of Microsoft Office Excel.\nHonesty, friendly demeanor and positive interpersonal skills to work closely with team members in a fast, sometime stressful environment.\nCommitment to success with the ability to communicate effectively and respectfully with co-workers to promote a working environment conductive of constructive intellectual exchanges.\n\nJOB TYPE: Full-Time/Part-Time\n\n\nEXPERIENCE\n\n\n· Laboratory Experience: 1 year\n\n\nBENEFITS:\n\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nOTHER\n\n\n· Must pass the required background check\n\n\n· Must be at least 21 years old.\n\n\n· Must be able to lift 20lbs\n\n\nAce Analytical is an Equal Opportunity Employer- All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.\n\n\nIf interested, please submit your resume and a cover letter emphasizing your motivation and how your education and experience make you an appealing candidate for this position. Applications without cover letters will not be considered.\n\n\nJob Types: Full-time, Part-time\n\n\nPay: $15.00 - $17.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nMonday to Friday\nNight shift\nWeekend availability\n\nSupplemental Pay:\n\n\nBonus pay\n\nCOVID-19 considerations:\nMasks and gloves are required and provided. Cleaning protocols are in place throughout the day, as well as hand washing guidelines.\n\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nMicrobiology: 1 year (Required)\nLaboratory Experience: 2 years (Preferred)\n\nWork Location: One location\n","slug":"microbiology-lab-technician-df164492-2376-4a8b-b481-5329cd0c8571","benefits":["Dental insurance","Health insurance","Paid time off","Vision insurance"],"selectedSkills":["Microsoft Excel","Laboratory experience","Microbiology","Microsoft Office","Bachelor's degree","Associate's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=8cuBGs7mJizJJmlBUgoIFGHab8fc2OodejaREPaUCaK9NKXABl0lPw"},{"position":"Courier and Accessioning Technician","labName":"Rm3 Labs","location":"Broomfield, CO","age":"4 days ago","type":"Full-time","salaryMin":"$17 an hour","jobDescriptionCopy":"Company Description\n\n\nSince our founding in 2009, Rm3 Labs has been a leader in providing scientific analysis for the cannabis community of Colorado. As a fully independent, analytical laboratory located in Broomfield, we bring state-of-the-art scientific expertise and technology to help our clients produce safe, pure, and effective cannabis products. We are ISO/IEC 17025 accredited and licensed and certified by the State.\n\n\nJob Summary\n\n\nWe are looking for a full-time Courier and Accessioning Technician to plan routes, pick up samples from client facilities in the Denver metro area, Fort Collins/Boulder, and/or Colorado Springs/Pueblo, accession samples in-house, and provide excellent customer service.\n\n\nThis position will require driving in a personal vehicle (58 cents per mile mileage reimbursement paid when using personal vehicle) or the company car, if available. It is estimated that a personal vehicle will need to be used for 150 - 200 miles per week. After courier routes, the rest of the workday will be spent in the lab accessioning samples into our system.\n\n\nThe schedule for this position is Mondays through Fridays from 8:30am - 5pm, unless assigned the south route, in which case the scheduled hours will be from 5:30am - 2pm.\n\n\nBenefits include three weeks of paid time off, six paid holidays, maternity/paternity leave, subsidized healthcare and dental insurance, holiday bonus based on performance, and professional development assistance.\n\n\nResponsibilities\n\n\nComply with State, Local, OSHA, and ISO 17025 requirements.\nFollow company Standard Operating Procedures (SOPs).\nMaintain Rm3 Labs’ brand essence when communicating with clients and lab visitors by demonstrating professional, courteous, and cooperative behavior.\nMaintain general knowledge on Rm3 Labs’ services, Metrc, and current testing and sampling rules.\nOperate the front desk reception area and greet and check-in visitors.\nReceive samples from client facilities or from clients in the lobby and accession samples into our system.\nCheck samples for accuracy, tampering and/or possible adulteration and ensure all pertinent information is documented.\nLabel samples with the internal Rm3 Labs ID and test analyses required and deliver samples to the appropriate department inbox.\nAnswer phones and contact clients to correct issues with samples or manifests.\nSchedule sample pick-ups and provide courier information to clients.\nPlan and follow the most efficient routes for picking up samples and drive safely to client facilities to pick up samples.\nAssist with training new or junior staff; may act an as onboarding buddy to new staff.\nPerform other tasks, as assigned by the Accessioning Lead or Client Services Lead.\nReport concerns to the Accessioning Lead or Client Service Lead.\n\nRequirements\n\n\nMust pass an extensive background check with no felony convictions and obtain a Colorado Department of Revenue – Marijuana Enforcement Division (DOR-MED) employee license prior to or at the time of hire.\nExcellent driving record and a reliable vehicle.\nExperience in customer service, data entry, and/or similar high-volume, detailed work.\nAble to work independently and part of a team in a fast-paced environment.\nAble to interact professionally with colleagues and bring up concerns immediately when you are faced with them.\nGood written and verbal communication skills.\nDetail and accuracy oriented.\n\nThe Ideal Candidate\n\n\nEnjoys driving.\nThrives in a fast-paced, professional, and fun work environment.\nIs self-motivated and focused on continual improvement.\nHas a passion for the cannabis industry.\nCannabis industry experience and/or METRC experience is a strong plus.\nHaving a current MED employee badge is a strong plus.\nComputer skills and experience in Windows and Microsoft Office is a plus.\n\nJob Type: Full-time\n\n\nPay: $17.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid sick time\nPaid time off\nParental leave\n\nSchedule:\n\n\nDay shift\nMonday to Friday\n\nSupplemental Pay:\n\n\nPerformance bonus\n\nTrucking Driver Type:\n\n\nCompany driver\n\nTrucking Route:\n\n\nLocal\nRegional\n\nCOVID-19 considerations:\nWe require employees and visitors to wear masks.\n\n\nApplication Question(s):\n\n\nAre you a Colorado resident? Unfortunately, we can only consider Colorado residents at this time.\nAre you comfortable driving your own vehicle with a 58 cent per mile mileage reimbursement for about 150 - 200 miles per week?\nDo you already have a MED badge?\nPlease list all the times you are available for a 15-30 min phone interview over the next two weeks.\n\nLicense/Certification:\n\n\nDriver's License (Required)\n\nWork Location: One location\n","slug":"courier-and-accessioning-technician-0f767329-b72d-483c-a30d-6c9e9f1de10f","benefits":["Dental insurance","Health insurance","Mileage reimbursement","Paid time off","Professional development assistance"],"selectedSkills":["Customer service","Driver's License","Computer skills","Communication skills","Data entry","Background check","Reliable transportation"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=5YAtlJRNNrDHsL5YJorP0KhSJaxy8bb6jizZpMvC73Y6-0BMrvW4jQ"},{"position":"Chemistry Analyst","labName":"Rm3 Labs","location":"Broomfield, CO","age":"3 days ago","type":"Full-time","salaryMin":"$19 ","salaryMax":" $22 an hour","jobDescriptionCopy":"Company Description\n\n\nSince our founding in 2009, Rm3 Labs has been a leader in providing scientific analysis for the cannabis community of Colorado. As a fully independent, analytical laboratory located in Broomfield, we bring state-of-the-art scientific expertise and technology to help our clients produce safe, pure, and effective cannabis products. We are ISO/IEC 17025 accredited and licensed and certified by the State.\n\n\nJob Summary\n\n\nWe are looking for a full-time Chemistry Analyst in our LC-MS department to perform chemical tests, analyze and record test results. This position involves preparing and analyzing cannabis flower, concentrates, and infused products for pesticide and mycotoxin contamination.\n\n\nThis position requires being in the lab Mondays through Fridays from 10am – 6:30pm. During training (approximately first 1-2 months), the schedule will be Mondays through Fridays from 9am - 5:30pm.\n\n\nThe hourly rate is based on the number of years of full-time laboratory testing experience (minimum required is 1 year of full time laboratory testing experience). Benefits include three weeks of paid time off, paid holidays, maternity/paternity leave, subsidized healthcare and dental insurance, holiday bonus based on performance, and professional development assistance.\n\n\nNOTE: The State of Colorado requires analysts to have a four-year degree in chemistry, biochemistry or related field and one year of full-time experience in a testing laboratory. Candidates will need a Marijuana Enforcement Division (MED) employee license. Only current Colorado residents that have a four-year degree in a natural science and one year of full-time experience in a testing laboratory will be considered.\n\n\nResponsibilities\n\n\nComply with State, Local, OSHA, and ISO 17025 requirements.\nFollow company and laboratory Standard Operating Procedures (SOPs).\nVerify lab equipment before use to ensure they are within acceptable limits.\nPrepare lab reagents and working standards and verify them before use.\nPrepare and test analytical samples using traditional laboratory technologies such as HPLC, GC-MS, LC-MS/MS, and ICP-MS.\nAccurately record and interpret data in an organized, legible, and consistent manner on documents and in the Laboratory Information Management System (LIMS).\nReview and authorize data for test reports to be created and sent to clients within prescribed reporting deadlines.\nIdentify, investigate, and document departures from the quality system and/or test procedures.\nTroubleshoot, clean, and maintain laboratory equipment and supplies.\nPerform general laboratory tasks such as inventory and consumables ordering, sample archival and disposal, cleaning, and similar lab duties.\nAssist with training new or junior staff; may act an as onboarding buddy to new staff.\nAssist in the development, modification, verification, and validation of methods.\nPerform special projects, as assigned by the Lead Chemist, Chemistry Lab Manager, and/or Laboratory Director.\nReport concerns to the Lead Chemist.\n\nRequirements\n\n\nBS/BA in chemistry, biochemistry, or related field and at least one year of full-time laboratory testing experience is required by State regulation, no exceptions.\nMust pass an extensive background check with no felony convictions and obtain a Colorado Department of Revenue – MED employee license prior to or at the time of hire.\nAble to work independently and part of a team in a fast-paced environment.\nAble to interact professionally with colleagues and bring up concerns immediately when you are faced with them.\nGreat written and verbal communication skills.\nExcellent laboratory troubleshooting skills.\nDetail and accuracy oriented.\nComputer skills and experience in Windows and Microsoft Office, particularly Excel.\n\nThe Ideal Candidate\n\n\nThrives in a fast-paced, professional, and fun work environment.\nIs self-motivated, curious, and focused on continual improvement.\nHas a passion for cannabis or the cannabis industry.\nLC-MS experience and/or sample preparation experience for pesticides or mycotoxins testing is a strong plus.\nExperience with other instruments such as HPLC, GC-MS, and/or ICP-MS is a strong plus.\nExperience in high-throughput, ISO/IEC 17025 accredited, and or FDA/EPA/USDA labs is a strong plus.\n\nJob Type: Full-time\n\n\nPay: $19.00 - $22.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nParental leave\nProfessional development assistance\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\n\nSupplemental Pay:\n\n\nBonus pay\n\nCOVID-19 considerations:\nAll employees and visitors must wear a mask.\n\n\nApplication Question(s):\n\n\nAre you currently a Colorado resident? Unfortunately, we need to fill this position quickly and residency is needed per state regulations.\nWhat analytical instrumentation do you have experience with (please also include what the instrument tests for)?\nDo you have any HPLC or LC-MS experience? If so, please elaborate.\nPlease list all the times you are available between 8am - 5pm Mondays - Fridays for a 15-30 minute phone interview in the next two weeks.\n\nExperience:\n\n\nFULL-TIME laboratory testing experience outside of college: 1 year (Required)\n\nWork Location: One location\n","slug":"chemistry-analyst-468071dc-b79c-43ae-90b8-5e02ff410109","benefits":["Dental insurance","Health insurance","Professional development assistance","Paid time off","Parental leave"],"selectedSkills":["Microsoft Excel","Windows","High-performance liquid chromatography","Laboratory experience","Communication skills","Bachelor of Science","Bachelor's degree","Master's degree","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=5A0aSftcRFLU7l5iQ43_bbgu9nMLyUtwvdxLNPzoEyuq0lZHJ7nP0g"},{"position":"Lab Technician-GCMS, HPLC","labName":"True Northwest, Inc","location":"Olympia, WA","age":"5 days ago","type":"Full-time","salaryMin":"$15 ","salaryMax":" $19 an hour","jobDescriptionCopy":"We are a small analytical laboratory based in Olympia, Washington. The perfect person is smart, confident, responsible, WANTS to work, presents themselves well. We are state certified and licensed for testing cannabis.\n\n\nIdeal candidates should possess the following skills:\n\n\n-2 years + GCMS & HPLC Chromatography experience\n\n\n-Experience in a high-throughput laboratory\n\n\n-Strong attention to detail\n\n\n-Degree in chemistry, microbiology, or related discipline\n\n\n-Ability to troubleshoot, problem solve, and improvise\n\n\n-Proficiency with data entry and computer applications\n\n\n-Multitasking capability\n\n\n-Ability to work in a fast paced environment\n\n\n-Strong written and verbal communication skills\n\n\n-Diligence in record keeping and updating\n\n\n-Positive attitude\n\n\n-Willing to carry out often repetitive procedures accurately, reliably and with care.\n\n\n-Must be flexible and willing to take on variety of tasks\n\n\n-Must be able to work independently & with a small team\n\n\nLaboratory Duties include:\n\n\n-Microbiological analysis of samples for pathogens\n\n\n-GCMS & HPLC Chromatography\n\n\n-Media and solution preparation\n\n\n-Data entry and documentation\n\n\n-General Lab housekeeping\n\n\nJob Type: Full-time\n\n\nPay: $15.00 - $19.00 per hour\n\n\nBenefits:\n\n\nRetirement plan\n\nSchedule:\n\n\n8 hour shift\nWeekend availability\n\nCOVID-19 considerations:\nEveryone is required to mask up if the Governor mandates it.\n\n\nAbility to commute/relocate:\n\n\nOlympia, WA: Reliably commute or planning to relocate before starting work (Required)\n\nWork Location: One location\n","slug":"lab-techniciangcms-hplc-6496836e-c420-4474-ac40-e4ebdac08322","benefits":["Retirement plan"],"selectedSkills":["Laboratory experience","Communication skills","Chromatography"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=-Og9epgC6U6ra6JXhADBdSu6dBE5WUHoeTmoRGbGVC-Q8e9119NU-A"},{"position":"HVAC Technician","labName":"Parallel","location":"Franklin, MA","age":"6 days ago","type":"Full-time","salaryMin":"$27 ","salaryMax":" $30 an hour","jobDescriptionCopy":"Everyone is welcome here. Each of us is unique, and that’s what makes us amazing. We believe in inclusiveness and celebrating each person’s individuality, because there’s power in bringing people with different points of view and life experiences together. That’s why we provide equal employment opportunities (EEO). All applicants are considered regardless of race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, or sexual orientation.\n\nSo, bring yourself and your best ideas; when we feel safe and comfortable being ourselves, there’s no limit to what we can achieve.\n\nIN A NUTSHELL…\n\nThe Facilities HVAC Tech 2 provides support to the facilities operation during the initial set up phase and ongoing operation thereafter. They provide guidance to ensure the Facilities department is operating best in class.\n\nThis role is with NETA, one of the renowned retail brands under the Parallel umbrella. Parallel is one of the largest multi-state cannabis companies in the world, owning and operating in five markets; Florida (Surterra Wellness), Massachusetts (NETA), Pennsylvania (Goodblend), Nevada (The Apothecary Shoppe) and Texas (Goodblend). If you enjoy companies that are growing, moving fast, and constantly challenging themselves to achieve more, then Parallel is for you. We work hard, lean on each other, and are passionate about a pretty ambitious vision … pioneering a new paradigm of what well-being can be for all people, everywhere. For more information, visit www.liveparallel.com.\n\nWHAT YOU WILL BE DOING:\nRepair and maintain Industrial HVAC, plumbing and mechanical equipment in accordance with diagrams, sketches, operating manuals, manufacturers' specifications or supervisor s instructions, using hand and power tools, precision measuring or testing devices. Responsible for complete maintenance of area of assignment.\nRead blueprints; understand and read computerized HVAC, Electrical, plumbing system and building layouts.\nObserve and adjust a wide variety of equipment, machines and devices in operation to assure proper operation, including pumps, refrigerant recovery, engines, motors, compressors and laboratory equipment.\nDismantle machines and devices for servicing, repair, or replacement of parts.\nObserve Parallel Policies & Procedures for daily operations and fully complies with state medical marijuana regulations at all times.\nPerform preventative maintenance and maintains a scheduled maintenance program to ensure proper facilities upkeep, including all mechanical, electrical and plumbing infrastructure and equipment.\nEffectively using CMMS tracking systems to report receipt of maintenance needs and/or other issues.\nRespond to facility related failures or emergencies promptly and prioritizes work orders, while maintaining preventative tasks in accordance with facility needs.\nPerform routine maintenance tasks, preventative systems and repairs.\nComplete all required documentation for utility and facility management, follows up and evaluates effectiveness of all implemented actions to ensure that problem has been resolved effectively.\nEnsure safe work practices are implemented and consistently followed by department staff.\nWork with other departments in addressing and rectifying potentially unsafe work conditions or practices.\nEnsure compliance with applicable building codes, fire and emergency codes, regulatory and other required regulations.\nResponsive and professional in all response and interactions regarding service requests and facility needs.\nAble to work carefully and efficiently in a fast-paced environment.\nWork in coordination with the Supervisor and Manager to help upgrade all systems and streamline as needed to function in the most efficient and effective manner.\nAfter hours on call availability.\nPerform other job duties and tasks as assigned.\n\nEXPERIENCE AND SKILLS YOU’LL BRING:\nTechnical school graduate or equivalent industrial operations experience (Required).\nHVAC Certification and Refrigeration Recycle Recovery license (Required).\nDemonstrate competency in performing routine maintenance tasks, preventative systems and repairs.\nAbility to read blueprints; ability to understand and read computerized HVAC, Electrical, plumbing system and building layouts.\nMin 7 years of progressively responsible work-related experience and any combination of education and training which provides the required knowledge, skills and abilities to perform the essential functions of the job, combined with demonstrated professional growth and achievement.\nAge 21 or over (Required).\nHigh School Diploma or equivalent (Required).\nValid Government-Issued Photo ID (Required).\n\nYOU WILL BE SUCCESSFUL IF YOU…\nAre self-motivated; micro-managing isn’t fun for anyone.\nRoll your sleeves up and do the work; strategy is important, but so is getting stuff done.\nCan work fast and be flexible; our industry is always changing.\nPlay nice with others; we collaborate with each other a lot.\nThink creatively; sometimes, the “traditional” solution isn’t the best one.\n\nWHAT YOU GET:\nConsistent, reliable benefits; Full medical/vision/dental, 401k with a possible company match, access to company-sponsored well-being programs\nBalance and flexibility; paid time off, paid parental leave, flexible work arrangements.\nFinancial opportunity; an incentive program that provides opportunity to earn cash AND equity in a fast-growing company and industry\nEmployee discount.\nChance to make a difference; Employee Relief Fund, community volunteerism opportunities through Benevity.\n\nPHYSICAL REQUIREMENTS:\nThe person in this position frequently communicates with other employees/customers. Must be able to communicate accurate information in these situations.\nMust be able to travel up to 5%-10% of the time.\nMust be able to move around the production facilities up to 30% of the time.\nMust be able to work in an environment which is noisy and with temperature fluctuations from 60 degrees to 90 degrees.\nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\nConstantly operates a computer and other office productivity machinery.\n\nPARALLEL IS UNITED BY OUR VISION, MISSION, & VALUES:\nOur Vision – why we exist – is to pioneer well-being and improve the quality of life for humanity through the benefits of cannabinoids.\n\nOur Mission – how we will do this – is to build a leading, global well-being company through the best talent, our values, trusted and recognized brands, science and technology-based innovation, and a relentless focus on execution and continuous improvement.\n\nOur Values – Integrity | Collaboration | Alignment | Intentionality | Accountability | Agility\n\nWe are an Equal Opportunity Employer. We embrace and encourage our employees’ differences in age, color, disability, ethnicity, gender identity or expression, language, national origin, physical and mental ability, political affiliation, race, religion, sexual orientation, socioeconomic status, veteran status, and other characteristics that make our employees unique.","slug":"hvac-technician-483e4ee5-8db1-40d5-862c-4c068fa8cf8e","benefits":["Dental insurance","Employee discount","Health insurance","401(k) matching","Paid time off"],"selectedSkills":["Precision measuring instruments","CMMS","EPA Refrigeration Certification","HVAC Certification","HVAC","High school diploma or GED","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=iXqDZrzPHimt-9fMbq3-8PH0pGgE1-7XPm3bZypYaRa93zVTtXdAOw"}]