[{"position":"Hemp and Cannabis Inspector","labName":"State of Utah","location":"Salt Lake County, UT","age":"4 days ago","type":"Full-time","salaryMin":"$17.74 ","salaryMax":" $26.64 an hour","jobDescriptionCopy":"Job Description\n\nJob Title: UDAF Cannabis and Hemp Division Inspector\nLocation: Taylorsville\n\nJob Description:\nThe Medical Cannabis and Industrial Hemp Division at the Utah Department of Agriculture and Food (UDAF) are seeking a qualified individual to fill a Compliance Inspector position. The incumbent will function as a field representative of the division and will primarily be responsible for performing inspections of cannabis & hemp cultivation sites, processing facilities, and retail locations, to enforce regulations set by the State of Utah and provide technical leadership. Inspectors monitor agricultural policy and certify compliance with program regulations. Inspectors need to have outstanding integrity, extreme attention to detail, and exceptional interpersonal communication skills. This job will require you to understand and clearly communicate laws and rules to individuals participating in the legal sale of cannabis and hemp products in the State of Utah. This will include reviewing product labels of hemp and cannabis commodities for compliance and issuing a notice of violations of the law, a notice of violation, and/or stop-sale notices.\n\nInspectors will:\nPromote responsible agricultural production and commerce.\nProvides technical leadership in their area of specialty.\nComply with the requirements of due process.\nPrepare compliance violations.\nImplement administrative controls. Federal and State licensure may be required for each program.\n\nPursuant to Utah Code §§ 4-41-107 and 26-61a-111, this job includes duties that arise from or directly relate to the Utah Medical Cannabis Act. Duties may require conduct which is in violation of the criminal laws of the United States with respect to the manufacture, sale, or distribution of cannabis. As a condition of employment, candidates who are selected to fill this position will be required to sign an Acceptance of Duties Under the Medical Cannabis Act Acknowledgment Form.\nPrincipal Duties:\nReceive, research, and respond to incoming questions or complaints.\nProvide information, explain policy, and procedures, and facilitate a resolution.\nEnsure compliance with applicable federal and state laws, regulations, and agency rules, standards, and guidelines.\nMonitor and evaluate operations, programs, processes, and practices for quality and effectiveness.\nInspect, grade, and certify facilities and products.\nSchedule and conduct inspections and investigations.\nGather, identify, and stores samples of materials to be tested on-site or forwarded to a laboratory for testing.\nEnforce laws, rules, and regulations.\nMaintain detailed inspection and investigation records, prepare reports, and attend to other related administrative requirements.\n\nIdeal Candidate:The ideal candidate will have:\nA basic understanding of the cannabis and/or hemp industry.\nExperience growing or manufacturing agriculture products or experience in the cannabis and hemp industry.\nAdvanced knowledge of standard office software.\nThe ability to read and understand laws and legal documents.\nA ”self-starter” mentality and the ability to manage their time effectively.\nA detail-oriented personality. The ability to understand complex problems and find and apply solutions.\nThe ability to communicate complex ideas in both written and verbal forms.\nThe ability to work well with the public, including diffusing difficult situations.\n\nPreference may be given to applicants with a bachelor's degree in natural sciences, natural resource management, or an agriculture-related field.\nWhy You Should Join Our Team:\nWould you like a career working in the new and exciting industrial hemp and medical cannabis industry? As an industrial hemp and cannabis inspector regulating state cannabis laws and working with great people in state and local agencies throughout Utah. The Utah Department of Agriculture and Food is hiring a hemp/cannabis inspector to monitor compliance of medical cannabis and industrial hemp growers, processors, and products. The Agency: If you would like to read more about working for the Department of Agriculture\nand Food please click here.\n\nThe Agency:\nIf you would like to read more about working for Agriculture and Food please click here.\n\nTypical Qualifications\n\nThe ability to see details at close range (within a few feet of the observer).\nThe ability to listen to and understand information and ideas presented through spoken words and sentences.\nThe ability to communicate information and ideas in speaking so others will understand.\nThe ability to read and understand information and ideas presented in writing.\nGiving full attention to what other people are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times.\nUsing logic and reasoning to identify the strengths and weaknesses of alternative solutions, conclusions, or approaches to problems.\nMonitoring and assessing the performance of individuals or organizations to make improvements or take corrective action.\nConducting tests and inspections of products, services, or processes to evaluate quality or performance.\nKnowledge of laws, legal codes, court procedures, precedents, government regulations, executive orders, agency rules, and the democratic political process.\nKnowledge of the chemical composition, structure, and properties of substances and of the chemical processes and transformations that they undergo. This includes uses of chemicals and their interactions, danger signs, production techniques, and disposal methods.\nKnowledge of the practical application of engineering science and technology. This includes applying principles, techniques, procedures, and equipment to the design and production of various goods and services.\nKnowledge of plant organisms, their tissues, cells, functions, interdependencies, and interactions with each other and the environment.\nThe ability to add, subtract, multiply, or divide quickly and correctly.\nThe ability to understand and calculate percentages.\n\nSupplemental Information\n\nRisks which require the use of special safety precautions and/or equipment, e.g., working around operating machines, working with contagious diseases or hazardous chemicals, etc.\nSpecific plant industry/agricultural licenses or certificates are required.\nValid driver license required to drive a motor vehicle on a highway in this state per UCA53-3-202(1)(a).\nWork requires physical exertion. May require the ability to stand; walk over rough surfaces; bend, crouch, stoop, stretch, reach, lift moderately heavy items (up to 50 lbs.) in a recurring manner and/or for long periods of time.","slug":"hemp-and-cannabis-inspector-4fa1935b-d833-4ece-9bc6-ce1fdb2c262a","benefits":[],"selectedSkills":["Writing skills","Growing experience","Communication skills","Manufacturing","Driver's License","Bachelor's degree"],"jobType":"free","applyURL":"https://www.governmentjobs.com/careers/utah/jobs/3518263/hemp-and-cannabis-inspector"},{"position":"Lab Assistant","labName":"Solar Therapeutics","location":"Somerset, MA","age":"6 days ago","type":"Full-time","salaryMin":"$37,000 ","salaryMax":" $54,000 a year","jobDescriptionCopy":"About Us\n\nMassachusetts based Solar Therapeutics is New England’s leading producer of wellness and alternative therapies dedicated to state of the art, fully sustainable cultivation & production of pharmaceutical grade cannabis.\n\nThe company’s experienced management team, dedicated board and passionate investors are driven by a singular mission: to provide industry leading alternative therapies with a sustainable carbon-neutral energy footprint.\n\nThe Position\n\nWe are seeking individuals to join our laboratory team here at Solar Therapeutics. The ideal candidates will be detail oriented, have prior extensive experience working in a laboratory setting, and have the ability to work quickly and efficiently with their hands in a fun, fast paced, regulated environment.\n\n\nMinimum of 21 years of age.\nPossess valid driver’s license or state ID.\nMust pass all required background checks.\nMust be and remain compliant with any and all legal or company regulations for working in the industry.\nMust be able to lift, carry and balance up to 30 pounds (100 pounds with assistance). This job function may include walking or standing for extended periods of time, as well as stooping, bending over and/or crouching.\nKey Responsibilities\n\n\nAssist in production calculating requirements; assembling and weighing plant material and supplies for supercritical CO2 extraction: emptying extraction vessels\nOperate intricate equipment, wipe film distillation and rotary evaporator, in accordance with Solar Therapeutics’ Standard Operating Procedures\nMaintaining inventory records of supplies, materials and equipment, and preparing requisitions as needed.\nWork with state licensed third party testing lab to ensure QC\nMake distillate\nOversee cartridge filling\nClean and help maintain laboratory equipment\nComplete data entry into various marijuana tracking systems including METRC\nStore supplies and equipment, dispose of waste according to guidelines, and keep laboratory working areas sanitary and safe\nReport leaks and faulty equipment to Laboratory Manager\nComplete other duties and tasks as assigned by the Laboratory Manager\nQualifications\n\nBachelor’s degree preferred\nGreat interpersonal/communication skills\nDetail-oriented\nHave genuine and positive energy\nGreat work ethic, reliability, and professionalism\nExcellent listening skills\nCannabis industry experience & knowledge preferred\nExperience working in a laboratory strongly preferred\nKnowledge of METRC a plus\nBenefits\n\nMedical Insurance\nDental Insurance\nVision Insurance\nEmployee Discount\nPaid Time Off\n401(k) plan\n\nSolar Therapeutics is an Equal Opportunity Employer committed to building a diverse workforce as it values the knowledge, diversity and performance of our employees to make us a great company. Solar Therapeutics is an Equal Opportunity Employer and all applicants will be considered without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran, or disability status. Solar Therapeutics agrees to hire individuals with Cannabis-related CORI offenses.","slug":"lab-assistant-a08b9785-eb31-4564-9f08-3fa85a40bfe4","benefits":["Paid time off","Dental insurance","Employee discount","401(k)","Health insurance"],"selectedSkills":["Laboratory experience","Communication skills","Driver's License","Bachelor's degree","21 years or older"],"jobType":"free","applyURL":"https://www.governmentjobs.com/careers/utah/jobs/3518263/hemp-and-cannabis-inspector"},{"position":"Inventory Control Manager","labName":"True Harvest","location":"Phoenix, AZ","age":"1 day ago","type":"Full-time","salaryMin":"$41,000 ","salaryMax":" $53,000 a year","jobDescriptionCopy":"INVENTORY MANAGER – SHANGO\n\nAre you ready to join Shango to lead our inventory team and be part of one of the fastest growing markets in Arizona? We are ready for you! The Inventory Manager will be responsible for entering, managing and maintaining the cultivation inventory - including all packaging, conversion, internal transfers, sales, laboratory testing, and sample reserves - into the BioTrack seed to sale Point of Sale System, as well as ensure full accountability for all product. Must possess strong analytical thinking, communication, attention to detail and creative problem-solving skills with a heavy focus on numbers and accounting.\n\nDUTIES AND ESSENTIAL FUNCTIONS:\nInventory control accountability for weights, and accurate tracking for trimming, packaging, waste disposal, labeling and inventory management.\nEffectively communicates with growers, production and management to ensure business has consistent supply of inventory available to meet the needs.\nOversees growhouse plant movement in BioTrack. Responsible for overseeing the removal of all dead plants from the system and destruction of all products\nOversees and controls non-cannabis inventory throughout facility\nAssist each department in the following: wholesale product transfers, laboratory testing batches, sample reserves, apply bar codes for tracking and ensuring inventory is accurate.\nMaintains tracking of all internal products moving in and out of the BioTrack system.\nSchedule and coordinate the physical inventory audits. Additionally, complete unannounced audits of inventory to ensure accuracy and report any balance to the Executive Management immediately.\nMaintain a sense of heightened security awareness.\nAbility to be trained on software comfortable using a track and trace system.\nAccurately report and track inventory balance, price lists, shortages, damages, and disposals in inventory control system.\nActively participate in management meetings and report inventory levels, test results and work cooperatively with the management team.\nParticipate with communication that the Executive Management may have with the Division as needed on inventory related issues and statements of deficiencies.\nReport any software deficiencies or ideas for improvements to the Executive Management.\n\nFunctional Knowledge, Skills, and Competencies:\nMust have excellent written and verbal communication and presentation skills\nCannabis Inventory Experience (preferred)\nBioTrack and/or seed to sale system experience\nAZ State Medical Marijuana compliance\nEffective time-management skills, self-motivation and ability to multi-task\nHigh level of attention to detail and ability to influence, negotiate and close business in meetings.\nSkilled in MS Office (Outlook, Excel, PowerPoint, and Word).\nEmploy a sense of urgency with complete follow through\nAbility to work in a fast-paced, changing and challenging environment.\nAbility to be flexible with schedule and hours of the day.\nComply with all company policies including confidentiality and non-disclosure.\n\nThe job description defines the general requirements and level of work. The description is not a complete list of all required responsibilities, duties and skill requirements. Other responsibilities may be added and the job description may be changed at any time.\n\nQualifications\n\nAbility to pass a background check\nMust be 21 years of age and authorized to work in the US\n2+ Years Cannabis Inventory Exp (Preferred)\nAdvanced BioTrack Experience (preferred)\nUnderstand all aspects of product movement within facilities, as well as distribution to customers and external service providers (extractors, laboratories)\nAbility to get along well with others\n\nBenefits:\n2 weeks Paid Time Off\nHealthcare Plans available first of the month following 60 days.\nEmployee Samples distributed monthly\n\nJob Type: Full-time\n\nSalary: Based on Experience","slug":"inventory-control-manager-0ca8c148-fb06-4148-a0df-22aed9072507","benefits":["Paid time off","Health insurance"],"selectedSkills":["Analysis skills","Communication skills","Microsoft Excel","Time management","Microsoft Powerpoint","Background check","21 years or older","US work authorization"],"jobType":"free","applyURL":"https://true-harvest.prismhr-hire.com/job/225827/inventory-control-manager?s=in"},{"position":"Lab Technician","labName":"Ataraxia","location":"Albion, IL","age":"4 hours ago","salaryMin":"$31,000 ","salaryMax":" $45,000 a year","jobDescriptionCopy":"The Lab Technician provides on-site support to the extraction operations within a cannabis cultivation facility. As an Analytical Lab Technician, you are responsible for the cannabis extraction process and the manufacturing of cannabis concentrates. Extraction Specialists may be cross-trained and asked to support other departments occasionally to meet business needs, including but not limited to the processing of dry cannabis flower.\n\nEssential Duties and Responsibilities:\nPrepare equipment, biomass, and raw materials for extraction.\nExecute extractions and post-extraction processes.\nOperate extraction equipment, such as rotary evaporators, reactors, filtration equipment, etc.\nEnsure the consistency and efficiency of products through quality control testing and procedures.\nCollect samples as needed for quality testing.\nRegularly clean and sterilize equipment and workspace.\nMaintain strict inventory record of raw materials, chemicals, waste, and equipment.\nManage, document, and dispose lab waste.\nMaintain Material Safety Data Sheets (MSDS) for all chemicals and products.\nFollow laboratory safety protocols.\nMonitor and maintain quality control measures in accordance with state and local laws.\nAdhere to company policies and Standard Operating Procedures (SOP).\nMaintain a clean and safe working environment within the facility and production areas.\nImmediately inform Extraction Manager of any system or equipment discrepancies.\nEnsure all products are of high quality and visually aesthetic, reporting concerns to management for remediation.\nPerform other duties as assigned by management.\n\nMinimum Qualifications:\nAble to follow detailed instruction and capable of performing repetitive tasks.\nMust have a positive attitude and work well with others in a team environment.\nWilling to learn about, operate, and maintain facility equipment in a safe manner.\nAble to understand proper and safe handling of hazardous materials.\nMust have effective time management and multitasking skills.\nMust have strong computer skills.\nAbility to safely climb, squat, bend, twist, kneel and stand for at least 8 hours per day, and lift up to 50 pounds.\nMust be authorized to work in the United States.\nMust be 21 years of age or older and able to successfully register with the state's cannabis commission as an agent.\nMust comply with all laws, regulations, and policies associated with the industry.\n\nPreferred Qualifications:\nAssociate degree, Bachelor's degree, or equivalent in a scientific discipline preferred.\nPrevious experience in a regulated production facility (food, beverage, CPG, etc.) preferred.\nPrevious experience in a laboratory setting preferred.\nKnowledge of extractions, separations, isolations, distillation and/or fractionation preferred.\n\nPhysical and Mental Demands:\nWhile performing the duties of this job, the employee is frequently required to remain in a stationary position, move and/or position oneself, communicate, operate and/or prepare, place, position objects, tools, or controls. The employee must occasionally move packages weighing up to 50 lb. Specific vision abilities required by this job include close observation and the ability to adjust focus. The mental and physical requirements described here are representative of those that must be met by an individual, with or without reasonable accommodation, to successfully perform the essential functions of this position.\n\nWorking Environment:\nWork is performed in a warehouse environment. The employee is occasionally exposed to moving mechanical parts and risk of electrical shock. The noise level in the work environment is usually moderate. The work environment characteristics described here are representative of those an individual encounters while performing the essential functions of this position.\n\nEEO Statement:\nWe are proud to be an equal opportunity employer. We place priority in an environment of inclusion, diversity and social justice and are committed to securing a better, brighter way forward for our employees, our markets and our communities.","slug":"lab-technician-311a80a5-72f5-480f-9a2a-2093af20b206","benefits":[],"selectedSkills":["Laboratory experience","Computer skills","Time management","Bachelor's degree","Associate's degree","21 years or older","US work authorization"],"jobType":"free","applyURL":"https://boards.greenhouse.io/ataraxia/jobs/5093806003?gh_src=6226ab7a3us"},{"position":"Cannabis Laboratory Director","labName":"E4 Bioscience","location":"Detroit, MI","age":"1 day ago","type":"Full-time","salaryMin":"$120,000 ","salaryMax":" $150,000 a year","jobDescriptionCopy":"Cannabis Laboratory Director\n\nWarren, MI, United States\n\n$120,000 - $150,000 a year\n\nE4 Bioscience is partnered with a start-up cannabis safety and compliance testing laboratory in Warren, Michigan that will provide analytical chemistry and microbiology testing services for cannabis cultivators and processors as mandated by the state of Michigan. The laboratory is looking to appoint a laboratory director who will have the autonomy to run and spearhead the laboratory services while working in collaboration with the ownership group. The ~8,000 sqft laboratory has two (2) full suites of new Agilent instrumentation as well as new ancillary testing equipment/instrumentation throughout. In addition to the PathogenDx microbial testing solution, there are dedicated rooms for DNA extraction, amplification, and traditional culturing.\n\nThe laboratory director will be primarily responsible for managing all laboratory testing staff, overseeing all sampling, testing and data analysis, obtaining and maintaining ISO 17025 accreditation, and adhering to the Michigan Cannabis Regulatory Agency rules. This is a rare opportunity for an entrepreneurial scientist to join a laboratory on the ground floor, help set culture, policy, and grow the business. The laboratory offers an exceptional work environment, long-term growth opportunities in an expanding market, healthcare & 401(k) plans, and profit sharing.\n\nEssential functions:\n\nTechnical\n\nManages multiple analytical projects related to the development & optimization and/or troubleshooting of sensitive, efficient, and reliable assays for several classes of analytes.\nPrepares, reviews, and edits method transfer, qualification, and validation protocols, analytical technical reports, and regulatory documentation.\nConducts testing and data analysis.\n\nRegulatory\n\nEstablishes and ensures compliance with all regulatory agency requirements through documentation, audits, and corrective action.\nEnsures development, implementation, and administration of department’s policies and standard operating procedures.\nEnsures development, implementation, and administration of department’s Quality Control program.\nPerforms quality control procedures to ensure accuracy of data.\n\nManagement Responsibilities\n\nPerforms performance review and planning for direct reports.\nWorks with supervisory personnel to ensure participation in educational plan and personnel development plans.\nDevelops and maintains cooperative relationships with laboratory personnel, other laboratories, clients, and vendors.\nInterviews, hires, counsels, and/or terminates subordinate personnel, as required. Coordinates with executive team on personnel issues.\nMaintain annual laboratory budget.\nProvides open, positive, and productive communication with site leadership and corporate leadership.\n\nJOB REQUIREMENTS\n\nKnowledge/Skills/Abilities:\n\nExperience in cannabis safety testing is not necessary but highly desirable.\nISO 17025 experience required.\nLaboratory experience performing method development, optimization, and validation activities.\nAbility to multi-task and work in a fast-paced, changing, and challenging environment.\nProven ability to successfully work in a team environment.\nSuperior oral and written communication skills.\nAbility to make independent decisions.\n\nCompetencies (“soft skills\", traits, behaviors):\n\nImpeccable character, leadership, shows initiative, results oriented, creative thinker, detail oriented, focused on continuous development, effective time-management skills.\n\nEducation/Experience:\n\nPhD or MS in analytical chemistry (preferred) or related discipline with previous cannabis safety testing experience.\nPhD in analytical chemistry or related discipline, with 3+ years relevant experience in commercial testing.\nMS in analytical chemistry or related discipline, with 5+ years relevant experience in commercial testing.\n\nJob Type: Full-time\n\nSalary: $120,000.00 to $150,000.00/year (depends on experience)\n\nLanguage: English (Required)\n\nWork authorization: United States (Required\n\nJob Type: Full-time\n\nPay: $120,000.00 - $150,000.00 per year\n\nBenefits:\n\n401(k)\nHealth insurance\nPaid time off\nRelocation assistance\n\nSchedule:\n\nMonday to Friday\n\nApplication Question(s):\n\nWhat does the acronym \"LC/MS\" stand for?\n\nExperience:\n\ncannabis laboratory testing: 1 year (Required)\n\nWork Location: One location","slug":"cannabis-laboratory-director-6d487a5e-9797-4a6c-ac5f-e38b58729d83","benefits":["Health insurance","Paid time off","401(k)","Profit sharing","Relocation assistance"],"selectedSkills":["Laboratory experience","Communication skills","DNA isolation","Analytical chemistry","Time management","Doctoral degree","Master's degree","Doctor of Philosophy","US work authorization"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&job=FoWQw0H9hONpHehEIf_JZ5aU0rBgjKYrD4s-808kuhPRw90TT1sshw"},{"position":"Lab Technician - Cannabis Industry","labName":"Oklahoma","location":"Oklahoma City, OK","age":"8 hours ago","type":"Full-time","salaryMin":"$35,000 ","salaryMax":" $49,000 a year","jobDescriptionCopy":"Job Title: Lab Technician\n\nReports To: Processing Manager\n\nDepartment: Processing\n\nFLSA Status: Non-Exempt\n\nSupervisory Responsibility: NA\n\nPosition Summary:\nThe Lab Tech will execute a variety of laboratory and manufacturing tasks under the direction and supervision of our Lab Director. The Lab Technician will be responsible for assisting in product processing and formulation. The Lab Technician completes tasks assigned by the Lab Manager to operate lab equipment, monitor and maintain cleanliness and efficiency, and drives quality control while always being compliant. This individual must be able to multitask, work quickly and efficiently, and be adaptable to changing priorities and tasks as needed.\n\nFurthermore, the successful candidate will be expected to interact with managers and supervisors to set manufacturing schedules and ensure proper execution of workflow tasks by other employees. We have a very fast- paced environment as we continue to grow and expand. The individual must be motivated, trustworthy, and able to operate both independently and within a team environment.\n\nEssential Functions:\nOperate laboratory, extraction, and manufacturing equipment\nFollow all company policies and procedures to ensure product integrity and quality control\nAssist with testing and calibrating lab equipment in preparation for specific tasks\nPerform quality control tests on ingredients, completed products, and product samples\nWork closely with logistics team to deliver the highest quality products, on-time, accurately, and compliantly\nMaintain accurate inventory of all products\nProvide feedback to Lab Director and fellow team members in support of our continuous improvement operating priority\nRecognize and report any issues, large or small\nPerform all tasks as directed by the Lab Director\n\nManufacturing\n\nResponsible for the preparation and execution of Cure s extraction and processing of product in accordance with the company s Standard Operating Procedures\nEnsures consistency and efficacy of product through close attention to detail\nPerform lab bench work and product filtrations\nAssist in packaging department as needed\nCreate distilled, high purity concentrate medical marijuana for use in a variety of products including vape, edibles, topicals, and tinctures\nExecute the preparation and production of extracted products\nExecute proper labeling and storage of extracted products\nComplete all orders for extracted products in an efficient and timely manner, meeting all necessary deadlines\nCoordinate equipment maintenance, purchases, and repairs with the Lab Director as needed\nExecute and enforce compliance of all local and state regulations\nFollow weekly schedules to ensure there is proper coverage based on the business needs\n\nFacility Cleaning\n\nPerform all assigned duties required to ensure a clean and safe production facility\nEnsure personal hygiene is acceptable under standards set by Cure before performing any production activities by washing hands, wearing a hair net, changing clothes\nComplete the sanitation of all production equipment and tools including workspace, lab equipment, containers, and appliances.\nMonitor, clean, and maintain all equipment and operate all equipment safely in its intended manner\nEnsure compliance at all times with all sanitation regulations and safety standards in the production of all products\nPerform duties as needed outlined in the daily, weekly, and monthly cleaning schedules\n\nRequirements\n\nPast experience in a highly regulated field producing pharmaceutical or nutraceutical products preferred\nEffective time-management skills and ability to multi-task\nAbility to work in a fast-paced, changing and challenging environment\nProficiency in windows-based software and Metrc experience a plus\n\nCompetencies:\nTechnically focused\nIntegrity and trust\nAttention to detail\nApproachability\nCommunication skills\n\nWorking Conditions:\nWhile performing the duties of this job, the employee is regularly required to perform grasping, talking, hearing, seeing and other repetitive motions.\n\nThe employee is frequently is required to stand for long periods of time, use hands for detailed work.\n\nSpecific vision abilities required by this job include close vision, distance vision, peripheral vision, depth perception and ability to adjust focus. This position requires the ability to occasionally lift products and supplies, up to 75 pounds (or more with assistance). Strong odors and varying room temperatures will occur on a daily basis. This position setting is in a general Lab setting.\n\nPosition Type/Expected Hours of Work\n\nThis is a full-time position, and hours of work and days will vary due to business needs. Some holidays and overtime maybe required.\n\nTravel\n\nNone.\n\nEEO\n\nOur organization does not discriminate against our employees or applicants because of race, color, religion, sex, pregnancy, national origin, ancestry, age, marital status, sexual orientation, veteran status, physical or mental disability, medical condition, or any other status or classification protected by applicable federal, state, and/or local laws. Equal employment opportunity will be extended to all persons in all aspects of the employer-associate relationships, including recruitment, hiring, advancement, compensation, benefits, training, promotion, transfer, discipline, layoff, recall and termination. Every reasonable accommodation will be made for qualified disabled employees/applicants.\n\nOther Duties\n\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.\n\nBy signing this job description, I acknowledge that I am able to perform the scope of duties listed with or without reasonable accommodation.","slug":"lab-technician-cannabis-industry-88879195-f428-4ece-8af4-dae6e06fcbf6","benefits":[],"selectedSkills":["Communication skills","Windows","Time management"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&job=LyP0qVj8QvWRt_eDn3oVYh7pPVcdtlN9fxY3RT-LiW8qbKShT7OKaA"},{"position":"Laboratory Scientist (MA)","labName":"Green Analytics Massachusettes","location":"Framingham, MA","age":"8 days ago","type":"Full-time","salaryMin":"$25 ","salaryMax":" $30 an hour","jobDescriptionCopy":"POSITION SUMMARY: This is an analytical position responsible for advanced laboratory support functions to include calibration, standard preparation, instrument tuning, instrument and equipment maintenance, and analysis of data used for laboratory quality control. Daily work involves the use of various types of machinery, lab equipment and complex computer programs to perform tests, record data or findings and present information.\n\nESSENTIAL FUNCTIONS\n\nWorks with Lab Manager to ensure lab efficiencies for prioritization, workflow, and sample preparation, as well as the loading and running of HPLC, LCMS, GCMS and other instruments\nIdentifies opportunities for improvement; works with Department Head to implement new and improved methods and processes\nAssists with the upkeep and improvement of the quality management system to include Standard Operating Procedures (SOP’s) and the employee training programs\nPrepares calibrations and verifies quality controls for laboratory instruments and methods; uses data to recognize and/or correct possible processing or instrument errors\nAcquires and analyzes data used to perform and report analytical laboratory testing of cannabis products\nAssists with the validation of test methods and with Research and Development (R&D) related activities\nImports data into LIMS and Seed-to-Sale systems; provides for the documentation and tracking of Continuing Calibration Verification (CCV) Standards for Quality Assurance\nPrepares reports related to cannabinoid potency, terpene potency, residual solvents, heavy metals, pesticides, microbiologic organisms, water activity and mycotoxins\nProvides guidance and support for all duties commonly assigned to Field Samplers and Lab Technicians\nResponsible for inventory oversight of crucial departmental supplies\nMay also be called upon to perform the same or similar duties at other laboratory facilities, and for other job-related duties as assigned\n\nPOSITION REQUIREMENTS:\n\nGeneral Knowledge/Abilities\n\nAbility to fluently speak and read the English language along with understanding and following both written and verbal direction\nAbility to function independently, have personal integrity, flexibility and the ability to work effectively with fellow employees\nAnalytical and numerical skills: ability to perform mathematical calculations in different units of measurement\nAbility to use concepts such as fractions, percentages, and ratios; demonstrated abilities in troubleshooting and problem-solving\nBasic knowledge of modern office practices and use of Microsoft Office Suite for Word and Excel\nExperience in driving tasks and meeting deadlines; accountable for the completion of assigned goals and objectives\nAbility to build relationships to strengthen partnerships with a focus on customer service\nAbility to perform physically demanding work such as moving and lifting equipment, standing for long periods of time, etc.\n\nExperience, Education, Licenses/Certifications\n\nBachelor’s degree in Chemistry or a related field from an accredited college or university, or an equivalent combination of education and experience\nAt least 3 years post-graduate laboratory experience\nPrior experience in the Cannabis industry is a must\n\nSUPERVISORY RESPONSIBILITIES: None\n\nJob Type: Full-time\n\nPay: $25.00 - $30.00 per hour\n\nBenefits:\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\nDay shift\nNight shift\nWeekend availability\n\nCOVID-19 considerations:\nVaccination against COVID-19 is required for ALL employees.\n\nEducation:\n\nBachelor's (Required)\n\nExperience:\n\nAnalytical Laboratory: 2 years (Required)\nHPLC, GCMS, qPCR, LCMS, and/or ICPMS: 2 years (Required)\nCannabis Industry: 1 year (Preferred)\n\nWork Location: One location","slug":"laboratory-scientist-ma-4029bf3f-73df-4176-ba8d-ae7486ce18e5","benefits":["Dental insurance","Health insurance","Paid time off","401(k)","Vision insurance"],"selectedSkills":["Analysis skills","Microsoft Excel","Laboratory experience","Microsoft Office","Microsoft Word","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&job=Fc768P6xV3FdyaLAhpV1e5AOJ6C624EZNeMnOQubsMJFaaNT3VFaQg"},{"position":"Courier/On-Site Sampling Technician (Cannabis Testing Laboratory)","labName":"PSI Labs","location":"Monrovia, CA","age":"2 days ago","type":"Full-time","salaryMin":"$18 ","salaryMax":" $21 an hour","jobDescriptionCopy":"Courier/On-Site Field Sampling Technician (Cannabis Testing Laboratory)\n\nAre you interested in working and growing your career in the cannabis space?\nAre you passionate about working with a close-knit and supportive team?\nDo you want to work for a company that provides its employees with excellent benefits?\n\nIf you answered “yes” to these questions, read on to find out if PSI Labs is right for you.\n\nPSI Labs is a multi-state cannabis laboratory, engaged in testing of products for both compliance and research & development purposes. We work closely with our clients to provide reliable testing and support services and approach every client conversation from a place of collaboration and curiosity. Visit http://www.psilabs.org for more information.\n\nPSI Labs is looking for a Field Sampling Technician to join our team. This position is responsible for conducting sampling in the field and safely and securely transporting samples and relevant documentation to the laboratory for processing. Field Sampling Technicians will report to the lab at the beginning of each shift to collect their sanitized sampling kit, drive to licensed facilities for sampling events and return to the lab at the end of shift to drop off and input samples into our LIMS.\n\nA Field Sampling Tech must be comfortable working with and around cannabis products. All employment offers will be contingent upon successful completion of a criminal background check, including a Motor Vehicle Report (MVR) which must be clear to proceed.\n\nOur Sampling Technician will:\n\nDriving to and from sampling events (requires several hours on the road each day).\nFollow all internal laboratory SOPs and state regulations while driving samples to and from the laboratory/clients’ sampling site.\nMaintain records of samples and transportation data per relevant procedures.\nMaintain sampling supply/equipment inventory.\nComplete vehicle operational logs and minor maintenance as needed.\nFollow good documentation practices, data integrity principles, and safety protocols.\nEnsure proper Sample Submission form protocols are followed.\nSupport laboratory-based functions including sample intake/preparation, etc.\nCoordinate intake activities with Client Services Representative(s), Director of Client Ops, and Laboratory Director.\nPerform other duties as requested by Management.\n\nSample Collection:\n\nRandomly select samples for testing using the defined SOPs.\nDocument sample and client information.\nMaintain proper chain of custody of the samples from the client to the laboratory.\nReceive samples and verify appropriate receipt conditions, including weighing samples.\nEnter the samples into the LIMS.\nComplete all necessary intake forms.\n\nCustomer Relations:\n\nContact clients in conjunction with the Director of Client Ops and Client Service Representative(s) to determine their sampling needs to create a sampling plan (e.g.# of batches, requested analyses, sample information) and schedule sample collection.\nMake decisions on the condition of the product and advise the client if their product is ready to be sampled.\nAlong with the Client Service Representative, maintain/enhance customer relations.\n\nApply for our Field Sampling Technician position if you:\n\nAre at least 21 years of age.\nHave proficiency with in-house LIMS (Metrc is preferred).\nHave proficiency in Microsoft Word, Excel, and Google Workspace applications.\nAre reliable, hard-working, honest, detail-oriented, self-starter. An organized multi-tasker who takes pride in their work. An individual of the highest integrity.\nHave a valid driver’s license; must have and maintain an excellent driving record.\nHave a reliable automobile, and are willing to drive. (PSI pays mileage at 0.58/mile when Sampling Techs have to use their own autos).\nAre able to lift 50 lbs.\nHave a bachelor’s degree from an accredited college or university (required).\nHave a Bachelor’s Degree in biological, chemical, agricultural, environmental, or related sciences from an accredited college or university (preferred).\nHave previous sampling experience (preferred).\nHave excellent oral and written communication skills (required).\n\nWorking Conditions:\n\nThis job will include some extended work hours, weekend work during harvest and other busy seasons, and occasional overnight trips.\nThis job may entail regularly driving 3+ hours each way to a sampling event, if necessary.\n\nPhysical Requirements:\n\nThis job requires long periods of standing. This job requires driving.\n\nJob Type: Full-time\n\nPay: $18.00 - $21.00 per hour\n\nWHY PSI LABS:\n\nCompetitive salary.\nMedical, dental, and vision insurance.\nPaid holidays and paid time off.\n\nWe offer a collaborative and rewarding work environment where we value your input, experience, and professional development.\n\nIf you are a fit for this role, a member of our Human Resource team will reach out to schedule an initial phone screen. If selected for a position at PSI Labs, you must be willing to submit to a background check.\n\nPSI Labs strives to ensure that our career website is accessible to all, including individuals with disabilities. If you are a qualified individual with a disability or a disabled veteran, you have the right to request a reasonable accommodation. Please email us if you are unable or limited in your ability to use or access our website as a result of your disability.\n\nPSI Labs is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or protected veteran or disability status.\n\nEEO is the law. Click here to view information on your protections under Federal Law from discrimination.\n\nJob Type: Full-time\n\nPay: $18.00 - $21.00 per hour\n\nBenefits:\n\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\nMonday to Friday\n\nEducation:\n\nBachelor's (Required)\n\nExperience:\n\nDriving: 1 year (Required)\n\nLicense/Certification:\n\nDriver's License (Required)\n\nWork Location: One location","slug":"courieronsite-sampling-technician-cannabis-testing-laboratory-ffd632d3-69ff-46bc-8091-5de86d87259f","benefits":["Dental insurance","Health insurance","Paid time off","Vision insurance","Life insurance"],"selectedSkills":["Intake","Driving","Microsoft Excel","Driver's License","Communication skills","Bachelor's degree","21 years or older","Criminal background check","Clean MVR report","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&job=7WWr3NmgM8Z6kcPiy7CHnRaCVu7KPDbpZL5XcaDTuQzQLBkZc-uvtw"},{"position":"Chemist I - Second Shift","labName":"R.I. Analytical Laboratories, Inc.","location":"Warwick, RI","age":"2 days ago","type":"Full-time","salaryMin":"$18 ","salaryMax":" $23 an hour","jobDescriptionCopy":"R.I. Analytical Laboratories, Inc.\n\nPosition Announcement\n\nJob Title: Chemist I\n\nPosition: Environmental Chemist\n\nDepartment: Wet Chemistry\n\nSupervisor: Department Team Lead\n\nPosition Summary:\n\nRI Analytical Laboratories, Inc. is a leading environmental, product & materials, and cannabis testing laboratory that has been serving the southern New England area for over 40 years. RI Analytical is seeking a highly motivated individual to join our team in Warwick, RI as a full-time chemist in our wet chemistry department. Please note, this role is second shift, Monday thru Friday. Hours are 3:00 PM to 11:45 PM.\n\nIn this role you will be responsible for providing operational support in your department by actively participating in daily laboratory production. Further, you will work with the department Team Lead to develop laboratory skills to ensure that workflow is managed according to sample holding time, priority status, and due dates while remaining compliant with RI Analytical’s quality systems, standard operating procedures (SOPs), health & safety regulations, and company policies. As skills develop, you will assist with the training of Chemists and perform basic troubleshooting of laboratory issues.\n\nAs a Chemist I, your essential functions will be to:\n\nActively participate in daily laboratory production. This should account for approximately 90% of your work time. In time, this may include review of raw data.\nWith assistance from the Team Lead, coordinate workflow to achieve most effective production while satisfying requirements for quality, on-time performance, and holding time with minimal supervision.\nPerform basic troubleshooting of common laboratory issues.\nFollow procedures as outlined in SOPs relevant to trained assays.\nComplete an Initial Demonstration of Capability (IDC) prior to performing analytical testing on samples independently and then complete an annual Continuing Demonstration of Capability (CDC).\nAdhere to R.I. Analytical’s Chemical Hygiene Plan, Code of Ethics and other policies defined in the Quality Manual, and Employee Handbook.\nCommunicate any laboratory issues in a timely manner to the Team Lead.\nMaintain and promote clean, organized, and functional work areas.\nOther duties as assigned by the Team Lead or senior management.\n\nQualifications:\n\nEducation - At minimum, an Associates’ degree in chemistry or related science.\nA Bachelor’s degree in chemistry or related science is preferred.\n\nExperience - This is an entry level position. A minimum 1 of year’s laboratory experience is preferred.\n\nRI Analytical Laboratories, Inc. is an equal opportunity employer.\n\nJob Type: Full-time\n\nPay: $18.00 - $23.00 per hour\n\nBenefits:\n\n401(k)\n401(k) matching\nFlexible schedule\nHealth insurance\nLife insurance\nPaid time off\nReferral program\nRetirement plan\nTuition reimbursement\nVision insurance\n\nSchedule:\n\n8 hour shift\nMonday to Friday\n\nCOVID-19 considerations:\nAll persons entering the building are required to weak a mask if unvaccinated and common areas are sanitized on a regular basis.\n\nEducation:\n\nAssociate (Preferred)\n\nExperience:\n\nLaboratory Experience: 1 year (Preferred)\n\nWork Location: One location","slug":"chemist-i-second-shift-d61d6627-d3ae-433c-b022-eeedd3147d54","benefits":["Health insurance","401(k) matching","Tuition reimbursement","Paid time off","Flexible schedule"],"selectedSkills":["Laboratory experience","Bachelor's degree","Associate's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&job=mvTqaIZzLWV2zIRWFUQJkB_lVlsq3K_HpT_oJW_Kkt1ww1amWUbV6w"},{"position":"Sample Intake Specialist/Front Office Reception","labName":"PharmLabs LLC","location":"San Diego, CA","age":"4 days ago","type":"Full-time | Contract","salaryMin":"$16 ","salaryMax":" $19 an hour","jobDescriptionCopy":"PharmLabs Laboratory is a DEA and California State DCC licensed analytical testing laboratory for the cannabis and hemp industries. PharmLabs is also ISO/IEC 17025:2017 accredited.\n\nWe are looking for a Sample Intake Specialist (Power house Receptionist!) to take charge of the front end of the laboratory. We are looking for someone who has been a previous office manager with cannabis experience and lots of customer service skills.\n\nPosition Summary:\n\nTo be responsible for the intake of client test samples to Laboratory Information Management System, as well as, act as an overall receptionist and brand ambassador. Under the general direction of the Operations Manager, is responsible for providing general office services to the laboratory staff.\n\nEssential Duties and Responsibilities:\n\n1. Answer incoming calls, determine the purpose of calls and transfer calls\n\n2. Greet walk-in clients\n\n3. Provide proper information about testing to clients\n\n4. Check in all client test samples and input them accurately into LIMS\n\n5. Update social media platforms including but not limited to: Facebook, Instagram, Twitter and the PharmLabs Blog\n\n6. Assist with integration of test samples and spread-sheet creation for test samples\n\n7. Sending new client welcome emails\n\n8. Adding new client emails to the newsletter distribution list\n\n9. Create the Monthly Newsletter\n\n10. Clean floors, bathroom, dusting and empty trash\n\n11. Track office supplies needed and report to CEO\n\n12. Refill office educational information as needed\n\n13. Take and deliver messages\n\n14. Monitors visitor access to the Laboratory\n\n15. Interacts with visiting vendors\n\n16. Provides on-going support to Laboratory staff\n\n17. Receives, sorts and distributes mail; prepares outgoing mail and ensures it is mailed\n\n18. Receives and processes deliveries\n\n19. Drafts correspondence, generates reports and other documents\n\n20. Orders and maintains office supplies\n\n21. Creates and maintains forms necessary to the operation of the Laboratory\n\n22. Ensures reception area is well maintained, neat and clean\n\n23. Performs other duties as assigned\n\nWe are also looking to fill this key position immediately, so if you meet the below qualifications, submit your resume and cover letter today.\n\nJob Types: Full-time, Contract\n\nPay: $16.00 - $19.00 per hour\n\nBenefits:\n\n401(k)\nHealth insurance\nPaid time off\n\nSchedule:\n\n8 hour shift\nMonday to Friday\n\nAbility to commute/relocate:\n\nSan Diego, CA 92110: Reliably commute or planning to relocate before starting work (Preferred)\n\nExperience:\n\nCustomer service: 1 year (Preferred)\n\nWork Location: One location","slug":"sample-intake-specialistfront-office-reception-c00d7146-06c7-4ea0-b778-a125f42d3e87","benefits":["Paid time off","401(k)","Health insurance"],"selectedSkills":["Customer service"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&job=SrV1G7Z7qOuhmC2aOc5aPkt7lD6MNkGs3x3deEpLOO7oRU849kgWyw"},{"position":"Laboratory Technician (PA)","labName":"Steep Hill Pennsylvania","location":"Harrisburg, PA","age":"9 hours ago","type":"Full-time","jobDescriptionCopy":"APPLICANTS MUST currently live within a reasonable commuting distance of business location. OUT OF AREA candidates and/or those requiring a relocation will NOT be considered.\n\nPOSITION SUMMARY: This is a technical position responsible for the collection and testing of samples of various chemical compounds and biological specimens. Daily work involves the routine and repetitive use of various types of machinery, lab equipment and programs to perform tests, record data or findings and present information.\n\nESSENTIAL FUNCTIONS:\n\nPrepares and weighs product samples; performs repetitive/routine testing activities to include accessioning and pipetting\nDocuments results pertaining to strength, stability, purity, chemical content, and other characteristics\nAssembles data and other pertinent information into groups, charts, graphs, reports, and the like for others to evaluate\nHelps to set up laboratory equipment and instrumentation required for testing activities under the supervision of team analysts\nUtilizes problem-solving skills to help to determine when an apparatus may need to be recalibrated or requires servicing\nRestocks inventory supplies used in various testing activities; provides for the weekly cleaning of glassware\nRecords and verifies log entries for various pieces of equipment/apparatus including balances, incubator, refrigerator/freezer, etc.\nComplies with all established safety, health, and environmental rules and regulations designed to ensure a safe work environment\nExpected to perform other job-related duties as assigned\n\nPOSITION REQUIREMENTS:\n\nGeneral Knowledge/Abilities\n\nAbility to fluently speak and read the English language along with understanding and following both written and verbal direction\nAbility to function independently, have personal integrity, flexibility and the ability to work effectively with fellow employees\nAnalytical and numerical skills: ability to perform mathematical calculations in different units of measurement\nAbility to use concepts such as fractions, percentages, and ratios; demonstrated abilities in troubleshooting and problem-solving\nBasic knowledge of modern office practices and use of Microsoft Office Suite for Word and Excel\nExperience in driving tasks and meeting deadlines; accountable for the completion of assigned goals and objectives\nAbility to build relationships to strengthen partnerships with a focus on customer service\nAbility to perform physically demanding work such as moving and lifting equipment, standing for long periods of time, etc.\n\nEducation, Licenses/Certifications\n\nBachelor’s degree in Chemistry or a related field from an accredited college or university\nPrior experience in the Cannabis Industry and/or applicable laboratory experience may be substituted in place of degree\n\nPreferred Experience\n\n1-2 years in experience in service based/customer-facing position\n2 years academic experience in an analytical laboratory setting\n\nSUPERVISORY RESPONSIBILITIES: None\n\nJob Type: Full-time\n\nPay: From $18.00 per hour\n\nBenefits:\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\nDay shift\nHolidays\nNight shift\nWeekend availability\n\nCOVID-19 considerations:\nVaccination against COVID-19 is required for ALL employees.\n\nEducation:\n\nBachelor's (Preferred)\n\nExperience:\n\nLaboratory: 2 years (Preferred)\n\nWork Location: One location","slug":"laboratory-technician-pa-cdce137c-b04b-458d-a309-05b7508ff275","benefits":["Dental insurance","Health insurance","Paid time off","401(k)","Vision insurance"],"selectedSkills":["Analysis skills","Microsoft Excel","Laboratory experience","Microsoft Office","Microsoft Word","Bachelor's degree","US work authorization"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=gUsNHsfhDGNlzCUH7KECOf8fii7Mb1chhkGgZlpwBKcOoOBiSVp4bg"},{"position":"Sample Intake","labName":"Kaycha Labs","location":"Natick, MA","age":"7 days ago","type":"Full-time","salaryMin":"$29,000 ","salaryMax":" $40,000 a year","jobDescriptionCopy":"Company Overview:\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\n*** The shift for this position will be Monday-Friday, 10am- 6:30 pm.***\n\nEssential Duties & Responsibilities:\n\nResponsible for the processing of customer samples for laboratory testing, following sample intake standard operating procedures and chain of custody guidelines.\nLog samples into laboratory information management systems (LIMS) and METRC to track sample traceability.\nPhotograph samples following aseptic guidelines using Logitech Webcam software.\nWork collaboratively with laboratory staff and management on the prioritization of samples to meet customer needs\nAssist customers with sample submission requirements following Massachusetts state regulations.\nIdentify sample intake issues and bring issues to the attention of management for quick resolution.\nAssist in ordering supplies for the laboratory.\nAssist in the disposition of samples using LIMS and METRC following Massachusetts state regulations.\nAnswer phones, while communicating clearly and professionally.\nCustomer facing responsibilities include nurturing relationships with existing and new customers.\nMust be comfortable working in a fast paced environment.\n\nSkills, Abilities and Competencies:\n\nExcellent communication skills and ability to effectively work, problem solve, and communicate with multiple levels of the organization.\nAbility to work in a dynamic, fast-paced deadline environment .\nAbility to maintain a high degree of attention to detail and accuracy.\nStrong agility, engagement, and flexibility in an ever-changing environment.\nWorking knowledge of logging data.\nProficiency working with Laboratory Internal Management and Customer Relations Management Systems.\n\nEducation & Experience:\n\nHigh school diploma or equivalent required.\nStrong understanding of standard laboratory protocol a plus.\nKnowledge of principles, terminology, practices and techniques is a plus.\nFood science and/pr environmental experience is a plus.\nExposure to the cannabis industry is a plus.\n\nOther:\n\nMust pass Level 2 background check.\nMust be at least 21 years old.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.\n\nThe above is intended to describe the general content of and requirements for the performance of this job. It is not to be construed as an exhaustive statement of duties, responsibilities, or physical requirements. Nothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions\n\nJob Type: Full-time\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nEmployee discount\nFlexible spending account\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nReferral program\nVision insurance\n\nSchedule:\n\n8 hour shift\nMonday to Friday\n\nApplication Question(s):\n\nWhat is your desired compensation?\n\nEducation:\n\nHigh school or equivalent (Preferred)\n\nExperience:\n\nCustomer service: 1 year (Preferred)\nData entry: 1 year (Preferred)\n\nWork Location: One location","slug":"sample-intake-0a150ad6-d971-4040-add6-245e23ffe782","benefits":["Health savings account","Dental insurance","Employee discount","Health insurance","Employee assistance program"],"selectedSkills":["Customer service","Communication skills","Data entry","High school diploma or GED","21 years or older","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=dbPHL24kjVyD-gegJXMcVzKZ6_3IX7qfGYRaBWiZt2JbqSf3C-zd2Q"},{"position":"Business Development Representative","labName":"HighRes Labs, Inc.","location":"Oklahoma City, OK","age":"4 days ago","type":"Full-time","salaryMin":"$15 ","salaryMax":" $50 an hour","jobDescriptionCopy":"Job description\n\nHighRes Labs has an opening for a team player in the dynamic new industry of medical marijuana testing in Oklahoma. Position yourself as a business professional in the fast paced field of cannabis quality control by leading the sales and marketing for a successful testing laboratory in Edmond, Oklahoma.\n\nHighRes Labs is an ISO-17025 accredited testing laboratory licensed by the Oklahoma State Department of Health and Oklahoma Medical Marijuana Authority. You bring your business development interests, chemistry intrigue, and team player mentality and we will train you in the field of MMJ testing.\n\nResponsibilities:\n\nThe Business Development Representative will manage marketing initiatives, sales strategies, and business development operations. Honesty and ethics are paramount for this position. This role will be directly responsible for driving revenue through customer acquisition, sales execution and customer relationship management.\n\nRequirements:\n\nProven sales leadership experience and success selling B2B\nAbility to work independently with little oversight\nA valid driver’s license and clean driving record\nPersonal transportation to visit existing and potential customers\nExcellent verbal and interpersonal communication skills\nClean criminal history\n\nJob Duties:\n\nDevelop and establish key customer relationships with Medical Cannabis growers, processors, and dispensaries.\nTravel as necessary within Oklahoma for in-person meetings with customers and prospects to develop key relationships.\nMake recommendations for sales strategy within the Oklahoma territory in order to maximize sales productivity.\nDesign, implement and manage sales forecasting, planning, and budgeting processes to establish high levels of quality, accuracy, and process consistency.\nMaintain a CRM of the target customers in Oklahoma.\n\nAdditional Preferences:\n\n1+ years in a similar sales role within the cannabis industry.\nAssociate degree.\nExperience creating and operating a sales pipeline management system.\nRecent sales experience in Oklahoma with existing Medical Cannabis growers, processors and dispensaries will be a plus.\nDirect, no-nonsense communication style that emphasizes transparency and integrity.\n\nWhat we offer:\n\nCompensation: Salary $15/hr ~ $50/hr + commissions.\n\nCommissions ranging from 10% to 15% or more depending on the base salary, prior experience and working performance.\n\nAnd untapped opportunity to develop cannabis testing sales in Oklahoma.\n\nThe candidate will be hired on a probationary basis for three months.\n\nJob Type: Full-time\n\nPay: $15.00 - $50.00 per hour\n\nBenefits:\n\nDental insurance\nFlexible schedule\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\nDay shift\nMonday to Friday\n\nSupplemental Pay:\n\nCommission pay\n\nAbility to commute/relocate:\n\nEdmond, OK: Reliably commute or planning to relocate before starting work (Preferred)\n\nEducation:\n\nAssociate (Preferred)\n\nExperience:\n\nCustomer service: 1 year (Preferred)\n\nWork Location: One location","slug":"business-development-representative-8c5bd296-b789-422e-ba4b-6ef8913ee2da","benefits":["Dental insurance","Health insurance","Paid time off","Flexible schedule","Vision insurance"],"selectedSkills":["Customer service","Driver's License","Sales","Customer relationship management","Sales pipeline","Associate's degree","Clean driving record","US work authorization"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=XPS9Jvrkugys01h2GbK0Qfw63jhytX3HxSp3e5Q_FgcFbZTgP6VC1A"},{"position":"Lab Technician for Cannabis Testing Lab (2nd Shift) P/T 30 hours","labName":"Cannabis Testing Lab","location":"Sylmar, CA","age":"7 days ago","type":"Full-time | Part-time","salaryMin":"$17 ","salaryMax":" $19 an hour","jobDescriptionCopy":"We are a full-service cannabis testing and research lab offering state-mandated testing services to California’s cannabis distributors, cultivators, and manufacturers to ensure safety and accurate labeling of products for medical and recreational use.\n\nThe Lab Technician role is a key position responsible for sample accessioning, intake, and sample preparation to support cannabis testing. Attention to detail, reliability, and good fundamental understanding of chemistry laboratory operation are a must for this important role. This position has potential for advancement.\n\nThis is an opportunity to come into a young company and help make it great!\n\nDuties and Responsibilities:\n\nEnsure the accurate intake and verification of cannabis and cannabis product samples upon delivery to the laboratory\nPhotograph samples prior to homogenization and upload to the customer portal\nHomogenize samples prior to further sample preparation by laboratory chemists\nWeigh samples for analysis\nRecord physical measurements such as water activity, moisture content, and density\nExtract samples for testing and sample perform dilutions according to SOPs\nPrepare standard curves for lab testing\nOrganize retention samples and dispose of samples past the holding time specified in laboratory SOPs\nClean and wash glassware and other laboratory equipment\nFollow detailed procedures to ensure cleanliness and avoid cross-contamination of samples\nPerform sample digestions for heavy metal testing\nData entry\nData interpretation as needed\nWork efficiently and effectively under time constraints\nMonitor inventory of lab supplies and place orders\nFollow laboratory safety procedures\n\nQualifications:\n\nBachelor’s degree in scientific field or Associates degree and 2 years of hands-on lab experience\nMust be detail-oriented and organized\nAbility to multi-task\nMust be able to work in a standing position for several hours at a time.\nMust be able to perform pipetting and operate centrifuges, vortexes, analytical balances, and other common laboratory equipment.\nProficient in use of email, Microsoft Excel, and Word\nMust be at least 21 years old\nThis position may require work outside of normal business hours of 9am – 5:30pm. Weekends or a later or earlier shift may be required.\n\nPreferred Qualifications:\n\nExperience in a cannabis testing laboratory or cannabis industry\nKnowledge of the Bureau of Cannabis Control regulations\nExperience with HPLC, GC-MS, ICP-MS, or PCR\nUnderstanding of aseptic technique\nExperience with data entry and/or use of a LIMS\nPlease send resume and cover letter and indicate date available to start working.\n\nMedical Standards\nAll candidates must submit to a drug test.\n\nBackground Investigation\nA comprehensive background investigation will be conducted upon acceptance all job offers, which will review and verify personal history including, but not limited to financial responsibility, criminal history, drug use history, driving record, and verification of application materials (if applicable). Significant issues or omissions in the above-stated areas may be grounds for disqualification.\n\nJob Type: Full-time or Part-time\n\nSalary: $18/hour - $23/hour\n\nJob Types: Full-time, Part-time\n\nPay: $17.00 - $19.00 per hour\n\nBenefits:\n\nHealth insurance\nPaid time off\n\nSchedule:\n\nMonday to Friday\nWeekend availability\n\nApplication Question(s):\n\nWhich of these shifts are you available to work?\n\nA. Sun - Thurs 4pm - 10:30pm\nB. Mon - Fri 4pm - 10:30pm\nC. A or B\nD. I'm not available for A or B, but am available ___ hours (please specify availability)\n\nEducation:\n\nBachelor's (Preferred)\n\nShift availability:\n\nNight Shift (Required)\n\nWork Location: One location","slug":"lab-technician-for-cannabis-testing-lab-2nd-shift-pt-30-hours-188f7fea-0f4e-4d45-bcc7-80c1f71a7ca0","benefits":["Health insurance","Paid time off","Opportunities for advancement"],"selectedSkills":["Gas chromatography","Microsoft Excel","High-performance liquid chromatography","Laboratory experience","Data entry","Bachelor's degree","Associate's degree","Pass drug screening","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=aqxlfufsTnmw-U0S8b9j243eIV3uuqK6z2QxIn__nbrYy2sWnJXa-A"},{"position":"Lab Director (NJ)","labName":"Steep Hill New Jersey","location":"Township of Hamilton, NJ","age":"4 days ago","type":"Full-time","jobDescriptionCopy":"POSITION SUMMARY: This is a high-level managerial position, responsible for the overall operation and administration of the laboratory. Responsible for performing a wide array of laboratory tests, procedures, and analyses, assures compliance with all applicable regulations.\n\nESSENTIAL FUNCTIONS\n\nEnsuring compliance with all state regulatory, corporate, and customer service requirements\nEnsuring that all employees are properly trained in quality-related procedures\nResponsible for the development, modification, verification, and validation of methods\nParticipating in the establishment and ongoing improvement of quality control systems\nEnsuring the safety of all personnel by overseeing the proper use of protective equipment during all sampling and testing activities\nDeveloping and maintaining documentation to comply with record keeping requirements\nVerifying the results of analyses conducted in the laboratory\nCompiles, reviews, and send certificates of analysis to customers\nReviews, approves, and uploads test data to respective state's seed-to-sale tracking system\nDeveloping and implementing analytical techniques and methodology to increase the accuracy and efficiency of all laboratory-related matters\nEncouraging project and process designs that simplify compliance with quality requirements\nInteracting with customers to provide analytical support as needed\nAuditing and updating standard operating procedures\nConducting analytical tests, including but not limited to potency, pesticide, residual solvent, heavy metal and moisture analyses\nCoordinating with customer service team members to proactively respond to customer complaints and inquiries\nImplementing solutions to quality control problems through inspections, investigations and audits\nConsulting with clients and government regulators as needed\nConducting client site visits as needed and\nPerforming other duties as needed for the successful operation of the laboratory.\n\nPOSITION REQUIREMENTS:\n\nGeneral Knowledge/Abilities\n\nAbility to fluently speak and read the English language along with understanding and following both written and verbal direction\nAbility to function independently, have personal integrity, flexibility, and the ability to work effectively with fellow employees\nAnalytical and numerical skills: ability to perform mathematical calculations in different units of measurement\nAbility to use concepts such as fractions, percentages, and ratios demonstrated abilities in troubleshooting and problem-solving\nBasic knowledge of modern office practices and use of Microsoft Office Suite for Word and Excel\nDemonstrated practice of constructive problem-solving and the confidence to challenge and be challenged to achieve the best strategies and solutions\nExperience in driving tasks and meeting deadlines accountable for the completion of assigned goals and objectives\nAbility to build relationships to strengthen partnerships with a focus on customer service\nAbility to perform physically demanding work such as moving and lifting equipment, standing for long periods of time, etc.\n\nExperience, Education, Licenses/Certifications\n\nMaster’s degree in Chemistry or a related field from an accredited college\nProven hand-on experience as a Quality Manager or other similar position\nCustomer service or customer-facing experience and analytical laboratory experience preferred\nIndustry experience in Medical/Recreation Cannabis is a major plus\n\nSUPERVISORY RESPONSIBILITIES: Lab Manager; Scientists/Analysts\n\nJob Type: Full-time\n\nPay: From $95,000.00 per year\n\nBenefits:\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\n\nCOVID-19 considerations:\nVaccination against COVID-19 is required for ALL employees.\n\nEducation:\n\nDoctorate (Required)\n\nExperience:\n\nAnalytical Laboratory: 5 years (Preferred)\n\nWork Location: One location","slug":"lab-director-nj-dd4b1216-050b-4440-90b3-f86244d847dc","benefits":["Dental insurance","Health insurance","Paid time off","401(k)","Vision insurance"],"selectedSkills":["Analysis skills","Customer service","Microsoft Excel","Laboratory experience","Microsoft Office","Doctoral degree","Master's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=7S-J5MyXJX-BNdpSzvCD3seQsi5VyCJw_Z1lFnAHzKpHMBqoCqWLug"},{"position":"Quality Manager","labName":"Certified Testing and Data","location":"Orlando, FL","age":"8 days ago","type":"Full-time","salaryMin":"$57,000 ","salaryMax":" $77,000 a year","jobDescriptionCopy":"Description:\nDepartment: Operations\n\nPosition Title: Quality Manager\n\nReports to: VP of Operations\n\nPosition Type: Full-time, Non-exempt\n\nCompany Description\n\nCertified Testing and Data - The soon to be premier provider in the cannabis and hemp testing space. Founders have extensive experience in Cannabis as well as leading Multi Billion dollar lab companies. Opportunity to participate in the growth and success of the company with a stock grant awarded to founding team members. Prior business led by management was top 15 Fastest growing company by Inc 5000. CTND has great culture, excellent professional growth opportunities, and one of the nicest working lab spaces in the country. Submit your application today.\nCertified Testing and Data, an analytical testing facility, provides consultations and analytical results across the entire spectrum of the plant medicine industry. Building on a record of excellence, Certified Testing and Data features one of the largest full-service testing laboratories in the United States. Dedication to personalized service coupled with superior scientific practices are the foundation of Certified Testing and Data success.\n\nJob Description\n\nThe Quality Manager is responsible for the implementation of CTND’s quality program and ensuring all laboratory activities are in compliance with local & state regulations and ISO/IEC 17025 standards. This role is accountable for knowing and following all Company policies and standards, leads by example, and lives our values.\n\nResponsibilities and Duties\n\nLead the team with dynamic leadership that promotes an environment of support, development, engagement, and high productivity. This includes, but is not limited to, hiring, coaching, performance management, ensuring productivity, disciplinary action, cross-training, rewards and recognition, and succession planning.\nEnsure quality assurance/control compliance and standardization. This requires maintaining current knowledge of internal and external standards, with particular focus on State Regulatory and ISO/IEC 17025 requirements.\nCreate, manage, and facilitate the quality scorecard.\nEffectively communicate quality policies and procedures to all levels of laboratory staff.\nEstablish and maintain documentation and record controls and procedures.\nDevelop and implement quality procedures and standards to ensure production activities meet compliance standards.\nCreate and update laboratory policies and procedures associated with various assays, in partnership with the Lab Director and Quality department.\nMonitor laboratory data performance and customer complaints with tracking and establish corrective measures as needed. Prepare detailed reports, including current, trending, forecasting.\nManage internal and external audits. Investigate findings, work with the affected department(s) to develop appropriate corrective and/or preventive actions, document the findings, and perform appropriate follow-up. Evaluate the efficacy of implemented corrective/preventive methods.\nGenerate audit reports and schedule review with appropriate internal stakeholders.\nManage the proficiency testing (PT) program for the laboratory. This includes PT vendor evaluation, purchasing PT samples, scheduling PT tests, and reviewing submissions.\nMonitor relevant data for performance and trends using statistical methods.\nBuild strong internal, external, and cross-functional relationships.\nOther duties and special projects as assigned.\n\nKnowledge & Skill\n\nThis position needs an advanced knowledge of microbiology and chemistry science obtained from a Master’s degree or equivalent experience, to provide information to customers and employees as well as implement new testing procedures. A thorough knowledge of chemistry and microbiology is necessary to manage the analysis that is conducted in the laboratory. A general knowledge of personal computers is necessary to track laboratory information and produce documents to support the management function. General knowledge of the Laboratory Information Management System (LIMS) is needed to review analysis results and correct any discrepancies. Analytical skills are needed to problem solve and fulfill customer's analysis needs. Strong oral and written communication skills are essential to this position for effective customer contact. Customer relation skills are needed to obtain and provide information to the customer. Planning skills are essential to maintain efficient laboratory operations.\n\nJob Complexity\n\nThis position requires individual analysis of each problem to determine the optimal solution. Problems can occur when the customer requests a test not currently used in the laboratory or when a new product requires a modification of current methods. The incumbent uses previous experience, federal (FDA, USDA, and APHA) publications, field texts, and current journal articles as resources to provide necessary information to solve a problem. Solutions may require innovative alternatives to modify current analysis methods to improve productivity or for solving unique employee relation difficulties. Customer problems are often unique and require the incumbent to select among several different alternatives to maintain customer business. The incumbent is responsible for overall quality of operational activities of the microbiology and chemistry laboratories. This position uses previous experience, guidance from other laboratory leadership and relevant literature to obtain a solution to the problem.\n\nDecision Making or Recommendations\n\nThis position requires decisions to be made regarding laboratory needs and difficulties. Information is available from standard operating procedures, position precedents, federal and state regulations and written company procedures and policies. All of the incumbent's decision making and recommendations must be based on ethics and integrity.\n\nAccountability\n\nThe incumbent receives general direction from the Vice President of Operations (VPO). This position works toward broad long-term objectives established with the VPO. The incumbent, with the authorization of the VPO, determines intermediate sequences. Review of work occurs on a monthly basis to ensure that procedures are followed and no quality issues arise. The incumbent is responsible for maintaining quality, ethics and integrity. This position is responsible for maintaining a work environment that promotes a productive workforce and accurate results for the customer. The Quality Manager ensures that laboratory personnel have the tools and knowledge to perform assigned tasks according to the quality process. Unique or unusual problems may result in consulting the VPO or corporate personnel to suggest possible solutions.\n\nSupervision of Others & Relationships\n\nThis position supports the Lab Director in the supervision of Lab Managers and subordinates. Supervisory responsibilities include quality assessment of work and evaluating work for accuracy and completeness. Coordination with microbiology and chemistry departments is required to provide complete analysis of samples when required. This position coordinates with the corporate departments of accounting, sales, IT, research, human resources and educational services to obtain information to provide quality services to the customer. Internal coordination between the various laboratory functions is needed to achieve the most accurate and timely analysis possible.\n\nWork Environment\n\nThe incumbent works in a laboratory environment with proper lighting and temperature control. Occasional exposure to laboratory fumes, chemicals, and materials will occur when obtaining results or testing status from operations personnel. Client visits may require protective clothing and equipment according to the facility environment. Physical dexterity is necessary to effectively manipulate a keyboard. The incumbent can expect extended time spent in a sitting position. Three to seven nights a month maybe needed to travel to other laboratory locations and attend professional seminars.\n\n. Requirements:\nWorking knowledge of a broad range of plant medicine products, processes, and cultivation preferred (e.g. Cannabis, Hemp, CBD and Fungi).\nExpert knowledge of regulations (local and federal), Good Laboratory Practices, and current official methods with at least 3 years experience working in an accredited laboratory.\nExcellent oral and written communication skills. Demonstrated expertise in plant medicine safety, quality and value.\nMust have strong organizational, leadership, and customer service skills. Excellent interpersonal, communications, public speaking, and presentation skills.\nExpert knowledge of root cause analysis, corrective and preventive action reporting.\nAbility to generate respect and trust from staff and external constituencies.\nBS/BA degree required, MS/MA degree preferred.\nMust be at least 21 years of age and pass required background check\n\nPhysical Requirements\n\nThese physical demands are representative of the physical requirements necessary for an employee to successfully perform the essential functions of the job. Reasonable accommodation can be made to enable people with disabilities to perform the described essential functions. While performing the responsibilities of the job, the employee is required to communicate with coworkers and managers by conversing and exchanging information regarding laboratory functions throughout 50% of the work day. The employee is required to stand 50% of most work days, sit 50% of most work days, and use their hands and fingers to record data on laboratory worksheets, enter data into spreadsheet workbooks, enter data into the LIMS system, and perform chemical analyses. The employee is occasionally required to lift up to 50lbs and pull up to 150lbs while performing laboratory duties such storing or retrieving chemicals. The employee must be able to reach. Vision abilities required by this job include close vision to record data on laboratory worksheets, enter data into spreadsheet workbooks, enter data into the LIMS system, and perform chemical analyses. The employee must be able to move about in the laboratory regularly throughout the work day. The employee must be able to occasionally work in extreme cold (below 32 degrees F) temperatures when retrieving samples, cleaning out retained samples and reorganizing stored samples. The employee must be able to tolerate moderate amounts of noise from laboratory equipment. The employee must be able to regularly tolerate very strong chemical odors. Provided with proper protective equipment, the employee must work with chemical hazards","slug":"quality-manager-9d431006-25b3-4431-b7c6-3a5e7560ca86","benefits":[],"selectedSkills":["Analysis skills","Customer service","GLP","Laboratory information management systems","Succession planning","Bachelor of Science","Bachelor's degree","Master's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=mNXO7Pp4S6vERCYOIRStmlPuATvzy2ugWHfPNJQuHT9ZZMuniYcJ_A"},{"position":"Extraction Technician-2nd shift","labName":"Trulieve/Harvest Health and Recreation","location":"Holyoke, MA","age":"8 days ago","type":"Full-time","jobDescriptionCopy":"Job Title: Extraction Technician\n\nDepartment: Processing\n\nReports to: Oil Supervisor or Team Lead\n\nFLSA Status: Regular-Non-Exempt\n\nShift: 2pm-10:30pm Mon-Fri\n\nRole Summary:\n\nTrulieve is looking for an Extraction Technician to support our extraction and production operations. You should be very technically astute in mechanical, electrical, and computer operated systems utilized in production/manufacturing environments. You need to be proactive, quick thinking and innovative in your approach.\n\nKey Duties and Responsibilities:\n\nPreparation of equipment and plant materials for extraction\nExecution of extraction and processing in accordance with state and local standards\nOperation of sophisticated extraction equipment\nEnsure consistency and efficiency of product through quality control testing and procedures\nCleaning and maintenance of extraction equipment and manufacturing facility\nMaintaining strict inventory records of all plant materials, chemicals, and equipment used in the facility\nOversee day-to-day operations of the entire extraction space beginning with storing the raw cannabis through the extraction process and all the way to fulfillment of orders\nOperating, maintaining, and making adjustments and repairs to extraction equipment\nStoring supplies and equipment and disposal of waste according to guidelines\nComplete the cleaning and sanitization of all production equipment, work surfaces, and tools\nMaintaining inventory records of supplies, materials, and equipment and preparing requisitions as needed\nMaintaining material safety data sheets for all chemicals and products\nFollowing all standard operating procedures regarding product creation and lab safety\nAssist in packaging and labeling of finished products\nWorks with testing laboratory as defined by state guidelines\nAll other duties as assigned\n\nRequirements\n\nSKILLS AND QUALIFICATIONS:\n\nBachelor’s or Associate degree or its equivalent, from a recognized college or university, with a major in chemistry or biology preferred\nUnderstanding of state and local laws\nUnderstanding of proper and safe handling of hazardous materials\nFamiliarity with separations, isolations and fractionation\nKnowledge of solvent and non-solvent extraction methods\nStay current of practices and new developments in the cannabis extraction industry\nAbility to work quickly without compromising accuracy\nAbility to discern the quality of plant material and finished products\nStrong computer and social skills\n\nPHYSICAL REQUIREMENTS:\n\nMust be able to push, pull, move, and/or lift a minimum of 25lbs to a minimum height of 5 feet and able to push, pull, move, and/or carry such weight a minimum distance of 50 feet, with or without mechanical assistance\nMust be able to work seated/standing as appropriate at workstations for extended periods of time, maintain body equilibrium while climbing ladders, stairways, stopping, kneeling, crouching, and reaching, and use hands/fingers to hold, grasp, turn, pick, pinch frequently/constantly to complete tasks\nMust be able to handle organic matter daily, able to wear PPE as appropriate (eye, face, hand, arm, head, foot, body, fall protection), and able to be exposed to hot, cold, wet, humid, or windy conditions while wearing PPE (95 degrees or greater)\nMust have visual acuity with/without job aids to perform activities such as; reading, viewing a computer terminal, visual inspection involving small parts/details. Clarity of vision at 20 ft or more in day and night/dark conditions\nMust be able to speak and communicate verbally at conversation levels with co-workers, vendors, etc. (Moderate noise)\n\nWORK SCHEDULE:\n\n40+ hours weekly with flexible hours depending on department needs. Must be available to work occasional evenings, weekends, and holidays\n\nEqual Opportunity Employer l Trulieve Supports a Drug Free Workplace\n\nJob Type: Full-time\n\nPay: From $17.50 per hour\n\nBenefits:\n\nDental insurance\nHealth insurance\nVision insurance\n\nSchedule:\n\nMonday to Friday\n\nApplication Question(s):\n\nAre you available to work Mon-Fri, 2:00-10:30 pm?\n\nExperience:\n\ncannabis industry: 1 year (Preferred)\nextraction: 1 year (Preferred)\n\nWork Location: One location","slug":"extraction-technician2nd-shift-e41494b7-6f01-477f-af63-4152bbdf309e","benefits":["Dental insurance","Flexible schedule","Health insurance","Vision insurance"],"selectedSkills":["Computer skills","Bachelor's degree","Associate's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=baUtPOK19P2ddGKCFJ9DOu2ozJ7XsM8cdIlqq8Du6bIbhhSBmg0zNQ"},{"position":"Laboratory Technician (NJ)","labName":"Steep Hill New Jersey","location":"Trenton, NJ","age":"1 day ago","type":"Full-time","jobDescriptionCopy":"APPLICANTS MUST currently live within a reasonable commute of business location. OUT OF AREA candidates and/or those requiring a relocation will NOT be considered.\n\nPOSITION SUMMARY: This is a technical position responsible for the collection and testing of samples of various chemical compounds and biological specimens. Daily work involves the routine and repetitive use of various types of machinery, lab equipment and programs to perform tests, record data or findings and present information.\n\nESSENTIAL FUNCTIONS:\n\nPrepares and weighs product samples; performs repetitive/routine testing activities to include accessioning and pipetting\nDocuments results pertaining to strength, stability, purity, chemical content, and other characteristics\nAssembles data and other pertinent information into groups, charts, graphs, reports, and the like for others to evaluate\nHelps to set up laboratory equipment and instrumentation required for testing activities under the supervision of team analysts\nUtilizes problem-solving skills to help to determine when an apparatus may need to be recalibrated or requires servicing\nRestocks inventory supplies used in various testing activities; provides for the weekly cleaning of glassware\nRecords and verifies log entries for various pieces of equipment/apparatus including balances, incubator, refrigerator/freezer, etc.\nComplies with all established safety, health, and environmental rules and regulations designed to ensure a safe work environment\nExpected to perform other job-related duties as assigned\n\nPOSITION REQUIREMENTS:\n\nGeneral Knowledge/Abilities\n\nAbility to fluently speak and read the English language along with understanding and following both written and verbal direction\nAbility to function independently, have personal integrity, flexibility and the ability to work effectively with fellow employees\nAnalytical and numerical skills: ability to perform mathematical calculations in different units of measurement\nAbility to use concepts such as fractions, percentages, and ratios; demonstrated abilities in troubleshooting and problem-solving\nBasic knowledge of modern office practices and use of Microsoft Office Suite for Word and Excel\nExperience in driving tasks and meeting deadlines; accountable for the completion of assigned goals and objectives\nAbility to build relationships to strengthen partnerships with a focus on customer service\nAbility to perform physically demanding work such as moving and lifting equipment, standing for long periods of time, etc.\n\nEducation, Licenses/Certifications\n\nBachelor’s degree in Chemistry or a related field from an accredited college or university\nPrior experience in the Cannabis Industry and/or applicable laboratory experience may be substituted in place of degree\n\nPreferred Experience\n\n1-2 years in experience in service based/customer-facing position\n2 years academic experience in an analytical laboratory setting\n\nSUPERVISORY RESPONSIBILITIES: None\n\nJob Type: Full-time\n\nPay: From $18.00 per hour\n\nBenefits:\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\nDay shift\nHolidays\nNight shift\nWeekend availability\n\nCOVID-19 considerations:\nVaccination against COVID-19 is required for ALL employees.\n\nEducation:\n\nBachelor's (Preferred)\n\nExperience:\n\nLaboratory Experience: 2 years (Preferred)\n\nWork Location: One location","slug":"laboratory-technician-nj-c1290c86-ace0-4e29-b7ca-d9e77d756f06","benefits":["Dental insurance","Health insurance","Paid time off","401(k)","Vision insurance"],"selectedSkills":["Analysis skills","Microsoft Excel","Laboratory experience","Microsoft Office","Microsoft Word","Bachelor's degree","US work authorization"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=Vx2CAeWQEeq6fRgwJcMI6D9NN5O1twaszqkLckSGbjZBaJiDemyUtw"},{"position":"Production Supervisor","labName":"Green Thumb","location":"Holyoke, MA","age":"1 day ago","salaryMin":"$69,000 ","salaryMax":" $93,000 a year","jobDescriptionCopy":"The Role\n\nProvide effective leadership to employees to ensure a complete understanding of, and alignment to the Company's vision, mission, and values to maintain a positive work environment and a high level of morale.\n\nResponsible for managing the daily activities of Marijuana infused products production (MIPS) within production laboratory facilities and operations.\nBe an effective leader who understands modern (21st century) business practices applicable to the global marketplace.\nPossess a thorough and honest understanding of the cannabis moment, including passion for cannabis science, and application of same.\nPractice authentic and excellent interpersonal skills, with an unrehearsed ability to understand and manage human affairs.\nPositively respond to the team's questions, concerns and suggestions and takes immediate action as necessary to effectively resolve conflicts.\nDeliberately and consciously practice professionalism, and righteous transformational initiatives.\nHave a thirst for continuous learning.\nVersed in planning, organizing, assigning, and coordinating the activities and resources of the department.\nRobust understanding and application of basic scientific principles as well as production laboratory operations.\nAbility to follow written instruction and maintain a laboratory notebook as well as production records and production logs.\nDevelops, maintains, and implements standard operating procedures for all MIPS and techniques developed.\nMust follow all applicable policies, procedures, and guidelines. This includes the safe and proper operation of any/all relevant machinery, instrumentation, and equipment.\nSets up, operates, and maintains production laboratory equipment, monitors experiments, makes observations, calculates mathematically and records results.\nKnowledge of manufacturing analytical testing, (which includes but is not limited to, HPLC, GC, ICP MS, UV/VIS, IR, Moisture Analysis, Particle Size Analysis, Microbial Testing); and monitors product disposition against these test results to support quality of infused products synthesized.\nDevelops and implements research and development procedures, programs, and techniques to meet organizational needs and to capitalize on potential new products.\nWorks collaboratively with product development towards innovative formulations that meet both patient and company guidelines for effectiveness, cost, and stability; must be able to take formulations from lab scale to full production.\nAbility to adapt to and implement new methods and techniques for operational and product improvement, technical development, and new product development.\nManage inventory and ensure the seed-to-sale system is properly maintained.\nMaintain clean and sanitary laboratories and work environments including but not limited to all equipment, work-stations, document controls and common areas.\nResponsible for preventative maintenance and keeping all equipment operational.\nAssist with compliance, including the creation of batch production records, and product labels specific to the state of Massachusetts, and in accordance with company standards.\nStay current on scientific and associated, literature and legislation in the cannabis industry, following cannabis research, industry trends and education.\nPartner collaboratively with other department managers including but not limited to, extraction, refinement, processing, packaging, facilities, security, cultivation, quality and compliance.\nPartner with management to develop, document, and keep current Standard Operating Procedures for production sequences and formulations.\nOther duties as assigned.\n\nEDUCATION & EXPERIENCE\n\nBachelor's Degree in Chemistry, Formulation Chemistry, Biochemistry, Manufacturing, Food Science, Engineering, and/or similar scientific field; and/or at least 2 years' experience in cannabis manufacturing or 5+ years managing professional laboratory environment.\nDemonstrated strategic experience in overseeing all aspects of professional production laboratory environments including managing a production team with diversity, equipment handling, production operations, processing, implementation, coordinating supplies, and maintaining equipment.\nMust be 21 years of age at time of hire.\nValid State driver's license or State ID card.\nA minimum of 3 years supervisory and/or managerial experience leading a large diverse team of professionals.\nKnowledge and experience related to producing CPG or medical marijuana products this includes but is not limited to: creating consumables, extraction techniques and routes of administration.\nWork history showing progressive responsibility, willingness to accept additional projects or challenges, 21st century industrial competences, and wisdom.\nAbility to maintain confidentiality; reliability, trustworthiness and honesty.\nAbility to remain calm in potential periods of high stress or unusual activity.\nProficiency in mathematics is an absolute requirement for all operations.\nProficient knowledge of the chemistry related to all manufacturing operations.\nDemonstrated ability to achieve manufacturing objectives in terms of volume, product mix, cost, and quality.\nExtensive knowledge in environment, health and safety standards in manufacturing operations required.\nExtensive knowledge of extraction and chemical processing techniques.\nAbility to listen well and communicate effectively, orally and in writing with various audiences.\nKnowledge and ability to use standard production laboratory equipment; filling equipment, vacuum ovens, hot plates, etc.\nDemonstrated experience in organizational development, personnel management, budget and resource development, and strategic planning.\nProficiency with Microsoft Office Suite, Word, and Excel with a strong attention to detail.\nMust be and remain compliant with all legal or company regulations for working in the cannabis industry\n\nPHYSICAL REQUIREMENTS\n\nFrequent sitting and walking\nOccasionally Twist/bend/stoop/squat, kneel/crawl\nAbility to communicate orally with management and other co-workers is crucial. Regular use of the telephone and e-mail for communication may be required. Sitting or standing for extended periods is common. Hearing and vision within normal ranges is essential for normal conversations, to receive ordinary information and to prepare or inspect documents.\nSome heavy lifting may be required. Exertion of up to 50 lbs. of force occasionally may be required.\nGood manual dexterity for the use of office equipment and manual tools.","slug":"production-supervisor-a2145067-e8df-4274-ba34-8940c0077f95","benefits":[],"selectedSkills":["Writing skills","Manufacturing","Microsoft Excel","Driver's License","Heavy lifting","Bachelor's degree","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=ktuRcytxq8VEjZBCPCHFVZlUuoldJY_xqmnCbZxOdLqyJWXhXFyhfw"},{"position":"Hiring Event: Extraction Specialist ***Cannabis Facility","labName":"AltMed Florida","location":"Apollo Beach, FL","age":"7 hours ago","type":"Full-time","salaryMin":"$14 an hour","jobDescriptionCopy":"MÜV/Verano, the fastest-growing cannabis company in Florida is hiring Extraction Specialists for our facility in Apollo Beach, FL. The payrate for this position is $14 per hour. Below are the details for the Extraction Specialist position as well as the Hiring Event.\n\nJob Summary\n\nPerforms and supports the extraction operations of a cultivation and manufacturing facility by adhering to the operation, technical, and quality control policies and guidelines. Maintains excellent personal hygiene, workspace cleanliness, documentation practices and quality control measures to ensure a high-quality product in accordance with the Department of Health Office of Compassionate Use regulations and standards set by the Company policies. Duties/Responsibilities/Tasks\n\nPrepare equipment and raw material for extraction while adhering to timeline protocols.\nExecute extractions as well as post-processes in accordance with state and local standards.\nOperate extraction equipment such as rotary evaporators, reactors, filtration equipment, etc.\nEnsure the consistency and efficiency of product through quality control testing and procedures.\nClean and maintain extraction equipment and manufacturing facility.\nMaintain strict inventory records of all raw materials, chemicals, and equipment used.\nDisposal of lab waste in accordance with established guidelines.\nComplete the cleaning and sanitization of all production equipment, work surfaces, and tools.\nMaintain material safety data sheets for all chemicals and products.\nFollow laboratory safety protocols.\n\nJob Requirements\n\nAssociate or Bachelor’s degree in a Science discipline preferred.\nAdditional education or experience working in a laboratory setting also preferred.\nUnderstanding of state and local laws.\nUnderstanding of proper and safe handling of hazardous materials.\nFamiliarity with extractions, separations, isolations, and fractionation.\nStrong computer skills.\nAbility to lift up to 50 lbs.\nAbility to manage time and balance multiple tasks simultaneously\nAbility to work well in a small team\n\nAdditional Requirements:\n\nMust be at least 21 years of age.\nMust be able to successfully register with the state’s cannabis commission as an agent\n\nPhysical and Mental Demands:\n\nWhile performing the duties of this job, the employee is frequently required to remain in a stationary position, move and/or position oneself, communicate, operate and/or prepare, place, position objects, tools, or controls. The employee must occasionally move packages weighing up to 50 lb. Specific vision abilities required by this job include close observation and the ability to adjust focus. The mental and physical requirements described here are representative of those that must be met by an individual, with or without reasonable accommodation, to successfully perform the essential functions of this position.\n\nWorking Environment:\n\nWork is performed in a warehouse environment. The employee is occasionally exposed to moving mechanical parts and risk of electrical shock. The noise level in the work environment is usually moderate. The work environment characteristics described here are representative of those an individual encounters while performing the essential functions of this position.\n\nEEO Statement:\n\nWe are proud to be an equal opportunity employer. We place priority in an environment of inclusion, diversity and social justice and are committed to securing a better, brighter way forward for our employees, our markets and our communities.\n\nHiring Event:\n\nSaturday, April 30, 2022 10am-4pm\n6938 US 41 Apollo Beach, Fl 33572 (1st Building)\nYou must bring a copy of your resume and RSVP by applying to this job posting\nWe are located just south of the Big Bend/US 41 intersection, in front of ACM Distribution. Look for the \"NOW HIRING\" sign.\n\nJob Type: Full-time\n\nPay: $14.00 per hour\n\nBenefits:\n\n401(k)\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n10 hour shift\n8 hour shift\nWeekend availability\n\nWork Location: One location","slug":"hiring-event-extraction-specialist-cannabis-facility-0ad98dc0-dd4c-4517-8517-603b68966774","benefits":["Dental insurance","Health insurance","Paid time off","401(k)","Vision insurance"],"selectedSkills":["Computer skills","Laboratory experience","Bachelor's degree","Associate's degree","21 years or older","US work authorization"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=1eoKsuYm-ibJ_B6Xg3tjUtCH3cvwtupoAAnFGEVy8ReVdP8fNn45gw"},{"position":"Extraction Technician-2nd shift","labName":"Trulieve, INC","location":"Holyoke, MA","age":"8 days ago","type":"Full-time","salaryMin":"$32,000 ","salaryMax":" $41,000 a year","jobDescriptionCopy":"Job Title: Extraction Technician-Ethanol\n\nDepartment: Processing\n\nReports to: Oil Supervisor or Team Lead\n\nFLSA Status: Regular-Non-Exempt\n\nRole Summary:\nTrulieve is looking for an Extraction Technician to support our extraction and production operations. You should be very technically astute in mechanical, electrical, and computer operated systems utilized in production/manufacturing environments. You need to be proactive, quick thinking and innovative in your approach.\n\nKey Duties and Responsibilities:\nPreparation of equipment and plant materials for extraction\nExecution of extraction and processing in accordance with state and local standards\nOperation of sophisticated extraction equipment\nEnsure consistency and efficiency of product through quality control testing and procedures\nCleaning and maintenance of extraction equipment and manufacturing facility\nMaintaining strict inventory records of all plant materials, chemicals, and equipment used in the facility\nOversee day-to-day operations of the entire extraction space beginning with storing the raw cannabis through the extraction process and all the way to fulfillment of orders\nOperating, maintaining, and making adjustments and repairs to extraction equipment\nStoring supplies and equipment and disposal of waste according to guidelines\nComplete the cleaning and sanitization of all production equipment, work surfaces, and tools\nMaintaining inventory records of supplies, materials, and equipment and preparing requisitions as needed\nMaintaining material safety data sheets for all chemicals and products\nFollowing all standard operating procedures regarding product creation and lab safety\nAssist in packaging and labeling of finished products\nWorks with testing laboratory as defined by state guidelines\nAll other duties as assigned","slug":"extraction-technician2nd-shift-1180f79f-871e-4760-91e1-e9665d141be5","benefits":[],"selectedSkills":[],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=by5GcIzUk_dQqX_koH3-rdkei1Zl0DcvO2MN7ebarQ2uiUJBTFfinA"},{"position":"Lab Analyst (NJ)","labName":"Green Analytics, LLC","location":"Township of Hamilton, NJ","age":"4 days ago","type":"Full-time","jobDescriptionCopy":"POSITION SUMMARY: This is an analytical position responsible for advanced laboratory support functions to include calibration, standard preparation, instrument tuning, instrument and equipment maintenance, and analysis of data used for laboratory quality control. Daily work involves the use of various types of machinery, lab equipment and complex computer programs to perform tests, record data or findings and present information.\n\nESSENTIAL DUTIES:\n\nWorks with Department Head to ensure lab efficiencies for prioritization, workflow, and sample preparation, as well as the loading and running of instruments\nIdentifies opportunities for improvement; works with Department Head to implement new and improved methods and processes\nAssists with the upkeep and improvement of the quality management system to include Standard Operating Procedures (SOP’s) and the employee training programs\nPrepares calibrations and verifies quality controls for laboratory instruments and methods; uses data to recognize and/or correct possible processing or instrument errors\nAcquires and analyzes data used to perform and report analytical laboratory testing of cannabis products\nAssists with the validation of test methods and with Research and Development (R&D) related activities\nImports data into LIMS and Seed-to-Sale systems; provides for the documentation and tracking of Continuing Calibration Verification (CCV) Standards for Quality Assurance\nPrepares reports related to cannabinoid potency, terpene potency, residual solvents, heavy metals, pesticides, microbiologic organisms, water activity and mycotoxins\nSubmits data reports and Certificates of Analysis for Department Head approval\nProvides guidance and support for all duties commonly assigned to Field Samplers and Lab Technicians\nMay also be called upon to perform the same or similar duties at other laboratory facilities, and for other job-related duties as assigned\n\nPOSITION REQUIREMENTS:\n\nGeneral Knowledge/Abilities\n\nAbility to fluently speak and read the English language along with understanding and following both written and verbal direction\nAbility to function independently, have personal integrity, flexibility and the ability to work effectively with fellow employees\nAnalytical and numerical skills: ability to perform mathematical calculations in different units of measurement\nAbility to use concepts such as fractions, percentages, and ratios; demonstrated abilities in troubleshooting and problem-solving\nBasic knowledge of modern office practices and use of Microsoft Office Suite for Word and Excel\nExperience in driving tasks and meeting deadlines; accountable for the completion of assigned goals and objectives\nAbility to build relationships to strengthen partnerships with a focus on customer service\nAbility to perform physically demanding work such as moving and lifting equipment, standing for long periods of time, etc.\n\nEducation, Licenses/Certifications\n\nBachelor’s degree in Chemistry or a related field from an accredited college or university\n\nPreferred Experience\n\n3 plus years in experience in service based/customer-facing position\n2 plus years non-academic experience in a real-world analytical laboratory\nRelevant industry related experience in Medical Cannabis is a plus\n\nSUPERVISORY RESPONSIBILITIES: None\n\nJob Type: Full-time\n\nPay: From $25.00 per hour\n\nBenefits:\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\nWeekend availability\n\nCOVID-19 considerations:\nVaccination against COVID-19 is required for ALL employees.\n\nEducation:\n\nBachelor's (Required)\n\nExperience:\n\nLaboratory Experience: 5 years (Preferred)\n\nWork Location: One location","slug":"lab-analyst-nj-d579f4fa-3b47-4687-9756-c2dcc8be693d","benefits":["Dental insurance","Health insurance","Paid time off","401(k)","Vision insurance"],"selectedSkills":["Analysis skills","Microsoft Excel","Laboratory experience","Microsoft Office","Microsoft Word","Bachelor's degree","US work authorization"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=RbDDEfRkiOsz3Y6MaCujcktdA6lPFQ5_TpXMH_uqSldDMHyZg5C2TA"},{"position":"Production Development Scientist","labName":"Panacea Life Sciences, Inc.","location":"Golden, CO","age":"8 hours ago","type":"Full-time","salaryMin":"$45,000 ","salaryMax":" $65,000 a year","jobDescriptionCopy":"PRODUCT DEVELOPMENT SCIENTIST\n\nEXEMPT\n\nFULL-TIME\n\nCompensation Range: $45,000 – $65,000 DOE\n\nReports to: Operations Manager\n\nJOB DESCRIPTION\n\nSummary/Objective\nPanacea is committed to delivering safe, high-quality products and services at scale. Our business vision is to become the lowest cost, highest quality cannabinoid producer in the markets we serve by utilizing current good manufacturing practices, offering better quality assurance with cannabinoid products that are accurately formulated and free from contaminants, providing better patient and doctor access to cannabinoid education and sourcing better equipment or devices.\n\nThe Product Development Scientist position is involved in all aspects of product development and improvement which are (but not limited to) internal testing to assure the quality of Panacea products and intermediates, evaluating competitive products, assist in New Product Development by evaluating new and existing formulations, participate in the Quality Release functions, develop and support GMP processes to support the achievement of the site’s business goals and objectives. This position requires advanced knowledge in the area of consumer product manufacturing, quality assurance and process development.\n\nEssential Functions.\n\nThe Product Development Scientist is responsible for all functions within the Research and Development department, including but not limited to:\n\nCreate and/or enhance products in the Cannabinoid industry to allow PLS to remain competitive long term.\nCreate concept ideas, submit product proposals and designs for evaluation by the project team and management.\nSupport Sales and Marketing departments with research to ensure that ideas and potential products are viable and competitive.\nCollaborate with Quality, Production and external partners for compliance and practicability.\nSupport manufacturing and design activities by developing samples, procedures, and formulation documentation for products in development.\nDetermining product requirements according to several various factors and uses in close cooperation with the Quality and Supply Chain departments as well external partners when necessary.\nProvides administrative reports to management in the areas of new product development and extraction.\nAssists with extraction and production departments as required.\n\nREQUIRED QUALIFICATIONS:  \n\nBachelor's degree in Chemistry, Biochemistry, Biology, or related science/engineering field.\nExperience working with routine laboratory equipment including but not limited to; analytical balances, pipettes, fume hoods, heated stir plates, high sheer equipment, etc.\nConsistently demonstrates good laboratory practices and techniques.\nAbility to work with multiple teams as well as manage workloads independently.\nDemonstrated safe working practices including habitual usage of PPE.\nExcellent written/verbal communication skills with the ability to communicate effectively with multiple levels within the organization.\nExcellent note taking and organizational skills.\nHighly proficient with Microsoft Office products (specifically, Excel).\nStrong critical thinking and problem-solving skills.\n\nPREFERRED QUALIFICATIONS:\n\nOne (1) to (3) years of relevant experience in Product Development/Research & Development in the food, nutraceutical, pharmaceutical, or cannabis/hemp industries.\nFamiliarity with analytical methods used in manufacture of CBD (and related).\nExperience working with analytical chemical methods utilizing High Performance Liquid Chromatography (HPLC).\nGMP-run and/or ISO accredited business experience.\nProven track record of providing accurate, reproducible results in a timely manner in a demanding environment.\nExperience with online project management platforms (Monday.com, Asana, etc.)\n\nCompetencies\n\nProduct Development\nProduct Formulation\nResearch and Development\nProblem Solving/Analysis\nAnalytical Chemistry\nProactive and Initiative\nCommunication Proficiency\nProactive and Intuitive\nPrioritization skills\nEthical Conduct\nResults Driven\nSoftware/Computer Proficiency\nWillingness to Learn\nRoutine sample preparation and analysis\n\nSupervisory Responsibility\nThis position does not require supervisory responsibility at this time.\n\nWork Environment/Physical Demands\nWork is regularly performed in a combination of office and shop environments and is regularly exposed to dust, odors, oil, fumes and noise. The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. While performing the duties of this job, the employee is regularly required to talk or hear. The employee is frequently required to stand; walk; use hands to finger, handle or feel; and reach with hands and arms. The employee is occasionally required to lift or move 25-50lbs; assistance, accommodations and tools are available for lifting work functions.\n\nPosition Type/Expected Hours of Work\nThis is a Regular Full-time position. Standard days and hours of work are Monday through Friday within the 7:00 AM to 5:00 PM window. However, the position may require additional hours to complete the assigned work in a timely manner.\n\nTravel\nAll work is required onsite at Golden facility. Some travel may be required from time to time for business purposes.\n\nOther Duties\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.\n\nJob Type: Full-time\n\nPay: $45,000.00 - $65,000.00 per year\n\nBenefits:\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\nMonday to Friday\n\nExperience:\n\nProduction & Assembly Occupations: 1 year (Preferred)\n\nWork Location: One location","slug":"production-development-scientist-3a412b34-68d9-42d3-8e01-5194d199b804","benefits":["Dental insurance","Health insurance","401(k)","Paid time off","Vision insurance"],"selectedSkills":["Microsoft Excel","Assembly","High-performance liquid chromatography","Product development","Laboratory experience","Bachelor's degree","US work authorization"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=kHFlE9VpwXp96ZHcDygAVkwmsyuITLsxiP1LWOXcqudBgCJVRw-nvA"},{"position":"Extraction Technician","labName":"Columbia Care","location":"Arcadia, FL","age":"7 days ago","jobDescriptionCopy":"Reports to: Facility Manager / Production Supervisor / Laboratory Supervisor\n\nPosition Overview:\nThe Extraction Technician is responsible for the facility’s overall extraction process and day-today production following established protocol and regulations. The Extraction Technician will lead the extraction lab team through the activities required to manufacture, store, maintain equipment and materials necessary to run a world-class extraction lab.\n\nAbout Columbia Care\n\nColumbia Care is one of the largest and most experienced cultivators, manufacturers and providers of cannabis products and related services, with licenses in 18 U.S. jurisdictions and the EU. Columbia Care operates 130 facilities including 99 dispensaries and 31 cultivation and manufacturing facilities, including those under development. Columbia Care is one of the original providers of medical cannabis in the U.S. and now delivers industry-leading products and services to both the medical and adult-use markets. In 2021, the company launched Cannabist, its new retail brand, creating a national dispensary network that leverages proprietary technology platforms. The company offers products spanning flower, edibles, oils, and tablets, and manufactures popular brands including Seed & Strain, Triple Seven, gLeaf, Classix, Plant Sugar, Press, Amber and Platinum Label CBD. For more information on Columbia Care, please visit www.col-care.com.\n\nMajor Areas of Responsibility include:\nFollows policies & procedures for the daily operations and fully complies with state medical marijuana regulations.\nMaintains testing and formulating operations by initiating, coordinating and enforcing operational policies and procedures.\nPerforms QA/QC through analytical testing for quality, consistency and efficacy.\nWorks closely with production team on all elements of the testing and formulating process.\nMasters various techniques for marijuana extraction and infusion, including butane extraction.\nDevelops expertise in testing and formulating methods as well as the purification, separation and isolation of various compounds of cannabis.\nResponsible for inventory, recordkeeping and quality of product at all times, maintaining inventory via seed to sale tracking.\n\nMinimum Qualifications (Skills, Knowledge & Abilities):\nAll applicants must be at least 21 years of age.\nBachelor’s degree preferably in chemistry or similar field.\n1-4 years of experience in related position with an emphasis in an operations production/manufacturing environment.\nExperience must include hands-on responsibility for the full scope production activities, both operations and analysis.\nExperience with analytical testing required and HPLC- specific experience preferred.\nExperience in various cannabis testing or formulation methods preferred.\n\nTravel %: 0-10\n\nFLSA status: Non-exempt\n\nAdditional Abilities Required:\nThe job requires physical activity, including prolonged standing, repetitive bending, climbing, and lifting or moving up to 10 pounds (or more with a coworker). Good visual acuity, hand-eye coordination, manual dexterity, and ability to perform repetitive motions with accuracy is required. The noise level in the work environment is usually moderate.\nNote: Nothing in this job description restricts the company’s right to assign or reassign duties and responsibilities to this position at any time. Reasonable accommodations may be made in appropriate circumstances to enable individuals to perform the essential functions of the position.","slug":"extraction-technician-974321c3-bc5d-4ed3-ba39-afec3ba4cbf4","benefits":[],"selectedSkills":["Manufacturing","High-performance liquid chromatography","Bachelor's degree","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=y1DH5acSz9zO7i-bRmlqOEsu05_O7x4tYmpjy4w9hViaZEkbbMZggA"},{"position":"Lab Technician","labName":"Curaleaf","location":"Webster, MA","age":"1 day ago","salaryMin":"$35,000 ","salaryMax":" $49,000 a year","jobDescriptionCopy":"Curaleaf Holdings, Inc. (CSE: CURA) (OTCQX: CURLF) (\"Curaleaf\") is a leading international provider of consumer products in cannabis, with a mission to improve lives by providing clarity around cannabis and confidence around consumption. As a high-growth cannabis company known for quality, expertise, and reliability, the company and its brands, including Curaleaf and Select provide industry-leading service, product selection, and accessibility across the medical and adult-use markets. In the United States, Curaleaf currently operates in 23 states with 123 dispensaries, 25 cultivation sites, and over 30 processing sites, and employs over 5,000 team members. Curaleaf International is the leading vertically integrated cannabis company in Europe with a unique supply and distribution network throughout the European market, bringing together pioneering science and research with cutting-edge cultivation, extraction, and production. Home | Curaleaf | Cannabis with Confidence\n\nOur corporate social responsibility is Rooted In Good Diversity, Equity, Inclusion + Social Equity + Sustainability Social Responsibility | Curaleaf | Cannabis with Confidence We believe in taking corporate and social responsibility very seriously, from our educational outreach to national partnerships, state-wide initiatives and local causes. Giving back to the communities where we operate is important to us, and helps to change old attitudes by showing the positive impact of cannabis in creating jobs, changing lives, and helping local communities.\n\nWe educate. We advocate. We give.\n\nWe are looking for a Laboratory Technician to join our growing team! The Laboratory Technician will work within the Processing Laboratory Department and report to the Lab Manager. The Laboratory Technician will assist the Lab Manager by carrying out day-to-day tasks. This task includes but are not limited to: Prepping chemicals, preventative maintenance, Calibration, Tracking, Documenting, Packaging, Labeling, and Cleaning, in accordance with the state of Massachusetts and standards set by Curaleaf. It is expected that you will learn and be able to perform all tasks within the laboratory area.\n\nPrimary Duties and Responsibilities:\nKeeping their workspace clean (cleaning glassware, wiping down their work station, mopping, etc.)\nTracking data through paperwork and on an iPad using our electronic batch record system\nUsing our internal tracking systems BioTrack and METRC\nResponsible for increasing operational efficiency and reducing waste through ownership, teamwork, communication and collaboration.\nPerform in-process and post-process quality assurance testing and conducting visual inspections to ensure all product meets or exceed CL's specifications and patient's expectations.\nEnsures 100% compliance involving proper weighing, data recording, product tracking and security throughout all processes.\nConsistently operates in an efficient manner that also complies with all OSHA regulations, CSATC SOP's, CL SOP's, and all applicable required procedures\nResponsible for ensuring each product is properly labeled in compliance with the MA Regulations\nTake instructions and help out on tasks delegated by laboratory management\nResponsible for the preparation of material to be processed in accordance with daily task\nEnsures consistency and efficacy of product through quality control testing\nPerforms all other assigned duties required to ensure a clean and safe production facility\nHas understanding of Good Manufacturing Practices (GMP) and all safety procedures to ensure the highest level of safety\nCompletes the sanitation of all production equipment and tools including workspace, all equipment, containers, and appliances\n\nQualifications:\nMust be at least 21 years of age\nAbility to pass a national background check per state cannabis regulations\nHigh School diploma or General Education Diploma (GED)\nExcellent verbal interpersonal communication skills to interact with team members\nMust possess basic math skills\nMust have be highly organized with strong attention to detail\nHave an understanding of weights and measurements\nMust be comfortable working in fast paced environment\nMust have the ability to adapt\nExperience with safe handling and proper disposal of harmful chemicals and hazardous waste\nAdaptable/flexible and able to work in an ever-changing environment\nPrevious agriculture or manufacturing experience preferred but not required\nAbility to work independently throughout a workday with given directive\nAbility to travel approximately 5%\n\nPhysical Requirements:\nStanding, bending, and lifting-up to 50 pounds, carrying product totes, pushing carts, moving and making adjustments to process equipment\nHave the ability to climb and work on raised platforms\nClose vision (clear vision at 20 inches or less)\nManual dexterity sufficient to reach/handle items, work with fingers\n\nFacility Environment\n\nAllergen warnings -Potential exposure to dust, pollen, and plant pathogens\nExposure to cleaning solvents, such as high volumes of isopropyl alcohol\nAll jobs require daily use of provided PPE, such as masks, hair nets, beard covers, respirators, boot covers, scrubs, non-slip shoes, and Tyvek suits as necessary\nExposure to loud noises, including but not limited to air compressors, packaging equipment, and alarms\nExposure to CO2 manufacturing procedures at OSHA approved CO2 levels\nHigh stress tolerance, adaptable, ability to work in an ever-changing environment, flexible\n\nCuraleaf is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.","slug":"lab-technician-d8139345-808b-432f-9e62-b8b4689163b2","benefits":["Safety equipment provided"],"selectedSkills":["Communication skills","Manufacturing","Basic math","Agriculture","CGMP","High school diploma or GED","Background check","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=T-9zRJAuodmWGgGpD9oasO1bTevvPiySkPbdAzR70C2VvpXqA-Gzqw"},{"position":"Laboratory Supervisor","labName":"Holistic Industries","location":"Monson, MA","age":"1 day ago","type":"Full-time","salaryMin":"$72,000 ","salaryMax":" $93,000 a year","jobDescriptionCopy":"About Us:\nAt Holistic Industries we are building a great place to work, shop and invest in cannabis. Our mission is to provide patients and customers with the highest quality, safest cannabis medicine possible. As our name suggests, we care for the whole person. Scaling from a seed of inspiration in 2011, Holistic Industries is now one of the largest and fastest growing private MSOs (Multi-State Operators) in the country. We're able to deliver consistent value to employees, patients, and investors because of the values that drive our work - how we do business and why. We have one of the most seasoned teams in the industry, a budding \"Greenhouse of Brands\" and a meaningful model of doing well by doing good. Our company develops and offers a wide range of proprietary strains that increase desired cannabinoids such as CBD. These high CBD strains have become our foundation for growing, packaging, and selling the best cannabis in our markets. We are committed to harvesting and crafting industry-leading strains, consumer brands, and medical-grade products based on the most progressive science in the space. Holistic Industries has a unique model and approach that enables it to win licenses, scale operations and introduce national brands successfully in highly regulated markets. The company has proven to be responsible stewards of capital since its inception by sourcing licenses on merit rather than simply acquiring them on the open market. A \"GREENHOUSE OF BRANDS\" beginning with our flagship retail and wholesale brand, Liberty Cannabis, we continue to prove our ability to launch new brands from scratch and attract noteworthy partners.\nWe are deeply and actively committed to the communities we serve; our efforts under Liberty Cannabis Cares are focused on four pillars: Social Equity, Diversity, Community, and Cannabis Literacy.\nOur team includes the nation’s most knowledgeable experts in cultivation and medical dispensing, along with professionals who are top of their fields in medical professions, security, agriculture, real estate, and the legal distribution of other highly controlled substances. We are a team of best-in-class executives and staff from within and outside the industry who share a passion for advancing cannabis products and retail experience at scale.\nOur well-established company is growing rapidly and adding to our team of professionals and specialists. Our employees receive PTO, paid Sick Leave, medical, dental, vision and other leave benefits as part of our highly competitive compensation package. Join us as we build a great place to work, shop, and invest.\nHolistic Industries is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.\n\nAbout the Job:\nThe Laboratory Supervisor acts as an assistant to the Processing Manager. This position will work to organize and maintain laboratory operations and procedures, handle daily operations with a focus on efficiency and time management, maintain intra-office/lab communication protocols, streamline administrative procedures, inventory control, and task delegation.\nAssist Processing Manager in management of day-to-day laboratory operations\nSupervise and assign daily tasks of laboratory technicians, packaging supervisor and packaging laborers\nAssist with production scheduling to ensure turnaround times are maintained, coordinated and communicated among laboratory, sales and administrative personnel\nResponsible for ensuring adherence to all laboratory scheduling including, but not limited to: production, equipment maintenance, sanitation SOPs, annual personelle training and safety inspections\nEnsure the lab is well organized, workflows are streamlined, and hold regular meetings with laboratory staff to set work priorities\nAssist Processing Manager to identify and implement procedural and policy changes to improve lab operational efficiency\nOversees Quality Assurance of all batch records and data collection for laboratory and packaging processes\nMaintains laboratory and packaging reports, records and files\nEnsure personnel are trained on SOPs\nMaintain laboratory consumables inventory and manages ordering\nPerforms data and inventory audits to ensure accuracy and ahearance to corporate and state mandated regulations\nCoordinate workflow and work schedules from sampler dispatch through testing and reporting of data to customers\nWork with 3rd party laboratories to submit samples and interpret data results\nRequired to maintain strict adherence to safety and Quality Assurance protocols\nPhysical Demands: VERY LABOR INTENSIVE. Must be able to lift, carry and balance up to 75 pounds (125 pounds with assistance), may include walking or standing for extended periods of time, as well as stooping, bending over and/or crouching. Moderate to loud exposure to noise level.\n\nAbout You:\nGeneral\nRegulations require that incumbent be at least 21 years of age and able to obtain and maintain state marijuana work credentials\n\nEducation/Experience:\nBachelor’s Degree in a related field required\nPrevious marijuana industry experience preferred with priority given to candidates with experience in licensed facilities\n3+ yrs experience in laboratory operations\n1+ yrs management experience preferred\n\nTechnological Skills:\nAbility to use standard office equipment, computer equipment and software including word processing, database management, spreadsheet applications and email\n\nRequired Knowledge and Skills:\nExcellent management skills with demonstrated ability to manage complex projects and technical team\nHighly detail oriented and organized, critical eye for optimizing workflows\nExcellent communication skills with ability to clearly and succinctly explain organizational goals and specific tasks\nAbility to inspire and motivate employees; encourage productivity, teamwork, and a collaborative environment\nDemonstrate effective delegation of tasks\nAbility to manage and develop key performance indicators of staff members\nExcellent problem solving and critical thinking skills with demonstrated ability to gather information and develop solutions\nEffectively manage changing priorities and remain calm under pressure\nStrong organizational and planning skills\nDemonstrate responsibility, accountability, and dependability toward assigned tasks and duties\nDisplays professionalism and positive attitude toward assigned tasks, projects and colleagues\nStrong ethics and sound judgment\nMust be able to successfully pass a thorough internal and external background check.","slug":"laboratory-supervisor-5dff33cc-3790-4012-aee0-eef61aa8070e","benefits":["Dental insurance","Health insurance","Paid time off","Paid sick time","Vision insurance"],"selectedSkills":["Database management","Laboratory procedures","Data collection","Laboratory experience","Communication skills","Bachelor's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=uBXYam5gN03f_O8Kc-ywGZ_T80kF9f6-aUwLoEyQWmGBsh8vXKnx0Q"},{"position":"Processing Lab Supervisor","labName":"Curaleaf","location":"Homestead, FL","age":"8 days ago","salaryMin":"$55,000 ","salaryMax":" $80,000 a year","jobDescriptionCopy":"Curaleaf Holdings, Inc. (CSE: CURA) (OTCQX: CURLF) (\"Curaleaf\") is a leading international provider of consumer products in cannabis, with a mission to improve lives by providing clarity around cannabis and confidence around consumption. As a high-growth cannabis company known for quality, expertise, and reliability, the company and its brands, including Curaleaf and Select provide industry-leading service, product selection, and accessibility across the medical and adult-use markets. In the United States, Curaleaf currently operates in 23 states with 123 dispensaries, 25 cultivation sites, and over 30 processing sites, and employs over 5,000 team members. Curaleaf International is the leading vertically integrated cannabis company in Europe with a unique supply and distribution network throughout the European market, bringing together pioneering science and research with cutting-edge cultivation, extraction, and production. Home | Curaleaf | Cannabis with Confidence\n\nOur corporate social responsibility is Rooted In Good Diversity, Equity, Inclusion + Social Equity + Sustainability Social Responsibility | Curaleaf | Cannabis with Confidence We believe in taking corporate and social responsibility very seriously, from our educational outreach to national partnerships, state-wide initiatives and local causes. Giving back to the communities where we operate is important to us, and helps to change old attitudes by showing the positive impact of cannabis in creating jobs, changing lives, and helping local communities.\n\nWe educate. We advocate. We give.\n\nProcessing Lab Supervisor Job Description:\nResponsibilities:\nOversees production by creating and reviewing production schedule; studying and clarifying specifications; calculating requirements; assembling and weighing plant materials and supplies for extraction\nQA/QC duties that require analytical testing for quality and consistency, data review\nOperating highly sophisticated extraction equipment; Processing concentrates and extracts\nCleaning and maintenance of extraction equipment and laboratory facility following current good manufacturing practices (cGMP), good documentation practices (GDP), and standard operating procedures; complying with legal regulations; monitoring environment\nOperating, maintaining, and making adjustments and repairs to laboratory equipment such as distillation systems, Rotovaps, balances, centrifuges, and other laboratory equipment\nMaintaining inventory records of supplies, materials, and equipment\nMaintaining STS system for Lab production\nStoring supplies and equipment, disposal of waste according to guidelines, and keeping laboratory, storerooms and working areas immaculate\nWashing and sterilizing laboratory glassware\nCreation of SOPs, training records, and related documentation\nMaintaining material safety data sheets for all department chemicals and products\nMaintaining highest level of compliance to ensure processing operation is fully compliant with state regulations, federal and state laws\nAssures that operation adheres to all business and industry license requirements-able to produce documents as proof immediately upon request\nAssures all safety requirements are adhered to\n\nSkills:\nKnowledge of and hands on experience with Super Critical CO2 Extraction, Rotary Evaporation and Wiped Film Distillation\nAble to oversee analysis on HPLC instrumentation\nAble to implement Food Quality Safe (SQF) standard procedures\nAble to process samples by collection, extraction, preparing for analysis, and quantifying results.\nScientific laboratory procedures and techniques as used in a chemistry laboratory\nScientific laboratory equipment and apparatus\nScientific methods of measurements\nHealth and safety practices and precautions applicable to a chemistry laboratory\nProper and safe handling and disposal of harmful chemicals, substances, and hazardous wastes\nCapabilities with computer systems, software, and hardware common to laboratories\nRecord keeping procedures\n\nPhysical Requirements:\nMust be able to perform repetitive techniques accurately and consistently\nMust be able to stand for long periods of time, along with frequent bending\nClose vision (clear vision at 20 inches or less)\nManual dexterity sufficient to reach/handle items, work with fingers\nAbility to lift up to 50 pounds and push up to 100 pounds with assistance\n\nRequirements:\nBS/BA Degree or greater with at least 4 years' experience in a lab or manufacturing setting required\nQA/QC experience with HPLC analysis highly preferred\nPrior experience with GMP in a food production environment and Safe Quality Food (SFQ) Standards\nScientific writing for processes, training, and procedures that require documentation\nMust be at least 21 years of age\nSubject to background check per state cannabis regulations\n\nCuraleaf is an Equal Opportunity Employer\n\nCuraleaf is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.","slug":"processing-lab-supervisor-dd0bda93-e0ed-4c50-8db3-b13a151a8b24","benefits":[],"selectedSkills":["Laboratory experience","Manufacturing","QA/QC","CGMP","High-performance liquid chromatography","Bachelor of Science","Bachelor's degree","Background check","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=1_1anLWsRcnnYTUxEzumwiDY6Dnv2KtSvl-228hQkwvXLMW6Z-R4cg"},{"position":"Microbiologist","labName":"Cannabis Testing Lab","location":"Los Angeles, CA","age":"2 days ago","type":"Full-time","salaryMin":"$45,000 ","salaryMax":" $60,000 a year","jobDescriptionCopy":"We are a full-service cannabis testing lab offering state-mandated testing services to California’s cannabis distributors, cultivators, and manufacturers to ensure safety and accurate labeling of products for medical and recreational use.\n\nThe Microbiologist is a key position responsible for the design, execution, and oversight of the laboratory samples requiring microbial pathogen screening.\n\nThis is an opportunity to come into a young company and help make it great!\n\nDuties and Responsibilities:\n\nPerform sample preparation and analysis of cannabis and cannabis products for the detection of Salmonella, Shiga toxin-producing coli (STEC), and Aspergillus species using DNA-based screening.\nPerform plating techniques for the detection of viable yeast and mold.\nExecute method validation in accordance with ISO 17025 requirements.\nReview raw and QA/QC data ensuring it meets established criteria and upload final results into the LIMS using GLP.\nSubmit non-conforming work to the Corrective Action/Preventative Action workflow.\nWork with the Lab Director to prepare and review SOPs and other controlled documentation.\nTake inventory of supplies and create orders for supplies needed.\nWork with a team of scientists in a fast-paced environment to design and implement analytical strategies.\nPrepare technical reports.\n\nAdditional Duties May Include:\n\nCross-training on separate analytical methods (HPLC, GC-MS, LC-MS/MS, ICP-MS)\nTraining scientific staff\n\nQualifications:\n\nBachelors or Masters degree in relevant field and demonstrated technical proficiency, method development, and validation experience with PCR and plating assays\nExperience in a regulated environment (ISO 17025, GLP, or GMP)\nHigh-level understanding and adherence to sterile/aseptic technique\nExperience writing SOPs\nAccuracy and attention to detail\nExcellent written and verbal communication skills\n\nPreferred Qualifications:\n\nExperience in a cannabis or environmental testing lab\nExperience with DNA-based pathogen screening and detection\nExperience with LIMS and ELN documentation\nExperience with METRC\n\nPlease send resume and cover letter and indicate date available to start working.\n\nJob Type: Full-time\n\nSalary: $45,000.00 to $60,000.00 /year\n\nJob Type: Full-time\n\nPay: $45,000.00 - $60,000.00 per year\n\nBenefits:\n\nDental insurance\nHealth insurance\nHealth savings account\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\nMonday to Friday\nWeekend availability\n\nEducation:\n\nBachelor's (Preferred)\n\nExperience:\n\nMicrobiology: 2 years (Preferred)\nLaboratory Experience: 2 years (Preferred)\n\nWork Location: One location","slug":"microbiologist-468aa620-30bd-4dd8-995a-c691a9acbea0","benefits":["Health savings account","Dental insurance","Health insurance","Paid time off","Vision insurance"],"selectedSkills":["Writing skills","PCR","Laboratory information management systems","Laboratory experience","Assays","Bachelor's degree","Master's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=YGW0sLgccItHGnTmBP0fhMXS2fA8d_ZLjHSe51xg11uX5CvGD2JK5A"},{"position":"Tissue Culture Technician","labName":"Tru Clones","location":"Bangor, MI","age":"4 days ago","type":"Full-time","salaryMin":"$18 ","salaryMax":" $22 an hour","jobDescriptionCopy":"Tru Clones is a startup Greenhouse/Outdoor Cannabis cultivation facility with Nursery and Tissue Culture Services, located outside Bangor, MI. We are developing our team and looking for qualified applicants for part-time and full-time positions within our organization.\n\nThe Tissue Culture Technician position is responsible for maintaining the Tissue Culture Production Schedule as well as the Tissue Culture department. Team members will utilize our process to free cultivars from virus, pathogen, or pest pressure as well as provide long term genetic banking for our clients. Tissue Culture Technicians will receive work instructions as well as report to the Director of Cultivation.\n\nThis full-time position is year round Monday through Friday 8AM-4PM. Weekend shifts may be required within the nature of our business. Compensation will range from $16-$20 per hour based on experience.\n\nJob Duties\n\n-Tissue Culture Technicians are responsible for propagating in house as well as third party cultivars though our tissue culture system.\n\n-Team members will assess incoming cultivars and maintain a rigid production schedule for each client.\n\n-Team members will prepare media, sterilize tools and supplies, maintain a clean workspace and monitor the growth of the tissue culture stock.\n\n-Through our training program team members will dissect plant tissues and propagate though various methods in order to deliver hardened plants to clients.\n\n-Team members will prepare tissue culture plants for delivery to clients or movement into our vegetative rotation.\n\n-As necessary the Tissue Culture Technician will assist the Propagation Team with duties in their department.\n\nQualifications\n\n- Over 21 years old\n\n- High School Diploma\n\n- Bachelors degree in related fields (Microbiology, Botany)\n\n- 2+ years experience within tissue culture laboratories\n\n- Exceptional attendance and punctuality\n\n- Reliable transportation\n\n- Ability to work with other team members to complete work instructions\n\n- Display a high level of attention to detail\n\n- Exhibit strong organization, record keeping, and time management skills\n\n- Familiarity with operation of laboratory equipment including: autoclaves, laminar flow hoods, microscopes, and testing equipment\n\n- Must be able to lift and carry 50lbs, and be on your feet or sitting for the entire shift when necessary\n\n- Understanding of Microsoft Office programs and general computer knowledge\n\nJob Type: Full-time\n\nPay: $18.00 - $22.00 per hour\n\nBenefits:\n\nHealth insurance\nPaid time off\n\nSchedule:\n\n8 hour shift\nMonday to Friday\nWeekend availability\n\nAbility to commute/relocate:\n\nBangor, MI 49013: Reliably commute or planning to relocate before starting work (Preferred)\n\nApplication Question(s):\n\nAre you over 21?\n\nWork Location: One location","slug":"tissue-culture-technician-8a257d3f-b110-4e70-8f31-cf9ed434a4b5","benefits":["Health insurance","Paid time off"],"selectedSkills":["Computer skills","Dissection","Tissue culture","Time management","Microsoft Office","Bachelor's degree","High school diploma or GED","21 years or older","Reliable transportation"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=Juv6H1IYXCJcxd4SYuhx26vbWKRm-S6hpH0FQ_WWqEV-VA7O8-QugA"},{"position":"Extraction Technician","labName":"Trulieve, INC","location":"McKeesport, PA","age":"1 day ago","type":"Full-time","salaryMin":"$32,000 ","salaryMax":" $44,000 a year","jobDescriptionCopy":"Job Title: Extraction Technician\n\nDepartment: Processing\n\nReports to: Oil Supervisor or Team Lead\n\nFLSA Status: Regular-Non-Exempt\n\nRole Summary:\nTrulieve is looking for an Extraction Technician to support our extraction and production operations. You should be very technically astute in mechanical, electrical, and computer operated systems utilized in production/manufacturing environments. You need to be proactive, quick thinking and innovative in your approach.\n\nKey Duties and Responsibilities:\nPreparation of equipment and plant materials for extraction\nExecution of extraction and processing in accordance with state and local standards\nOperation of sophisticated extraction equipment\nEnsure consistency and efficiency of product through quality control testing and procedures\nCleaning and maintenance of extraction equipment and manufacturing facility\nMaintaining strict inventory records of all plant materials, chemicals, and equipment used in the facility\nOversee day-to-day operations of the entire extraction space beginning with storing the raw cannabis through the extraction process and all the way to fulfillment of orders\nOperating, maintaining, and making adjustments and repairs to extraction equipment\nStoring supplies and equipment and disposal of waste according to guidelines\nComplete the cleaning and sanitization of all production equipment, work surfaces, and tools\nMaintaining inventory records of supplies, materials, and equipment and preparing requisitions as needed\nMaintaining material safety data sheets for all chemicals and products\nFollowing all standard operating procedures regarding product creation and lab safety\nAssist in packaging and labeling of finished products\nWorks with testing laboratory as defined by state guidelines\nAll other duties as assigned","slug":"extraction-technician-0edeb096-db95-4594-95b7-01d38db0fe3d","benefits":[],"selectedSkills":[],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=ztHzQIXt8gXaf9hbpqu-0TBRvVGHCvInPqKXGtw6_OzUAP9cb2nISQ"},{"position":"Cannabis Extraction Technician","labName":"Kaycha Labs","location":"Tempe, AZ","age":"8 days ago","type":"Full-time","salaryMin":"$27,000 ","salaryMax":" $37,000 a year","jobDescriptionCopy":"Company Overview:\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\nJob Purpose:\n\nThe Lab Technician, Level I is responsible for working closely with our laboratory team to develop analytical skills and related experience. This position consists of many aspects from homogenizing, weighing and extracting samples, performing quality control checks, verifying various support equipment and properly disposing of all waste.\n\nEssential Duties & Responsibilities:\n\nExecute laboratory protocol and procedures under the supervision of the Lab Director.\nRegularly display good laboratory technique to avoid cross-contamination or misidentified samples.\nPerform sample preparation procedures including homogenization, weighing and liquid extraction.\nPerform QC duties as assigned, including LCS and matrix spikes.\nPerform qualitative and quantitative tests, as assigned.\nUtilize the LIMS system to create batches, enter sample prep information and maintain physical and electronic records.\nAdhere to ISO 17025 standards as well as state regulatory requirements.\nPromote a strong customer service culture while adhering to the highest safety and industry standards.\nOther duties and/or special projects as assigned.\n\nSkills, Abilities and Competencies:\n\nAbility to maintain an incredibly high degree of attention to detail and accuracy.\nStrong agility, engagement, and flexibility in an ever-changing environment.\nWorking knowledge of logging, organizing, and analyzing data.\nAbility to work in a dynamic, fast-paced deadline environment while successfully managing multiple tasks.\nStrong knowledge of Microsoft Office, including Excel, PowerPoint, and Word.\nWorking knowledge of standard laboratory protocol.\nExcellent communication skills and ability to effectively work, problem solve, and communicate with multiple levels of the organization.\n\nEducation & Experience:\n\nMinimum of Bachelor’s degree in chemistry, biochemistry or related field based on state requirements.\n0-1 year of lab experience.\nKnowledge of principles, terminology, practices, techniques commonly used in a laboratory setting preferred.\nExposure to the cannabis industry is a plus.\n\nOther:\n\nMust pass Level 2 background check.\nMust be at least 21 years old.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status\n\nJob Type: Full-time\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\nDay shift\nMonday to Friday\nWeekend availability\n\nCOVID-19 considerations:\nFace masks required.\n\nApplication Question(s):\n\nAre you willing to work nights and/or weekends as needed?\nDo you have a chemistry degree?\nWhat is your desired compensation?\n\nEducation:\n\nBachelor's (Preferred)\n\nWork Location: One location","slug":"cannabis-extraction-technician-0a19c9e3-e00c-41ea-af49-81c45295b576","benefits":["Dental insurance","Health insurance","401(k)","401(k) matching","Paid time off"],"selectedSkills":["Microsoft Excel","Microsoft Powerpoint","Laboratory experience","Communication skills","Microsoft Office","Bachelor's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=XELSWMKICuuSVXP9coRjADsxwvmN7_bqSa1cV8NWFWJGWwwKNzDPaQ"},{"position":"Laboratory Technician (MA)","labName":"Green Analytics, LLC","location":"Framingham, MA","age":"1 day ago","type":"Full-time","jobDescriptionCopy":"APPLICANTS MUST currently live within a reasonable commute of business location. OUT OF AREA candidates and/or those requiring a relocation will NOT be considered.\n\nPOSITION SUMMARY: This is a technical position responsible for the collection and testing of samples of various chemical compounds and biological specimens. Daily work involves the routine and repetitive use of various types of machinery, lab equipment and programs to perform tests, record data or findings and present information.\n\nESSENTIAL FUNCTIONS:\n\nPrepares and weighs product samples; performs repetitive/routine testing activities to include accessioning and pipetting\nDocuments results pertaining to strength, stability, purity, chemical content, and other characteristics\nAssembles data and other pertinent information into groups, charts, graphs, reports, and the like for others to evaluate\nHelps to set up laboratory equipment and instrumentation required for testing activities under the supervision of team analysts\nUtilizes problem-solving skills to help to determine when an apparatus may need to be recalibrated or requires servicing\nRestocks inventory supplies used in various testing activities; provides for the weekly cleaning of glassware\nRecords and verifies log entries for various pieces of equipment/apparatus including balances, incubator, refrigerator/freezer, etc.\nComplies with all established safety, health, and environmental rules and regulations designed to ensure a safe work environment\nExpected to perform other job-related duties as assigned\n\nPOSITION REQUIREMENTS:\n\nGeneral Knowledge/Abilities\n\nAbility to fluently speak and read the English language along with understanding and following both written and verbal direction\nAbility to function independently, have personal integrity, flexibility and the ability to work effectively with fellow employees\nAnalytical and numerical skills: ability to perform mathematical calculations in different units of measurement\nAbility to use concepts such as fractions, percentages, and ratios; demonstrated abilities in troubleshooting and problem-solving\nBasic knowledge of modern office practices and use of Microsoft Office Suite for Word and Excel\nExperience in driving tasks and meeting deadlines; accountable for the completion of assigned goals and objectives\nAbility to build relationships to strengthen partnerships with a focus on customer service\nAbility to perform physically demanding work such as moving and lifting equipment, standing for long periods of time, etc.\n\nEducation, Licenses/Certifications\n\nBachelor’s degree in Chemistry or a related field from an accredited college or university preferred\nPrior experience in the Cannabis Industry and/or applicable laboratory experience may be substituted in place of degree\n\nPreferred Experience\n\n1-2 years in experience in service based/customer-facing position\n2 years academic experience in an analytical laboratory setting\n\nSUPERVISORY RESPONSIBILITIES: None\n\nJob Type: Full-time\n\nPay: Up to $20.00 per hour\n\nBenefits:\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\nHolidays\nNight shift\nWeekend availability\n\nCOVID-19 considerations:\nVaccination against COVID-19 is required for ALL employees.\n\nEducation:\n\nBachelor's (Preferred)\n\nExperience:\n\nLaboratory Experience: 2 years (Preferred)\n\nWork Location: One location","slug":"laboratory-technician-ma-6b8391f8-183c-4286-aeba-b305d3266c8e","benefits":["Dental insurance","Health insurance","Paid time off","401(k)","Vision insurance"],"selectedSkills":["Analysis skills","Microsoft Excel","Laboratory experience","Microsoft Office","Microsoft Word","Bachelor's degree","US work authorization"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=gd6Le4VBieve9pODf_X7mo8SmFGOKr8_ip2VkwwIp38B3ORwdMGmfQ"},{"position":"Processing Lab Manager","labName":"Curaleaf","location":"Mount Dora, FL","age":"2 hours ago","salaryMin":"$57,000 ","salaryMax":" $81,000 a year","jobDescriptionCopy":"Curaleaf Holdings, Inc. (CSE: CURA) (OTCQX: CURLF) (\"Curaleaf\") is a leading international provider of consumer products in cannabis, with a mission to improve lives by providing clarity around cannabis and confidence around consumption. As a high-growth cannabis company known for quality, expertise, and reliability, the company and its brands, including Curaleaf and Select provide industry-leading service, product selection, and accessibility across the medical and adult-use markets. In the United States, Curaleaf currently operates in 23 states with 123 dispensaries, 25 cultivation sites, and over 30 processing sites, and employs over 5,000 team members. Curaleaf International is the leading vertically integrated cannabis company in Europe with a unique supply and distribution network throughout the European market, bringing together pioneering science and research with cutting-edge cultivation, extraction, and production. Home | Curaleaf | Cannabis with Confidence\n\nOur corporate social responsibility is Rooted In Good Diversity, Equity, Inclusion + Social Equity + Sustainability Social Responsibility | Curaleaf | Cannabis with Confidence We believe in taking corporate and social responsibility very seriously, from our educational outreach to national partnerships, state-wide initiatives and local causes. Giving back to the communities where we operate is important to us, and helps to change old attitudes by showing the positive impact of cannabis in creating jobs, changing lives, and helping local communities.\n\nWe educate. We advocate. We give.\n\nACE Lab Manager:\nEngineering/science degree (BA or BS) with 3-5 years experience operating a lab with large equipment.\nBasic plumbing and electrical knowledge.\nWaste water treatment experience is ideal.\nOnce trained, needs to be able to troubleshoot the ACE system with limited or no hand-holding.\nOnce trained and fully autonomous, must be able to provide valuable feedback for system operation and optimization\n\nResponsibilities and General Job Duties:\nFull scientific oversight of the Labs and all processes\nManage extraction process, purification process, formulation process, and analytical testing in their entirety\nBuild a strong high functioning team and manage through both engagement and accountability\nRecruit new talent Hire all new staff from Extraction Technicians through Chemists\nComplete employee evaluations and performance-based coaching\nResource planning and staff scheduling\nDevelop and oversee all applicable training programs\nCapacity and production planning for departments based on constraints and calculated requirements\nValidations and qualifications of SOPs, equipment, and methods\nConducting IQ OQ PQ projects for new equipment\nComplete R&D projects as required for product and process expansion\nCreate and track all department metrics and KPIs (focusing on safety, quality, and productivity)\nLiaison with Corporate applicable SMEs\nEngineer technical solutions for departmental expansion\nExecute on short-term projects as well as long-term vision for the departments\nMaintain all cGMPs based on set facility standards\nConduct quality-based investigations and create CAPAs\nWrite and review all department specific SOPs, Work Instructions, Forms, or other technical and controlled documents\nImplement continuous improvement initiatives including six sigma and 5S\nManaging procurement process of department and maintain an OPEX budget\nEnsure all associated personnel are trained in and comply with all New York DOH applicable regulations\nEnsure processing operation is fully compliant with state regulations and state/federal law\nAssure that operation adheres to all business and industry license requirements\n\nSpecific Job Duties and Qualifications:\nCannabis industry specific processes related to Post-Harvest (drying, curing, trimming), Processing (extraction, purification, formulation, filling, and packaging), and Analytical Testing (potency reporting)\nOperation and maintenance of ACE and hash/rosin equipment – intimate knowledge of plumbing, electrical and chemical processes.\nMaintaining proper workflow that keeps up with production demands and efficiencies\nQA/QC duties that require analytical testing for quality and consistency; data review and analysis of HPLC and GC equipment\nOversight of highly sophisticated extraction equipment; Processing concentrates and extracts\nOperating, maintaining, repairing and adjusting laboratory equipment such as pumps, balances, centrifuges, rotary evaporators, vacuum ovens, stills, homogenizers, and other laboratory equipment\nStoring supplies and equipment, disposal of waste according to guidelines, and keeping laboratory, storerooms, harvest rooms, and working areas clean\nScientific laboratory procedures and techniques as used in a chemistry laboratory including methods of measurements\nHealth and safety practices and precautions (including HazCom) applicable to a laboratory and manufacturing\n\nMaintaining strict inventory compliance and records of all controlled substances tracked through Cannabis tracking software\n\nCuraleaf is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.","slug":"processing-lab-manager-07583b39-43e7-48be-8fe2-9bcba698d852","benefits":[],"selectedSkills":["Wastewater","Laboratory experience","Production planning","Water treatment","Bachelor of Science","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=7klCbAw5y6lIAOnPnrTwZOfJ2b2VVnS3AEGu55gdLAqsNaREMEahGw"},{"position":"Analytical Chemist","labName":"Curaleaf","location":"Winslow, NJ","age":"6 days ago","salaryMin":"$42,000 ","salaryMax":" $60,000 a year","jobDescriptionCopy":"Curaleaf Holdings, Inc. (CSE: CURA) (OTCQX: CURLF) (\"Curaleaf\") is a leading international provider of consumer products in cannabis, with a mission to improve lives by providing clarity around cannabis and confidence around consumption. As a high-growth cannabis company known for quality, expertise, and reliability, the company and its brands, including Curaleaf and Select provide industry-leading service, product selection, and accessibility across the medical and adult-use markets. In the United States, Curaleaf currently operates in 23 states with 123 dispensaries, 25 cultivation sites, and over 30 processing sites, and employs over 5,000 team members. Curaleaf International is the leading vertically integrated cannabis company in Europe with a unique supply and distribution network throughout the European market, bringing together pioneering science and research with cutting-edge cultivation, extraction, and production. Home | Curaleaf | Cannabis with Confidence\n\nOur corporate social responsibility is Rooted In Good Diversity, Equity, Inclusion + Social Equity + Sustainability Social Responsibility | Curaleaf | Cannabis with Confidence We believe in taking corporate and social responsibility very seriously, from our educational outreach to national partnerships, state-wide initiatives and local causes. Giving back to the communities where we operate is important to us, and helps to change old attitudes by showing the positive impact of cannabis in creating jobs, changing lives, and helping local communities.\n\nWe educate. We advocate. We give.\n\nAnalytical Chemist\n\nWe are seeking an Analytical Chemist to join our team. This role requires 2 to 3 years of analytical laboratory experience and a BSc in Chemistry or a related science. Experience with GC, GC/MS, and HPLC is a must. Experience in GC/MS/MS and/or LC/MS/MS a plus. This team member will need to be familiar with, or have the ability to quickly learn, a wide range of analytical and sample prep techniques to ensure we are delivering quality products.\n\nRoles/Responsibilities\n\nProvide analytical support to analytical research team utilizing a variety of analytical equipment including GC, GC/MS, GCQQQ, LC, LC/MS, LCQQQ, ICPMS, and NMP, among other equipment types\nWork independently with project assignments, or collaboratively on group projects/programs.\nConduct chemical and physical laboratory tests on raw materials, in-process goods, and finished products.\nPerform QC sample testing of materials and products\nUtilize pipette and syringe based techniques for liquid measurement\nCalibrate and utilize analytical scales or balances for sample weight or mass determinations\nLogin and retain samples for future evaluations\nFollow sample chain-of-custody protocols\nPrepare reagents and standard solutions\nCompile an inventory and maintain stock of laboratory supplies and chemicals\nMaintain logbook records of testing analyses as well as other records as required\nDiagnose analytical system problems and provide solutions as needed\nPerform routine and non-routine maintenance and repair of instruments and equipment as needed\nPerform system qualification and calibration of required equipment as needed\nAssist in training new laboratory personnel\nClean glassware, refill/replace items/solutions as needed\nPerform basic waste disposal per state regulations\nMaintain Safety Data Sheets for all chemicals and products\nConduct stability tests and studies following approved stability protocols\nAssist in approving and releasing materials from inventory for use in product manufacture and/or clear products for sale\nAssist in the investigation of product complaints, including the recording of all testing information\nProcure R&D requested samples as required\nCompose, review, and edit standard operating procedures\nLearn new procedures and complete training in the operation and use of new equipment as required\nSupport laboratory manufacturing as needed\nPerform other duties as required\n\nJob Qualification Requirements\n\nMust be at least 21 years of age\nSubject to background check per state cannabis regulations\nQA/QC Experience\nAdept with GC and LC operation, including MS applications and hardware\nMust have 2 to 3 years' experience with non-academic analytical chemistry\nBachelor's Degree in Chemistry or related field\n\nRequired Skills and Abilities\n\nEffective verbal and written communication skills\nBasic arithmetic and computer skills\nProficiency in MS Office suite\nUse of personal protective equipment including lab coats, safety goggles, and safety glasses\nAnalytical focus with the ability to collect and interpret chemical data\nStrong organizational skills with the ability to multitask and prioritize competing demands\nAbility to comply with established safety standards for the proper use, safe handling, and disposal of harmful chemicals, substances, and hazardous wastes\nExperience with a variety of analytical software platforms with Agilent Chemstation, Agilent MassHunter, Lab Solutions, & Agilent OpenLab CDS experience a plus\nRegular attendance is required\nMust be able to work in a challenging fast-paced environment while maintaining strong attention to details\nSubject to background check per state cannabis requirements\n\nEducation\n\nBSc in Chemistry or similar\n\nCuraleaf is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.","slug":"analytical-chemist-ff180d8f-273e-4cff-ac38-4e3f90f739b0","benefits":[],"selectedSkills":["Gas chromatography","QA/QC","Computer skills","Laboratory experience","Communication skills","Bachelor of Science","Bachelor's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=aibNRpYVvZwqPMpiiSAHMqzRC05o50hatrf8-HLIwsszKyTmwFO6ww"},{"position":"Field Sampler","labName":"Kaycha Labs","location":"Monrovia, CA","age":"8 days ago","type":"Full-time","salaryMin":"$34,000 ","salaryMax":" $42,000 a year","jobDescriptionCopy":"Company Overview:\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\nJob Purpose:\n\nThe Field Sampler is responsible for conducting routine pickups and processing of regulatory compliance samples for laboratory analysis. This includes accurately recording sample and chain of custody documentation and the safe and secure transportation of all samples to the laboratory. Candidates must be located in the Enter Lab Location area or close proximity.\n\nEssential Duties & Responsibilities:\n\nPerform onsite field sampling pickups in accordance with all laws and regulations related to the legal cannabis market and laboratory operating procedures.\nCollect and forward weekly inventory requests to the laboratory team.\nCollect payment from clients.\nInterface effectively between customers and the laboratory team.\nContact clients in conjunction with the Client Service Rep(s) to determine if their sampling needs to create a sampling plan (e.g., number of batches, requested analyses, sample information)\nInput orders with required sample information into METRC and the lab’s LIMS system as required.\nFollow detailed procedural requirements as outlined in the Kaycha Labs Sampling and Chain of Custody SOP.\nSafely drive throughout an assigned region, which may include multi-hour destination pickups.\nCollect detailed data in the field according to SOPs.\nMaintain current knowledge of our products and services.\nConsistently maintain customer confidentiality.\nOther duties and special projects as assigned.\n\nKnowledge, Skills, and Abilities:\n\nAbility to maintain a high degree of attention to detail and accuracy.\nExcellent communication skills and ability to effectively work, problem solve, and communicate with internal and external customers.\nDemonstrate keen attention to detail and punctuality.\nAbility to work in a dynamic, fast-paced deadline environment while successfully managing multiple tasks.\nDemonstrated ability to be professional, pleasant, and presentable.\nFamiliarity with the assigned geographic area.\nBuild long-lasting customer relationships.\n\nEducation & Experience\n\nHigh School Diploma (or GED required.)\nA valid driver’s license and clean driving record (with at least three years of driving experience).\nExposure to the Cannabis industry is a plus.\n\nOther:\n\nMust be over 21 years old\nPre-Employment Verifications: Must pass Level 2 background check.\nKaycha Labs offers a competitive and comprehensive benefits package.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.\n\nEssential Functions:\n\nThe physical demands described here are representative of those that an employee must meet to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nWhile performing the duties of this job the employee is frequently required to stand, handle or feel, to speak, and to hear. The employee is occasionally required to walk, sit, reach with hands and arms, bend, kneel, crouch, or crawl. The employee must frequently lift and/or move up to thirty-five (35) pounds.\n\nSpecific vision abilities required for this job include close (proximity) vision, depth perception, and the ability to adjust focus.\n\nWork Environment:\n\nThe work environment described here is representative of that which an employee may encounter while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nThe standard analytical laboratory environment is one in which potential health hazards do exist. Administrative, operations, technical, and professional staff are expected to safely operate in accordance with applicable and appropriate health and safety policies and procedures, as prescribed by the applicable Kaycha manuals and policies and/or federal, state, or local standards.\n\nLaboratory staff can be expected to work in areas where hazards associated are with, but not limited to, airborne pathogens. Biological materials, hazardous substances, and radioactive material exist and are handled. Appropriate training is provided regarding these hazards and staff are expected to adhere to all health and safety policies at all times, whether they are in writing or verbalized by a supervisor.\n\nJob Type: Full-time\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nReferral program\nVision insurance\n\nSchedule:\n\nDay shift\nMonday to Friday\nWeekend availability\n\nApplication Question(s):\n\nBest email/phone number to reach you at?\nWhat is your desired compensation?\n\nEducation:\n\nHigh school or equivalent (Preferred)\n\nLicense/Certification:\n\nDriver's License (Preferred)\n\nWork Location: On the road","slug":"field-sampler-2e9971e6-7ffd-4131-aabf-f195c568db48","benefits":["Dental insurance","Health insurance","401(k) matching","Paid time off","Referral program"],"selectedSkills":["Driving","Driver's License","Communication skills","High school diploma or GED","21 years or older","Clean driving record","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=KWSxyB_RtAmiZ8SSB4-DxOjfNvLHhcaW3hZra4CtFbMlypnj6vZqMQ"},{"position":"LI entry level Chemistry Technician for Food/BioScience Testing Lab","labName":"Deibel Laboratories","location":"Lincolnwood, IL","age":"4 days ago","type":"Full-time","salaryMin":"$16 ","salaryMax":" $18 an hour","jobDescriptionCopy":"Deibel Labs is a private food and cannabis testing facility providing services in both food Microbiology and Chemistry testing. We play an integral role in food and product safety for industry-leading producers, as well as family run operations much like our own. Our location in Lincolnwood, LI is currently looking to hire a full-time Chemistry Technician (40 hours/week and benefits included). We offer a competitive salary based upon knowledge and experience. Deibel pays 100% of health insurance premiums for employee and 50% for dependence. Deibel also offers a self-funded dental plan, vision plan, and 401K option along with profit sharing. Please submit a resume for consideration.\nCheck out our website at www.DeibelLabs.com.\nCompensation: Starting hourly rates at $16 - $18/hr plus competitive benefits package.\nSchedule Offered:\nSunday - Thursday, Tuesday - Saturday, Monday - Friday(with rotating weekends) 9am to 5pm\nJob Description\nResponsibilities\n\nReagent login, makeup, storage, and disposal.\nChemistry Proximate testing which will include liquid-liquid extractions, dilutions, titrations, proper use of a balance.\nAssist in sample preparation, data analysis and paperwork for various instrumental methods used for Protein Leco, spectrometer, HPLC, GC etc.\nGeneral laboratory maintenance and house keeping.\n\nQualifications\nRequirements for Applicant:\n\nHigh School Diploma\n0-1 Years Experience.\nMust be able to stand and work efficiently in a fast paced environment.\nMust be highly motivated, detail oriented, critical thinker with good math skills.\nMust be able to lift 10lbs with each hand and pick up to 50lbs.\nMust be willing to learn Good Documentation Practices.\nMust work occasional holidays.\nMust be willing to have a flexible schedule for days that require overtime.\nMust also live within 40 miles of Lincolnwood IL. No relocation packages available.\nPrior experience working in a fast paced environment\n\nJob Type: Full-time\n\nPay: $16.00 - $18.00 per hour","slug":"li-entry-level-chemistry-technician-for-foodbioscience-testing-lab-17261652-81a7-4011-b7ba-b6812e99190b","benefits":["Health insurance","401(k)","Vision insurance","Profit sharing"],"selectedSkills":["Math","Spectrometer","High school diploma or GED"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=zgD57F0NR6il8Jf01Lpod58uRxROMarFcLppg_ung-fPGc2WZO7A6Q"},{"position":"Chemistry Laboratory Technician","labName":"Rm3 Labs","location":"Broomfield, CO","age":"12 hours ago","type":"Full-time","salaryMin":"$18 ","salaryMax":" $19 an hour","jobDescriptionCopy":"Company Description\n\nSince our founding in 2009, Rm3 Labs has been a leader in providing scientific analysis for the cannabis community of Colorado. As a fully independent, analytical laboratory located in Broomfield, we bring state-of-the-art scientific expertise and technology to help our clients produce safe, pure, and effective cannabis products. We are ISO/IEC 17025 accredited and licensed and certified by the State.\n\nJob Summary\n\nWe are looking for full-time Chemistry Laboratory Technicians to prepare samples for chemical analysis in one or more of our chemistry departments, assist with sample extractions and dilutions, and assist with other general laboratory tasks and projects.\n\nThe schedule for this position is Tuesdays through Saturdays from 10am – 6:30pm (the start time can be adjusted on Saturdays). During training (approximately first 1-2 months), the schedule will be Mondays through Fridays from 9am - 5:30pm. The schedule for this position is unlikely to change, so candidates must be comfortable with this schedule.\n\nBenefits include three weeks of paid time off, paid holidays, maternity/paternity leave, subsidized healthcare and dental insurance, holiday bonus based on performance, and professional development assistance.\n\nResponsibilities\n\nComply with State, Local, OSHA, and ISO 17025 requirements.\nFollow laboratory SOPs to weigh and prepare analytical samples for testing using balances, pipettes, fume hoods, vortexers, centrifuges, etc.\nAccurately record data in an organized, legible, and consistent manner.\nIdentify and document departures from the quality system and/or test procedures.\nVerify lab equipment before use to ensure they are within acceptable limits.\nPrepare lab reagents, working standards, and/or media and verify them before use.\nPerform general laboratory tasks such as inventory, sample archival and disposal, cleaning, and similar lab duties.\nAdhere to strict reporting deadlines.\nPerform special projects, as assigned.\nReport concerns to the Lead Chemist.\n\nRequirements\n\nMust be comfortable with the mentioned schedule.\nMust be a Colorado resident and at least 21 years old, no exceptions.\nMust have at least an Associate's Degree in Science, no exceptions.\nMust pass an extensive background check with no felony convictions and obtain a Colorado Department of Revenue – MED employee license prior to or at the time of hire.\nAble to work independently and part of a team in a fast-paced environment.\nAble to interact professionally with colleagues and bring up concerns immediately when you are faced with them.\nGreat written and verbal communication skills.\nExcellent laboratory troubleshooting skills.\nDetail and accuracy oriented.\nComputer skills and experience in Windows and Microsoft Office, particularly Excel.\n\nThe Ideal Candidate\n\nHas little experience working in a laboratory (this is an entry level position).\nIs comfortable performing repetitive tasks.\nThrives in a fast-paced environment and adapts well to change.\nHas experience handling large sample loads or would be able to easily adapt to large sample loads.\nHas a passion for cannabis or the cannabis industry.\n\nJob Type: Full-time\n\nPay: $18.00 - $19.00 per hour\n\nBenefits:\n\nDental insurance\nHealth insurance\nPaid time off\nParental leave\nProfessional development assistance\n\nSchedule:\n\n8 hour shift\nWeekend availability\n\nSupplemental Pay:\n\nBonus pay\n\nCOVID-19 considerations:\nAll employees and visitors must wear a mask.\n\nApplication Question(s):\n\nAre you a Colorado resident? We are only considering Colorado residents at this time.\nDo you already have a Marijuana Enforcement Division (MED) badge?\nAre you comfortable working Tuesdays through Saturdays from 10am - 6:30pm (start time on Saturdays can be adjusted to preference)? This schedule is unlikely to change.\nPlease list all the times you are available in the next two weeks for a 15-30 minute phone interview.\n\nEducation:\n\nAssociate (Required)\n\nWork Location: One location","slug":"chemistry-laboratory-technician-51588f79-3405-44b6-8cdd-3b2730a7d25e","benefits":["Dental insurance","Health insurance","Paid time off","Professional development assistance","Parental leave"],"selectedSkills":["Microsoft Excel","Windows","Computer skills","Laboratory experience","Communication skills","Associate's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=rskz07TA8LhDaOVrZpfkNN-0o9ybSO6mOFGuNScrtD2KIh-IQmRGmA"},{"position":"HPLC Technician","labName":"Curaleaf","location":"Winslow, NJ","age":"6 days ago","salaryMin":"$38,000 ","salaryMax":" $54,000 a year","jobDescriptionCopy":"Curaleaf Holdings, Inc. (CSE: CURA) (OTCQX: CURLF) (\"Curaleaf\") is a leading international provider of consumer products in cannabis, with a mission to improve lives by providing clarity around cannabis and confidence around consumption. As a high-growth cannabis company known for quality, expertise, and reliability, the company and its brands, including Curaleaf and Select provide industry-leading service, product selection, and accessibility across the medical and adult-use markets. In the United States, Curaleaf currently operates in 23 states with 123 dispensaries, 25 cultivation sites, and over 30 processing sites, and employs over 5,000 team members. Curaleaf International is the leading vertically integrated cannabis company in Europe with a unique supply and distribution network throughout the European market, bringing together pioneering science and research with cutting-edge cultivation, extraction, and production. Home | Curaleaf | Cannabis with Confidence\n\nOur corporate social responsibility is Rooted In Good Diversity, Equity, Inclusion + Social Equity + Sustainability Social Responsibility | Curaleaf | Cannabis with Confidence We believe in taking corporate and social responsibility very seriously, from our educational outreach to national partnerships, state-wide initiatives and local causes. Giving back to the communities where we operate is important to us, and helps to change old attitudes by showing the positive impact of cannabis in creating jobs, changing lives, and helping local communities.\n\nWe educate. We advocate. We give.\n\nThe HPLC Lab Technician carries out day-to-day tasks including: testing, prepping, extracting, and packaging. The HPLC Lab Technician must monitor and maintain production facility in accordance with the state of New Jersey and standards set by the Company.\n\nResponsibilities:\nDevelop and execute validation of analytical systems\nOperate spectrophotometer and viscosity meter for QC\nAssist in production; calculating requirements; assembling and weighing plant material and supplies for supercritical CO2 extraction: emptying of extraction vessels.\nOperating highly sophisticated extraction equipment; Processing concentrates and extracts\nCleaning and maintenance of extraction equipment and laboratory facility following current good manufacturing practices (cGMP), and standard operating procedures; complying with legal regulations; monitoring environment\nOperating, maintaining, and making adjustments and repairs to laboratory equipment such as analytical systems, pumps, microscopes, balances, rotary evaporator, centrifuges, and other laboratory equipment\nCreating dilutions, HPLC diagnostics and repair, calibration\nMaintaining inventory records of supplies, materials, and equipment, and preparing requisitions as needed\nStoring supplies and equipment, and keeping laboratory, storerooms and working areas immaculate\nWashing and sterilizing laboratory glassware\nPerforming clerical work related to laboratory activities such as word processing, record keeping, and filing\nAssist in packaging of final products as needed\nAssist in the training of other technicians\nWork with state licensed third party testing lab to ensure QC\nPerforms related duties as assigned\n\nCompliance:\nEnsure processing operation is fully compliant with state and federal regulations\nMaintain analytical and other laboratory waste with registered waste disposal company while following state regulations\nMaintaining material safety data sheets for all department chemicals and products\nAssure that operation adheres to all business and industry license requirements.\nMaintaining strict inventory records of all plant materials, chemicals and equipment used in the laboratory and documents production by completing forms, reports, logs and records\n\nJob Qualification Requirements:\nBachelor's Degree preferred/ 1-2 years' experience in a laboratory or manufacturing setting required\nQA/QC Experience with HPLC and GC analysis\nExperience with Agilent equipment using ChemStation\nMust be at least 21 years of age\nSubject to background check per state cannabis regulations\nCapacity to work independently and/or with vendors, perform troubleshooting and solve complex problems.\nThe qualified individual will possess a keen interest and knowledge of Organic and Inorganic chemistry.\n\nCuraleaf is an Equal Opportunity Employer\n\nCuraleaf is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.","slug":"hplc-technician-e496ac0d-fd45-417d-9911-acdbafbcae18","benefits":[],"selectedSkills":["Gas chromatography","Laboratory experience","Analysis skills","Manufacturing","QA/QC","Bachelor's degree","Background check","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=u9Rmy9p0DohjMx9CtqzQu-QI7ttWr0DQfewVyOpM3CiqbPqTid1spg"},{"position":"Administrative Assistant - Sample Intake & Reporting","labName":"The Spott","location":"Kalamazoo, MI","age":"1 day ago","type":"Full-time","salaryMin":"$12 ","salaryMax":" $17 an hour","jobDescriptionCopy":"The Spott is a state licensed and ISO/IEC 17025:2017 accredited Cannabis safety compliance facility located in Kalamazoo, MI. The Spott provides comprehensive safety testing for Cannabis products to ensure compliance with regulatory requirements. We are seeking a Administrative Assistant to join our team. The primary role of this position is to perform Sample Intake and Reporting tasks. This is an exciting opportunity to work in the emerging, rapidly growing, and fast paced environment of Cannabis laboratory safety testing.\n\nDUTIES & RESPONSIBILITIES\n\nField Sampling\n\nServe as the primary point of contact for licensed facility clients and assist them sample submission and testing requirements.\nCoordinate client sampling needs with field sampler availability and maintain field sampling schedule.\nReview sampling records and transfer manifests for accuracy and facilitate corrections as needed before performing sample intake process.\n\nSample Intake & Reporting\n\nIdentify sample intake issues and bring issues to the attention of management for quick resolution.\nAssist walk-in customers, taking orders, completing paperwork, and payments.\nEnter new orders and samples into laboratory information management system (LIMS) and METRC.\nUpload test results into LIMS, generate reports, and check for accuracy.\nEnter licensed facility test results into METRC.\n\nAdditional Duties\n\nAssist in answering incoming customer calls regarding billing issues, service questions, and general client concerns.\nPerform any other tasks that may be required.\n\nMINIMUM QUALIFICATIONS\n\nHigh school diploma or equivalent is required.\nMust be 21 or older.\nMust pass a background check.\nMust live within commuting distance of Kalamazoo, MI.\nExcellent verbal and written communication skills.\nAbility to maintain a high degree of attention to detail and accuracy.\nProficiency with the Microsoft Office suite and Google equivalents.\nAbility to work independently and as a team member and to adapt to a changing environment and handle multiple priorities.\nAbility to multi-task, prioritize, work under pressure, and meet deadlines.\nPersonal integrity, disciplined work ethic, and organization skills.\nBe able to work Monday thru Friday, 10 AM - 6 PM, and Saturday as needed.\n\nTHE IDEAL CANDIDATE WOULD ALSO POSSESS\n\nA positive attitude and self-motivation\nGreat interpersonal and customer service skills.\nPrevious experience with METRC.\nSome knowledge of Cannabis.\nFamiliarity with analytical or microbiological science.\n\nNote: The Spott supports the Michigan Marijuana Social Equity program and is an Equal Opportunity Employer.\n\nJob Type: Full-time\n\nPay: $12.00 - $17.00 per hour\n\nBenefits:\n\nDental insurance\nEmployee discount\nHealth insurance\nLife insurance\nVision insurance\n\nSchedule:\n\n8 hour shift\nMonday to Friday\nWeekend availability\n\nApplication Question(s):\n\nAre you willing to undergo a background check, in accordance with local law/regulations?\n\nEducation:\n\nHigh school or equivalent (Preferred)\n\nExperience:\n\nData Entry: 2 years (Preferred)\n\nWork Location: One location","slug":"administrative-assistant-sample-intake-reporting-7e342630-9260-4759-939d-ba2643477e3a","benefits":["Dental insurance","Employee discount","Health insurance","Vision insurance","Life insurance"],"selectedSkills":["Customer service","Communication skills","Microbiology","Data entry","Microsoft Office","High school diploma or GED","21 years or older","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=t_-EEBuO6lbmogJq9-9sIWkrLU15xSceVvvlpiDby_qwj4jYsQstvg"},{"position":"Lead Microbiology Analyst","labName":"Rm3 Labs","location":"Broomfield, CO","age":"2 days ago","type":"Full-time","salaryMin":"$23 ","salaryMax":" $26 an hour","jobDescriptionCopy":"Company Description:\n\nSince our founding in 2009, Rm3 Labs has been a leader in providing scientific analysis for the cannabis community of Colorado. As a fully independent, analytical laboratory located in Broomfield, we bring state-of-the-art scientific expertise and technology to help our clients produce safe, pure, and effective cannabis products. We are ISO/IEC 17025 accredited and licensed and certified by the State.\n\nJob Summary:\n\nWe are looking for a full-time Lead Microbiology Analyst to lead the Microbiology team; assign and supervise its work; assist with special laboratory projects; and, as a team member, perform microbiological tests, analyze and record test results.\n\nThis position requires being in the lab Tuesday through Saturday from 10am – 6:30pm. The person that fills this position may choose to start earlier on Saturdays. The schedule for this position is unlikely to change, so the candidate must be comfortable with a Tuesday through Saturday shift.\n\nBenefits include three weeks of paid time off, six paid holidays, maternity/paternity leave, subsidized healthcare and dental insurance, performance-based bonus, and professional development assistance.\n\nJob Responsibilities:\n\nAssign and supervise the daily work flow of the team, including Total Yeast and Mold (TYAM), qPCR, and water activity testing.\nEnsure an environment of professionalism and continuous quality and method improvement.\nEnsure laboratory operations maintain quality and comply with State, Local, OSHA, and ISO 17025 requirements.\nMonitor the performance of the team to ensure productivity and efficiency.\nWith the Laboratory Director, establish and regularly review/update written standard operating procedures (SOPs).\nLead corrective action investigations when nonconformances to the quality system and/or test procedures are identified and documented.\nProvide training to personnel on proper lab methods, procedures, and techniques.\nAssist team members with problem solving and troubleshooting.\nIdentify and research of new technologies and methodologies to improve laboratory processes and techniques.\nWhen performing sample analysis, follow all relevant SOPs and meet all other relevant duties of a Microbiology Analyst.\nParticipate in 6-month and annual reviews of team members.\nReport concerns to the Laboratory Director.\nPerform special projects, as assigned by the Laboratory Director.\n\nRequirements\n\nMust be a Colorado resident and at least 21 years old, no exceptions.\nMust have a BS or BA in chemistry, biochemistry, or related field and at least 3 years of full-time laboratory testing experience, no exceptions.\nMust pass an extensive background check with no felony convictions and obtain a Colorado Department of Revenue – MED employee license prior to or at the time of hire.\nMust be comfortable working Tuesday through Saturday from 10am – 6:30pm (can start earlier on Saturday).\nMust have significant experience with qPCR and/or culture-based plating.\nAble to work independently and part of a team in a fast-paced environment.\nAble to interact professionally with colleagues and bring up concerns immediately when you are faced with them.\nGreat written and verbal communication skills.\nExcellent laboratory troubleshooting skills.\nDetail and accuracy oriented.\nComputer skills and experience in Windows and Microsoft Office, particularly Excel.\n\nThe Ideal Candidate\n\nThrives in a fast-paced, professional, and fun work environment.\nIs a great leader, self-motivated, curious, and focused on continual improvement.\nExperience working in Biosafety Cabinets using aseptic technique is a strong plus.\nExperience with other analytical instrumentation is a strong plus.\nExperience in high throughput, regulated, or ISO/IEC 17025 accredited labs is a strong plus.\n\nJob Type: Full-time\n\nPay: $23.00 - $26.00 per hour\n\nBenefits:\n\nDental insurance\nHealth insurance\nPaid time off\nParental leave\nProfessional development assistance\n\nSchedule:\n\n8 hour shift\nDay shift\nWeekend availability\n\nSupplemental Pay:\n\nBonus pay\n\nCOVID-19 considerations:\nWe require employees to wear masks.\n\nApplication Question(s):\n\nDo you currently live in Colorado? Unfortunately, we cannot consider out of state residents due to the need to fill this position quickly.\nAre you comfortable with a Tuesday - Saturday shift (10am – 6:30pm Tues – Fri; can start earlier on Saturday). This schedule is unlikely to change, so we want to make sure all candidates are comfortable with this work schedule.\nList all the times you are available for a 15-20 min phone interview in the next two weeks. Please do not leave this blank.\n\nEducation:\n\nBachelor's (Required)\n\nExperience:\n\nfull-time laboratory testing: 3 years (Required)\n\nWork Location: One location","slug":"lead-microbiology-analyst-28eb5e93-0870-4730-bb8a-32dbb1df3d41","benefits":["Dental insurance","Health insurance","Paid time off","Professional development assistance","Parental leave"],"selectedSkills":["Microsoft Excel","Windows","Computer skills","Laboratory experience","Communication skills","Bachelor of Science","Bachelor's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=WFqRR6t9cuEPhir3qvGXFzBDN1LE8DbjGc98J5RnqM2SA-KlOnUufg"},{"position":"Selection Specialist","labName":"ACT Laboratories, LLC","location":"Morton, IL","age":"8 days ago","type":"Full-time","jobDescriptionCopy":"About us\n\nACT Laboratories, LLC operates a network of laboratories across the Midwest and Northeast providing state regulated cannabis testing for our clients. Working with the largest medical marijuana retailers, ACT Laboratories prides itself on accurate reliable testing, exemplary responsive customer service, and professional knowledgeable technical services. Act collaborates with state provided cannabis programs to ensure standards are met or exceeded within our company. We encourage military veterans and retired law enforcement to consider joining the ACT team to bring your professional experience and respected training to our company.\n\nACT Laboratories\nJob Description\n\nJob Title: Selection Specialist\nReports To: Selection Specialist Manager\nDate: February 24, 2022\n\nJob Summary:\nCollect and transport sample from client location to laboratory location.\n\nEssential Duties and Responsibilities:\n\nCollect samples from client locations and transport to laboratory in as safe and efficient manner while following state regulations in a company vehicle\nKeep inventory of essential items needed to perform sampling procedures\nMaintain sterility of samples and sampling kits\nInform leadership on emerging compliance and customer issues\nMaintain logs relevant to sample collection and sterilization of equipment\nInform the Senior Driver/Laboratory Manager when vehicles need maintenance\nEstablish and maintain productive working relationships with people inside the laboratory and people outside the laboratory including customers, regulatory staff and corporate staff\n\nSupervisory Responsibilities:\nNone\n\nAdditional Responsibilities:\n\nClean and sanitize the laboratory\nAutoclave tongs\nPerform waste disposal\nPerform inventory of laboratory supplies\nPerform other duties as may be assigned\n\nQualifications:\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily.\nThe requirements listed below are representative of the knowledge, skills, and/or abilities required.\nReasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nEducation and/or Experience:\n\nHigh School Diploma or equivalent\n1 year of customer service experience preferred\nSome laboratory experience preferred\n\nKnowledge, Skills and Abilities Required:\n\nKnowledge of federal, state and local laws regarding testing and transport of cannabis products preferred\nKnowledge of cannabis industry\nAbility to follow standard operating procedures\nAbility to drive safely to and from client facilities (not applicable at New York laboratory)\nBasic knowledge and understanding of seed to sale tracking systems\nBasic understanding of the tests the laboratory performs\nAbility to keep a professional and courteous demeanor in day-to-day operations\nBasic knowledge and understanding of Microsoft Office\nAbility to use computers and computer software programs and systems and standard office equipment such as phones, photocopiers and fax machines\nGood written and verbal communication skills to convey and receive information effectively (face-to- face, telephone and electronic)\nGood analytical and judgment skills\nDetail-oriented\nAbility to maintain confidentiality regarding test results\nExcellent organizational skills to work independently, prioritize, handle multiple tasks, manage time\n\nCertifications, Licenses, Registrations:\nValid Driver’s License required\n\nSafety Sensitive Position:\nEquipment or vehicles used and activities performed by this position that could cause serious injury or death to the operator, other employees and/or other individuals if not used properly or safely:\n\nDriving a vehicle\nWorking around testing equipment\nPerforming waste disposal\n\nPhysical Demands:\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nProlonged periods of driving a vehicle and using hands to handle, control a vehicle\nProlonged periods of walking/moving around and standing, talking and hearing and using hands to handle objects\nOccasional periods of stooping/kneeling, bending\nLifting up to 10 pounds regularly and up to 25 pounds occasionally\nClose vision and ability to focus on computer screens and documents; distance vision; peripheral vision; depth perception\n\nWork Environment:\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. The employee works in a laboratory environment and if applicable travels to client locations throughout the state.\n\nWhile performing work related duties, the employee occasionally works in elevated places and if applicable, around fumes or airborne particles and must be aware of outdoor weather conditions for the purpose of travel.\n\nThe noise level in the work environment is usually moderate.\n\nStressful Conditions in the Work Environment Affecting This Position:\n\nChallenging work demands include heavy workload/work quantity and quality demands, infrequent rest breaks, and long or unpredictable work hours\nChallenging situations including dealing with difficult customers/employees/vendors\n\nWork Schedule:\nThe position is full time requiring varying shifts Monday through Friday to cover business operations.\nWork week hours will vary between 40 and 60 hours both in the laboratory and if applicable, traveling to client locations during weekends and holidays.\n\nThis job description is intended to describe the essential functions of and requirements for the successful performance of this position. It is not to be interpreted as an exhaustive statement of duties, responsibilities or requirements of this position, nor is it intended to limit the authority of any manager to assign and direct the activities of employees under his or her direction.\n\nJob Type: Full-time\n\nPay: From $15.00 per hour\n\nBenefits:\n\n401(k)\nDental insurance\nDisability insurance\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\nMonday to Friday\n\nEducation:\n\nHigh school or equivalent (Preferred)\n\nWork Location: On the road","slug":"selection-specialist-3c949df5-c220-454b-8357-143287fa1bd9","benefits":["Dental insurance","Health insurance","Disability insurance","Paid time off","401(k)"],"selectedSkills":["Analysis skills","Customer service","Driver's License","Laboratory experience","Communication skills","High school diploma or GED"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=5&job=cK-1wn8pO-OF8Bcgmgy6g-XmjbkcdEV9_iJxNXDgoaVPrTU2VX8Rxw"},{"position":"Accounting Clerk","labName":"Kaycha Labs","location":"Fort Lauderdale, FL","age":"8 days ago","type":"Full-time","jobDescriptionCopy":"Company Overview:\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\nEssential Duties & Responsibilities:\n\nEnter A/P invoices\nMatch supporting documentation to Credit Card transactions\nFiling\nMail payments\nOther duties as assigned to support Accounting Manager\n\nEducation & Experience:\n\nBachelor’s degree in accounting, finance or general business administration preferred.\nSage X3 Experience (2-3 years, preferred)\n\nSkills, Abilities and Competencies:\n\nExcellent verbal and written communication skills.\nTeam-oriented individual with strong attention to detail\nSolid organization skills, such as multitasking and effective time-management\nMulti-tasker who can prioritize tasks to achieve time-sensitive deadlines\n\nOther:\n\nMust pass Level 2 background check.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.f.\n\nEssential Functions:\n\nThe physical demands described here are representative of those that an employee must meet to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nWhile performing the duties of this job the employee is frequently required to stand, handle or feel, to speak, and to hear. The employee is occasionally required to walk, sit, reach with hands and arms, bend, kneel, crouch, or crawl. The employee must frequently lift and/or move up to thirty-five (35) pounds.\n\nSpecific vision abilities required for this job include close (proximity) vision, depth perception, and the ability to adjust focus.\n\nWork Environment:\n\nThe work environment described here is representative of that which an employee may encounter while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nThe standard analytical laboratory environment is one in which potential health hazards do exist. Administrative, operations, technical, and professional staff are expected to safely operate in accordance with applicable and appropriate health and safety policies and procedures, as prescribed by the applicable Kaycha manuals and policies and/or federal, state, or local standards.\n\nLaboratory staff can be expected to work in areas where hazards associated are with, but not limited to, airborne pathogens. Biological materials, hazardous substances, and radioactive material exist and are handled. Appropriate training is provided regarding these hazards and staff are expected to adhere to all health and safety policies at all times, whether they are in writing or verbalized by a supervisor.\n\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.\n\nThe above is intended to describe the general content of and requirements for the performance of this job. It is not to be construed as an exhaustive statement of duties, responsibilities, or physical requirements. Nothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions\n\nJob Type: Full-time\n\nPay: From $16.00 per hour\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nDisability insurance\nEmployee assistance program\nFlexible spending account\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nPhysical Setting:\n\nOffice\n\nSchedule:\n\n8 hour shift\nDay shift\nMonday to Friday\nOvertime\n\nApplication Question(s):\n\nBest email and phone number to reach you at?\nDesired compensation?\n\nEducation:\n\nBachelor's (Required)\n\nExperience:\n\nSage X3: 2 years (Preferred)\nAccounts payable: 2 years (Preferred)\n\nWork Location: One location","slug":"accounting-clerk-2f051007-8d80-4be5-a28e-c0b8ece892ff","benefits":["Dental insurance","Health insurance","401(k)","Flexible spending account","Employee assistance program"],"selectedSkills":["Sage","Accounts payable","Communication skills","Time management","Bachelor's degree","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=5&job=Pdmo_85aVe0xpAa6sMXLm0aM3AIc8n6-yRQFBlAKMTWitLYUETOY9w"},{"position":"HVAC Technician","labName":"Parallel","location":"Franklin, MA","age":"4 days ago","type":"Full-time","salaryMin":"$27 ","salaryMax":" $30 an hour","jobDescriptionCopy":"Everyone is welcome here. Each of us is unique, and that’s what makes us amazing. We believe in inclusiveness and celebrating each person’s individuality, because there’s power in bringing people with different points of view and life experiences together. That’s why we provide equal employment opportunities (EEO). All applicants are considered regardless of race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, or sexual orientation.\n\nSo, bring yourself and your best ideas; when we feel safe and comfortable being ourselves, there’s no limit to what we can achieve.\n\nIN A NUTSHELL…\n\nThe Facilities HVAC Tech 2 provides support to the facilities operation during the initial set up phase and ongoing operation thereafter. They provide guidance to ensure the Facilities department is operating best in class.\n\nThis role is with NETA, one of the renowned retail brands under the Parallel umbrella. Parallel is one of the largest multi-state cannabis companies in the world, owning and operating in five markets; Florida (Surterra Wellness), Massachusetts (NETA), Pennsylvania (Goodblend), Nevada (The Apothecary Shoppe) and Texas (Goodblend). If you enjoy companies that are growing, moving fast, and constantly challenging themselves to achieve more, then Parallel is for you. We work hard, lean on each other, and are passionate about a pretty ambitious vision … pioneering a new paradigm of what well-being can be for all people, everywhere. For more information, visit www.liveparallel.com.\n\nWHAT YOU WILL BE DOING:\nRepair and maintain Industrial HVAC, plumbing and mechanical equipment in accordance with diagrams, sketches, operating manuals, manufacturers' specifications or supervisor s instructions, using hand and power tools, precision measuring or testing devices. Responsible for complete maintenance of area of assignment.\nRead blueprints; understand and read computerized HVAC, Electrical, plumbing system and building layouts.\nObserve and adjust a wide variety of equipment, machines and devices in operation to assure proper operation, including pumps, refrigerant recovery, engines, motors, compressors and laboratory equipment.\nDismantle machines and devices for servicing, repair, or replacement of parts.\nObserve Parallel Policies & Procedures for daily operations and fully complies with state medical marijuana regulations at all times.\nPerform preventative maintenance and maintains a scheduled maintenance program to ensure proper facilities upkeep, including all mechanical, electrical and plumbing infrastructure and equipment.\nEffectively using CMMS tracking systems to report receipt of maintenance needs and/or other issues.\nRespond to facility related failures or emergencies promptly and prioritizes work orders, while maintaining preventative tasks in accordance with facility needs.\nPerform routine maintenance tasks, preventative systems and repairs.\nComplete all required documentation for utility and facility management, follows up and evaluates effectiveness of all implemented actions to ensure that problem has been resolved effectively.\nEnsure safe work practices are implemented and consistently followed by department staff.\nWork with other departments in addressing and rectifying potentially unsafe work conditions or practices.\nEnsure compliance with applicable building codes, fire and emergency codes, regulatory and other required regulations.\nResponsive and professional in all response and interactions regarding service requests and facility needs.\nAble to work carefully and efficiently in a fast-paced environment.\nWork in coordination with the Supervisor and Manager to help upgrade all systems and streamline as needed to function in the most efficient and effective manner.\nAfter hours on call availability.\nPerform other job duties and tasks as assigned.\n\nEXPERIENCE AND SKILLS YOU’LL BRING:\nTechnical school graduate or equivalent industrial operations experience (Required).\nHVAC Certification and Refrigeration Recycle Recovery license (Required).\nDemonstrate competency in performing routine maintenance tasks, preventative systems and repairs.\nAbility to read blueprints; ability to understand and read computerized HVAC, Electrical, plumbing system and building layouts.\nMin 7 years of progressively responsible work-related experience and any combination of education and training which provides the required knowledge, skills and abilities to perform the essential functions of the job, combined with demonstrated professional growth and achievement.\nAge 21 or over (Required).\nHigh School Diploma or equivalent (Required).\nValid Government-Issued Photo ID (Required).\n\nYOU WILL BE SUCCESSFUL IF YOU…\nAre self-motivated; micro-managing isn’t fun for anyone.\nRoll your sleeves up and do the work; strategy is important, but so is getting stuff done.\nCan work fast and be flexible; our industry is always changing.\nPlay nice with others; we collaborate with each other a lot.\nThink creatively; sometimes, the “traditional” solution isn’t the best one.\n\nWHAT YOU GET:\nConsistent, reliable benefits; Full medical/vision/dental, 401k with a possible company match, access to company-sponsored well-being programs\nBalance and flexibility; paid time off, paid parental leave, flexible work arrangements.\nFinancial opportunity; an incentive program that provides opportunity to earn cash AND equity in a fast-growing company and industry\nEmployee discount.\nChance to make a difference; Employee Relief Fund, community volunteerism opportunities through Benevity.\n\nPHYSICAL REQUIREMENTS:\nThe person in this position frequently communicates with other employees/customers. Must be able to communicate accurate information in these situations.\nMust be able to travel up to 5%-10% of the time.\nMust be able to move around the production facilities up to 30% of the time.\nMust be able to work in an environment which is noisy and with temperature fluctuations from 60 degrees to 90 degrees.\nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\nConstantly operates a computer and other office productivity machinery.\n\nPARALLEL IS UNITED BY OUR VISION, MISSION, & VALUES:\nOur Vision – why we exist – is to pioneer well-being and improve the quality of life for humanity through the benefits of cannabinoids.\n\nOur Mission – how we will do this – is to build a leading, global well-being company through the best talent, our values, trusted and recognized brands, science and technology-based innovation, and a relentless focus on execution and continuous improvement.\n\nOur Values – Integrity | Collaboration | Alignment | Intentionality | Accountability | Agility\n\nWe are an Equal Opportunity Employer. We embrace and encourage our employees’ differences in age, color, disability, ethnicity, gender identity or expression, language, national origin, physical and mental ability, political affiliation, race, religion, sexual orientation, socioeconomic status, veteran status, and other characteristics that make our employees unique.","slug":"hvac-technician-699e2c86-2ba5-43bb-b720-f27eb82c9be6","benefits":["Dental insurance","Employee discount","Health insurance","401(k) matching","Paid time off"],"selectedSkills":["Precision measuring instruments","CMMS","EPA Refrigeration Certification","HVAC Certification","HVAC","High school diploma or GED","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=5&job=t0ngzMtTr8uhw5sigVp9mnXyjYORGM1VdpE2iMB-ekTEfokq3G7dLQ"}]