[{"position":"LIMS Implementation Specialist","labName":"Cloud LIMS","location":"Wilmington, DE","age":"6 days ago","type":"Full-time","salaryMin":"$66,000 ","salaryMax":" $87,000 a year","jobDescriptionCopy":"This is not a full time vacancy, it is a project based vacancy. Candidate can work from anywhere in the world.\nAbout CloudLIMS\n\nCloudLIMS.com is an ISO 9001:2015 certified informatics company. Our SaaS, in the cloud Laboratory Information Management System (LIMS), CloudLIMS, helps biorepositories, analytical, diagnostic testing and research laboratories, manage data, automate workflows, and follow regulatory compliance at zero upfront cost. We are looking for a Domain Expert. The position can be remote or you may work from our office in Indore. We have been recognized as an Organization with Best Employee Relations Practices, as well as an Employer of Choice in India by the World HRD Congress. Know more: https://cloudlims.com/about-us/awards.html\n\nOur mission is to digitally transform and empower laboratories across the globe to improve the quality of living. We build a digital tool called Laboratory Information Management Systems (LIMS) that manages all the information & data flow for analytical and clinical laboratories. We have enabled hundreds of analytical testing labs to help keep food, air, water, soil fit for public consumption. We have partnered with biobanks, clinical research & COVID-19 testing laboratories in the fight against life threatening disease & the pandemic. We have created a positive change in the society through responsible business practices of caring for the well-being of people and of making the world a better & safer place to live in.\n\nOur Culture\n\nAt CloudLIMS, you're valued not only for what you know, but also for how you think and collaborate. We encourage an open culture and respect differences. We try to future proof business operations and achieve sustainability. For doing so, we keep looking for extremely talented individuals and ideas to contribute to what we do which is where you come in. Read more: https://cloudlims.com/careers/life.html\n\nOur Team\n\nYou'll be interacting with product owners, customer success teams and software engineers. You'll join a close-knit team of top talent to define the next-generation of our cloud-based product, used globally by many users. As a result, we are seeking talented domain experts with proven success to join our team on project basis.\n\nWhat will you learn?\n\nAt CloudLIMS, we believe in learning and adapting well to changing environments to perform the best over time. As an organization, we invest heavily in building talent and provide our employees with ample opportunities to grow into larger roles with more responsibilities.\n\nYou will manage the feature backlog and development to ensure that priorities adhere to the strategic direction outlined by the organization.\nYou will identify, analyze, and write the multiple industry workflow features in an industry-standard format and validating the features before they go live.\nYou will perform market research and collects customer feedback\nYou will study products on the market in order to create a better product.\nYou will work closely with the development team to provide solutions to requirements and the issues impacting customers\nYou will build and maintain industry-specific background.\n\nWhat will you be doing?\n\nAnalyze and document customer requirements and business processes.\nTailor CloudLIMS LIMS solution and implement it through configuration.\nDeliver training courses to the customer project team.\nAssist customers with their validation and testing stages appropriate to their industry.\nDeliver instrument integration and software integration (Quickbooks, EMR, ELN) projects.\nConfigure test reports, CoAs, labels and barcode as per client specifications.\nAssist in system validation & IQ, OQ and PQ scripting.\n\nRequired\n\nQualification in Science and/or Information Technology.\nHands-on experience in laboratory informatics and environmental/cannabis/material testing LIMS.\nKnowledge in laboratory or QC processes.\nExcellent communication (both written and verbal) and presentation skills.\n\nNice to have\n\nKnowledge of analytical laboratory workflows along with compliance needs\nExperience in writing software specification documents and OQ's","slug":"lims-implementation-specialist-5bd34ef7-35c6-4857-bfa0-2777e4627803","benefits":[],"selectedSkills":["Laboratory experience","QuickBooks","Quality control","IT"],"jobType":"free","applyURL":"https://cloudlims.kekahire.com/jobdetails/7142"},{"position":"Investigator","labName":"Cannabis Control Commission","location":"Worcester, MA","age":"2 days ago","type":"Full-time","salaryMin":"$70,000 ","salaryMax":" $80,000 a year","jobDescriptionCopy":"PURPOSE OF THE JOB\n\nThe Cannabis Control Commission (Commission) Investigator conducts inspections and investigations of licensed marijuana establishments in the Commonwealth to ensure understanding and compliance with laws, rules, and regulations. A significant component of this position includes visiting marijuana establishments across the Commonwealth and completing regulatory compliance inspections/audits targeting operational requirements, and may include specific cultivation product manufacturing and, retail requirements as pertains to the license type, as well as facility management requirements. Investigator(s) assist in the administration of the registration and licensing compliance process for marijuana establishments and individual registered marijuana establishment agents as defined in the regulations.\n\nESSENTIAL FUNCTIONS AND RESPONSIBILITIES\n\nConducts and reports about on-site inspections of marijuana establishments;\nTracks compliance with all relevant laws and regulations through on-site visits, auditing, and inspection of records;\nResponds to inquiries from all the parties, constituents, and/or the public by providing outstanding customer service in a reasonable timeframe via on-site visits, telephone, email and/or other written correspondence;\nAssists with ongoing documentation and implementation of Commission policies and procedures to reflect best practices in this new industry;\nReviews policies, processes, and oversight of marijuana establishments to ensure compliance with the regulations (examples of specific policies may include: security policies; product safety policies, sanitation, and waste disposal policies). Conducts investigations in a reasonable time frame by developing investigative plans, gathering, verifying, analyzing, and reviewing documents relating to any investigation or inquiry pursuant to state law and regulations; Conducts investigative conferences, interviews witnesses, parties and requesting production of documents through request(s) for information;\nReviews the implementation of marijuana establishment policies and procedures to ensure the security of the cultivation, processing and dispensing of marijuana;\nReviews marijuana establishment processes and procedures for determining the placement and proper use of surveillance cameras and other security controls;\nReviews standards and implementation for storage facilities regarding the use of lighting, ventilation, labeling, security procedures, access controls, etc.;\nInspects procedures outlined in the marijuana establishment operational documents to ensure compliance with required seed-to-sale tracking;\nReviews and assesses protocols for the testing of marijuana and marijuana products;\nReviews all operational policies and procedures, such as: quality control, record keeping and reporting, staffing plans, human resources policies, staff training, business records for accounting administration and operations standards;\nResponds to rule violations, incidents, or complaints by issuing deficiency statements in a timely manner and evaluating and approving plans for corrective action;\nDrafts investigative memoranda and other reports;\nRepresents Commission in administrative or court hearings related to non-compliance;\nConfers with parties to complaints to resolve issues and encourage compliance with established laws, rules, and regulations through settlement, where appropriate;\nObtains evidence and establishes facts concerning non-compliance with laws, rules, and regulations regarding marijuana cultivation, processing, and distribution;\nMaintains thorough documentation of inspections and makes corrective action recommendations;\nMakes appropriate referrals and other legal issues arising from investigations to Enforcement Counsel in collaboration with the Director of Investigations;\nSummarizes and make appropriate recommendations by writing factually sound reports by applying relevant evidence and legal analysis;\nComplies with quality control procedures to ensure information is accurate and complete;\nMaintains a caseload and updated records in case management system.\n\nOTHER DUTIES AND RESPONSIBILITIES\n\nMaintain the highest standards of personal, professional and ethical conduct and support the Commission’s goals for a diverse and culturally aware workforce;\nMaintains professional relationships with assigned agency personnel and various private, local, state and federal agencies;\nMakes relevant referrals to appropriate state, local and federal agencies;\nCommunicates and, if assigned, works collaboratively with state and local agencies, including law enforcement and local boards of health;\nResponds to inquiries and complaints to provide information concerning medical use of marijuana and adult-use of marijuana laws, regulations, rules, and procedures;\nPerforms related duties such as maintaining records, attending meetings, and preparing correspondence including emails and letters;\nAssists in determining compliance with applicable laws and standards and recommending enforcement actions and corrective measures;\nPerforms other related duties as assigned.\n\nBenefits Package:\nThe Commission is pleased to offer a comprehensive benefits package to its employees. The specific components and eligibility may vary based upon position classification, hours worked per week and other variables. Therefore, specific benefits for this position may be discussed as part of the interview and offer process.\n\nThis position is non-civil service. This position is an exempt position.\n\nThe overall benefits available include: paid vacation, sick and personal leave time, health, dental and vision insurance through the Commonwealth’s Group Insurance, and optional pre-tax Health Savings Account plans.\n\nIn addition, the Commission provides employees the opportunity to elect life insurance, long-term disability insurance, deferred compensation savings, tuition remission and pre-tax commuter account plans, along with other programs.\n\nThe Commission employees also participate in the Commonwealth’s State Retirement Plan, which can become a defined benefit plan for those that both vest and subsequently retire from State service. Follow this link for additional retirement information: http://www.mass.gov/treasury/retirement/state-board-of-retire/.\n\nCommitment to Diversity:\nThe Commission is committed to building a diverse staff across its entire agency and at all levels. The Commission is an equal opportunity/affirmative action employer.\n\nApplication Process and Deadline:\nThe Commission encourages interested candidates that meet the minimum requirements for experience and skills to apply for this position. Interested candidates should submit a cover letter and resume by e-mail no later than Friday, June 3, 2022. The application package should be submitted to:\n\ncareers@cccmass.com\n\nPlease include the position title in the subject line: CCC Investigator.\n\nSubmissions are due by 5:00 pm (e-mail) on Friday, June 3, 2022, late submissions may be considered solely at the discretion of the Commission.\n\nNotice of Required Background Check – Including Tax Compliance:\n\nThe Commission requires a background check on all prospective employees as a condition of employment. Candidates should be aware of this requirement but should also know that such background check is not initiated until:\n\nA candidate is invited to a second or subsequent interview, and\nThe candidate has signed the Background Check Authorization Form and related releases.\n\nThis background check includes a Criminal Offender Record Information (CORI) check, Federal IRS, and Department of Revenue state tax compliance on all prospective employees as a condition of their employment.\n\nThe Cannabis Control Commission reserves the right to conduct and or require a physical pre-employment screening, in addition to drug and alcohol testing at its sole discretion.\n\nCandidates with advanced degrees and professional licenses may have these credentials verified. Individuals other than those references provided by a candidate may be contacted while completing a full background and qualification check.\n\nThose candidates invited to interview will be contacted by the Commission. Unfortunately, due to the anticipated high volume of applicants for this vacancy, we are unable to provide status updates to specific individuals.\n\nQualifications\n\nKNOWLEDGE AND SKILLS\n\nAbility to operate a motor vehicle;\nPossesses a valid Motor Vehicle Operator's License from Massachusetts or another state;\nAbility to establish rapport with persons from different ethnic, cultural and/or economic backgrounds;\nAbility to use investigative techniques to obtain information;\nAbility to gather information from questioning individuals and observation;\nAbility to gather information by examining records and documents;\nAbility to maintain an in-depth knowledge of state statutes related to work performed and agency rules and regulations including 935 CMR 500.000;\nAbility to proficiently utilize MS Word, Excel, Outlook;\nAbility to write concisely, to express thoughts clearly and to develop ideas in logical sequence;\nAbility to work independently, as well as with teams;\nExperience or familiarity with administrative law and procedure;\nAbility to exercise discretion in handling confidential information;\nAbility to maintain a calm manner in stressful and emergency situations;\nAbility to spend much of the workweek traveling to marijuana establishment locations throughout the Commonwealth. Typical schedules may require occasional work on the weekends to conduct inspections.\nWillingness to travel to and work in our Worcester headquarters.\nApproximately 60-70% of the time is spent in the field, out of the office.\n\nEDUCATION AND EXPERIENCE\n\nBachelor’s degree required; advanced degree preferred\nExtensive report writing experience required;\nThree years of full-time, or equivalent part-time, experience in investigatory or inspection work, or an equivalent or related field;\n\nOne or more of the following:\nExperience with financial or fraud investigations, audits, forensic accounting, data finance data analysis;\nCPA or CPE certification preferred;\nRegulatory compliance experience in the food industry, including safety inspections related to food preparation;\nExperience with building inspection, building code compliance, architectural review, or related inspections;\nRegulatory compliance experience in the pharmaceutical industry;\nExperience in the chemistry industry and public health;\nExperience with agriculture, horticulture, farming, or hydroponic growing;\nExperience in analysis of laboratory tests;\nExperience in energy compliance;\nKnowledge of and ability to understand and explain independent laboratory tests of soil, temperature, humidity, and carbon dioxide type and use of fertilizers; and processes to implement best practices to limit contamination.\n\nOfficial Title: Investigator, CNB\nPrimary Location: United States-Massachusetts-Worcester-2 Washington Square\nJob: Compliance and Certification\nAgency: Cannabis Control Commission\nSchedule: Full-time\nShift: Day\nJob Posting: May 2, 2022, 2:18:15 PM\nNumber of Openings: 14\nSalary: 70,000.00 - 80,000.00 Yearly\nIf you have Diversity, Affirmative Action or Equal Employment Opportunity questions or need a Reasonable Accommodation, please contact Diversity Officer / ADA Coordinator: Erika White - 7744150200","slug":"investigator-d82ead2b-8969-43f5-ba1b-329a9d5c7713","benefits":["Health savings account","Dental insurance","Health insurance","Disability insurance","Paid time off"],"selectedSkills":["Horticulture","Growing experience","Microsoft Excel","Food preparation","Laboratory experience","Bachelor's degree","Background check"],"jobType":"free","applyURL":"https://massanf.taleo.net/careersection/ex/jobdetail.ftl?job=220005ML&tz=GMT-05%3A00&tzname=America%2FChicago&src=JB-10080"},{"position":"Report Writer","labName":"Montrose Environmental Group, Inc.","location":"Durham, NC","age":"5 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate about the environment and ready to join an inclusive work environment, committed to excellence, to new ideas, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you based in our Durham, NC or Wilmington, NC lab. Who are we? We are Enthalpy Analytical, a subsidiary of Montrose Environmental, the premier environmental services provider.\n\nWe are looking for a Full-time Report Writer.\n\nThe Report Writer is responsible for and authorized to perform the processing of raw data and finalizing all reports for HPLC, GC, GC/MS, FTIR, and all other analytical disciplines performed at Enthalpy Analytical, Inc.\n\nWHAT WE CAN OFFER TO YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nCompetitive medical, dental, and vision insurance coverage\nMedical, Dependent Care and Transit Flexible Spending Accounts\nCompany paid Life and Disability Insurance and access to additional voluntary programs\n401k with a competitive employer match\nProgressive vacation policies and company holiday to ensure work/life balance for our people.\nA financial assistance program to help support peers in need.\nAccess to telemedicine and employee assistance programs\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of 10 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nAs a key member of the Durham/Wilmington team, this role will be responsible for a full range of activities including:\n\nPrepare results for QA review\nEnsure data is received in a timely fashion\nUpdate internal database software (i.e., jobs) with correct report delivery and completion dates for tracking purposes\nCommunication with sales and lab personnel to ensure reports are prepared as specified\nComply with Enthalpy's Quality Assurance Program and other policies\nOther duties as assigned\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nAssociates degree or equivalent and relevant formal academic / vocational qualification\nPrevious experience that provides the knowledge, skills, and abilities to perform the job (comparable to 2+ years’) or equivalent combination of education, training, & experience\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!","slug":"report-writer-dfa9a927-9098-4f83-b3f6-c12a6f23cdbe","benefits":["Dental insurance","401(k)","Health insurance","Employee assistance program","Disability insurance"],"selectedSkills":["Associate's degree"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-NC-Durham-Capitola-Drive/Report-Writer_R2013?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Environmental Laboratory Technician I (Volatile)","labName":"Montrose Environmental Group, Inc.","location":"Richmond, VA","age":"4 hours ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicity testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nA Laboratory Technician I is responsible for performing tasks required to meet the expectations of our clients, in addition to efficiently and profitably generating defensible data in a timely manner. The ideal candidate will have experience in working under possibly hazardous conditions (e.g. pathogens or chemicals). He/She/They will be well-trained to maintain safety conditions and will be passionate for doing work that makes things move forward\n\nAs a key member of the Richmond Laboratory team, this role will be responsible for a full range of activities including:\n\nROLES AND RESPONSIBILITIES\n\nReceives environmental samples into the laboratory according to Enthalpy’s SOPs\nPerforms data entry of sample and test information into Laboratory Information System (LIMS)\nLabel sample containers, store them in appropriate locations and/or contact the proper department to inform them of short holding time and/or rush requests.\nAssists in sample bottle preparation\nAssists in sample management/archiving and disposal\nAssists in sample pickup or field sampling, if needed\nAssists in the coordination of daily field sampling/pickup schedule, if needed\nParticipates in focus teams to improve efficiency\nComply with Enthalpy’s Quality Assurance Program\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nHigh School Diploma or GED. Associate’s degree or equivalent and relevant formal academic/vocational qualifications preferred.\nSome lab experience is preferred but not required.\n\nPREFERRED SKILLS\n\nKnowledge of general lab practices and lab safety\nAble to multi-task and communicate effectively (both oral and written)\nAble to work independently and make sound decisions\nWell organized and have an attention to detail\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air, water and soil measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you will get tons of guidance and plenty of support from talented, super-smart colleagues in tackling head-scratching professional challenges. If this scenario attracts you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"environmental-laboratory-technician-i-volatile-7c2513a1-e683-467e-9925-401fef31150a","benefits":["401(k)","Disability insurance","Parental leave","Tuition reimbursement"],"selectedSkills":["Laboratory experience","High school diploma or GED","Associate's degree"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-VA-Richmond-Reymet-Rd/Environmental-Laboratory-Technician-I--Volatile-_R2027?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Quality Assurance Specialist","labName":"Vireo Health","location":"Johnstown, NY","age":"7 days ago","type":"Full-time","salaryMin":"$36,000 ","salaryMax":" $51,000 a year","jobDescriptionCopy":"Description\nVireo Health, Inc. (“Vireo”) is a physician-led multi-state medical cannabis company that is committed to safely alleviating pain by providing patients with best-in-class cannabis products and compassionate care.\nVireo subsidiary companies cultivate cannabis in environmentally friendly greenhouses, manufacture pharmaceutical-grade cannabis extracts in state-of-the-art labs, and offer their products for sale to qualifying patients at retail dispensaries and online.\nVireo is looking for an energetic and dedicated Quality Assurance Specialist to join our team in our Hurlock, MD facility.\nThe Quality Assurance Specialist is responsible for quality inspections of Medical Cannabis products and monitoring the processes and procedures in the medical cannabis manufacturing operation. They are required to follow set processes and ensure adherence to state regulations, SOPs, work instructions (WI), and adhere to good manufacturing practices (GMP), Good Laboratory Practice (GLP) and other product quality standards.\nResponsibilities\n\nPerform Quality Control inspections on Products, Equipment and procedures. Ensure package integrity and accuracy.\nMay perform or assist inventory management personnel with inventory audits when needed.\nResponsible for monitoring product cannabis safety and quality throughout the manufacturing process.\nEnsure all cannabis and cannabis containing products produced at the facility are properly tested in accordance with company procedures and guidelines, at appropriate frequencies, and meet specifications prior to release. Ensure testing data is appropriately recorded and maintained.\nResponsible for performing verification on equipment and other areas required.\nResponsible for ensuring the correct recording and filing of all relevant record logs and documentation completed by staff.\nEnsures the correct guidelines for production are followed during operations.\nEnsures employees are following all SOPs, Work Instructions and worker safety practices.\nEnsure the facility follows applicable Quality Management directives such as SOP’s, manuals, policies and procedures, work instructions, etc.\nAssist Quality Manager with instructing employees on Quality Improvements and Issues.\nAnalyze quality data to recommend quality and process improvements.\nCollect product samples for Product Development, lab retains and the laboratory when directed.\nSupport QA Manager and assist other QA Specialists as needed.\n\nCompliance Interactions\nQA assists in aligning the company with all state, federal and 3rd party requirements. Compliance will work with QA to ensure compliance with government regulatory agencies and third-party audits.\nQualifications\n\nHigh School Diploma required; must be at least 21 years old\n2 years minimum employment experience in a manufacturing/quality control setting\nExperience with record keeping/internal auditing\nAbility to follow existing inventory/inspection procedures accurately\nWorking knowledge of general computer operation and competency with Microsoft Office Products\nExperience operating in a quality-centric setting (Medical/Manufacturing/Health related industries)\nGood writing/reading/arithmetic skills\nBasic physical ability to walk back and forth across facility and lift/move up to 50lbs if necessary\nSelf-motivated with proven leadership skills and attention to detail\nStrong interpersonal skills for multitasking and interacting with team members\n\nVireo is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.\nU6SU4oY1V5\n\nJob Type: Full-time","slug":"quality-assurance-specialist-006e0d07-9077-4571-aa04-0aba4b459218","benefits":[],"selectedSkills":["Writing skills","Leadership","Manufacturing","Quality control","Internal audits","High school diploma or GED","21 years or older"],"jobType":"free","applyURL":"https://vireohealth.applytojob.com/apply/U6SU4oY1V5/Quality-Assurance-Specialist?source=INDE"},{"position":"Laboratory Technician I","labName":"Montrose Environmental Group, Inc.","location":"Durham, NC","age":"6 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicity testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nAs a key member of the Durham Laboratory team, this role will be responsible for a full range of activities including:\n\nROLES AND RESPONSIBILITIES\n\nReceive thermal desorption samples\nLog-in samples using laboratory database\nReview and reconcile samples received and chain-of-custody\nCommunicate to Project Manager sample status including samples received or expected to be received\nMaintain sample thermal desorption sample storage and disposal records\nMaintain sample storage archive area and accurate records\nPrepare thermal desorption sampling supplies for shipment to clients\nMaintain inventory of thermal desorption media\nMaintain sampling media history in tube tracking database.\nClean thermal desorption tubes and verify acceptable cleanliness using TD/GC/MS.\nFrequent communication with Group Leader, Analysts and Project Manager\nMaintain clean laboratory areas\nOverhead projects designed to improve efficiency\nComplying with Enthalpy's Quality Assurance Program and other policies\nComply with Enthalpy's Exposure Control Plan\nOther duties as assigned by the Company\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nHigh School Diploma or GED. Associate’s degree or equivalent and relevant formal academic/vocational qualifications preferred.\nSome lab experience is preferred but not required.\n\nPREFERRED SKILLS\n\nKnowledge of general lab practices and lab safety\nAble to multi-task and communicate effectively (both oral and written)\nAble to work independently and make sound decisions\nWell organized and have an attention to detail\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air, water and soil measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you will get tons of guidance and plenty of support from talented, super-smart colleagues in tackling head-scratching professional challenges. If this scenario attracts you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"laboratory-technician-i-853bbce1-92ba-4f9d-8242-169d687c4013","benefits":["401(k)","Disability insurance","Parental leave","Tuition reimbursement"],"selectedSkills":["Laboratory experience","High school diploma or GED","Associate's degree"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-NC-Durham-Capitola-Drive/Laboratory-Technician-I_R1996-1?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Commercial Marketing Manager - Food and Beverage (Remote)","labName":"MilliporeSigma","location":"St. Louis, MO","age":"7 days ago","type":"Full-time","jobDescriptionCopy":"A career with MilliporeSigma is an ongoing journey of discovery: our 60,300 people are shaping how the world lives, works and plays through next generation advancements in Healthcare, Life Science and Electronics. For more than 350 years and across the world we have passionately pursued our curiosity to find novel and vibrant ways of enhancing the lives of others. MilliporeSigma is a business of Merck KGaA, Darmstadt, Germany.\n\nThis role does not offer sponsorship for work authorization. External applicants must be eligible to work in the US.\n\nYour Role:\nMilliporeSigma has an opening as a Commercial Marketing Manager - Food and Beverage (F&B) Customer Segment! In this role you will focus on driving short and long-term business plan execution for F&B testing, processing, and manufacturing customers in North America.\n\nReporting to the Commercial Marketing Director for Science and Laboratory Services (SLS), the Commercial Marketing Manager - Food and Beverage (F&B) will partner with global Segment Marketing and serve as a tactical liaison to the North America Industrial and Lab Testing sales teams. You will also be translating marketing strategies into practical sales campaigns crafted to ensure the Commercial organization is effectively enabled to deliver on revenue growth goals.\n\nOpen to Remote Worker in the US.\n\nSupports for and/or ownership of: Sales tools (brochures, flyers, promotions), E-mail campaigns, on-line display advertising, Trade Shows, application notes / white papers, webinars, sales campaign training, and relationships with internal partners, the NA sales team & key customers\nTranslates segment strategy into North America commercial area marketing tactics\nAssesses assigned market(s), analyzes trends, and prioritizes revenue growth opportunity\nDevelops short and long-term business plans for the cannabis segment in North America\nAssembles a suite of programs to communicate value propositions, develop markets and stimulate demand\nDisseminates segment and commercial strategy to region or Commercial area sales teams\nEnsures region or commercial area sales teams can effectively articulate value propositions\nMonitors the effectiveness of business plans and collaborates with internal collaborators to optimize\nMaintains business plan KPIs, monitors performance, and reports internally\nMonitors F&B customer growth trends and deploys tactics to capture emerging opportunity\nDocuments why customers buy and how they use MilliporeSigma products\nMaintains a deep understanding of the Applications and Areas of Science where MilliporeSigma products are used\nIdentifies new Applications and Areas of Science where MilliporeSigma products can be used\nIdentifies KOLs and deploys teams to develop and handle relationships\nPartners with the commercial team to stimulate demand through company events and Account Based Marketing (ABM) opportunities\nMaintains an in-depth knowledge of the competitive landscape\nEnables the region or commercial area sales team with tools to effectively deliver the value proposition\nGenerates leads through tradeshows and direct marketing activities, providing a robust pipeline for sales\nSupports and/or produces live or recorded training presentations to sales force when appropriate\n\nPhysical Attributes\n\nUp to 20% of domestic travel to customers, trade shows, and internal meetings\n\nWho You Are:\nMinimum Qualifications:\nBachelor's degree in Biology, Chemistry, Agriculture or other life science field\n3+ years marketing and/or selling experience in the life science/food and beverage industry OR 3+ years of work experience in life science/food and beverage lab\n\nPreferred Qualifications:\nMaster's in Business Administration\nKnowledge from a prior commercial role or project management\nStrong leadership and project management skills with acute attention to details\nStrong analytical skills in using data to make sound recommendations and business decisions\nAbility to lead multiple projects simultaneously with a high degree of independence\nAbility to solve complex problems and overcome obstacles\nStrong communication skills; ability to function in a complex business environment\nExcellent written and oral communication skills, including presentation experience to large and diverse audiences\nGood foundation of marketing know-how, consumer insight and an understanding of how to manage all elements of the marketing mix\n\nWhat we offer: With us, there are always opportunities to break new ground. We empower you to fulfil your ambitions, and our diverse businesses offer various career moves to seek new horizons. We trust you with responsibility early on and support you to draw your own career map that is responsive to your aspirations and priorities in life. Join us and bring your curiosity to life!\n\nOur Benefits - https://www.emdgroup.com/en/careers/benefits.html\n\nCurious? Apply and find more information at https://jobs.vibrantm.com\n\nIf you are a resident of a Connecticut, Colorado or New York City, you are eligible to receive additional information about the compensation and benefits, which we will provide upon request. You may contact 855 444 5678 from 8:00am to 5:30pm ET Monday through Friday, for assistance.\n\nThe Company is an Equal Employment Opportunity employer. No employee or applicant for employment will be discriminated against on the basis of race, color, religion, age, sex, sexual orientation, national origin, ancestry, disability, military or veteran status, genetic information, gender identity, transgender status, marital status, or any other classification protected by applicable federal, state, or local law. This policy of Equal Employment Opportunity applies to all policies and programs relating to recruitment and hiring, promotion, compensation, benefits, discipline, termination, and all other terms and conditions of employment. Any applicant or employee who believes they have been discriminated against by the Company or anyone acting on behalf of the Company must report any concerns to their Human Resources Business Partner, Legal, or Compliance immediately. The Company will not retaliate against any individual because they made a good faith report of discrimination.\n\nJob Requisition ID: 245893\n\nLocation: St. Louis\n\nCareer Level: D - Professional (4-9 years)\n\nWorking time model: full-time\n\nNorth America Disclosure\nThe Company is committed to accessibility in its workplaces, including during the job application process. Applicants who may require accommodation during the application process should speak with our Candidate Services team at 844-655-6466 from 8:00am to 5:30pm ET Monday through Friday. If you are a resident of a Connecticut or Colorado, you are eligible to receive additional information about the compensation and benefits, which we will provide upon request. You may contact 855 444 5678 from 8:00am to 5:30pm ET Monday through Friday, for assistance.\n\nNotice on Fraudulent Job Offers\nUnfortunately, we are aware of third parties that pretend to represent our company offering unauthorized employment opportunities. If you think a fraudulent source is offering you a job, please have a look at the following information .\n\nJob Segment: Developer, Manager, Laboratory, Project Manager, Technology, Management, Science","slug":"commercial-marketing-manager-food-and-beverage-remote-44e4d9c7-ba3d-4414-9865-54370b08f810","benefits":[],"selectedSkills":["Project management","Analysis skills","Communication skills","Marketing","Bachelor's degree","Master's degree","US work authorization"],"jobType":"free","applyURL":"https://jobs.vibrantm.com/job/St_-Louis-Commercial-Marketing-Manager-Food-and-Beverage-%28Remote%29-Miss-63103-2350/801149701/?jobPipeline=Indeed"},{"position":"Chief Equity Officer (Deputy Director, NS)","labName":"Office of Cannabis Management","location":"Albany, NY","age":"1 day ago","type":"Full-time","jobDescriptionCopy":"Bachelor’s degree and seven years of relevant experience or a comparable combination of education and/or experience in cannabis laws, regulations, and/or the history of cannabis enforcement in New York State with two years of experience at a managerial level.\n\nPreferred qualifications:\nIdeal candidates will have 3 years at a managerial level and demonstrate commitment to social justice, leadership skills, sound judgment, strong oral and written skills, and experience and willingness to collaborate with people who have diverse backgrounds, experiences, and roles in local and state affairs. Understanding of New York State government, geography and culture is preferred.\n\nDuties DescriptionReporting to the Executive Director, the Chief Equity Officer carries out the policy objectives of social and economic equity for the Office of Cannabis Management (Office). This effort involves identifying and engaging with communities that have been affected by the prohibition and criminalization of cannabis and linking them to education, resources, and technical assistance to provide opportunities in the regulated cannabis industry. The Chief Equity Officer will also assist in the development and implementation of the Office’s social and economic equity plan and defining communities disproportionally impacted by cannabis prohibition.\n\nDuties include, but are not limited to:\n\nReport to the Executive Director on all matters related to social and economic equity and work in consultation with the Cannabis Control Board as required by statute.\nAssist with the development and implementation of and ensure the Cannabis Control Board and the Office of Cannabis Management’s continued compliance with, the social and economic equity plan, required to be developed.\nEstablish public education programming dedicated to providing communities that have been impacted by cannabis prohibition with information detailing the licensing process and informing individuals of the support and resources that the office can provide to individuals and entities interested in participating in obtaining licensure.\nCoordinate with the Economic Development and Equity Unit and other state agencies such as empire state development to provide access to financial capital, including a small business revolving loan fund, low or zero interest loans, capital development programs and exposure and vetting of private venture firms.\nProvide reports to the board on an annual basis, of the activities in ensuring compliance with the social and economic equity plan. The Board will present these reports to the Governor and Legislature.\nIn consultation with the Board and the Executive Director, assist with the promulgation of any and all necessary rules and regulations governing the cultivation, manufacture, processing, transportation, distribution, testing, delivery and sale of medical cannabis, adult-use cannabis, and cannabinoid hemp and hemp extract, including but not limited to the registration of organizations authorized to sell medical cannabis, licensing and/or permitting of adult-use cannabis cultivators, processors, cooperatives, microbusiness, distributors, laboratories, and retailers, and the licensing of cannabinoid hemp and hemp extract producers and processors.\nIn consultation with the Board and the Executive Director create a social responsibility framework agreement that fosters racial, ethnic, and gender diversity in the workplace and make the adherence to such agreement a conditional requirement for license renewal.\nWork collaboratively with the communications unit on timely updates to the Office of Cannabis Management’s website content and publications relating to opportunities for social and economic equity applicants.\nCoordinate with the Office of Cannabis Management’s intergovernmental and public affairs units to conduct follow-up activities raised at forums, events and questions received to the Office.\nAnalyze program data from surveys to recommend opportunities for program improvement.\nProvide verbal and written communications to internal and external stakeholders, including but not limited to, practitioners, patients and registered organizations with inquiries pertaining to the Program.\nPresent at forums and public events about the Office of Cannabis Managements social and economic equity program and, track follow-up activities on issues raised at forums.\nAdditional CommentsWork location and telecommuting opportunities to be discussed at interview. All Office of Cannabis Management (OCM) employees are required to be tested weekly for COVID-19 unless they are fully vaccinated. Employees who are vaccinated must provide proof of vaccine status through a secure online portal. Salary will be commensurate with experience. Positions located in NYC will receive an annual downstate adjustment payment of $3,026 in addition to the regular salary.\n\nWe offer a comprehensive benefits plan, which includes:\n\nLow-cost and competitive health insurance plan choices\nDental & vision insurance at no additional cost\nMembership in the NYS Retirement System\nDeferred Compensation Investment Plan\nMinimum of 13 vacation days per year\nUp to 13 days of paid sick leave annually for PEF/CSEA\nUp to 8 days of paid sick leave annually for M/C\n5 days of personal leave per year\n13 paid holidays per year\nTuition reimbursement\nPublic Service Loan Forgiveness (PSLF)\nTraining & development opportunities","slug":"chief-equity-officer-deputy-director-ns-79b07891-1642-4c9a-9659-936314891741","benefits":["Paid time off","Dental insurance","Paid sick time","Health insurance","Loan forgiveness"],"selectedSkills":["Leadership","Bachelor's degree"],"jobType":"free","applyURL":"https://statejobs.ny.gov/employees/vacancyDetailsView.cfm?id=104079#jobspecifics"},{"position":"Analytic Laboratory Technician/Analytic Laboratory Technologist- PB Laboratories","labName":"TriCore Reference Laboratories","location":"Albuquerque, NM","age":"2 days ago","type":"Full-time","salaryMin":"$34,000 ","salaryMax":" $48,000 a year","jobDescriptionCopy":"Job ID #: 12278 City, State: NM - Albuquerque\n\nFunctional Area: Health/Medical Department Name:\nPosition Type: Regular - Full Time Education Required: See Minimum Qualifications\nExperience Required: See Minimum Qualifications Relocation Provided:\n\nJob Summary\n\nWe help New Mexico hemp and cannabis growers produce safe, high-quality products by delivering precise, accurate, and reliable laboratory testing.\n\nPrecision Botanical Laboratories provides regulation-compliant laboratory testing to ensure safety and effectiveness of medical and adult-use cannabis and hemp.\n\nThe successful candidate will perform in one of the following capacities based on education and experience:\n\nANALYTIC LABORATORY TECHNICIAN\n\nJOB SUMMARY:\nUnder direct supervision, provides basic skills in the performance of moderate or high complexity laboratory tests for purpose of determining analytic purity and sterility within the scope of training and experience.\n\nESSENTIAL FUNCTIONS:\n1. Assists with the development and validation of analytical methods to achieve specified quality performance requirements.\n\n2. Performs/results laboratory testing using validated methods and procedures.\n\n3. Operates routine laboratory equipment, instruments, and interfaces.\n\n4. Prepares reagents and solutions following standard laboratory formulas and procedures.\n\n5. Performs and documents routine and periodic maintenance and calibration procedures.\n\n6. Performs routine logging for QC/QA purposes. Collects and compiles QA data as directed.\n\n7. Performs basic troubleshooting, identifies testing problems, and notifies appropriate supervisors for corrective action.\n\n8. Participates in regulatory inspections as appropriate.\n\n9. Assists by taking inventory as needed or appropriate. Orders supplies for the Department as directed.\n\n10. Handles hazardous materials and wastes in accordance with safety procedures and regulations.\n\n11. Serves as a liaison with internal and external customers/employees/clients as appropriate.\n\n-\n\nANALYTIC LABORATORY TECHNOLOGIST\n\nJOB SUMMARY:\nUnder direct supervision, provides basic skills in the performance of high complexity laboratory tests for the purpose of determining analytic purity and sterility within the scope of training and experience.\n\nESSENTIAL FUNCTIONS:\n1. Performs/results laboratory testing using validated methods and procedures.\n\n2. Operates routine laboratory equipment, instruments, and interfaces.\n\n3. Prepares reagents and solutions following standard laboratory formulas and procedures.\n\n4. Performs and documents routine and periodic maintenance and calibration procedures.\n\n5. Performs routine logging for QC/QA purposes. Collects and compiles QA data as directed.\n\n6. Performs basic troubleshooting, identifies testing problems, and notifies appropriate supervisors for corrective action.\n\n7. Participates in regulatory inspections as appropriate.\n\n8. Assists by taking inventory as needed or appropriate. Orders supplies for the Department as directed.\n\n9. Handles hazardous materials and wastes in accordance with safety procedures and regulations.\n\n10. Serves as a liaison with internal and external customers/employees/clients as appropriate.\n\nMinimum Qualifications\n\nANALYTIC LABORATORY TECHNICIAN\n\nMINIMUM EDUCATION:\nAssociate of Science\n\nMINIMUM EXPERIENCE:\nNo experience is required.\n\nPREFERENCES:\nCannabis Technician certification\n\n______________________________________\n\nANALYTIC LABORATORY TECHNOLOGIST\n\nMINIMUM EDUCATION:\n\nBachelor’s degree in a chemical, physical or biological science\nMINIMUM EXPERIENCE:\n\nNo experience is required.\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class.","slug":"analytic-laboratory-techniciananalytic-laboratory-technologist-pb-laboratories-e69904ba-3813-4c0e-8c36-7285916228a6","benefits":[],"selectedSkills":["Laboratory experience","Bachelor's degree","Associate's degree"],"jobType":"free","applyURL":"https://careers.peopleclick.com/careerscp/client_tricore/external/jobDetails.do?functionName=getJobDetail&jobPostId=27076&localeCode=en-us"},{"position":"Environmental Senior Scientist","labName":"Montrose Environmental Group, Inc.","location":"Richmond, VA","age":"2 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of 10 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nThe Staff Engineer performs a wide range of duties in support toward maintenance and service of laboratory instrumentation. Provides technical expertise within the specialty field of environmental laboratories.\n\nAs a key member of the Richmond, VA Enthalpy team, this role will be responsible for a full range of activities including:\n\nRepair/service and maintenance (both electrical and mechanical) of laboratory instruments\nDiagnose malfunctions, errors, and technical problems of equipment and determine proper solutions\nDisassemble and reassemble instrumentation to repair and replace worn or malfunctioning component and consumables\nOversee and assist with implementation of existing and new technologies and techniques within the laboratory.\nUpdate and maintain instruments per manufacturers specs and keep records as required.\nProvide direction and technical decision making for management involving capital asset purchases\nInvolvement with the purchasing/installation/validation of equipment and instrumentation.\nDirect and manage maintenance on analytical systems in concert with the department Group Leaders\nOversee and assist with the modification of existing systems in the laboratories to make them more efficient and/or effective, along with the development and implementation of new processes and procedures\nOther duties as assigned by the Laboratory Director or his/her designee(s)\nComply with Enthalpy's Quality Assurance Program and other policies\nComply with Enthalpy's Health and Safety Plan\nOther duties as assigned\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nAssociate’s Degree in Engineering, Chemistry, Biology or related discipline from an accredited university or equivalent combination of education, training and experience.\n\nPreferred Skills\n\nStrong problem solving and analytical skills\nSolid organization and time management skills\nEffective verbal and written communication skills.\nAble to work independently, managing multiple responsibilities (i.e. self-starter, self-motivated)\nAbility/willingness to travel up to 25% of time\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!","slug":"environmental-senior-scientist-1fb051b1-b59d-4485-b548-2427d9029b0d","benefits":["Disability insurance","Tuition reimbursement","401(k)","Parental leave"],"selectedSkills":["Analysis skills","Communication skills","Time management","Associate's degree"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-VA-Richmond-Reymet-Rd/Environmental-Senior-Scientist_R2015?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Laboratory Analyst","labName":"Jushi","location":"Manassas, VA","age":"4 days ago","type":"Full-time","salaryMin":"$34,000 ","salaryMax":" $47,000 a year","jobDescriptionCopy":"WHO IS DALITSO\n\nDalitso is focused on integrating standard medical, scientific, and operational practices into the medical cannabis industry, improving the quality, safety and affordability of cannabis-based medicines for our patients in Virginia.\n\nTHE OPPORTUNITY\n\nThe Laboratory Analyst role assists the manufacturing team in the production of cannabis-based medicines.\n\nWeigh and prepare samples for analytical testing\nAnalyze samples for cannabinoid potency using HPLC\nIdentify and quantify Terpenes using GC\nCalibrate and Maintain HPLC & GC\nOrder Chemical Supplies\nMicrobial analysis via PCR\nDispose of Chemical Waste\nTroubleshoot Analytical Equipment\n\nEDUCATION & EXPERIENCE\n\nBS/BA in chemistry, biochemistry or biology\nMinimum of three years work experience in related field focusing on chemical processing and equipment use. (HPLC/GC primarily)\nAbility to communicate to employees in organization\nPreferred\nPrevious experience in medical cannabis industry\n\nPHYSICAL REQUIREMENTS\n\nConstantly perform desk-based computer tasks\nFrequently sitting\nAbility to work flexible schedule, including periodic weekends\nOccasionally Twist/bend/stoop/squat, kneel/crawl\nAbility to communicate orally with management and other co-workers is crucial. Regular use of the telephone and e-mail for communication may be required. Sitting or standing for extended periods is common. Hearing and vision within normal ranges is essential for normal conversations, to receive ordinary information and to prepare or inspect documents.\nSome heavy lifting may be required. Exertion of up to 50 lbs. of force occasionally may be required.\nGood manual dexterity for the use of common office equipment.\nMust be comfortable operating and troubleshooting equipment.\n\nWORK ENVIRONMENT\n\nThe job is performed indoors and outdoors. Must be able to work in hot, humid environments for extended periods of time with exposure to dust, allergens, and water. Appropriate PPE will be provided. Activities include extended periods of sitting, standing, kneeling, stooping and bending. Twisting in tight areas may also be required at times.\n\nOTHER DUTIES\n\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities, and activities may change at any time with or without notice\n\nWe are an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, sex, sexual orientation, gender identity or expression, religion, national origin or ancestry, age, disability, marital status, pregnancy, protected veteran status, protected genetic information, political affiliation, or any other characteristics protected by local laws, regulations, or ordinances.\n\nWe offer benefit packages that may include: Medical, Dental, Vision, Life, Short, and Long Term Disability.\n8sWhPfzEJL","slug":"laboratory-analyst-6ed02895-07f9-45ad-94d2-3aacf29a5515","benefits":["Dental insurance","Health insurance","Disability insurance","Vision insurance","Safety equipment provided"],"selectedSkills":["Biochemistry","Heavy lifting","Bachelor of Science","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=Wra_-l0tTX-go8Ls0fKid8aNvkZcssPqD_bxVeRdgiIzOM0bMawj7Q"},{"position":"Microbiologist I","labName":"ProVerde Laboratories","location":"Milford, MA","age":"4 hours ago","type":"Full-time","salaryMin":"$50,000 ","salaryMax":" $55,000 a year","jobDescriptionCopy":"Company Description:\n\nProVerde is an analytical testing and research laboratory comprised of dedicated scientists working on cutting edge and next-generation analysis methods. ProVerde provides analytical, consulting, and process development services for a wide range of consumer products including cannabis and hemp products, health and wellness supplements, and natural/botanical products. ProVerde is recognized and used internationally as a standard of excellence with one of the broadest accreditation scopes for services offered within the industry.\n\nProVerde Labs is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.\n\nTitle & Position Overview: Microbiologist I\n\nProVerde is seeking a highly motivated self-starter to join our laboratory team! The Microbiologist/Microbiological Technician position requires, but is not limited to, excellent manual dexterity and aseptic technique, efficient workload management, attention to detail in an ISO 17025 regulated environment, and excellent documentation skills. This position is intended for internal growth and professional development.\n\nEducation and Experience:\n\nMinimum of a bachelor’s degree in Microbiology, with 0-2 years of microbiological experience is required. Entry level candidates will be considered. Experience in a technical or life sciences field, production, industrial, agricultural, quality control, analytical laboratory, or cannabis products testing is highly desirable.\n\nJob Responsibilities:\n\nConducts work in a manner that is compliant with the Quality System and all ISO 17025 requirements.\nPrepare customer samples of all matrix types for analysis on various microbiological platforms.\nAnalyze and screen samples for microbiological contaminants such as total aerobic bacterial count, total coliform, total bile-tolerant gram-negative bacteria and total yeast and mold, salmonella and E. coli using system platforms such as the TEMPO and VIDAS technologies, plating methods, and DNA microarray system (PathogenDx).\nRecord and report sample results according to SOPs.\nOperate, maintain, and troubleshoot lab equipment including autoclaves, incubators, refrigerators, freezers, culture media, reagents, pipettes, or other related to microbiology.\nMaintain an organized and sterile microbiological lab area and monitor environmental conditions.\nPrepare microbiological reagents or culture materials.\nPrepare microbiological standards and evaluate system performance.\nParticipate in proficiency testing programs for national accreditation and standardization.\nValidate newly developed microbiological methods as needed.\nMaintain familiarity with applicable test methods and ensure all analyses are conducted in conformance with established methods and laboratory SOPs.\nAssist with proper sample and laboratory waste disposal according to appropriate regulations.\nMonitor inventory levels, order materials and supplies in accordance with procedures.\nIdentify process difficulties and propose solutions to manager. Review data per QC and technical requirements, discuss any outliers with manager.\n\nRequired Skills:\n\nBachelor’s degree in Microbiology, Biology, Biochemistry, Food Science, or related life science field\n0-2 years of experience with microbiology for quality control, analytical or production.\nFamiliarity with aseptic technique and the fundamental principles associated therein.\nStrong knowledge and experience with wet lab, organic lab, and microbiological lab techniques.\nDemonstrated ability to handle multiple tasks simultaneously working on a team or as an individual.\nAptitude to mentor team members and provide technical guidance.\nProficient in Microsoft Office particularly Excel and Word with the ability to summarize work for clients and management.\nDetail-oriented individual with positive demeanor. Highly competent as a member of a team.\nMust be able to work with minimal supervision and have excellent attention to detail with a high volume work load.\nMust maintain excellent attendance to ensure accurate culture results, with an ability to periodically work on weekends to maintain in-process bioreactors.\nStrong communication skills with team members, managers, and customers.\nDemonstrated experience learning or mastering a new skill or task with proficiency and expediency.\n\nDesired Skills:\n\n2+ years of laboratory experience in an analytical (biological, pharmaceutical, consumer products) or production setting.\n2+ years of regulated quality control experience and/or experience with quality control chemistry including sample handling.\nExtensive experience with PCR and ELFA techniques.\nStrong understanding of standardized test methods for microbiology (AOAC, BAM, USDA, FDA, EPA, etc).\nStrong aptitude for identifying microbial species based on observations, experience, and functional expertise.\nStrong aptitude for learning and continual growth. Ability to take on more responsibility and autonomy with increased experience.\nKnowledge of primer/probe and fluorescence chemistry for PCR techniques is preferable.\n\nJob Type: Full-time\n\nPay: $50,000.00 - $55,000.00 per year\n\nBenefits:\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\n\nEducation:\n\nBachelor's (Preferred)\n\nWork Location: One location","slug":"microbiologist-i-d97f15f4-3dc4-44c0-a414-a438856f2c8e","benefits":["Dental insurance","Health insurance","Paid time off","401(k)","Vision insurance"],"selectedSkills":["Microsoft Excel","PCR","Laboratory experience","Communication skills","Microbiology","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=zTHq9TNEoOoTVio2eeaCQdsncujZuqOL5MNv-UxvcA-D83ZJwX3dOg"},{"position":"QA Manager","labName":"Pree Laboratories, LLC","location":"Corvallis, OR","age":"1 hour ago","type":"Full-time","salaryMin":"$20 ","salaryMax":" $24 an hour","jobDescriptionCopy":"Pree Laboratories is hiring a Quality Assurance Manager!\n\nAbout PREE:\nLocated in the heart of the Willamette Valley, PREE Laboratory is an OLCC licensed and ORELAP accredited high complexity environmental laboratory currently providing cannabis and hemp compliance and R&D testing solutions for our amazing clients. PREE Laboratory prides itself in providing our client-partners with the highest quality technical support and customer service in a prompt and professional manner.\n\nThis full time position is anticipated to work 9:00-5:00 Monday-Friday.\n\nPosition Description:\n\nWe are looking for a reliable QA Manger to ensure that all external and internal requirements are met before our product reaches our customers. You will be responsible for inspecting procedures and outputs and identifying mistakes or non-conformity issues. An excellent QA Manager has eyes like a hawk and solid experience in quality control. The ideal candidate is a reliable and competent professional whose approval will be necessary for the continuation of a business life cycle.\n\nThe QA Manager is responsible for the oversight and review of quality control data but is independent from laboratory operations. The QA Manager's training and proof of experience in QA/QC procedures, knowledge of analytical methods, and familiarity with the laboratory's management system is vital to the success of the laboratory. The QA Manager must have a bachelor's degree in science and experience in an environmental lab setting.\n\nSpecific Duties & Responsibilities\n\nDevelop and update standard operating procedures to inspect and report quality issues in conjunction with laboratory director and manager\nMonitor all operations that affect quality\nSupervise and train technicians and other staff\nAssure the reliability and consistency of production by checking processes and final output\nAppraise customers’ requirements and make sure they are satisfied\nReport all malfunctions to production executives to ensure immediate action\nFacilitate proactive solutions by collecting and analyzing quality data\nReview current standards and policies\nKeep records of quality reports, statistical reviews and relevant documentation\nEnsure all legal standards are met\nCommunicate with external quality assurance officers during on-site inspections\n\nSkills\n\nProven experience as a quality assurance manager or relevant role\nThorough knowledge of methodologies of quality assurance and standards\nExcellent numerical skills and understanding of data analysis/statistical methods\nGood knowledge of MS Office and databases\nOutstanding communication skills\nGreat attention to detail and a results driven approach\nExcellent organizational and leadership abilities\nReliable and Trustworthy\nBSc/BA in science or a relevant field\nFamiliarity with OLCC practices and Orelap guidelines\nMust be 21 years of age or older per OLCC rules\n\nJob Type: Full-time\n\nPay: $20.00 - $24.00 per hour\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nHealth insurance\nLife insurance\nPaid time off\nRetirement plan\nVision insurance\n\nSchedule:\n\n8 hour shift\nDay shift\nMonday to Friday\n\nSupplemental Pay:\n\nBonus pay\n\nExperience:\n\nQuality Assurance Managers: 1 year (Preferred)\n\nWork Location: One location","slug":"qa-manager-db55c588-a475-4312-8b4f-260a0235a661","benefits":["Dental insurance","Health insurance","401(k)","Employee assistance program","401(k) matching"],"selectedSkills":["QA/QC","Laboratory experience","OLCC Service Permit","Quality assurance","Communication skills","Bachelor of Science","Bachelor's degree","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=9unxj5lgV45pR8NcZ8fdzzgHdIDEvRcf47VURB0cwZMOuZBKi27DWg"},{"position":"Manufacturing Technician","labName":"Mana Supply","location":"St. Louis, MO","age":"2 hours ago","type":"Part-time","salaryMin":"$15 an hour","jobDescriptionCopy":"The Manufacturing Technician will provide direct assistance to the manufacturing process for medical marijuana products. This person will help to produce and package products. This is a part-time position.\n\nDuties and Responsibilities:\n\nProduce medical cannabis food products Ensure that all medical marijuana food products meet state requirements.\nStoring supplies and equipment, disposal of waste according to guidelines, and keeping laboratory, storerooms and working areas immaculate.\nWashing and sterilizing laboratory glassware.\nPackage all marijuana products in their correct packaging.\nOperate packaging equipment.\nApply labels, barcodes, and testing results to product containers.\nMaintain inventory counts.\nWorks in a timely manner and strives to increase productivity.\nMaintain a culture of professionalism.\nOther duties as assigned.\n\nQualifications and Education:\n\nExperience in the medical marijuana industry is preferred, but not required.\nMust be able to sit or stand for extended periods of time.\nAble to move about a typical office, manufacturing and warehouse environment.\nAble to lift and move up to 50 pounds.\nHigh School Diploma or Equivalent.\nMust be at least 21 yrs of age.\n\nJob Type: Part-time\n\nPay: $15.00 per hour\n\nBenefits:\n\nFlexible schedule\n\nSchedule:\n\n8 hour shift\nDay shift\n\nAbility to commute/relocate:\n\nSaint Louis, MO 63134: Reliably commute or planning to relocate before starting work (Required)\n\nWork Location: One location","slug":"manufacturing-technician-e4cc6153-86e0-460d-bffe-bf1c96e8488b","benefits":["Flexible schedule"],"selectedSkills":["High school diploma or GED","21 years or older","US work authorization"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=kYIEZO-WWhtB3EjCGnjcU8K5ukugx2Ch6vgJuXbRXB35QyW-qCj70w"},{"position":"Cannabis Trimmer/Packager","labName":"Prohibition 37","location":"Albuquerque, NM","age":"2 hours ago","type":"Full-time | Contract","salaryMin":"$12 ","salaryMax":" $15 an hour","jobDescriptionCopy":"ABOUT US\n\nProhibition 37 is a fully licensed, vertically integrated cannabis business with a cultivation and manufacturing facility, and several dispensaries, located on the west side of Albuquerque, NM. The cultivation and manufacturing facility is fast-paced and multi-faceted, from every step of plant cultivation to drying, trimming, and packaging of the final product. Our production cycle is consistent and the physical workload is high, but we have a relaxed work environment where we encourage employees to be themselves and engage with coworkers.\n\nWe pride ourselves in the quality of our cannabis products, our customer service and credible education for both recreational customers and medical patients, and our integrity regarding facility cleanliness, product reliability, and accuracy/transparency of laboratory testing, including full terpene profiles. We are a growing company that seeks to promote from within when opportunities arise, especially employees that are hard working, reliable, and demonstrate leadership qualities.\n\nJOB DESCRIPTION\n\nThis position begins as a temporary 1099 contract position, with the potential to move into a full-time employee role with a raise after a 4 week trial period.\n\nWe are seeking motivated individuals at least 21 years of age who preferably have experience in the cannabis industry. Our goal is to maintain a diverse, hard working team that works efficiently together, takes initiative, adapts to changing environments, and is detail and quality oriented.\n\nJob roles include:\n\nassisting with plant harvest, including plant logging, weighing, and hanging to dry\ndebranching and bucking buds off of dried plants\npartially hand trimming buds before packaging\noperating trimming machines, joint machines, packaging machines, and scales\nidentifying potential bud rot, mold, or infestation if they occur\nweighing, packaging, sealing, and labeling product\ntracking product using spreadsheets and state-regulated software\nmaintaining facility cleanliness\nassisting growing team wherever needed\n\nThis job requires the ability to lift and carry up to 50 lbs, and to perform work while sometimes using ladders, squatting, or kneeling, in and around water and loose soil.\n\nThis job also requires state and federal background checks, as well as signing a non-disclosure agreement. Finally, all company procedures must be understood and followed closely.\n\nUltimately, this is an exciting and growing industry, and we are trying to generate a positive, hard working company culture where all employees feel appreciated, included, and eager to learn and meet goals and deadlines.\n\nJob Types: Full-time, Contract\n\nPay: $12.00 - $15.00 per hour\n\nBenefits:\n\nEmployee discount\nPaid time off\nParental leave\n\nSchedule:\n\n8 hour shift\nDay shift\nMonday to Friday\nOvertime\n\nCOVID-19 considerations:\nPer current state regulations, we do not require employees to wear masks. We ask if feeling unwell, stay home and seek testing, following CDC guidelines if positive. We maintain a clean facility and wear gloves and masks when handling cannabis products.\n\nAbility to commute/relocate:\n\nAlbuquerque, NM 87121: Reliably commute or planning to relocate before starting work (Required)\n\nApplication Question(s):\n\nHow many months/years of experience do you have in cannabis-related employment or education?\nAre you at least 21 years of age?\n\nShift availability:\n\nDay Shift (Required)\n\nWork Location: One location","slug":"cannabis-trimmerpackager-a530b74b-8186-4b86-932e-aeebb8269db4","benefits":["Employee discount","Paid time off","Parental leave"],"selectedSkills":["21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=338rQ8Z3HPkqsJnm7u-4U7z-H8RUATYw0QkiQKd8XcsV_J7_j6Oe0g"},{"position":"Laboratory Manager","labName":"ACT Laboratories, LLC","location":"Ballston Spa, NY","age":"1 day ago","type":"Full-time","salaryMin":"$65,000 ","salaryMax":" $80,000 a year","jobDescriptionCopy":"ACT Laboratories\n\nJob Description\n\nJob Title: Laboratory Manager\n\nReports To: Chief Operating Officer\n\nDate: May 3, 2022\n\nJob Summary:\n\nCoordinate and oversee daily activities of an assigned production laboratory facility and provide leadership to a laboratory operations team performing chemical, microscopic and/or microbiological testing procedures\n\nEssential Duties and Responsibilities:\n\nEnsure testing samples are properly received, organized and prepared for testing procedures\nEnsure laboratory testing is completed accurately and timely according to all standard operating procedures and in compliance with federal, state and/or local regulations\nEnsure test results and other data are accurately and timely entered into the Laboratory Information Management System\nEnsure test results are timely and accurately transmitted/delivered to customers; discuss results with customers and address customer questions, comments and concerns\nEnsure all Quality Control / Quality Assurance protocols are followed and verified\nPrioritize work, manage workflow and coordinate employee efforts to achieve accurate and timely results\nPerform audits; respond timely and address items identified during audits/inspections\nEnsure laboratory is clean, organized and efficiently operating and laboratory equipment is properly calibrated and maintained\nReview and update standard operating procedures as needed; ensure standard operating procedures are appropriately and timely implemented at the assigned laboratory\nPerform work of laboratory employees as needed based upon workflow and staffing\nPerform initial troubleshooting of testing issues and inform technical experts of existing issues in a timely fashion\nInform leadership on emerging compliance and customer issues\nWork with leadership to define and maintain laboratory capacity\nSupport laboratory operations key initiatives\nAssume bottom-line responsibility for laboratory operations including identifying areas of operational efficiencies\nEstablish and maintain productive working relationships with people inside the laboratory and people outside the laboratory including customers, regulatory staff and corporate staff\n\nSupervisory Responsibilities:\n\nManage employees that may include Lead Laboratory Technicians, Laboratory Technicians, Drivers / Samplers and Administrative Assistants\nCarry out supervisory responsibilities in accordance with the organization’s policies and applicable laws; responsibilities include: interviewing, hiring and training, onboarding, staffing/workplace planning, assigning and directing work, scheduling, evaluating performance, recognizing and rewarding, disciplining, addressing complaints and resolving problems\n\nAdditional Responsibilities:\n\nVisit customer sites to investigate/advise customers on issues including contamination\nConduct or oversee inventory and order/arrange for pick up or delivery of laboratory reagents/supplies/materials as needed\nPerform/participate in research and development initiatives/projects\nPerform other duties as may be assigned\n\nQualifications:\n\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skills, and/or abilities required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nEducation and/or Experience:\n\nBachelor’s degree with a major in chemistry, biology or other related science major required\nLaboratory experience required\n3-5 years supervisory experience preferred\n\nKnowledge, Skills and Abilities Required:\n\nKnowledge of federal, state and local laws regarding testing, cultivation, processing and transport of cannabis products\nKnowledge of laboratory applications of biology, microbiology and chemistry\nExemplary customer service skills\nAbility to use a variety of laboratory equipment and instruments including incubators, scales/balances, pipettes, chromatographs, PCR equipment and mass spectrometers\nAbility to use computers and computer software programs and systems and standard office equipment such as phones, photocopiers and fax machines\nGood written and verbal communication skills to convey and receive information effectively (face-to-face, telephone and electronic)\nGood analytical and judgment skills\nDetail-oriented\nAbility to maintain confidentiality regarding test results, personnel and/or financial data\nExcellent organizational skills to work independently, prioritize, handle multiple tasks, manage time\nLeadership skills including comfort with decision-making responsibilities, coaching, teaching and counseling, ability to inspire and build confidence in others and forge alliances and garner support\n\nCertifications, Licenses, Registrations:\n\nValid driver/operator license\n\nSafety Sensitive Position:\n\nEquipment or vehicles used and activities performed by this position that could cause serious injury or death to the operator, other employees and/or other individuals if not used properly or safely:\n\nDriving/operating cars/vans\nWorking with testing equipment with hot surfaces\nHandling chemicals including acids and solvents used in the testing process\n\nPhysical Demands:\n\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nProlonged periods of sitting at a desk and working on a computer, walking/moving around and standing, talking and hearing and using hands to handle, control or feel objects, tools or controls\nOccasional periods of stooping/kneeling, bending\nLifting up to 10 pounds regularly and up to 25 pounds occasionally\nClose vision and ability to focus on computer screens and documents; distance vision; peripheral vison; depth perception; color vision\n\nWork Environment:\n\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. The employee works in a laboratory environment.\n\nWhile performing work-related duties the employee occasionally works with hazardous, toxic or caustic chemicals such as acids and solvents, works around fumes or airborne particles from laboratory chemicals used/fume hoods works with or near moving mechanical parts from laboratory equipment and works with equipment that vibrates. The noise level in the work environment is usually moderate.\n\nStressful Conditions in the Work Environment Affecting This Position:\n\nChallenging work demands including heavy workload/work quantity or quality demands, time demands, conflicting/multiple deadlines or tasks, infrequent rest breaks, long or unpredictable work hours and shiftwork\nChallenging situations including dealing with difficult customers/vendors/employees and interpreting data\n\nWork Schedule:\n\n40-hour minimum workweek; Monday - Friday\nMay require on-call duty and the ability to work outside of scheduled work hours including weekends and holidays when the need arises\nSome travel during the day and overnight - to other laboratories, attend seminars, training and/or conferences\n\nThis job description is intended to describe the essential functions of and requirements for the successful performance of this position. It is not to be interpreted as an exhaustive statement of duties, responsibilities or requirements of this position, nor is it intended to limit the authority of any manager to assign and direct the activities of employees under his or her direction.\n\nJob Type: Full-time\n\nPay: $65,000.00 - $80,000.00 per year\n\nBenefits:\n\n401(k)\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\nMonday to Friday\n\nSupplemental Pay:\n\nBonus pay\n\nAbility to commute/relocate:\n\nBallston Spa, NY 12020: Reliably commute or planning to relocate before starting work (Preferred)\n\nEducation:\n\nBachelor's (Required)\n\nExperience:\n\nSupervising experience: 3 years (Preferred)\n\nWork Location: One location","slug":"laboratory-manager-45299438-de0c-407e-8fe9-1bcc0ff03fe9","benefits":["Dental insurance","Health insurance","401(k)","Paid time off","Vision insurance"],"selectedSkills":["Laboratory experience","Leadership","Communication skills","Microbiology","Spectrometer","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=M1NDYctnrwAh0_0tQgslg9HneVJDTBgmK5nmNO_skfH0DNINS0eAKw"},{"position":"Laboratory Director","labName":"US Cannabis Laboratories","location":"Needles, CA","age":"6 hours ago","type":"Full-time","salaryMin":"$80,000 ","salaryMax":" $120,000 a year","jobDescriptionCopy":"US Cannabis Laboratories Lab Director\n\nUS Cannabis Laboratories is seeking a qualified lab director for our Needles, CA lab. We are looking for a dynamic, self-starter who is interested in growing with our company. US Cannabis Laboratories is a cannabis compliance testing lab. Previous management experience is not required.\n\nLaboratory Manager Responsibilities:\n\nManages direct reports\nResponsible for the overall operation and administration of the laboratory\nOversee and maintain methods and SOPs making sure that they are up to date and compliant\nAvailability to staff during working hours\nHelp to conduct interviews and staff reviews\nEnsure that the laboratory is compliant with ISO and BCC requirements\nCoordinate and implement employee training\n\nRequired Skills and Experience:\n\nAdvanced understanding of analytical chemistry and analytical methodologies\nExperience with three or more of the following: LC, LC/MS/MS, GC/MS, ICP-MS, and PCR\nAttention to detail\nAbility to work as part of a team, self-motivating, and a positive attitude\nAbility to learn new techniques, perform multiple tasks simultaneously, keep accurate records, and follow instructions\nAdept at interpretation of LC-MS/MS, ICP-MS, LC, and GC/MS data\nStrong background with analytical chemistry techniques, methods, and calculations\nComfortable in a fast-paced environment\nMethod development and R&D experience a plus\nBachelor’s/Master’s degree in relevant field such as chemistry, biochemistry, biology, or chemical engineering. Experience may be substituted for education.\nAt least 1-4 years laboratory experience, preferably in a regulated environment (environmental, pharmaceutical, etc.)\n\nJob Type: Full-time\n\nPay: $80,000.00 - $120,000.00 per year\n\nBenefits:\n\nPaid time off\n\nSchedule:\n\n8 hour shift\n\nSupplemental Pay:\n\nBonus pay\n\nCOVID-19 considerations:\nMasks required on-site.\n\nAbility to commute/relocate:\n\nNeedles, CA 92363: Reliably commute or planning to relocate before starting work (Preferred)\n\nEducation:\n\nBachelor's (Preferred)\n\nExperience:\n\nResearch: 1 year (Preferred)\n\nWork Location: One location","slug":"laboratory-director-68aac814-7514-43dc-ad57-8dbf82545755","benefits":["Paid time off"],"selectedSkills":["Research","Laboratory experience","Management","Analytical chemistry","Research & development","Bachelor's degree","Master's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=608IFQbl_-aeCDfqFl9m0ydYudtMGzjsB9lFqP0lvJdiDsgwmmreCg"},{"position":"Sampling Technician for a Cannabis Lab","labName":"Veda Scientific","location":"Lompoc, CA","age":"2 days ago","type":"Full-time | Part-time","salaryMin":"$18 ","salaryMax":" $21 an hour","jobDescriptionCopy":"SAMPLING TECHNICIAN\nJOB DESCRIPTION\n\nBASIC FUNCTION:\nThe Sampling Technician will collect representative samples from a batch of cannabis plant materials and manufactured products according to state-approved standard operating procedures while documenting the activity by filling up the required forms. Must be able to drive to sampling sites, perform unbiased sampling procedures, follow laboratory protocols, and assist with the housekeeping operations of the laboratory.\nSupports laboratory staff by maintaining glassware, logs and record books, inventory, and helping with special projects. Sampling technicians ensure that representative samples are taken at customer sites without compromising their cleanliness and integrity, which are then delivered to the laboratory securely and with proper documentation. They will also be asked to help in the laboratory.\n\nRESPONSIBILITIES AND AUTHORITY:\n\nWorks under general supervision, expected to perform job functions independently\nCollects samples as product or raw materials while maintaining their integrity.\nFollow standard operating procedures for sampling and be competent in executing steps of the sampling plan for acquiring samples for cannabis testing\nCount, measure, weigh and label samples as needed and place in approved sampling containers\nEnsures sample containers and all related paperwork are labeled with identifying data, location of sample, date, time of collection, and other information required on the forms\nEnsure sampling equipment and tools are clean and in a workable condition, making any necessary orders and adjustments to sampling supplies as needed\nDelivers samples to the laboratory for analysis\nReport any sampling irregularities to laboratory director and management\nMay also have sample preparation or lab responsibilities, as required by business needs\nMay assist laboratory analysts as required\nMaintains a safe working environment\nMaintains Driver Safety Certification\nProvide administrative assistance\nAttend and participate in group and project meetings\nUpdate job knowledge by participating in educational opportunities\nPerforms other duties as assigned\n\nQUALIFICATIONS AND SKILLS:\n\nEducation\n\nHigh school diploma or GED equivalent.\nAn Associate or Bachelor’s degree in chemistry, physical science, biology or environmental science or related field is preferred.\n\nExperience\n\nLaboratory and field experience is required. Must have a valid driver’s license with a clean driving record. Experience in the hemp industry is a plus.\n\nSkills\n\nAbility to follow protocol and perform tasks according to specifications\nExcellent IT skills\nExcellent writing skills to document research process and results\nCommunicates effectively both individually and in small group situations\nCorrectly interprets documents such as safety rules and operating manuals\nGood at following directions to ensure the end results are accurate\nCustomer Centrix and team player attitude\nReliable and trustworthy\nStrong conceptual thinking and innovative skills and ability integrate input from diverse fields of research and sample testing\nStrong interpersonal skills\nExcellent judgment and decision making capabilities\nFlexibility to acquire additional competencies and skill sets as mandated by the changing needs of the organization\n\n________________________________________________________________\n\nPOSITION TITLE: Sampling Technician\n\nFair Labor Standards Act (FSLA) Status: Non-Exempt\n\nSupervisory Responsibility: Yes\n\nReports to: VPLO\n\nI have read and understand this explanation and job description. The information contained within it appears to be accurate to the best of my knowledge. This job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee. * The employee is expected to comply with organizational policies, procedures, and documents specific to their position* .\n\nEmployee: ___________________________\nSupervisor: ________________________\n\nDate: _____________________ Date: _____________________\n\nJob Types: Full-time, Part-time\n\nPay: $18.00 - $21.00 per hour\n\nBenefits:\n\n401(k)\nDental insurance\nFlexible schedule\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\nMonday to Friday\nOn call\n\nEducation:\n\nAssociate (Required)\n\nWork Location: One location","slug":"sampling-technician-for-a-cannabis-lab-1e6ba496-39d7-495b-ad46-ec266c045c7c","benefits":["Dental insurance","Health insurance","Paid time off","Flexible schedule","401(k)"],"selectedSkills":["Writing skills","Research","Driver's License","Laboratory experience","Bachelor's degree","High school diploma or GED","Associate's degree","Clean driving record"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=prKLcFFtl_Gxw7dC-hfb7QUbqv9ViLdszpohEp1DisGc7NcvFFBwPg"},{"position":"Laboratory Analyst","labName":"VRX Labs","location":"Long Beach, CA","age":"7 days ago","type":"Full-time","jobDescriptionCopy":"We are a cannabis safety and compliance testing lab. Our goal is to sell testing services to growers, manufacturers / extractors, and distributors of cannabis products. Without certified test results for Pesticides, Residual Solvents, Heavy Metals, Microbiological contaminants, Potency, and Mycotoxins, no cannabis product may be legally sold in the state of California.\n\nThe Laboratory Analyst will be accountable for conducting tests and preparing documentation for DCC compliance testing. Under general supervision of the Lab Director or supervisor, the Laboratory Analyst conducts routine technical tasks in the lab and provides basic technical assistance in other areas.\n\nDescription:\n\nPerform sample batching, sample and QC preparation, solvent, and other reagent preparation\nPerform data acquisition, analysis of data, and report preparation for the testing/screening using validated analytical methods and appropriate SOPs\nReview analytical raw data and upload appropriate documentation to LIMS\nIdentify and assign sample re-tests\nAs assigned, perform advanced lab support functions such as calibration standard preparation, analytical equipment tuning and maintenance, and analysis of data used for laboratory quality control\nAs assigned, support and/or lead laboratory process, method, and operations improvement projects\nAs assigned, assist with the upkeep and improvement of elements of the quality management system such as SOPs and the training program\nCompliance with local and state guidelines requiring chain of custody of controlled substances\nMaintain a safe, clean, well-organized, and efficient laboratory work environment\n\nQualifications:\n\nBachelor’s Degree in biological, chemical, agricultural, environmental, or related sciences from an accredited college or university is preferred\nAt least 2 years of experience in a regulated or high throughput laboratory environment is required\nExceptional wet laboratory technique and ability to perform documentation for ISO/NELAC standards\nCandidate must have experience with some or all the following instrumentation: LC-MS/MS, GC-FID, GS-MS, and ICP-MS\nPreferably candidates with LC-MS/MS experience. Sciex experience is a plus.\n\nPhysical Demands\n\nThe Laboratory Analyst must be able to move about the laboratory\nAbility to lift 50lbs\n\nPersonal Characteristics\n\nMust be able to multi-task\nMust be detail-oriented\nMust be highly motivated and able to work efficiently in a fast-paced environment\n\nJob Type: Full-time\n\nPay: From $23.00 per hour\n\nSchedule:\n\n8 hour shift\n\nAbility to commute/relocate:\n\nLong Beach, CA 90813: Reliably commute or planning to relocate before starting work (Required)\n\nApplication Question(s):\n\nDo you have experience with the following instruments: LC-MS/MS, GC-FID, GS-MS, and/or ICP-MS?\n\nEducation:\n\nBachelor's (Required)\n\nExperience:\n\nLaboratory: 2 years (Required)\n\nWork Location: One location","slug":"laboratory-analyst-45c0c2a0-d3c8-41d1-a400-f8223df5e44e","benefits":[],"selectedSkills":["Laboratory experience","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=03Br-B1LqMAnexXfaeAZm-AgS0sEYTG5xyxRIOf2sgE2JRc1RgDpNQ"},{"position":"Quality Assurance Manager - Testing Lab","labName":"RDP Development","location":"Las Vegas, NV","age":"2 days ago","type":"Full-time","salaryMin":"$45,000 ","salaryMax":" $60,000 a year","jobDescriptionCopy":"We are a Cannabis Testing Lab based in Las Vegas. Our goal is to protect patients and consumers by certifying that the product they are consuming have undergone the same level of stringent testing as other drug and food products.\n\nQuality Manager\n\nResponsibilities within the ISO 17025:2017 Quality Management System\nThe Quality Manager has defined responsibility and authority for ensuring that the quality management system related to quality in the laboratory is implemented and followed at all times. The Quality Manager has direct access to the highest level of management where decisions are made on laboratory policy or resources.\n\nThe Quality Manager maintains the master list identifying\nthe current revision status and distribution of documents in the QMS to prevent the use of obsolete documents.\n\nRequired Qualifications, Training & Skills\n\nMust be self-motivated, energetic and possess the ability to work in a diverse GLP laboratory environment under a QMS. Candidate must have deep understanding of analytical techniques with hands-on experience in method development leading to the creation of SOPs, LIMS interface and basic chemistry techniques e.g. HPLC, GC-MS, LC-MS.\n\nThis position requires the candidates to have adequate statistical analysis skills, good concept of quantification, accuracy/variation, and organizational skills. Candidates must have the ability to work independently with minimal supervision; have strong trouble-shooting, computer and record keeping skills and problem-solving skills.\n\nSpecifically\n\nServes as the focal point for the QMS\nOversees and provides secondary approval for all certificates of analyses published by lab\nApproves all controlled laboratory documentation\nOversees quality control data.\nEvaluates data objectively and performs assessments without managerial influence.\nMaintains ISO 17025 accreditation and compliance with State and local regulatory requirements, including quality checks and compliance of safety standards such as, but not limited to, OSHA, Fire Marshall and Police\nOversees the Quality Assurance and Control Program\nManages and maintains all laboratory controlled documentation\nPerforms internal audits, including both technical and quality systems and direct any necessary corrective action notifying management of deficiencies or opportunities for improvement\nDevelops and maintains laboratory policy and procedural manuals, quality procedures, SOPs, equipment requirements, and evaluating and implementing new procedures as necessary.\nPerforms, schedules, and records internal laboratory inspections as necessary\nOversees the LIMS and general records management.\nProvides oversight of human resources and any adherences required as an equal opportunity facility\nServes as the laboratory safety officer with oversight on all safety systems in adherence with ISO 17025, OSHA, NAC 453A, and any other laboratory safety organizations\nMaintains chemical/equipment traceability records and generating control charts.\nMaintains training records for all lab staff.\nGenerates training plans for all laboratory staff.\nCreates and maintains internal training processes for all laboratory staff including (but not limited to) any necessary retrainings, safety training, good laboratory practices, quality assurance programs, and continuing education\nSchedules proficiency testing for all analytes\nMonitors CAPAs, non-conformances, OOS, failed tests, repeat tests employee incidents, and client complaints for areas of improvement\nMay oversee and sign-off on any laboratory documentation as needed\nMay step in and perform any tasks assigned in the lab as needed\n\nDesired Skills\n\nDemonstrated expertise in sample chain of custody protocols, large dataset analysis, should be aware of emerging analytical techniques, experience using LIMS, familiar with cGMP and GLP requirements, as well as working under a Quality Management System are favored.\n\nRequired Education, Expertise & Experience\n\nA Bachelor’s Degree (BS) or greater in chemistry, biochemistry, microbiology or equivalent with 5 years of relevant experience is REQUIRED.\n\nExcellent written and oral communication skills, previously demonstrated successful managerial or supervisory experience and previously demonstrated successful ability to contribute in a team Quality Management System environment are essential.\n\nJob Type: Full-time\n\nPay: $45,000.00 - $60,000.00 per year\n\nBenefits:\n\nHealth insurance\nPaid time off\n\nSchedule:\n\nMonday to Friday\n\nAbility to commute/relocate:\n\nLas Vegas, NV 89102: Reliably commute or planning to relocate before starting work (Preferred)\n\nExperience:\n\nISO 9001: 1 year (Preferred)\n\nWork Location: One location","slug":"quality-assurance-manager-testing-lab-54c962db-dfe9-4577-ade3-bc2e758fc1b8","benefits":["Health insurance","Paid time off"],"selectedSkills":["Statistical analysis","ISO 9001","Computer skills","CGMP","Laboratory information management systems","Bachelor of Science","Bachelor's degree","US work authorization"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=hdAkyb-kLCwQDt0K_-SmUY4DyqmiijWxKnU7CWlZ5V-qYG2mCeaNXw"},{"position":"Cannabis Lab Technician","labName":"Sanctuary Medicinals","location":"Apopka, FL","age":"2 days ago","salaryMin":"$29,000 ","salaryMax":" $40,000 a year","jobDescriptionCopy":"Sanctuary Medicinals is seeking a highly competent, driven, and diligent candidate for a Laboratory Technician role in our extraction lab. The Laboratory Technician will work under the Laboratory Manager and, under their direction, be responsible for the production of Sanctuary's extract products, from extraction to post processing. Responsibilities include:\n\n\nRunning extractions using a variety of solvents according to established SOPs *Maintaining laboratory equipment as needed and able *Cleaning up the laboratory at the end of each day and ensuring the space is ready to run in the morning *Winterizing and filtering raw extract *Running short path distillations on extract *Generating dabbable extracts by following established SOPs *Preparing samples for analytical testing *Keeping and maintaining records of material used and generated both digitally and on paper\nThis position is Monday to Friday 8:00am to 4:30pm. The Laboratory Technician will report to the Laboratory Manager and Laboratory Director\n\nRequirements:\n\nTHIS IS A PHYSICAL JOB - ability to lift and carry objects up to 50lbs, perform repetitive wrist and arm motions, and transition between squatting and standing positions consistently throughout the workday is required *Strong communication skills and ability to follow detailed directions *Associates degree or higher in chemistry, engineering, biology, or similar field a plus *Previous production laboratory experience a plus *Working knowledge of basic solvent handling, pressurized gas behavior and thermodynamic flow is required *Strong desire to work in the cannabis industry *Competence in algebra and basic mathematics *Strong attention to detail and ability to keep clean documentation *Mechanical aptitude and ability to troubleshoot and perform basic repairs on equipment a huge plus *Ability to work both quickly and carefully *Ability to run procedures using both metric and imperial measurement units *Must be 21 years or older. *Must Pass Florida background checks *Ability to work on your feet the majority of the day in a fast-paced environment\nAvailable shifts and compensation: Available shifts all days except Sundays and Saturdays. Compensation depends on your experience.\n\nAbout Sanctuary Medicinals: Sanctuary prides itself on cultivating premium quality marijuana. We are a compassionate group of New England citizens who believe that this goal can only be accomplished through a caring, trusting, and knowledgeable approach. We offer a wide range of products to accommodate individual preferences and needs from tinctures, edibles, topicals to concentrates. Our friendly and caring staff is here to help you understand how cannabis works and what is the best strain for you. A true sanctuary, free from harm, judgement, and prejudice.\n\nBy applying to this job, you agree to receive periodic text messages from this employer and Homebase about your pending job application. Opt out anytime. Msg & data rates may apply.\n\nPowered by Homebase. Free employee scheduling, time clock and hiring tools.","slug":"cannabis-lab-technician-4ab0f614-73d9-4b4b-b08b-ab87c3d3082b","benefits":[],"selectedSkills":["Laboratory experience","Communication skills","Basic math","Mechanical knowledge","Associate's degree","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=VVExbW0DbKn1TIQXH12uC2q-13sjp9_-Bbjr660JdGrPO4OzZ32Cvg"},{"position":"Chemist","labName":"VidaCann","location":"Jacksonville, FL","age":"6 days ago","type":"Full-time","salaryMin":"$39,000 ","salaryMax":" $52,000 a year","jobDescriptionCopy":"Who we are:\n\nWe are a vertically integrated Florida owned Medical Marijuana treatment center. We are one of the largest and most advances providers of medical cannabis in Florida. Our mission is to help others live their healthiest lives with the help of our all-natural canna products. We have a long history of growing high-quality products using sustainable, organic cultivation methods.\n\nGeneral Purpose\n\nThe Analytical Chemist will test raw material and final products. Performs duties in the laboratory to support company goals.\n\nPrimary Responsibilities.\n\nPreforms potency testing using an Shimadzu HPLC\nPerform calibrations and routine maintenance of analytical instrumentation as needed\nPerform data review and data analysis utilizing validated analytical methods\nTroubleshoots equipment, laboratory protocols and procedures.\nFormulates new products, from development to commercialization, within defined company, industry, and regulatory parameters\nEstablishes guidelines and criteria for acceptance and testing of chemical raw-materials in finished blends\nDemonstrate ability to multitask and prioritize projects efficiently in a high throughput environment\nUses seed-to-sale tracking software.\n\nQualifications\n\nMinimum of BS Degree in Chemistry.\nProficient in computer usage, such as data/document systems, Microsoft Office software, etc.\nExperience working in the lab with chromatographic separation techniques (i.e. HPLC and GC) is highly desirable\n\nJob Type: Full-time\n\nBenefits:\n\nDental insurance\nEmployee discount\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\n\nWork Location: One location","slug":"chemist-5e303219-be2d-4335-aa53-07252e6ea1d9","benefits":["Paid time off","Dental insurance","Employee discount","Health insurance","Vision insurance"],"selectedSkills":["Laboratory experience","Microsoft Office","Bachelor of Science","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=cZOl0pgQl5i03Mv17nTNonvh5KEe0HWEtn1W2Tgu-Yf78FGV6n45Kw"},{"position":"Cannabis Extraction Chemist","labName":"Kaycha Labs","location":"Albany, NY","age":"8 days ago","type":"Full-time","salaryMin":"$39,000 ","salaryMax":" $50,000 a year","jobDescriptionCopy":"Company Overview:\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\nJob Purpose:\n\nThe Lab Technician, Level I is responsible for working closely with our laboratory team to develop analytical skills and related experience. This position consists of many aspects from homogenizing, weighing and extracting samples, performing quality control checks, verifying various support equipment and properly disposing of all waste.\n\nOpen Shifts:\n\nMonday - Friday\n\nTuesday - Saturday\n\nSunday - Thursday\n\nEssential Duties & Responsibilities:\n\nExecute laboratory protocol and procedures under the supervision of the Lab Director.\nRegularly display good laboratory technique to avoid cross-contamination or misidentified samples.\nPerform sample preparation procedures including homogenization, weighing and liquid extraction.\nPerform QC duties as assigned, including LCS and matrix spikes.\nPerform qualitative and quantitative tests, as assigned.\nUtilize the LIMS system to create batches, enter sample prep information and maintain physical and electronic records.\nAdhere to ISO 17025 standards as well as state regulatory requirements.\nPromote a strong customer service culture while adhering to the highest safety and industry standards.\nOther duties and/or special projects as assigned.\n\nSkills, Abilities and Competencies:\n\nAbility to maintain an incredibly high degree of attention to detail and accuracy.\nStrong agility, engagement, and flexibility in an ever-changing environment.\nWorking knowledge of logging, organizing, and analyzing data.\nAbility to work in a dynamic, fast-paced deadline environment while successfully managing multiple tasks.\nStrong knowledge of Microsoft Office, including Excel, PowerPoint, and Word.\nWorking knowledge of standard laboratory protocol.\nExcellent communication skills and ability to effectively work, problem solve, and communicate with multiple levels of the organization.\n\nEducation & Experience:\n\nMinimum of Bachelor’s degree in chemistry, biochemistry or related field based on state requirements.\n0-1 year of lab experience.\nKnowledge of principles, terminology, practices, techniques commonly used in a laboratory setting preferred.\nExposure to the cannabis industry is a plus.\n\nOther:\n\nMust pass Level 2 background check.\nMust be at least 21 years old.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status\n\nJob Type: Full-time\n\nSchedule:\n\nWeekend availability\n\nCOVID-19 considerations:\nFace masks required.\n\nApplication Question(s):\n\nBest email/phone number to reach you at?\nWhat is your desired compensation range?\n\nEducation:\n\nBachelor's (Required)\n\nExperience:\n\nLaboratory experience: 1 year (Preferred)\nAnalytical chemistry: 1 year (Preferred)\n\nWork Location: One location","slug":"cannabis-extraction-chemist-0225d1fd-5a50-44ae-b937-64fb1ba75e43","benefits":["Dental insurance","Health insurance","Vision insurance"],"selectedSkills":["Analysis skills","Microsoft Excel","Microsoft Powerpoint","Laboratory experience","Communication skills","Bachelor's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=s_Lm6CgJq1Bf1YasvOdNKngHo1PTPGPdabihy1LYbbF-iacr-OzmnQ"},{"position":"Analytical Chemist (with LC-MS-MS & GC-MS-MS experience)","labName":"Purevita Labs","location":"West Warwick, RI","age":"7 days ago","type":"Full-time","salaryMin":"$50,000 ","salaryMax":" $55,000 a year","jobDescriptionCopy":"COMPANY OVERVIEW:\n\nPureVita Labs is a full-service regulatory and consulting analytical laboratory that offers our clients a comprehensive panel of services to ensure that their cannabis and hemp products are in full compliance with all regulatory requirements for retail sale. Equipped with the most advanced, state-of-the-art analytical instrumentation, expertise in the analytical testing of cannabis, and carefully designed scientific methodology, we are setting a new standard for accuracy and consumer safety in the cannabis industry. Our dedicated team of physicians and scientists are working passionately to advance knowledge and understanding of the complex entourage effects of specific cannabinoid/terpene combinations and individual dose sensitivity on user experience.\n\nhttps://purevitalabs.com/\n\nQUALIFICATIONS:\n\nBS in Chemistry\nA minimum of 1 year’s analytical laboratory experience\nAn understanding of Chromatography and Mass Spectrometry\nStrict attention to detail and ability to adhere to protocol\nStrong communication skills\n\nRESPONSIBILITIES & DUTIES:\n\nThe Analytical Chemist’s primary role is to prepare samples and perform tests on our Pesticides analytical chemistry testing equipment as establishing in our Standard Operating Procedures. This position is responsible for carry out the required procedures to generate accurate analytical data for samples presented to the laboratory for testing. This includes, but is not limited to, instrument calibration, preventive maintenance, and the data analysis for each test performed.\n\nSample Receiving & Preparation: Receive samples at the laboratory, enter data into internal tracking system. Prepare samples for analysis using a variety of sample preparation devices and techniques such as extraction, freezer milling, grinding and microwave digestion.\nTesting for Volatile & Non-Volatile Pesticides: Use GC-MS-MS with liquid injection for the quantitative analysis of volatile pesticides and use LC-MS-MS for the quantitative analysis of non-volatile pesticides in cannabis containing products.\nOther potential testing (cross-training): (1) Cannabinoid & Terpene Profiling (UHPLC and photo diode array detection, GC-MS-MS with headspace injection), (2) Residual Solvent Testing (GC-MS-MS with headspace injection) and (3) Elemental Analysis (ICP-MS).\nData Reporting: Ensure that the analytical data and test results have passed the relevant QC data checks before uploading data in to the relevant data management/LIMS system.\n\nQUALIFICAITONS & SKILLS:\n\nBS in Chemistry\nA minimum of 1 year’s analytical laboratory experience\nExperience at running and developing chemistries on LC-MS-MS\nExperience with GC-MS-MS as both a quantitative and qualitative tool\nExperience at troubleshooting and maintaining analytical instrumentation\nSome previous experience with cannabis or hemp cultivation is desirable, but not required\nExperience with basic office computer applications (Word, Excel)\nExcellent written and oral communication skills\nExcellent time management skills with ability to multi-task, effectively manage changing priorities and remain calm under pressure\nAbility to demonstrate teamwork and collaborate effectively on projects\nDemonstrate initiative, responsibility, accountability, and dependability toward assigned tasks and duties\nAbility to demonstrate professional, positive attitude toward assigned tasks, projects and colleagues\n\nBENFITS:\n\nHealthcare\nPaid vacation and sick time\nEquity\n\nJob Type: Full-time\n\nPay: $50,000.00 - $55,000.00 per year\n\nBenefits:\n\nHealth insurance\nPaid time off\n\nSchedule:\n\nMonday to Friday\n\nSupplemental Pay:\n\nBonus pay\n\nApplication Question(s):\n\nA minimum of 1 year’s analytical laboratory experience\nBS in chemistry\n\nWork Location: One location","slug":"analytical-chemist-with-lcmsms-gcmsms-experience-d3d8a925-b528-45f8-84af-2d0dd103b19c","benefits":["Health insurance","Paid time off"],"selectedSkills":["Gas chromatography","Microsoft Excel","Laboratory experience","Communication skills","Chromatography","Bachelor of Science","Bachelor's degree","US work authorization"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=GRUyoa_oYuNAmYtPdVvabeaKnMVdxPJJGjvYbZ1iAgvV_kTLN8ftUw"},{"position":"Laboratory Technician","labName":"Curaleaf","location":"Biddeford, ME","age":"4 days ago","salaryMin":"$32,000 ","salaryMax":" $41,000 a year","jobDescriptionCopy":"Curaleaf Holdings, Inc. (CSE: CURA) (OTCQX: CURLF) (\"Curaleaf\") is a leading international provider of consumer products in cannabis, with a mission to improve lives by providing clarity around cannabis and confidence around consumption. As a high-growth cannabis company known for quality, expertise, and reliability, the company and its brands, including Curaleaf and Select provide industry-leading service, product selection, and accessibility across the medical and adult-use markets. In the United States, Curaleaf currently operates in 23 states with 123 dispensaries, 25 cultivation sites, and over 30 processing sites, and employs over 5,000 team members. Curaleaf International is the leading vertically integrated cannabis company in Europe with a unique supply and distribution network throughout the European market, bringing together pioneering science and research with cutting-edge cultivation, extraction, and production. Home | Curaleaf | Cannabis with Confidence\n\nOur corporate social responsibility is Rooted In Good Diversity, Equity, Inclusion + Social Equity + Sustainability Social Responsibility | Curaleaf | Cannabis with Confidence We believe in taking corporate and social responsibility very seriously, from our educational outreach to national partnerships, state-wide initiatives and local causes. Giving back to the communities where we operate is important to us, and helps to change old attitudes by showing the positive impact of cannabis in creating jobs, changing lives, and helping local communities.\n\nWe educate. We advocate. We give.\n\nWe are looking for a Laboratory Technician to join our growing team! The Laboratory Technician will work within the Processing Laboratory Department and report to the Lab Manager. The Laboratory Technician will assist the Lab Manager by carrying out day-to-day tasks. This task includes but are not limited to: Prepping chemicals, preventative maintenance, Calibration, Tracking, Documenting, Packaging, Labeling, and Cleaning, in accordance with the state of Maine and standards set by Curaleaf. It is expected that you will learn and be able to perform all tasks within the laboratory area.\n\nPrimary Duties and Responsibilities:\nKeeping their workspace clean (cleaning glassware, wiping down their work station, mopping, etc.)\nTracking data through paperwork and on an iPad using our electronic batch record system\nUsing our internal tracking systems BioTrack and METRC\nResponsible for increasing operational efficiency and reducing waste through ownership, teamwork, communication and collaboration.\nPerform in-process and post-process quality assurance testing and conducting visual inspections to ensure all product meets or exceed CL's specifications and patient's expectations.\nEnsures 100% compliance involving proper weighing, data recording, product tracking and security throughout all processes.\nConsistently operates in an efficient manner that also complies with all OSHA regulations, CSATC SOP's, CL SOP's, and all applicable required procedures\nResponsible for ensuring each product is properly labeled in compliance with the MA Regulations\nTake instructions and help out on tasks delegated by laboratory management\nResponsible for the preparation of material to be processed in accordance with daily task\nEnsures consistency and efficacy of product through quality control testing\nPerforms all other assigned duties required to ensure a clean and safe production facility\nHas understanding of Good Manufacturing Practices (GMP) and all safety procedures to ensure the highest level of safety\nCompletes the sanitation of all production equipment and tools including workspace, all equipment, containers, and appliances\n\nQualifications:\nMust be at least 21 years of age\nSubject to background check per state cannabis regulations\nHigh School diploma or General Education Diploma (GED)\nExcellent verbal interpersonal communication skills to interact with team members\nMust possess basic math skills\nMust have be highly organized with strong attention to detail\nHave an understanding of weights and measurements\nMust be comfortable working in fast paced environment\nMust have the ability to adapt\nExperience with safe handling and proper disposal of harmful chemicals and hazardous waste\nAdaptable/flexible and able to work in an ever-changing environment\nPrevious agriculture or manufacturing experience preferred but not required\nAbility to work independently throughout a workday with given directive\n\nPhysical Requirements:\nStanding, bending, and lifting-up to 50 pounds, carrying product totes, pushing carts, moving and making adjustments to process equipment\nHave the ability to climb and work on raised platforms\nClose vision (clear vision at 20 inches or less)\nManual dexterity sufficient to reach/handle items, work with fingers\n\nFacility Environment\n\nAllergen warnings -Potential exposure to dust, pollen, and plant pathogens.\nExposure to cleaning solvents, such as high volumes of isopropyl alcohol\nAll jobs require daily use of provided PPE, such as masks, hair nets, beard covers, respirators, boot covers, scrubs, non-slip shoes, and Tyvek suits as necessary\nExposure to loud noises, including but not limited to air compressors, packaging equipment, and alarms.\nExposure to CO2 manufacturing procedures at OSHA approved CO2 levels\nHigh stress tolerance, adaptable, ability to work in an ever-changing environment, flexible\n\nCuraleaf is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.","slug":"laboratory-technician-f297977b-99bb-4477-ae90-c3705209cca7","benefits":["Safety equipment provided"],"selectedSkills":["Communication skills","Manufacturing","Basic math","CGMP","High school diploma or GED","Background check","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=U2RXbazTJzOSTD2Ya47vuRqoygrl1Sx2izpa26Zd-6Gzsn1QS4xJ-w"},{"position":"Lab Distillation Technician","labName":"Arvida Labs LLC.","location":"Fort Lauderdale, FL","age":"1 day ago","type":"Full-time","salaryMin":"$16 ","salaryMax":" $25 an hour","jobDescriptionCopy":"At Arvida Labs, we are coordinating a hard-working and exciting team to operate and scale-up our production processes in a compliant and efficient manner. This business is growing fast, and there is opportunity for higher levels of responsibility as performance standards are met. We value incredible people with incredible skills, but your commitment to a greater cause is what we value most.\n\nPosition:\n\nThis position will work in multiple processes in the production lab to create hemp-derived cannabinoid products. This role will be responsible for duties including distillation, reactions, analytical testing, and production of other products as needed. This role operates in a fast-paced environment to accomplish larger production goals with the rest of the team. Employee should be aware of, and able to maintain GMP regulations and handle food products in a sanitized workspace. Person must be highly motivated and capable of multitasking.\n\nDuties:\n\nEffectively fulfill duties by GMP compliant standards\nManage inventories by following the production plan and maintain accurate records\nWork efficiently in a team environment\nCarefully follow SOP’s (Standard Operating Procedures)\nHandle sensitive glassware and solvents\nIdentify and report dysfunctional equipment\nSolve or report issues relating to production efficiency\nOperate attentively and follow facility protocols and standards\nMaintain a proactive behavior around the manufacturing facility.\nDevelop expertise in distillation, testing, and formulating methods of various cannabinoid compounds.\nOperate, clean, and maintain laboratory equipment. Perform corrective and preventative maintenance on associated equipment as required.\nEnsure compliance and accuracy involving all product tracking, product security, and product movement procedures.\nPerform in-process and post-process quality assurance sampling, testing, and visual inspections to ensure all products meets or exceeds Arvida Labs’ specifications, along with patient and customer expectations. Such quality assurance work shall include, but not limited to:\nRecord and monitor process conditions to ensure compliance to standard operating procedures.\nProper weighing, data recording, and batch tracking throughout our process.\n\nRequired Experience/ Capabilities:\n\nQuality control\nKeeps a clean, pristine and organized work environment\nAble to prioritize\nFollows directions with a positive attitude\nDemonstrates interpersonal skills, professionalism, flexibility and teamwork.\n\nOur culture can be described as:\n\nDetail-oriented -- quality and precision-focused\nOutcome-oriented -- results-focused with strong performance culture\nTeam-oriented -- cooperative and collaborative\n\nQualifications\n\nBachelor's (Preferred)\nExperience: The ideal candidate will have at least one (1) to three (3) years of experience in manufacturing or laboratory environments in the food, pharmaceutical industries, or cannabis industries. Experience with short path and wiped film distillation is preferred.\n\nArvida Labs, LLC provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age disability or genetics. We value diversity, military service, and law enforcement experience. Compensation is competitive and will be commensurate with experience.\n\nJob Type: Full-time\n\nPay: $16.00 - $25.00 per hour\n\nBenefits:\n\nEmployee discount\nHealth insurance\nPaid time off\n\nSchedule:\n\nMonday to Friday\nNight shift\n\nCOVID-19 considerations:\nPersonal protective equipment provided. Sanitizing, disinfecting, and cleaning procedures in place.\n\nExperience:\n\nResearch & Development Laboratory Technicians: 1 year (Preferred)\n\nWork Location: One location","slug":"lab-distillation-technician-5c6e0f65-b81f-48e5-bf2a-47280fef17ee","benefits":["Employee discount","Health insurance","Paid time off"],"selectedSkills":["Manufacturing","Research","Sanitation","Law enforcement","Laboratory experience","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=F1IsUCVPSptFLnKPPA5j271Dtz6_oGZ0mAJzgOL0F11c85Pa1pmb8A"},{"position":"Laboratory Technician","labName":"COLUMBIA LABORATORIES, INC","location":"Portland, OR","age":"2 days ago","type":"Full-time","salaryMin":"$16 ","salaryMax":" $18 an hour","jobDescriptionCopy":"Columbia Laboratories is looking for a Laboratory Technician to join our growing team. We are a long standing, accredited food safety, cannabis/hemp, and water testing laboratory in Portland, OR. Columbia Labs is a proud member of the Tentamus Group, a global team of laboratories focused on human wellness.\n\nPrimary Responsibilities:\n\nPerform sample preparation for ICP, IC, Flow Analyzer, and water distillation.\nWork with the supervisor to determine priority of samples, including;\nStandard preparation\nSample extraction\nInstrument setup\nData entry\nProperly handle and dispose of laboratory hazardous waste.\nSeek opportunities to reduce routine laboratory costs by increased efficiency (higher throughput, decreased cost of supplies).\nExecute projects as assigned to meet changing laboratory needs and requirements.\nShared responsibility for general laboratory organization and cleanliness.\nCommunication of relevant work details to Lab Supervisor and coworkers.\nOther duties as assigned.\n\nBasic Qualifications:\n\nStrong computer, scientific, and organizational skills\nExcellent communication (oral & written) and attention to detail\nAbility to work independently and as part of a team, self-motivation, adaptability, and a positive attitude\nAbility to learn new techniques, perform multiple tasks simultaneously, keep accurate records, follow instructions, and comply with company policies\nAble to stand for long periods of time and regularly lift 20 pounds.\n\nEducation and Experience:\n\nHigh School Graduate or GED with preference for candidates with experience working in a production laboratory.\nGood knowledge of Environmental laboratory terminology, wet chemistry, bench work, equipment, materials, and the techniques/procedures commonly used in a production laboratory.\nKnowledge of LIMS, Microsoft Word, Excel, and Outlook.\nFamiliarity with EPA methodologies, regulations, and environmental data compliance.\nAuthorization to work in the United States indefinitely without restriction or sponsorship.\nPosition is full-time with overtime as needed. Day Shift Monday-Friday.\n\nWho we are:\n\nTentamus Group is a global product and safety firm with a core presence in Europe, Israel, China, Japan, and North America. Tentamus evaluates and consults on products involving the human body with strong focus on food, nutraceuticals, and cosmetics. Tentamus is represented in over 80 locations worldwide with more than 3,500 highly trained staff members.\n\nwww.tentamus.com\n\nwww.columbialaboratories.com\n\nhttps://www.linkedin.com/company/tentamus-group/\n\nJob Type: Full-time\n\nPay: $16.00 - $18.00 per hour\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nFlexible schedule\nFlexible spending account\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\nDay shift\nOvertime\n\nEducation:\n\nHigh school or equivalent (Required)\n\nExperience:\n\nLaboratory Experience: 1 year (Preferred)\n\nWork Location: One location","slug":"laboratory-technician-8ee2dcbe-9ddb-4075-ae56-bba7b7ca078c","benefits":["Health savings account","Dental insurance","Health insurance","401(k) matching","Paid time off"],"selectedSkills":["Microsoft Excel","Microsoft Outlook","Laboratory information management systems","Laboratory experience","Organizational skills","High school diploma or GED","US work authorization"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=dG-EjH6VE-6VzWqHa1_iLw2zDaTX2Ix-fLGnn6p_OfBm0vRmaS9irA"},{"position":"Analytical Lab Technician","labName":"Harrens Lab Inc.","location":"Hayward, CA","age":"7 days ago","type":"Full-time","salaryMin":"$42,000 ","salaryMax":" $56,000 a year","jobDescriptionCopy":"We are a testing laboratory on food, agricultural products, plants, hemp,cannabis, and other matrix. We test for nutritional factors, residue of pesticides, and solvents, etc. We are currently looking for a hard working talent to join our diverse team.\n\nDuties\n\norganizing testing samples\nprepare, extract and processing the samples including weighting, diluting , centrifuging etc.\nEnsure proficient workflow of samples in timely.\nanalysis the data and record into LIMS\nperform /operate , maintain and troubleshoot analytical instrumentation\nData interpretation and data entry\nMaintain a clean and safe laboratory environment on daily basis\n\nQualifications:\n\n* education on chemistry, biochemistry, bio-engineering or related area\n\n* experience on HPLC, GC, LC/MS/MS, experience with Shimadzu equipment is a plus\n\n* good communication skill and good personality\n\n* attention to details\n\n* fast path, meet the deadline and can work under the pressure\n\n* motivated and hard working\n\n*independent and team player\n\nPlease send your resume, cover letter and salary expectation to the email on indeed. We will contact the candidates who meet the requirements. Thank you very much for applying.'\n'\n\nJob Type: Full-time\n\nBenefits:\n\n401(k)\nHealth insurance\nPaid time off\n\nSchedule:\n\n8 hour shift\n\nAbility to commute/relocate:\n\nHayward, CA 94545: Reliably commute or planning to relocate before starting work (Required)\n\nExperience:\n\nResearch & Development Laboratory Technicians: 1 year (Preferred)\n\nWork Location: One location\n\nJob Type: Full-time\n\nBenefits:\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\n\nAbility to commute/relocate:\n\nHayward, CA: Reliably commute or planning to relocate before starting work (Required)\n\nExperience:\n\nResearch & Development Laboratory Technicians: 1 year (Preferred)\n\nWork Location: One location","slug":"analytical-lab-technician-fb27e5e4-17dc-4c4f-bf5c-8e12010e4b3e","benefits":["Dental insurance","Health insurance","Paid time off","401(k)","Vision insurance"],"selectedSkills":["Gas chromatography","Research","High-performance liquid chromatography","Laboratory experience","Communication skills"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=UcwZAwVWY86kfK83NctId6VsIxaiVDqR-Pc6VrFwLhZm74AxFTIJpg"},{"position":"Cannabis Extraction Technician","labName":"Kaycha Labs","location":"Knoxville, TN","age":"5 days ago","type":"Full-time","salaryMin":"$26,000 ","salaryMax":" $35,000 a year","jobDescriptionCopy":"Company Overview:\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\nJob Purpose:\n\nThe Lab Technician, Level I is responsible for working closely with our laboratory team to develop analytical skills and related experience. This position consists of many aspects from homogenizing, weighing and extracting samples, performing quality control checks, verifying various support equipment and properly disposing of all waste.\n\n*** Work shift will be include weekends every other week***\n\nEssential Duties & Responsibilities:\n\nExecute laboratory protocol and procedures under the supervision of the Lab Director.\nRegularly display good laboratory technique to avoid cross-contamination or misidentified samples.\nPerform sample preparation procedures including homogenization, weighing and liquid extraction.\nPerform QC duties as assigned, including LCS and matrix spikes.\nPerform qualitative and quantitative tests, as assigned.\nUtilize the LIMS system to create batches, enter sample prep information and maintain physical and electronic records.\nAdhere to ISO 17025 standards as well as state regulatory requirements.\nPromote a strong customer service culture while adhering to the highest safety and industry standards.\nOther duties and/or special projects as assigned.\n\nSkills, Abilities and Competencies:\n\nAbility to maintain an incredibly high degree of attention to detail and accuracy.\nStrong agility, engagement, and flexibility in an ever-changing environment.\nWorking knowledge of logging, organizing, and analyzing data.\nAbility to work in a dynamic, fast-paced deadline environment while successfully managing multiple tasks.\nStrong knowledge of Microsoft Office, including Excel, PowerPoint, and Word.\nWorking knowledge of standard laboratory protocol.\nExcellent communication skills and ability to effectively work, problem solve, and communicate with multiple levels of the organization.\n\nEducation & Experience:\n\nMinimum of Bachelor’s degree in chemistry, biochemistry or related field based on state requirements.\n0-1 year of lab experience.\nKnowledge of principles, terminology, practices, techniques commonly used in a laboratory setting preferred.\nExposure to the cannabis industry is a plus.\n\nOther:\n\nMust pass Level 2 background check.\nMust be at least 21 years old.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status\n\nJob Type: Full-time\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nFlexible spending account\nHealth insurance\nLife insurance\nPaid time off\nReferral program\nRetirement plan\nVision insurance\n\nSchedule:\n\n8 hour shift\nDay shift\nMonday to Friday\nWeekend availability\n\nCOVID-19 considerations:\nFace masks required.\n\nApplication Question(s):\n\nWhat is your desired compensation?\nWhat is the best phone # and email to reach you at?\nDo you have a Chemistry degree?\nDo you have experience working in the Cannabis industry?\n\nEducation:\n\nBachelor's (Required)\n\nExperience:\n\nLaboratory Experience: 1 year (Preferred)\n\nWork Location: One location","slug":"cannabis-extraction-technician-a1f3956d-e20f-4cac-b7d9-258a7c77f0d2","benefits":["Dental insurance","Health insurance","Referral program","401(k)","Flexible spending account"],"selectedSkills":["Microsoft Excel","Microsoft Powerpoint","Laboratory experience","Communication skills","Microsoft Office","Bachelor's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=V1qkSiM0xatiMGGaUP7a52zlPERCkRMkX2e9sbM3U1qyRFaH0L-dSw"},{"position":"Seed-to-Sale (METRC) Compliance Officer","labName":"Clone to Grown LLC","location":"Oklahoma City, OK","age":"1 day ago","type":"Full-time","salaryMin":"$18 ","salaryMax":" $23 an hour","jobDescriptionCopy":"We are looking for a Compliance Officer to ensure that our operations and business transactions follow all relevant OMMA and newly mandated seed-to-sale compliance tracking program (METRC). You will be in charge of all compliance related matters including product intakes, production, inventory control, laboratory testing, outgoing products, and more.\n\nTo succeed in this role, you should be a reliable professional who is not afraid to speak their mind and stand by their decisions. You should be familiar with the industry’s standards for all compliance tracking, have previous experience working hands on with METRC, and have experience as a compliance officer with a previous company in the industry.\n\nIf you have a sharp business acumen, we’d like to meet you. Your goal will be to ensure we operate in a legal and ethical manner while meeting our business objectives.\n\nResponsibilities\n\nDevelop and implement an effective seed-to-sale tracking system utilizing METRC program within the company\nCreate sound internal controls and monitor adherence to them\nProactively audit processes, practices and documents to identify weaknesses\nCollaborate with external auditors (OMMA, METRC) and HR when needed\nSet plans to manage a crisis or compliance violation\nEducate and train employees on regulations and industry practices\nAddress employee concerns or questions on legal compliance\nKeep abreast of internal standards and business goals\n\nSkills\n\nProven experience as a Compliance Officer or Compliance Manager\nSpecific experience working with METRC in a cannabis legal state\nKnowledge of legal requirements and controls (e.g. OMMA regulations, METRC requirements, Oklahoma cannabis testing and inventory rules and regulations, etc.)\nFamiliarity with industry practices and professional standards\nExcellent communication skills\nIntegrity and professional ethics\nBusiness acumen\nTeamwork skills\nAttention to detail\n\nJob Type: Full-time\n\nPay: $18.00 - $23.00 per hour\n\nBenefits:\n\nHealth insurance\nPaid time off\n\nSchedule:\n\n8 hour shift\nMonday to Friday\n\nApplication Question(s):\n\nHave you previously worked as a compliance officer in a cannabis legal state?\n\nExperience:\n\nSeed-to-sale compliance: 1 year (Required)\n\nWork Location: One location","slug":"seedtosale-metrc-compliance-officer-4a211aa4-bf8a-4bae-97b9-5101080c2830","benefits":["Paid time off","Health insurance"],"selectedSkills":["Communication skills"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=UlSG-huXnVgODIt9lMPIcJRwxcY2enR6zFErvbYENn6VSQ9AOH9dTQ"},{"position":"Admin and Customer Service Associate","labName":"Nova Analytic Labs","location":"Portland, ME","age":"8 days ago","salaryMin":"$35,000 ","salaryMax":" $50,000 a year","jobDescriptionCopy":"Nova Analytic Labs is a startup business interested in energetic, dedicated and experienced individuals to join our team. The person that fills this role will join Nova as one of the first team members. Everyday will be an opportunity to design innovative and efficient solutions to daily operations and support the high quality and rapid testing experience provided by Nova.\n\nThis role will initially be a mixed role. The primary focus will be to provide administrative support as it relates to laboratory launch tasks. The other focus will initially be on supporting sales, customer service and marketing related launch tasks. This position will work with the laboratory to assist in requisitioning, coordination of lab technicians, remote samplers, and field sampling as needed.\n\nThis position will also be required to be on the road at least 1 day per week to function as a sample courier. The duties involve using the company vehicle to travel to client sites and pickup samples for testing.\n\nDuties and Responsibilities\n\nHighly proficient with software and technology solutions. Advanced computer user skills required.\nResponsible for providing day to day supervision over administrative tasks\n\nResponsible for receipt and transfer of samples\n\nFunction as an occasional sample courier using company provided vehicle\nResponsible for maintaining sample logs and METRC chain of custody\n\nResponsible for accurate data entry when necessary\n\nResponsible for understanding and following all necessary SOPs\n\nMay be required to provide support and training to clients on-site\n\nEnsures resolution of ordering errors before samples are returned to clients\n\nAssists administrative team with sales and marketing projects\n\nProvides orientation and performance feedback on appropriate staff\n\nReviews policies and procedures to meet specific guidelines\n\nEnsures prompt resolution of clerical errors\n\nMaintains documentation and resolution of problem samples\n\nResponsible for data entry and review, both in oversight and production\n\nResponsible for documentation and resolution of customer complaints\n\nWorks as a liaison between laboratory, client base and lab management\n\nWorks closely with the Facility Director(s) and the QAO to organize documents, meetings and audits\n\nField calls, emails from clients\n\nOn-board clients as necessary\n\nOrganize promotional materials, marketing outreach\n\nMonitor communication platforms\n\nRequirements\nAdvanced computer skills and ability to configure and program various SaaS software platforms used in day-to-day management of tasks, communication, finances, CRM etc. Experience with Zoho platform is a plus.\nBachelor degree with management experience preferred\n2 years college coursework or high school diploma\n1-3 years of administrative experience, supervisory role preferred\nPreferred experience in the cannabis testing, food testing or environmental testing field\n\nBenefits\nThis position includes health, dental and vision benefits.","slug":"admin-and-customer-service-associate-94a5a8f6-b996-44c9-a551-aa1d06dbd294","benefits":["Dental insurance","Health insurance"],"selectedSkills":["Communication skills","Customer service","Computer skills","Management","Data entry","Bachelor's degree","High school diploma or GED"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=Pcx_ZB_KmaoRUXqrBO8BtljAK4SqUjBc0z4RHRetOAITHUzTJDPE3w"},{"position":"Kitchen Technician","labName":"Ieso Holdings","location":"Murphysboro, IL","age":"7 days ago","type":"Full-time","jobDescriptionCopy":"Ieso Holdings, Inc. is currently seeking a dedicated kitchen technician to join our state-of-the-art facility.\n\nThe kitchen technician will be responsible for navigating day-to-day operations as directed. This includes: preparing raw materials, high volume production, equipment cleaning and sanitation, product preparation, and other general duties. Technicians must be familiar with basic kitchen practice and fundamental knowledge of candy making and chocolate tempering. Technicians will be responsible for maintaining compliance with the regulations set by the Illinois Department of Agriculture; this includes documentation of all cannabis-related products and performing random weekly audits. Applicants must have the ability to perform tedious tasks and must maintain sanitary conditions associated with the production of cannabis infused products. This job is repetitive and requires the ability to sit for long periods of time.\n\nDuties and Responsibilities\n\n· Producing cannabis infused edibles, as directed\n\n· Perform post-processing and clean-up of equipment\n\n· Assist in the formulation of cannabis infused products\n\n· Assist in research and development experiments\n\n· Perform basic troubleshooting on equipment\n\n· Ability to read and follow recipes\n\n· Prepare and document samples for testing\n\n· Quality assurance/quality control\n\n· Coordinate/assist third-party laboratory testing\n\n· Maintain inventory using state-mandated tracking system; proper documentation of waste\n\n· Maintain organized documentation of data and batch production records\n\n· Assist Illinois Department of Agriculture and Illinois State Police with random audits\n\n· Perform any task as directed by the Kitchen Manager\n\n· Assist other departments as necessary\n\nMinimum Qualification and Skills Required\n\n· Must be 21 years of age or older\n\n· Capable of lifting up to 50 lbs.\n\n· Basic understanding of food preparation used in day-to-day operations\n\n· Diligent record-keeping\n\n· Ability to perform tedious tasks\n\n· Basic computer skills including the use of Microsoft Word and Excel, as well as state-mandated tracking system (with training)\n\n· Ability to perform basic calculations\n\nTuesday - Friday 6:30 a.m. - 5:00 p.m.\n\nJob Type: Full-time\n\nPay: From $13.00 per hour\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nLife insurance\nVision insurance\n\nSchedule:\n\n10 hour shift\nDay shift\n\nWork Location: One location","slug":"kitchen-technician-a161c5d8-0dba-4884-a910-f21bdfd70b6c","benefits":["Dental insurance","Health insurance","401(k) matching","401(k)","Vision insurance"],"selectedSkills":["Microsoft Excel","Computer skills","Computer literacy","Microsoft Word","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=4l8UTNUsN8J8VRru2RnQF6vjDHD6PKVYIDsgwiSx5PHmHH4NHWZerw"},{"position":"Outside Sales Representative","labName":"New Bloom Labs","location":"Chattanooga, TN","age":"5 days ago","type":"Full-time","salaryMin":"$40,000 ","salaryMax":" $50,000 a year","jobDescriptionCopy":"New Bloom Labs is a rapidly-growing testing laboratory company providing analytical services to the cannabis industry. We are searching for an up and coming sales and marketing phenom and customer service ninja to serve as an effective sales representative to find and attract new accounts. The ideal candidate will be familiar with CRM software and various digital marketing techniques.\n\nAdvanced proficiency in Excel/Google Sheets is critical.\n\nYou will require a thorough working knowledge of common business software applications, as well as an easy ability to learn industry-specific software ecosystems. A detailed job description follows:\n\nReports To\n\nDirector of New Markets, CEO\n\nSummary\n\nThe Sales Representative is responsible for conducting the company’s sales and marketing campaigns. Duties may include: Sales calls - both in person and remote - conducting educational seminars, assisting clients with rudimentary results interpretation, executing sales and marketing strategies, trade show representations, contributing to the development of sales and marketing objectives.\n\nEssential Functions\n\nReasonable accommodations may be made to enable individuals with disabilities to perform essential functions.\n\nMust follow all directives from the Director of New Markets and CEO\nAbility to multi-task with ease\nStrong attention to detail\nDriving and navigation\nFace-to-face sales interactions\nAbility to summarize technical information in lay terms\nProficient with industry jargon, processes\nDemonstrable sales proficiency\nEngagement with the company’s CRM software\n\nCompetencies\n\nCommunication proficiency\nProficient with industry jargon, processes\nUnderstanding of the cannabis industry and its various business models\nTime management\nCollaboration skills\nPersonal effectiveness/credibility\nFlexibility\nContemporary technological know-how is necessary\nStress management/composure\nPositive attitude\nProficiency with various digital marketing strategies and techniques, including email marketing, social media, and database management.\n\nSupervisory Responsibility\n\nNone\n\nWork Environment\n\nThis position operates in a professional office and in the marketing field. This role routinely has direct contact with personnel both within the laboratory organization offices and without. Routine use of standard office equipment such as computers, phones, photocopiers, and filing cabinets.\n\nPhysical Demands\n\nThis is a largely sedentary role, however, some minor lifting will be required. This requires the ability to lift small boxes and sample trays, and bend or stand as necessary.\n\nPosition Type\n\nFull-Time\n\nEducation and Experience\n\nCollege degree not required, but similar and equivalent work experience is necessary.\n\nSales experience and work history with successful sales measurables, preferred.\n\nGood organizational and social skills is critical.\n\nOther Duties\n\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this position. Duties, responsibilities and activities may change at any time without notice.\n\nJob Type: Full-time\n\nPay: $40,000.00 - $50,000.00 per year\n\nBenefits:\n\nPaid time off\n\nSchedule:\n\nMonday to Friday\nWeekend availability\n\nSupplemental Pay:\n\nCommission pay\n\nLicense/Certification:\n\nDriver's License (Required)\n\nWillingness to travel:\n\n25% (Preferred)\n\nWork Location: Multiple Locations","slug":"outside-sales-representative-fa3c946f-7b55-4f04-9bd3-4b2da419ca51","benefits":["Paid time off"],"selectedSkills":["Social media management","Microsoft Excel","Driver's License","Sales","Digital marketing","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=MJBuz-MF_awYuI3ATi3H7hJedCFIxqHmkk0hKl_9i15CRZVvAz8e5A"},{"position":"Administrative Specialist","labName":"Green Leaf Lab","location":"Portland, OR","age":"7 days ago","type":"Full-time","salaryMin":"$17 an hour","jobDescriptionCopy":"The Company: Green Leaf Lab is the nation’s first licensed and accredited cannabis analytical laboratory. We are a full-service, production oriented, cannabis and hemp laboratory using cutting-edge technology to characterize the chemical, physical, biological, and microbial properties of a wide range of samples submitted for regulatory compliance and operational purposes. We are team oriented and focused on excellent service. We are looking for an Administrative Specialist to join our team.\n\nPosition: The Administrative Specialist is responsible for assisting the growth and success of the business by providing a wide range of services, such as data entry and review using our laboratory intake management system (LIMS), receive inventory and track package issues in the state seed to sale tracking system (Metrc), customer service via phone, email and in-person, project management, in-house sampling, inventory, among other administrative tasks. The position requires ability to learn new material quickly, excellent customer service, keen attention to detail, ability to multi-task with ability to self-start and self-manage. Schedule is Tuesday-Saturday, 7am-3:30pm.\n\nEssential Duties:\n\n· Establish working knowledge of Oregon cannabis and hemp testing regulations and requirements\n\n· Data entry utilizing Laboratory Intake Management System (LIMS), Excel and Word\n\n· Manage incoming inventory using state seed to sale tracking system (Metrc)\n\n· Manage and track package issues in state seed to sale tracking system (Metrc)\n\n· Answering phones\n\n· Replying to emails\n\n· Project management from start to completion\n\n· Setup, train, and support clients using account portal\n\n· Assisting clients with sampling and intakes at the laboratory\n\n· Ensures department document filing is kept up to date and the filing system is maintained properly\n\n· Performs other general office, administrative and customer service tasks, as required by the position\n\nQualifications:\n\n· Bachelor's degree in Administration, Business or Marketing or equivalent experience\n\n· Ability to produce quality work in a timely and efficient manner\n\n· Project management experience\n\n· Demonstrates ability to easily grasp the concepts and functionality of software and programs\n\n· Self-motivated with strong organizational skills, ability to prioritize work, be detail oriented and meet deadlines\n\n· Demonstrates excellent analytical and problem-solving skills\n\n· Excellent verbal and written communication skills with the ability to work well with people within the organization, customers and the business community\n\n· Possess the highest regard for confidentiality and professionalism\n\n· Strong work ethic\n\n· Superior typing and grammar skills\n\n· Interest or experience in cannabis industry\n\n· Flexibility in work hours required\n\n· Positive and upbeat attitude\n\n· Experience in office environment\n\n· Must be able to work at a computer for long periods of time\n\n· Ability to sit for long periods of time\n\n· Must be at least 21 years of age\n\n· Must be authorized to work in the United States\n\n· Background check required\n\n· Ability to work weekends\n\n· Ability to work overtime\n\nCompensation: $17 hr. Competitive benefits package included.\n\nTo Apply: Send RESUME and COVER LETTER. Please do not call regarding this position.\nGreen Leaf Lab is an equal opportunity employer and follows Oregon law hiring practices. All positions with Green Leaf Lab are at will employment.\n\nJob Type: Full-time\n\nPay: $17.00 per hour\n\nBenefits:\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\nWeekend availability\n\nEducation:\n\nBachelor's (Preferred)\n\nExperience:\n\nAdministrative: 2 years (Preferred)\nCustomer Service: 2 years (Preferred)\n\nWork Location: One location","slug":"administrative-specialist-4c864777-42f8-434f-9717-acf0a0de7cc5","benefits":["Dental insurance","Health insurance","Paid time off","Vision insurance"],"selectedSkills":["Project management","Customer service","Office experience","Microsoft Excel","Communication skills","Bachelor's degree","21 years or older","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=RhZX6NxohaeV2rVFVcjFoPHssKDHNFz_s0O_NJ2xP2OKBipAgmLKkg"},{"position":"Oil Department Technician","labName":"Choice Labs, LLC","location":"Jackson, MI","age":"5 days ago","type":"Full-time","jobDescriptionCopy":"Choice Labs, LLC is a rapidly expanding Michigan Center based medical and recreational cannabis processor. The Oil Technician will be responsible for safely and effectively extracting oil consistent with company requirements.\n\nEssential Duties:\n\n- Prepare the equipment and products for production departments\n- Mix oil and terpenes using established policies and procedures\n- Prep doses for edible production\n- Ensure consistency and efficiency of products through quality control testing and procedures\n- Maintain strict inventory records of all materials, chemicals and equipment\n- Perform all duties accurately and in a safe manner by adhering to all governmental regulations and established company procedures\n- Store supplies and equipment and waste disposal according to established guidelines\n- Complete routine preventative maintenance, cleaning, and troubleshooting on instruments and equipment\n- Responsible for various laboratory support activities, including but not limited to sample inventory, record-keeping, proper sample disposal, and cleaning\n- Ensures timely and accurate reporting and responses to compliance-related issues and assists with implementation of corrective action plans related to such issues\n- Cross train in other departments as necessary\n\nRequirements:\n\n- Must be age 21 or older\n- Must be ServSafe certified or eligible to become certified within 30 days of hire\n- Must have at least 1 year mixing, pouring and/or blending product experience\n- Some college in science related disciplines\n- Ability to lift up to 50lbs\n- Excellent verbal and written communication skills\n- Excellent organizational skills\n- Basic computer skills\n- Able to multi-task and work in a fast paced, changing and challenging environment\n- Must be able to work independently and as part of a team\n\nJob Type: Full-time\n\nPay: From $15.00 per hour\n\nBenefits:\n\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\n\nWork Location: One location","slug":"oil-department-technician-a6a198ee-4f68-4009-aab1-c04c42d9378a","benefits":["Dental insurance","Health insurance","Paid time off","Vision insurance","Life insurance"],"selectedSkills":["Computer skills","Communication skills","Computer literacy","ServSafe","Organizational skills","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=1qSB-ubzTQKaI5fQn1SpcwTFQEKE7Ac2WAbmzC0X20VVdah4g74-Ow"},{"position":"Transport Driver","labName":"Confidence Analytics","location":"Seattle, WA","age":"5 days ago","type":"Full-time","salaryMin":"$16.50 an hour","jobDescriptionCopy":"Description:\nConfidence Analytics is an industry leader in the field of cannabis quality assurance testing. We are a full-service chemical analytical and microbiology laboratory serving the i502 regulated marketplace. We are currently seeking a new sample transport driver. This is a great opportunity to get in on the ground floor of this growing industry.\n\nDrivers are responsible for picking up cannabis samples and transporting them to the Confidence Analytics (referred to as CA) laboratory in a safe and secure manner while also following all the regulations required by I-502 law. As drivers have direct face to face contact with our clients, they are expected to behave professionally as well as maintain a high level of confidentiality. Drivers must also be able to effectively communicate any discrepancies with the client and instruct them on CA labeling practices when required.\n\nResponsibilities:\n-Receive samples per state requirements.\n-Ensure samples are properly bar-coded and labeled.\n-File transportation manifests accurately and within required timelines.\n-Be knowledgeable about I-502 guidelines and CA practices.\n-Conduct oneself in a professional manner and ensure quality communication with clients.\n-Follow all driving laws to the fullest and maintain a clean driving record outside of work.\n-Maintain security of all cannabis materials in the vehicle for safe transport back to the lab.\n-Communicate back to management important customer information.\n\nNecessary Skills:\n-Safe and alert driver.\n-Ability to drive in winter conditions and on unmaintained rural roads safely as needed.\n-Professional demeanor and ability to maintain a high level of confidentiality.\n-Accuracy with data entry.\n-Route finding and map reading ability.\n-Good communication skills.\n\nAdditional Qualifications:\n-Clean driving record.\n-Mechanically sound personal vehicle (company vehicle may not always be available; mileage reimbursement provided for personal vehicle use).\n-Ability to lift up to 50 pounds.\n-Ability to sit for long periods of time.\n\nLocation, Pay, and Benefits:\n-Location: Redmond, WA 98052\n-Hours: Full Time (30-40 hours per week)\n-Schedule: Monday-Friday\n-Hourly Wage: $16.50 per hour + mileage reimbursement for personal vehicle use\n-Position Type: Hire\n-Full time employees are eligible for paid time off, medical/dental/vision/life insurance\n\nIf you think you are the right candidate for the job, apply with your resume and cover letter. Include in your cover letter why you want to take on this position and why you want to work for this company in particular. Please take some time to review our website before applying https://www.conflabs.com\n\nConfidence Analytics is an industry leader in the field of cannabis quality assurance testing. We are a full-service chemical analytical and microbiology laboratory serving the i502 regulated marketplace. We lead the industry in both market share and analytical capability and we are on the cutting edge of development and standardization of testing methodologies. EEO Employer: Race, Religion, Color, National Origin, Citizenship, Sex, Sexual Orientation, Gender Identity, Age, Disability, Ancestry, Veteran Status, Genetic Information, Service in the Uniformed Services or any other classification protected by law.\n\nJob Type: Full-time\n\nPay: $16.50 per hour\n\nBenefits:\n\nDental insurance\nFlexible schedule\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\nDay shift\nMonday to Friday\nOvertime\nWeekend availability\n\nCOVID-19 considerations:\nAll employees are required to wear a mask at all times while in the building if they are not fully vaccinated.\n\nEducation:\n\nHigh school or equivalent (Preferred)\n\nLicense/Certification:\n\nDriver's License (Required)\n\nWork Location: On the road","slug":"transport-driver-aa9cb93c-0e9b-41be-921e-3996491d025a","benefits":["Dental insurance","Health insurance","Mileage reimbursement","Paid time off","Flexible schedule"],"selectedSkills":["Driver's License","Communication skills","High school diploma or GED","Clean driving record"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=2uVW-2WlX4C6488eaEC6Wm66ZoLTH9oNF_1n5Z1m24mFAgRQWGVwLQ"},{"position":"HVAC Technician","labName":"Parallel","location":"Franklin, MA","age":"2 days ago","type":"Full-time","salaryMin":"$27 ","salaryMax":" $30 an hour","jobDescriptionCopy":"Everyone is welcome here. Each of us is unique, and that’s what makes us amazing. We believe in inclusiveness and celebrating each person’s individuality, because there’s power in bringing people with different points of view and life experiences together. That’s why we provide equal employment opportunities (EEO). All applicants are considered regardless of race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, or sexual orientation.\n\nSo, bring yourself and your best ideas; when we feel safe and comfortable being ourselves, there’s no limit to what we can achieve.\n\nIN A NUTSHELL…\n\nThe Facilities HVAC Tech 2 provides support to the facilities operation during the initial set up phase and ongoing operation thereafter. They provide guidance to ensure the Facilities department is operating best in class.\n\nThis role is with NETA, one of the renowned retail brands under the Parallel umbrella. Parallel is one of the largest multi-state cannabis companies in the world, owning and operating in five markets; Florida (Surterra Wellness), Massachusetts (NETA), Pennsylvania (Goodblend), Nevada (The Apothecary Shoppe) and Texas (Goodblend). If you enjoy companies that are growing, moving fast, and constantly challenging themselves to achieve more, then Parallel is for you. We work hard, lean on each other, and are passionate about a pretty ambitious vision … pioneering a new paradigm of what well-being can be for all people, everywhere. For more information, visit www.liveparallel.com.\n\nWHAT YOU WILL BE DOING:\nRepair and maintain Industrial HVAC, plumbing and mechanical equipment in accordance with diagrams, sketches, operating manuals, manufacturers' specifications or supervisor s instructions, using hand and power tools, precision measuring or testing devices. Responsible for complete maintenance of area of assignment.\nRead blueprints; understand and read computerized HVAC, Electrical, plumbing system and building layouts.\nObserve and adjust a wide variety of equipment, machines and devices in operation to assure proper operation, including pumps, refrigerant recovery, engines, motors, compressors and laboratory equipment.\nDismantle machines and devices for servicing, repair, or replacement of parts.\nObserve Parallel Policies & Procedures for daily operations and fully complies with state medical marijuana regulations at all times.\nPerform preventative maintenance and maintains a scheduled maintenance program to ensure proper facilities upkeep, including all mechanical, electrical and plumbing infrastructure and equipment.\nEffectively using CMMS tracking systems to report receipt of maintenance needs and/or other issues.\nRespond to facility related failures or emergencies promptly and prioritizes work orders, while maintaining preventative tasks in accordance with facility needs.\nPerform routine maintenance tasks, preventative systems and repairs.\nComplete all required documentation for utility and facility management, follows up and evaluates effectiveness of all implemented actions to ensure that problem has been resolved effectively.\nEnsure safe work practices are implemented and consistently followed by department staff.\nWork with other departments in addressing and rectifying potentially unsafe work conditions or practices.\nEnsure compliance with applicable building codes, fire and emergency codes, regulatory and other required regulations.\nResponsive and professional in all response and interactions regarding service requests and facility needs.\nAble to work carefully and efficiently in a fast-paced environment.\nWork in coordination with the Supervisor and Manager to help upgrade all systems and streamline as needed to function in the most efficient and effective manner.\nAfter hours on call availability.\nPerform other job duties and tasks as assigned.\n\nEXPERIENCE AND SKILLS YOU’LL BRING:\nTechnical school graduate or equivalent industrial operations experience (Required).\nHVAC Certification and Refrigeration Recycle Recovery license (Required).\nDemonstrate competency in performing routine maintenance tasks, preventative systems and repairs.\nAbility to read blueprints; ability to understand and read computerized HVAC, Electrical, plumbing system and building layouts.\nMin 7 years of progressively responsible work-related experience and any combination of education and training which provides the required knowledge, skills and abilities to perform the essential functions of the job, combined with demonstrated professional growth and achievement.\nAge 21 or over (Required).\nHigh School Diploma or equivalent (Required).\nValid Government-Issued Photo ID (Required).\n\nYOU WILL BE SUCCESSFUL IF YOU…\nAre self-motivated; micro-managing isn’t fun for anyone.\nRoll your sleeves up and do the work; strategy is important, but so is getting stuff done.\nCan work fast and be flexible; our industry is always changing.\nPlay nice with others; we collaborate with each other a lot.\nThink creatively; sometimes, the “traditional” solution isn’t the best one.\n\nWHAT YOU GET:\nConsistent, reliable benefits; Full medical/vision/dental, 401k with a possible company match, access to company-sponsored well-being programs\nBalance and flexibility; paid time off, paid parental leave, flexible work arrangements.\nFinancial opportunity; an incentive program that provides opportunity to earn cash AND equity in a fast-growing company and industry\nEmployee discount.\nChance to make a difference; Employee Relief Fund, community volunteerism opportunities through Benevity.\n\nPHYSICAL REQUIREMENTS:\nThe person in this position frequently communicates with other employees/customers. Must be able to communicate accurate information in these situations.\nMust be able to travel up to 5%-10% of the time.\nMust be able to move around the production facilities up to 30% of the time.\nMust be able to work in an environment which is noisy and with temperature fluctuations from 60 degrees to 90 degrees.\nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\nConstantly operates a computer and other office productivity machinery.\n\nPARALLEL IS UNITED BY OUR VISION, MISSION, & VALUES:\nOur Vision – why we exist – is to pioneer well-being and improve the quality of life for humanity through the benefits of cannabinoids.\n\nOur Mission – how we will do this – is to build a leading, global well-being company through the best talent, our values, trusted and recognized brands, science and technology-based innovation, and a relentless focus on execution and continuous improvement.\n\nOur Values – Integrity | Collaboration | Alignment | Intentionality | Accountability | Agility\n\nWe are an Equal Opportunity Employer. We embrace and encourage our employees’ differences in age, color, disability, ethnicity, gender identity or expression, language, national origin, physical and mental ability, political affiliation, race, religion, sexual orientation, socioeconomic status, veteran status, and other characteristics that make our employees unique.","slug":"hvac-technician-447ac83d-2a03-4023-8dc1-bc0c7d9a99f5","benefits":["Dental insurance","Employee discount","Health insurance","401(k) matching","Paid time off"],"selectedSkills":["Precision measuring instruments","CMMS","EPA Refrigeration Certification","HVAC Certification","HVAC","High school diploma or GED","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=Bv-AX0Rm8K9BSNZz-793z62Yx5i8edcMJpigKkLKhfzOnUOg9SEuDw"}]