[
  {
    "position": "Hemp and Cannabis Inspector",
    "labName": "State of Utah",
    "location": "Salt Lake County, UT",
    "age": "19 hours ago",
    "type": "Full-time",
    "salaryMin": "$17.74 ",
    "salaryMax": " $26.64 an hour",
    "jobDescriptionCopy": "Job Description\n\nJob Title: UDAF Cannabis and Hemp Division Inspector\nLocation: Taylorsville\n\nJob Description:\nThe Medical Cannabis and Industrial Hemp Division at the Utah Department of Agriculture and Food (UDAF) are seeking a qualified individual to fill a Compliance Inspector position. The incumbent will function as a field representative of the division and will primarily be responsible for performing inspections of cannabis & hemp cultivation sites, processing facilities, and retail locations, to enforce regulations set by the State of Utah and provide technical leadership. Inspectors monitor agricultural policy and certify compliance with program regulations. Inspectors need to have outstanding integrity, extreme attention to detail, and exceptional interpersonal communication skills. This job will require you to understand and clearly communicate laws and rules to individuals participating in the legal sale of cannabis and hemp products in the State of Utah. This will include reviewing product labels of hemp and cannabis commodities for compliance and issuing a notice of violations of the law, a notice of violation, and/or stop-sale notices.\n\nInspectors will:\nPromote responsible agricultural production and commerce.\nProvides technical leadership in their area of specialty.\nComply with the requirements of due process.\nPrepare compliance violations.\nImplement administrative controls. Federal and State licensure may be required for each program.\n\nPursuant to Utah Code §§ 4-41-107 and 26-61a-111, this job includes duties that arise from or directly relate to the Utah Medical Cannabis Act. Duties may require conduct which is in violation of the criminal laws of the United States with respect to the manufacture, sale, or distribution of cannabis. As a condition of employment, candidates who are selected to fill this position will be required to sign an Acceptance of Duties Under the Medical Cannabis Act Acknowledgment Form.\nPrincipal Duties:\nReceive, research, and respond to incoming questions or complaints.\nProvide information, explain policy, and procedures, and facilitate a resolution.\nEnsure compliance with applicable federal and state laws, regulations, and agency rules, standards, and guidelines.\nMonitor and evaluate operations, programs, processes, and practices for quality and effectiveness.\nInspect, grade, and certify facilities and products.\nSchedule and conduct inspections and investigations.\nGather, identify, and stores samples of materials to be tested on-site or forwarded to a laboratory for testing.\nEnforce laws, rules, and regulations.\nMaintain detailed inspection and investigation records, prepare reports, and attend to other related administrative requirements.\n\nIdeal Candidate:The ideal candidate will have:\nA basic understanding of the cannabis and/or hemp industry.\nExperience growing or manufacturing agriculture products or experience in the cannabis and hemp industry.\nAdvanced knowledge of standard office software.\nThe ability to read and understand laws and legal documents.\nA ”self-starter” mentality and the ability to manage their time effectively.\nA detail-oriented personality. The ability to understand complex problems and find and apply solutions.\nThe ability to communicate complex ideas in both written and verbal forms.\nThe ability to work well with the public, including diffusing difficult situations.\n\nPreference may be given to applicants with a bachelor's degree in natural sciences, natural resource management, or an agriculture-related field.\nWhy You Should Join Our Team:\nWould you like a career working in the new and exciting industrial hemp and medical cannabis industry? As an industrial hemp and cannabis inspector regulating state cannabis laws and working with great people in state and local agencies throughout Utah. The Utah Department of Agriculture and Food is hiring a hemp/cannabis inspector to monitor compliance of medical cannabis and industrial hemp growers, processors, and products. The Agency: If you would like to read more about working for the Department of Agriculture\nand Food please click here.\n\nThe Agency:\nIf you would like to read more about working for Agriculture and Food please click here.\n\nTypical Qualifications\n\nThe ability to see details at close range (within a few feet of the observer).\nThe ability to listen to and understand information and ideas presented through spoken words and sentences.\nThe ability to communicate information and ideas in speaking so others will understand.\nThe ability to read and understand information and ideas presented in writing.\nGiving full attention to what other people are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times.\nUsing logic and reasoning to identify the strengths and weaknesses of alternative solutions, conclusions, or approaches to problems.\nMonitoring and assessing the performance of individuals or organizations to make improvements or take corrective action.\nConducting tests and inspections of products, services, or processes to evaluate quality or performance.\nKnowledge of laws, legal codes, court procedures, precedents, government regulations, executive orders, agency rules, and the democratic political process.\nKnowledge of the chemical composition, structure, and properties of substances and of the chemical processes and transformations that they undergo. This includes uses of chemicals and their interactions, danger signs, production techniques, and disposal methods.\nKnowledge of the practical application of engineering science and technology. This includes applying principles, techniques, procedures, and equipment to the design and production of various goods and services.\nKnowledge of plant organisms, their tissues, cells, functions, interdependencies, and interactions with each other and the environment.\nThe ability to add, subtract, multiply, or divide quickly and correctly.\nThe ability to understand and calculate percentages.\n\nSupplemental Information\n\nRisks which require the use of special safety precautions and/or equipment, e.g., working around operating machines, working with contagious diseases or hazardous chemicals, etc.\nSpecific plant industry/agricultural licenses or certificates are required.\nValid driver license required to drive a motor vehicle on a highway in this state per UCA53-3-202(1)(a).\nWork requires physical exertion. May require the ability to stand; walk over rough surfaces; bend, crouch, stoop, stretch, reach, lift moderately heavy items (up to 50 lbs.) in a recurring manner and/or for long periods of time.",
    "slug": "hemp-and-cannabis-inspector-b34419f5-c49c-4b95-8ab6-fbf407a7d237",
    "benefits": [],
    "selectedSkills": [
      "Writing skills",
      "Growing experience",
      "Communication skills",
      "Manufacturing",
      "Driver's License",
      "Bachelor's degree"
    ],
    "applyURL": "https://www.governmentjobs.com/careers/utah/jobs/3518263/hemp-and-cannabis-inspector"
  },
  {
    "position": "Lab Assistant",
    "labName": "Solar Therapeutics",
    "location": "Somerset, MA",
    "age": "3 days ago",
    "type": "Full-time",
    "salaryMin": "$37,000 ",
    "salaryMax": " $54,000 a year",
    "jobDescriptionCopy": "About Us\n\nMassachusetts based Solar Therapeutics is New England’s leading producer of wellness and alternative therapies dedicated to state of the art, fully sustainable cultivation & production of pharmaceutical grade cannabis.\n\nThe company’s experienced management team, dedicated board and passionate investors are driven by a singular mission: to provide industry leading alternative therapies with a sustainable carbon-neutral energy footprint.\n\nThe Position\n\nWe are seeking individuals to join our laboratory team here at Solar Therapeutics. The ideal candidates will be detail oriented, have prior extensive experience working in a laboratory setting, and have the ability to work quickly and efficiently with their hands in a fun, fast paced, regulated environment.\n\n\nMinimum of 21 years of age.\nPossess valid driver’s license or state ID.\nMust pass all required background checks.\nMust be and remain compliant with any and all legal or company regulations for working in the industry.\nMust be able to lift, carry and balance up to 30 pounds (100 pounds with assistance). This job function may include walking or standing for extended periods of time, as well as stooping, bending over and/or crouching.\nKey Responsibilities\n\n\nAssist in production calculating requirements; assembling and weighing plant material and supplies for supercritical CO2 extraction: emptying extraction vessels\nOperate intricate equipment, wipe film distillation and rotary evaporator, in accordance with Solar Therapeutics’ Standard Operating Procedures\nMaintaining inventory records of supplies, materials and equipment, and preparing requisitions as needed.\nWork with state licensed third party testing lab to ensure QC\nMake distillate\nOversee cartridge filling\nClean and help maintain laboratory equipment\nComplete data entry into various marijuana tracking systems including METRC\nStore supplies and equipment, dispose of waste according to guidelines, and keep laboratory working areas sanitary and safe\nReport leaks and faulty equipment to Laboratory Manager\nComplete other duties and tasks as assigned by the Laboratory Manager\nQualifications\n\nBachelor’s degree preferred\nGreat interpersonal/communication skills\nDetail-oriented\nHave genuine and positive energy\nGreat work ethic, reliability, and professionalism\nExcellent listening skills\nCannabis industry experience & knowledge preferred\nExperience working in a laboratory strongly preferred\nKnowledge of METRC a plus\nBenefits\n\nMedical Insurance\nDental Insurance\nVision Insurance\nEmployee Discount\nPaid Time Off\n401(k) plan\n\nSolar Therapeutics is an Equal Opportunity Employer committed to building a diverse workforce as it values the knowledge, diversity and performance of our employees to make us a great company. Solar Therapeutics is an Equal Opportunity Employer and all applicants will be considered without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran, or disability status. Solar Therapeutics agrees to hire individuals with Cannabis-related CORI offenses.",
    "slug": "lab-assistant-5a7937bb-9629-4050-ba57-22264d2ca8ab",
    "benefits": [
      "Paid time off",
      "Dental insurance",
      "Employee discount",
      "401(k)",
      "Health insurance"
    ],
    "selectedSkills": [
      "Laboratory experience",
      "Communication skills",
      "Driver's License",
      "Bachelor's degree",
      "21 years or older"
    ],
    "applyURL": "https://secure2.entertimeonline.com/ta/SolarTherapeutics.careers?ShowJob=436396497"
  },
  {
    "position": "Quality Manager",
    "labName": "CannaSafe",
    "location": "Van Nuys, CA",
    "age": "7 days ago",
    "salaryMin": "$68,000 ",
    "salaryMax": " $75,000 a year",
    "jobDescriptionCopy": "Job Summary\n\nThe Quality Manager is responsible for the implementation of CannaSafe’s quality program and ensuring all laboratory activities are in compliance with BCC regulations and ISO/IEC 17025 standards. This role is accountable for knowing and following all Company policies and standards, leads by example, and lives our values.\n\nEssential Duties and Responsibilities\n\n\nLead the team with dynamic leadership that promotes an environment of support, development, engagement, and high productivity. This includes, but is not limited to, hiring, coaching, performance management, ensuring productivity, disciplinary action, cross-training, rewards and recognition, and succession planning.\nEnsure quality assurance/control compliance and standardization. This requires maintaining current knowledge of internal and external standards, with particular focus on BCC and ISO/IEC 17025.\nCreate, manage, and facilitate the quality scorecard.\nEffectively communicate quality policies and procedures to all levels of laboratory staff.\nEstablish and maintain documentation and record controls and procedures.\nDevelop and implement quality procedures and standards to ensure production activities meet compliance standards.\nCreate and update laboratory policies and procedures associated with various assays, in partnership with the Lab Director and Quality department.\nMonitor laboratory data performance and customer complaints with tracking and establish corrective measures as needed. Prepare detailed reports, including current, trending, forecasting.\nManage internal and external audits. Investigate findings, work with the affected department(s) to develop appropriate corrective and/or preventive actions, document the findings, and perform appropriate follow-up. Evaluate the efficacy of implemented corrective/preventive methods.\nGenerate audit reports and schedule review with appropriate internal stakeholders.\nManage the proficiency testing (PT) program for the laboratory. This includes PT vendor evaluation, purchasing PT samples, scheduling PT tests, and reviewing submissions.\nMonitor relevant data for performance and trends using statistical methods.\nBuild strong internal, external, and cross-functional relationships.\nOther duties and special projects as assigned.\nKnowledge, Skills, and Abilities\n\n\nAbility to maintain an incredibly high degree of attention to detail and accuracy.\nAbility to maintain confidence, confidentially, and composure during difficult and/or complex situations.\nAbility to work in a dynamic, fast-paced deadline environment while successfully managing multiple tasks.\nStrong knowledge of Microsoft Office, including Excel, PowerPoint, and Word.\nStrong understanding of standard laboratory protocol.\nExcellent communication skills and ability to effectively work, influence, problem solve, and communicate with all levels of the organization.\n\n\nProven track record in people leadership (supporting, developing, engaging) with demonstrated teambuilding and collaboration skills.\nProven track record in adapting to change and accelerating the performance of laboratory groups.\nDemonstrated ability to be well balanced between the strategic view of the work and the execution aspect of the role.\nEducation and Experience\n\n\nRequired: A bachelor’s degree in a scientific discipline from a four-year college or university plus at least seven (7) years of relevant regulated industry experience (BCC, ISO, FDA, EPA, USP, etc.).\nRequired: Knowledge of principles, terminology, practices, techniques, and instrumentation commonly used in a laboratory setting.\nPreferred: Supervisory/management experience.\nOptional: Exposure to the cannabis industry",
    "slug": "quality-manager-933ebe72-01cc-4ac5-8287-afa3eecb3d47",
    "benefits": [],
    "selectedSkills": [
      "Succession planning",
      "Communication skills",
      "Microsoft Excel",
      "Management",
      "Microsoft Powerpoint",
      "Bachelor's degree"
    ],
    "applyURL": "https://csalabs.com/careers/?gnk=job&gni=8a78839f80061732018019bcf1566821&gns=Indeed+Free"
  },
  {
    "position": "Lab Sampler/ Driver (Cannabis Testing Lab) - Northern California",
    "labName": "Encore Labs LLC",
    "location": "Ukiah, CA",
    "age": "3 days ago",
    "type": "Full-time | Part-time",
    "jobDescriptionCopy": "Encore Labs is an ISO/IEC accredited testing laboratory located in Pasadena, CA. We are constantly striving to improve our scientific innovation in both laboratory efficiency and research & development.\n\nJOB TITLE: Lab Sampler/ Driver\n\nEncore Labs is seeking a Part-Time/Full-Time employee based out of Northern California area who enjoys being on the road and networking.\n\nThe hired individual will need to be available for a two week paid training in the Los Angeles area.\n\nESSENTIAL FUNCTIONS:\n\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Other duties may be assigned.\n\nDrive to client's distribution and cultivation locations to collect cannabis samples for lab testing\nFollow laboratory's standard operating procedures\nDrop off samples and meet up with other driver/sampler during handoffs\nDocument sample intake and client information\nWork closely with sales staff and fleet operations manager on coordinating client pick ups\nCollect payments from clients\nOrganize and record inventory of supplies needed to complete pick ups\nBuild professional relationships with clients\nCommunicate with fleet operations manager regarding vehicle's maintenance\n\nEDUCATION, EXPERIENCE & CERTIFICATES\n\nMust be 21+ years of age\nValid CA driver's license\nValid CA vehicle insurance\nCompleted 2 years of college coursework\nMust have good working condition vehicle\nMust have clean driving record\nExcellent communication skills\nAttention to detail\nStrong work ethic\nPrior experience in Cannabis Industry a plus\nPrior experience as a driver a plus\n\nBenefits/Compensation\n\nCompetitive Pay + bonus\nGas Reimbursement\nExciting Start Up Environment\nCompany Outings & Corporate Prize Giveaways\n\n﻿Encore Labs is an Equal Opportunity Employer.'\n'\nWork Location:\n\nOn the road\n\nWork Remotely\n\nNo\n\nJob Types: Full-time, Part-time\n\nPay: From $17.00 per hour\n\nBenefits:\n\n401(k)\nDental insurance\nFlexible schedule\nHealth insurance\nPaid time off\nPaid training\nVision insurance\n\nSchedule:\n\nMonday to Friday\n\nEducation:\n\nHigh school or equivalent (Required)\n\nExperience:\n\nDriving: 5 years (Required)\n\nLicense/Certification:\n\nDriver's License (Required)\nCA vehicle insurance (Required)\n\nWork Location: Multiple Locations",
    "slug": "lab-sampler-driver-cannabis-testing-lab-northern-california-6a470a1b-4763-4f93-ac5a-c73fd2ab3a1e",
    "benefits": [
      "Dental insurance",
      "Paid training",
      "Health insurance",
      "Paid time off",
      "Flexible schedule"
    ],
    "selectedSkills": [
      "Driving",
      "Driver's License",
      "Communication skills",
      "High school diploma or GED",
      "21 years or older",
      "Clean driving record",
      "US work authorization"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&job=DIJXXppuosg1eGCFoWksgVM5seq9rAteEDe3IRIMT1xjZ7D0VTMYBQ"
  },
  {
    "position": "Analytical Chemist - Cannabis Testing",
    "labName": "CP Labs Ohio",
    "location": "Columbus, OH",
    "age": "7 days ago",
    "type": "Full-time",
    "salaryMin": "$23 ",
    "salaryMax": " $28 an hour",
    "jobDescriptionCopy": "CP Labs Ohio is a new startup currently seeking a talented Analytical Chemist to join our team and help build our recently approved cannabis testing laboratory. With cannabis industry expertise and a brand-new analytical facility, we are looking for an energetic, creative, team-oriented person with strong background in analytical chemistry, excellent organizational and communications skills. We are looking for individuals with a few years of analytical lab's experience including daily laboratory sample flow, method optimization/ validation, QA/QC and more.\n\nPosition Summary: This is an analytical position responsible for advanced laboratory support functions to include calibration, standard preparation, instrument tuning, instrument and equipment maintenance, and analysis of data used for laboratory quality control. Daily work involves the use of various types of machinery, lab equipment and complex computer programs to perform tests, record data or findings and present information.\n\nEssential Duties:\n\nWorks with Laboratory Director to ensure lab efficiencies for prioritization, workflow, and sample preparation, as well as the loading and running of instruments\nIdentifies opportunities for improvement; works with laboratory members to implement new and improved methods and processes\nAssists with the upkeep and improvement of the quality management system to include Standard Operating Procedures (SOP’s) and the employee training programs\nPrepares calibrations and verifies quality controls for laboratory instruments and methods; uses data to recognize and/or correct possible processing or instrument errors\nAcquires and analyzes data used to perform and report analytical laboratory testing of cannabis products\nAssists with the validation of test methods and with Research and Development (R&D) related activities\nImports data into LIMS and Seed-to-Sale systems; provides for the documentation and tracking of Continuing Calibration Verification (CCV) Standards for Quality Assurance\nPrepares reports related to cannabinoid potency, terpene potency, residual solvents, heavy metals, pesticides, microbiologic organisms, water activity and mycotoxins\nSubmits data reports and Certificates of Analysis (COA) for approval \nProvides guidance and support for all duties commonly assigned to Field Samplers and Lab Technicians\n\nPosition Requirements:\n\nGeneral Knowledge/Abilities\n\nAbility to fluently speak and read the English language along with understanding and following both written and verbal direction\nAbility to function independently, have personal integrity, flexibility and the ability to work effectively as a team member with fellow employees\nAnalytical and numerical skills: ability to perform mathematical calculations in different units of measurement\nBasic knowledge of modern office practices and use of Microsoft Office Suite for Word and Excel\nExperience in driving tasks and meeting deadlines; accountable for the completion of assigned goals and objectives\n\nEducation, Licenses/Certifications\n\nBachelor’s degree in Chemistry or a related field from an accredited college or university\n2 plus years non-academic experience in a real-world analytical laboratory setting\n\nPreferred Experience\n\nRelevant industry related experience in Medical Cannabis is a plus\n\nJob Type: Full-time\n\nPay: $23.00 - $28.00 per hour\n\nBenefits:\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\nMonday to Friday\n\nAbility to commute/relocate:\n\nColumbus, OH 43228: Reliably commute or planning to relocate before starting work (Preferred)\n\nEducation:\n\nBachelor's (Required)\n\nExperience:\n\nCannabis: 1 year (Preferred)\nLaboratory: 1 year (Required)\n\nWork Location: One location",
    "slug": "analytical-chemist-cannabis-testing-b38792c0-b940-4b4c-ac34-7d378500f48e",
    "benefits": [
      "Dental insurance",
      "Health insurance",
      "Paid time off",
      "Vision insurance"
    ],
    "selectedSkills": [
      "Analysis skills",
      "Microsoft Excel",
      "Laboratory experience",
      "Analytical chemistry",
      "Microsoft Office",
      "Bachelor's degree"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&job=bT0_JKFDn2bb1rB8K03LXJcUAUKFWacQ-l1SqB2fq10jj5qCRlxmmw"
  },
  {
    "position": "Entry Level Scientist for Cannabis Lab",
    "labName": "Keystone State Testing",
    "location": "Harrisburg, PA",
    "age": "7 days ago",
    "type": "Full-time",
    "salaryMin": "$41,638 ",
    "salaryMax": " $103,165 a year",
    "jobDescriptionCopy": "A Prominent Cannabis testing laboratory with a need for an sample technician to join their chemical analysis team. They perform safety and potency testing to measure cannabinoids, terpenoids, mycotoxins, heavy metals, pesticide residues, residual solvent levels, and microbial contaminants.\n\nResponsibilities:\n\nHigh attention to detail\n\nExperience preparing and analyzing samples in a high-throughput laboratory\n\nKnowledge of HPLC, QPCR, ICP-AES, LC-MS/MS, GC-MS/MS\n\nFamiliar with Shimadzu instrumentation and software\n\nExperience in an ISO 17025 regulated laboratory\n\nWorking knowledge of the cannabis industry\n\nRequirements:\n\nMinimum: BSc in chemistry, biology, biochemistry, microbiology, or a related field\n\nApplicants with graduate level degrees in a science-related field are strongly encouraged to apply\n\nJob Type: Full-time\n\nPay: $41,638.00 - $103,165.00 per year\n\nBenefits:\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n10 hour shift\n8 hour shift\n\nSupplemental Pay:\n\nBonus pay\n\nAbility to commute/relocate:\n\nHarrisburg, PA 17109: Reliably commute or planning to relocate before starting work (Required)\n\nEducation:\n\nBachelor's (Preferred)\n\nWork Location: One location",
    "slug": "entry-level-scientist-for-cannabis-lab-cb7025fe-7883-40cd-a6d4-c3a576a17e37",
    "benefits": [
      "Dental insurance",
      "Health insurance",
      "Paid time off",
      "Vision insurance"
    ],
    "selectedSkills": [
      "High-performance liquid chromatography",
      "Laboratory experience",
      "Detailing",
      "Bachelor of Science",
      "Bachelor's degree"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&job=as3W7hixGLlLND7hkNwR-FG4tc8429UX9szzSbW3FU6JWqhNdEALOA"
  },
  {
    "position": "Extraction Technician-2nd shift",
    "labName": "Trulieve, INC",
    "location": "Holyoke, MA",
    "age": "5 days ago",
    "type": "Full-time",
    "salaryMin": "$32,000 ",
    "salaryMax": " $41,000 a year",
    "jobDescriptionCopy": "Job Title: Extraction Technician-Ethanol\n\nDepartment: Processing\n\nReports to: Oil Supervisor or Team Lead\n\nFLSA Status: Regular-Non-Exempt\n\nRole Summary:\nTrulieve is looking for an Extraction Technician to support our extraction and production operations. You should be very technically astute in mechanical, electrical, and computer operated systems utilized in production/manufacturing environments. You need to be proactive, quick thinking and innovative in your approach.\n\nKey Duties and Responsibilities:\nPreparation of equipment and plant materials for extraction\nExecution of extraction and processing in accordance with state and local standards\nOperation of sophisticated extraction equipment\nEnsure consistency and efficiency of product through quality control testing and procedures\nCleaning and maintenance of extraction equipment and manufacturing facility\nMaintaining strict inventory records of all plant materials, chemicals, and equipment used in the facility\nOversee day-to-day operations of the entire extraction space beginning with storing the raw cannabis through the extraction process and all the way to fulfillment of orders\nOperating, maintaining, and making adjustments and repairs to extraction equipment\nStoring supplies and equipment and disposal of waste according to guidelines\nComplete the cleaning and sanitization of all production equipment, work surfaces, and tools\nMaintaining inventory records of supplies, materials, and equipment and preparing requisitions as needed\nMaintaining material safety data sheets for all chemicals and products\nFollowing all standard operating procedures regarding product creation and lab safety\nAssist in packaging and labeling of finished products\nWorks with testing laboratory as defined by state guidelines\nAll other duties as assigned",
    "slug": "extraction-technician2nd-shift-bd7a76ff-33a9-40e1-bb88-dd250bb26c47",
    "benefits": [],
    "selectedSkills": [],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&job=by5GcIzUk_dQqX_koH3-rdkei1Zl0DcvO2MN7ebarQ2uiUJBTFfinA"
  },
  {
    "position": "Sample Intake",
    "labName": "Kaycha Labs",
    "location": "Natick, MA",
    "age": "4 days ago",
    "type": "Full-time",
    "salaryMin": "$29,000 ",
    "salaryMax": " $40,000 a year",
    "jobDescriptionCopy": "Company Overview:\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\n*** The shift for this position will be Monday-Friday, 10am- 6:30 pm.***\n\nEssential Duties & Responsibilities:\n\nResponsible for the processing of customer samples for laboratory testing, following sample intake standard operating procedures and chain of custody guidelines.\nLog samples into laboratory information management systems (LIMS) and METRC to track sample traceability.\nPhotograph samples following aseptic guidelines using Logitech Webcam software.\nWork collaboratively with laboratory staff and management on the prioritization of samples to meet customer needs\nAssist customers with sample submission requirements following Massachusetts state regulations.\nIdentify sample intake issues and bring issues to the attention of management for quick resolution.\nAssist in ordering supplies for the laboratory.\nAssist in the disposition of samples using LIMS and METRC following Massachusetts state regulations.\nAnswer phones, while communicating clearly and professionally.\nCustomer facing responsibilities include nurturing relationships with existing and new customers.\nMust be comfortable working in a fast paced environment.\n\nSkills, Abilities and Competencies:\n\nExcellent communication skills and ability to effectively work, problem solve, and communicate with multiple levels of the organization.\nAbility to work in a dynamic, fast-paced deadline environment .\nAbility to maintain a high degree of attention to detail and accuracy.\nStrong agility, engagement, and flexibility in an ever-changing environment.\nWorking knowledge of logging data.\nProficiency working with Laboratory Internal Management and Customer Relations Management Systems.\n\nEducation & Experience:\n\nHigh school diploma or equivalent required.\nStrong understanding of standard laboratory protocol a plus.\nKnowledge of principles, terminology, practices and techniques is a plus.\nFood science and/pr environmental experience is a plus.\nExposure to the cannabis industry is a plus.\n\nOther:\n\nMust pass Level 2 background check.\nMust be at least 21 years old.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.\n\nThe above is intended to describe the general content of and requirements for the performance of this job. It is not to be construed as an exhaustive statement of duties, responsibilities, or physical requirements. Nothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions\n\nJob Type: Full-time\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nEmployee discount\nFlexible spending account\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nReferral program\nVision insurance\n\nSchedule:\n\n8 hour shift\nMonday to Friday\n\nApplication Question(s):\n\nWhat is your desired compensation?\n\nEducation:\n\nHigh school or equivalent (Preferred)\n\nExperience:\n\nCustomer service: 1 year (Preferred)\nData entry: 1 year (Preferred)\n\nWork Location: One location",
    "slug": "sample-intake-c09b4be5-76fb-4f0b-b653-2d5cbd5b7702",
    "benefits": [
      "Health savings account",
      "Dental insurance",
      "Employee discount",
      "Health insurance",
      "Employee assistance program"
    ],
    "selectedSkills": [
      "Customer service",
      "Communication skills",
      "Data entry",
      "High school diploma or GED",
      "21 years or older",
      "US work authorization",
      "Background check"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&job=dbPHL24kjVyD-gegJXMcVzKZ6_3IX7qfGYRaBWiZt2JbqSf3C-zd2Q"
  },
  {
    "position": "Field Sampler",
    "labName": "Kaycha Labs",
    "location": "Monrovia, CA",
    "age": "5 days ago",
    "type": "Full-time",
    "salaryMin": "$34,000 ",
    "salaryMax": " $42,000 a year",
    "jobDescriptionCopy": "Company Overview:\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\nJob Purpose:\n\nThe Field Sampler is responsible for conducting routine pickups and processing of regulatory compliance samples for laboratory analysis. This includes accurately recording sample and chain of custody documentation and the safe and secure transportation of all samples to the laboratory. Candidates must be located in the Enter Lab Location area or close proximity.\n\nEssential Duties & Responsibilities:\n\nPerform onsite field sampling pickups in accordance with all laws and regulations related to the legal cannabis market and laboratory operating procedures.\nCollect and forward weekly inventory requests to the laboratory team.\nCollect payment from clients.\nInterface effectively between customers and the laboratory team.\nContact clients in conjunction with the Client Service Rep(s) to determine if their sampling needs to create a sampling plan (e.g., number of batches, requested analyses, sample information)\nInput orders with required sample information into METRC and the lab’s LIMS system as required.\nFollow detailed procedural requirements as outlined in the Kaycha Labs Sampling and Chain of Custody SOP.\nSafely drive throughout an assigned region, which may include multi-hour destination pickups.\nCollect detailed data in the field according to SOPs.\nMaintain current knowledge of our products and services.\nConsistently maintain customer confidentiality.\nOther duties and special projects as assigned.\n\nKnowledge, Skills, and Abilities:\n\nAbility to maintain a high degree of attention to detail and accuracy.\nExcellent communication skills and ability to effectively work, problem solve, and communicate with internal and external customers.\nDemonstrate keen attention to detail and punctuality.\nAbility to work in a dynamic, fast-paced deadline environment while successfully managing multiple tasks.\nDemonstrated ability to be professional, pleasant, and presentable.\nFamiliarity with the assigned geographic area.\nBuild long-lasting customer relationships.\n\nEducation & Experience\n\nHigh School Diploma (or GED required.)\nA valid driver’s license and clean driving record (with at least three years of driving experience).\nExposure to the Cannabis industry is a plus.\n\nOther:\n\nMust be over 21 years old\nPre-Employment Verifications: Must pass Level 2 background check.\nKaycha Labs offers a competitive and comprehensive benefits package.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.\n\nEssential Functions:\n\nThe physical demands described here are representative of those that an employee must meet to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nWhile performing the duties of this job the employee is frequently required to stand, handle or feel, to speak, and to hear. The employee is occasionally required to walk, sit, reach with hands and arms, bend, kneel, crouch, or crawl. The employee must frequently lift and/or move up to thirty-five (35) pounds.\n\nSpecific vision abilities required for this job include close (proximity) vision, depth perception, and the ability to adjust focus.\n\nWork Environment:\n\nThe work environment described here is representative of that which an employee may encounter while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nThe standard analytical laboratory environment is one in which potential health hazards do exist. Administrative, operations, technical, and professional staff are expected to safely operate in accordance with applicable and appropriate health and safety policies and procedures, as prescribed by the applicable Kaycha manuals and policies and/or federal, state, or local standards.\n\nLaboratory staff can be expected to work in areas where hazards associated are with, but not limited to, airborne pathogens. Biological materials, hazardous substances, and radioactive material exist and are handled. Appropriate training is provided regarding these hazards and staff are expected to adhere to all health and safety policies at all times, whether they are in writing or verbalized by a supervisor.\n\nJob Type: Full-time\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nReferral program\nVision insurance\n\nSchedule:\n\nDay shift\nMonday to Friday\nWeekend availability\n\nApplication Question(s):\n\nBest email/phone number to reach you at?\nWhat is your desired compensation?\n\nEducation:\n\nHigh school or equivalent (Preferred)\n\nLicense/Certification:\n\nDriver's License (Preferred)\n\nWork Location: On the road",
    "slug": "field-sampler-ed56dc85-66fd-432a-be26-461f01b5d6df",
    "benefits": [
      "Dental insurance",
      "Health insurance",
      "401(k) matching",
      "Paid time off",
      "Referral program"
    ],
    "selectedSkills": [
      "Driving",
      "Driver's License",
      "Communication skills",
      "High school diploma or GED",
      "21 years or older",
      "Clean driving record",
      "US work authorization",
      "Background check"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&job=KWSxyB_RtAmiZ8SSB4-DxOjfNvLHhcaW3hZra4CtFbMlypnj6vZqMQ"
  },
  {
    "position": "Sample Intake Specialist/Front Office Reception",
    "labName": "PharmLabs LLC",
    "location": "San Diego, CA",
    "age": "17 hours ago",
    "type": "Full-time | Contract",
    "salaryMin": "$16 ",
    "salaryMax": " $19 an hour",
    "jobDescriptionCopy": "PharmLabs Laboratory is a DEA and California State DCC licensed analytical testing laboratory for the cannabis and hemp industries. PharmLabs is also ISO/IEC 17025:2017 accredited.\n\nWe are looking for a Sample Intake Specialist (Power house Receptionist!) to take charge of the front end of the laboratory. We are looking for someone who has been a previous office manager with cannabis experience and lots of customer service skills.\n\nPosition Summary:\n\nTo be responsible for the intake of client test samples to Laboratory Information Management System, as well as, act as an overall receptionist and brand ambassador. Under the general direction of the Operations Manager, is responsible for providing general office services to the laboratory staff.\n\nEssential Duties and Responsibilities:\n\n1. Answer incoming calls, determine the purpose of calls and transfer calls\n\n2. Greet walk-in clients\n\n3. Provide proper information about testing to clients\n\n4. Check in all client test samples and input them accurately into LIMS\n\n5. Update social media platforms including but not limited to: Facebook, Instagram, Twitter and the PharmLabs Blog\n\n6. Assist with integration of test samples and spread-sheet creation for test samples\n\n7. Sending new client welcome emails\n\n8. Adding new client emails to the newsletter distribution list\n\n9. Create the Monthly Newsletter\n\n10. Clean floors, bathroom, dusting and empty trash\n\n11. Track office supplies needed and report to CEO\n\n12. Refill office educational information as needed\n\n13. Take and deliver messages\n\n14. Monitors visitor access to the Laboratory\n\n15. Interacts with visiting vendors\n\n16. Provides on-going support to Laboratory staff\n\n17. Receives, sorts and distributes mail; prepares outgoing mail and ensures it is mailed\n\n18. Receives and processes deliveries\n\n19. Drafts correspondence, generates reports and other documents\n\n20. Orders and maintains office supplies\n\n21. Creates and maintains forms necessary to the operation of the Laboratory\n\n22. Ensures reception area is well maintained, neat and clean\n\n23. Performs other duties as assigned\n\nWe are also looking to fill this key position immediately, so if you meet the below qualifications, submit your resume and cover letter today.\n\nJob Types: Full-time, Contract\n\nPay: $16.00 - $19.00 per hour\n\nBenefits:\n\n401(k)\nHealth insurance\nPaid time off\n\nSchedule:\n\n8 hour shift\nMonday to Friday\n\nAbility to commute/relocate:\n\nSan Diego, CA 92110: Reliably commute or planning to relocate before starting work (Preferred)\n\nExperience:\n\nCustomer service: 1 year (Preferred)\n\nWork Location: One location",
    "slug": "sample-intake-specialistfront-office-reception-4c538b2f-fe3b-459a-8794-3117dd3e8124",
    "benefits": ["Paid time off", "401(k)", "Health insurance"],
    "selectedSkills": ["Customer service"],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&job=SrV1G7Z7qOuhmC2aOc5aPkt7lD6MNkGs3x3deEpLOO7oRU849kgWyw"
  },
  {
    "position": "Cannabis Extraction Technician",
    "labName": "Kaycha Labs",
    "location": "Monrovia, CA",
    "age": "5 days ago",
    "type": "Full-time",
    "salaryMin": "$35,000 ",
    "salaryMax": " $50,000 a year",
    "jobDescriptionCopy": "Company Overview:\n\nKaycha Group, LLC is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\nJob Summary:\n\nThe Lab Technician, Level I, is responsible for working closely with our laboratory team to develop analytical skills and related experience. This position consists of many aspects from homogenizing, weighing and extracting samples, performing quality control checks, verifying various support equipment and properly disposing of all waste.\n\nEssential Duties & Responsibilities:\n\nExecute laboratory protocol and procedures under the supervision of the Lab Director.\nRegularly display good laboratory technique to avoid cross-contamination or misidentified samples.\nPerform sample preparation procedures including homogenization, weighing and liquid extraction.\nPerform QC duties as assigned, including LCS and matrix spikes.\nPerform qualitative and quantitative tests, as assigned.\nUtilize the LIMS system to create batches, enter sample prep information and maintain physical and electronic records.\nAdhere to ISO 17025 standards as well as state regulatory requirements.\nPromote a strong customer service culture while adhering to the highest safety and industry standards.\nOther duties and/or special projects as assigned.\n\nKnowledge, Skills and Abilities:\n\nAbility to maintain an incredibly high degree of attention to detail and accuracy.\nStrong agility, engagement, and flexibility in an ever-changing environment.\nWorking knowledge of logging, organizing, and analyzing data.\nAbility to work in a dynamic, fast-paced deadline environment while successfully managing multiple tasks.\nStrong knowledge of Microsoft Office, including Excel, PowerPoint, and Word.\nWorking knowledge of standard laboratory protocol.\nExcellent communication skills and ability to effectively work, problem solve, and communicate with multiple levels of the organization.\n\nEducation & Experience:\n\nMinimum of Bachelor’s degree in chemistry, biochemistry or related field based on state requirements.\n0-1 year of lab experience.\nKnowledge of principles, terminology, practices, techniques commonly used in a laboratory setting preferred.\nExposure to the cannabis industry is a plus.\n\nOther:\n\nMust pass Level 2 background check.\nMust be at least 21 years old.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status\n\nEssential Functions:\n\nThe physical demands described here are representative of those that an employee must meet to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nWhile performing the duties of this job the employee is frequently required to stand, handle or feel, to speak, and to hear. The employee is occasionally required to walk, sit, reach with hands and arms, bend, kneel, crouch, or crawl. The employee must frequently lift and/or move up to thirty-five (35) pounds.\n\nSpecific vision abilities required for this job include close (proximity) vision, depth perception, and the ability to adjust focus.\n\nWork Environment:\n\nThe work environment described here is representative of that which an employee may encounter while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nThe standard analytical laboratory environment is one in which potential health hazards do exist. Administrative, operations, technical, and professional staff are expected to safely operate in accordance with applicable and appropriate health and safety policies and procedures, as prescribed by the applicable Kaycha manuals and policies and/or federal, state, or local standards.\n\nLaboratory staff can be expected to work in areas where hazards associated are with, but not limited to, airborne pathogens. Biological materials, hazardous substances, and radioactive material exist and are handled. Appropriate training is provided regarding these hazards and staff are expected to adhere to all health and safety policies at all times, whether they are in writing or verbalized by a supervisor.\n\nThe above is intended to describe the general content of and requirements for the performance of this job. It is not to be construed as an exhaustive statement of duties, responsibilities, or physical requirements. Nothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions\n\nJob Type: Full-time\n\nSchedule:\n\n8 hour shift\nWeekend availability\n\nApplication Question(s):\n\nWillingness to work nights and/or weekends as needed?\nDo you have a chemistry degree?\nWhat is your desired compensation?\n\nEducation:\n\nBachelor's (Preferred)\n\nWork Location: One location",
    "slug": "cannabis-extraction-technician-f3c9d045-149c-4b19-8a9f-b7b6d901d02e",
    "benefits": ["Dental insurance", "Health insurance", "Vision insurance"],
    "selectedSkills": [
      "Analysis skills",
      "Microsoft Excel",
      "Microsoft Powerpoint",
      "Laboratory experience",
      "Communication skills",
      "Bachelor's degree",
      "21 years or older",
      "Background check"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=ZXaxN1zaPOJbSnphwpSmli3mfrXLGevuOh_dqSzKLFcRgubpp9AxKA"
  },
  {
    "position": "Courier Driver",
    "labName": "Botanacor Laboratories",
    "location": "Denver, CO",
    "age": "20 hours ago",
    "type": "Full-time",
    "salaryMin": "$18 an hour",
    "jobDescriptionCopy": "The Driver is responsible for the prompt and consistent pick-up of our customer products to our testing facilities. Under the supervision of the Field Operations Manager, the Driver performs driving responsibilities to ensure the timely pick-up and delivery of our customer products to our testing facilities in compliance with all company and state regulations. Drivers are critical to the daily operations of our business and are our first point of contact for many of our patients and clients. They are responsible for picking up products packages from suppliers or retail dispensaries and delivering these packages to destinations including home delivery. It’s expected our drivers are representing our company in a professional and personable manner when making deliveries. The ideal candidate will be customer-focused, work well independently, and possess impeccable time management skills.\n\nRESPONSIBILITIES\n\nLEADERSHIP\n\nEngage patients and clients with friendly, courteous, and effective communication to determine pickup and delivery needs\nLoad and unload cargo\nContact vendors directly to resolve delivery paperwork issues or discrepancies and takes corrective actions as necessary\nBecome familiar with the vendor’s locations: the specific protocols regarding deliveries, safety, and security\nReport any incidents or delays encountered on the road to a dispatcher as soon as possible\nFollow all applicable traffic laws\nCreate a proactive and positive environment while meeting and exceeding personal and company goals\n\nQUALITY & FINANCIAL\n\nComplete deliveries in a timely and efficient manner according to company SOPs\nIdentify and report potential efficiency issues in the supply chain/fulfillment process\nHandle physical paperwork, i.e., delivering invoices, obtaining required signatures, receipts, or delivery confirmation notices\nKeep vehicle and associated equipment clean and in good working order\nCouriers are paid for each mile driven\n\nPEOPLE & DEVELOPMENT\n\nStay up to date and comply with all state and local cannabis laws and regulations\nMentor new drivers and perform ride-along as required\n\nCOMPLIANCE\n\nReview paper documents for accuracy and compliance to state and local regulations\nAdhere to all safety and loss prevention protocols per the company’s policies and procedures\nComply with company and industry standards set forth by the state\n\nSKILLS & ABILITIES\n\nDemonstrate ownership, accountability, and initiative\nSkilled in analyzing potential problems with the product being delivered\nAbility to remain calm during stressful periods\nAbility to adapt quickly to changes in policy, procedure, methods, and techniques\nPunctual and reliable\nStrong verbal and written communication, problem-solving, and decision-making skills\nDetail oriented with solid time-management skills\nSelf-directed; able to perform work unsupervised\n\n· Follow Vehicle Use Policy for fueling, maintenance, cleanliness, staffing requirements, DOT regulations, emergency procedures, approved break times/locations, and all other requirements\n\n· Responsible for maintaining the integrity of all confidential information\n\n· Responsible for reading and understanding all department-specific Standard Operating Procedures and documentation\n\nREQUIREMENTS\n\nCandidates will be required to utilize their personal vehicle\nValid Driver’s License and clean driving record\nPersonal form of transportation\nProof of insurance\nMust have MED License\nA deep understanding of the local area is desired\n\nWORKING CONDITIONS/PHYSICAL DEMANDS\n\nLoading and unloading cargo\nDriving in congested traffic while adhering to strict delivery timelines\nRegular exposure to outside weather conditions\nMust be able to enter and exit a vehicle many times per shift and sit in a vehicle for extended periods\nOvertime may be necessary from time to time, especially on deliveries on the opposite side of the state.\n\nThe above statements are intended to describe the general nature and level of work being performed by people assigned to do this job. The above is not intended to be an exhaustive list of all responsibilities and duties required and includes all other duties as assigned by management.\n\n*External and internal applicants, as well as position incumbents who become disabled as defined under the Americans with Disabilities Act must be able to perform the essential job functions (as listed) either unaided or with the assistance of a reasonable accommodation to be determined by management on a case-by-case basis.\n\nJob Type: Full-time\n\nPay: $18.00 per hour\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nMileage reimbursement\nPaid time off\nReferral program\nVision insurance\n\nSchedule:\n\n8 hour shift\nDay shift\nMonday to Friday\nNo nights\nOvertime\n\nEducation:\n\nHigh school or equivalent (Preferred)\n\nShift availability:\n\nDay Shift (Required)\n\nWork Location: On the road",
    "slug": "courier-driver-9c6a0699-4685-4f1a-8789-22818d596dce",
    "benefits": [
      "Dental insurance",
      "Health insurance",
      "Mileage reimbursement",
      "401(k) matching",
      "Paid time off"
    ],
    "selectedSkills": [
      "Driver's License",
      "Communication skills",
      "Time management",
      "High school diploma or GED",
      "Clean driving record",
      "US work authorization"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=cLMMShdlAmLSsvt9Sp-pp-MFub5N_akT_l2WtEf1JpajFwyvhVmvNw"
  },
  {
    "position": "Laboratory Scientist (MA)",
    "labName": "Green Analytics Massachusettes",
    "location": "Framingham, MA",
    "age": "4 days ago",
    "type": "Full-time",
    "salaryMin": "$25 ",
    "salaryMax": " $30 an hour",
    "jobDescriptionCopy": "POSITION SUMMARY: This is an analytical position responsible for advanced laboratory support functions to include calibration, standard preparation, instrument tuning, instrument and equipment maintenance, and analysis of data used for laboratory quality control. Daily work involves the use of various types of machinery, lab equipment and complex computer programs to perform tests, record data or findings and present information.\n\nESSENTIAL FUNCTIONS\n\nWorks with Lab Manager to ensure lab efficiencies for prioritization, workflow, and sample preparation, as well as the loading and running of HPLC, LCMS, GCMS and other instruments\nIdentifies opportunities for improvement; works with Department Head to implement new and improved methods and processes\nAssists with the upkeep and improvement of the quality management system to include Standard Operating Procedures (SOP’s) and the employee training programs\nPrepares calibrations and verifies quality controls for laboratory instruments and methods; uses data to recognize and/or correct possible processing or instrument errors\nAcquires and analyzes data used to perform and report analytical laboratory testing of cannabis products\nAssists with the validation of test methods and with Research and Development (R&D) related activities\nImports data into LIMS and Seed-to-Sale systems; provides for the documentation and tracking of Continuing Calibration Verification (CCV) Standards for Quality Assurance\nPrepares reports related to cannabinoid potency, terpene potency, residual solvents, heavy metals, pesticides, microbiologic organisms, water activity and mycotoxins\nProvides guidance and support for all duties commonly assigned to Field Samplers and Lab Technicians\nResponsible for inventory oversight of crucial departmental supplies\nMay also be called upon to perform the same or similar duties at other laboratory facilities, and for other job-related duties as assigned\n\nPOSITION REQUIREMENTS:\n\nGeneral Knowledge/Abilities\n\nAbility to fluently speak and read the English language along with understanding and following both written and verbal direction\nAbility to function independently, have personal integrity, flexibility and the ability to work effectively with fellow employees\nAnalytical and numerical skills: ability to perform mathematical calculations in different units of measurement\nAbility to use concepts such as fractions, percentages, and ratios; demonstrated abilities in troubleshooting and problem-solving\nBasic knowledge of modern office practices and use of Microsoft Office Suite for Word and Excel\nExperience in driving tasks and meeting deadlines; accountable for the completion of assigned goals and objectives\nAbility to build relationships to strengthen partnerships with a focus on customer service\nAbility to perform physically demanding work such as moving and lifting equipment, standing for long periods of time, etc.\n\nExperience, Education, Licenses/Certifications\n\nBachelor’s degree in Chemistry or a related field from an accredited college or university, or an equivalent combination of education and experience\nAt least 3 years post-graduate laboratory experience\nPrior experience in the Cannabis industry is a must\n\nSUPERVISORY RESPONSIBILITIES: None\n\nJob Type: Full-time\n\nPay: $25.00 - $30.00 per hour\n\nBenefits:\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\nDay shift\nNight shift\nWeekend availability\n\nCOVID-19 considerations:\nVaccination against COVID-19 is required for ALL employees.\n\nEducation:\n\nBachelor's (Required)\n\nExperience:\n\nAnalytical Laboratory: 2 years (Required)\nHPLC, GCMS, qPCR, LCMS, and/or ICPMS: 2 years (Required)\nCannabis Industry: 1 year (Preferred)\n\nWork Location: One location",
    "slug": "laboratory-scientist-ma-d843de03-a509-41a2-a9be-8d71b4d4fa22",
    "benefits": [
      "Dental insurance",
      "Health insurance",
      "Paid time off",
      "401(k)",
      "Vision insurance"
    ],
    "selectedSkills": [
      "Analysis skills",
      "Microsoft Excel",
      "Laboratory experience",
      "Microsoft Office",
      "Microsoft Word",
      "Bachelor's degree"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=Fc768P6xV3FdyaLAhpV1e5AOJ6C624EZNeMnOQubsMJFaaNT3VFaQg"
  },
  {
    "position": "Sales Assistant",
    "labName": "Columbia Laboratories",
    "location": "Portland, OR",
    "age": "21 hours ago",
    "type": "Full-time | Part-time",
    "salaryMin": "$18 ",
    "salaryMax": " $25 an hour",
    "jobDescriptionCopy": "Columbia Laboratories is looking for a customer service-oriented Sales Assistant to join our team and support our sales lead. We are a long standing, accredited food safety, cannabis/hemp, and water testing laboratory in Portland, OR. Columbia Labs is a proud member of the Tentamus Group, a global team of laboratories focused on human wellness. The ideal candidate will ensure laboratory services are communicated with potential clients and that customer satisfaction remains paramount.\n\nResponsibilities and Job functions:\n\nTracking their daily activity through CRMs.\nProspecting lead lists.\nDaily outgoing phone calls with prospects.\nCreate promotional material with given content and pre-existing design materials.\nManaging one-two social media outlets.\nWeekly meeting and monthly reports with Sales Director and General Manager.\n\nQualifications and Experience:\n\nHigh School Diploma or GED equivalent.\nAbility to follow directions and work independently to meet daily outreach quota.\nPossess excellent customer service, written and oral skills.\nMaintain a professional demeanor and be very organized.\nKnowledge and/or experience with Wordpress, Mailchimp, Excel, Microsoft, LinkedIn, Instagram and CRMs is highly desired.\nInterest in analytical, environmental and microbiological testing, for food, water and cannabis and/or regulated consumer industries is a plus.\n\nWhy join our team:\n\nCompetitive hourly pay\nPotential to grow into full time with:\nComprehensive and low-cost benefits package\n401k program with company match\nIndustry stability with strong brand recognition and a consistent growth\nChallenging tasks, a motivated team, and a long-term perspective global business\nFlat hierarchies and a very family-conscious working environment\n\nWho we are:\n\nTentamus Group is a global product and safety firm with a core presence in Europe, Israel, China, Japan, and North America. Tentamus evaluates and consults on products involving the human body with strong focus on food, nutraceuticals, and cosmetics. Tentamus is represented in over 80 locations worldwide with more than 3,500 highly trained staff members.\n\nwww.tentamus.com\n\nwww.columbialaboratories.com\nhttps://www.linkedin.com/company/tentamus-group/\n\nJob Types: Full-time, Part-time\n\nPay: $18.00 - $25.00 per hour\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nFlexible schedule\nFlexible spending account\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\nMonday to Friday\n\nEducation:\n\nHigh school or equivalent (Preferred)\n\nWork Location: One location",
    "slug": "sales-assistant-255c82b8-41f6-497b-b5ab-55ec60acc935",
    "benefits": [
      "Health savings account",
      "Dental insurance",
      "Health insurance",
      "401(k) matching",
      "Paid time off"
    ],
    "selectedSkills": [
      "Customer service",
      "Microsoft Excel",
      "WordPress",
      "MailChimp",
      "High school diploma or GED"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=iR0E9wUghdNxL9DhwTs7ZFH49l9SpRZqD0Lpjip-DCjf1r2wZl70cA"
  },
  {
    "position": "Process Chemist",
    "labName": "Chemistry. (cannabis brand)",
    "location": "Oakland, CA",
    "age": "7 days ago",
    "type": "Full-time",
    "salaryMin": "$55,000 ",
    "salaryMax": " $65,000 a year",
    "jobDescriptionCopy": "Process Chemist\n\nFull-time position with salary and benefits.\n\nThe Company:\n\nAt Chemistry, we produce high quality, full-spectrum cannabis extract from sun grown, whole flower sourced from Northern California cultivators. We are a team of scientists and enthusiasts that unite on our passion and love for high quality, craft cannabis.\n\nLearn more by visiting www.trychemistry.com\n\nSpecific Responsibilities:\n\nAs a Process Chemist, you will participate in an integrated manufacturing team aimed at producing the highest quality cannabis extracts for our brand Chemistry, our partners, clients, collaborators and patients. You will be trained in and responsible for assisting in all aspects of manufacturing, including but not limited to the following:\n\nPreparation of materials for all steps in the manufacturing of cannabis extract\nExtraction, mechanical grinding of biomass, solvent transfer systems\nLab equipment operation and maintenance\nOperation of rotary evaporators\nData input into compliance systems and management tracking platforms\nLaboratory materials and inventory management\nCleaning, organizing and maintaining a safe lab environment\nQuality control and sample submissions to external testing laboratory\nQuality control track and trace software per California regulations\n\nThe ideal candidate will:\n\nDemonstrate strong leadership, communication and organization skills\nHave a desire to maintain a clean and efficient laboratory, with a focus on optimizing workflow.\nHave a familiarity with concepts regarding distillation, chromatography, polarity in context of extraction science, knowledge of phase diagrams and volatility of liquid solvents.\nBe able to multitask and work in a dynamic environment\nHave knowledge of crude cannabis oil refinement techniques\nFlexibility to help with workload where needed, sometimes outside of lab duties\nLearning new techniques and willingness to help structure and implement them as we grow\nHas worked with vacuum pumps, chillers and filtration equipment.\nWork independently with no supervision and as a team member to accomplish manufacturing goals\nFrequently communicate to team on production status, results, concerns, ideas\nBe able to solving problems creatively\nWill be able to lift up to 50 lbs\nHave a good sense of humor and desire to have fun at work!\n\nEssential Duties and Job Functions\n\nPlans and executes assigned processes that support manufacturing activities and company goals. Demonstrates and applies advanced level of understanding of company goals, methods, and SOPs. May work cross-functionally within organization to achieve common goals. Recommends alternatives, researches new methods and techniques and may proactively seek out senior personnel to discuss potential solutions to problems. Participates in company meetings. Works with limited supervision on projects of moderate scope and complexity.\n\nKnowledge, Experience, and Skills\n\nBS in Biology, Chemistry, Biochemistry and/or relevant experience in a laboratory setting is preferred. The preferred candidate will 1-3 years of experience in a laboratory in the biotechnology, pharmaceutical or cannabis extraction industry. Strong verbal communication skills and interpersonal skills are required. Must be able to participate in highly effective teams. Requires ability to use common tools for effective (scientific) communication within the company.\n\nSince we are a small but growing team and company, there will be significant career growth opportunities as we increase our production capacity and expand our team. Please briefly explain why you would like to work in this industry.\n\nJob Type: Full-time, Monday - Friday (9:30 am- 6 pm)\n\nSalary: $55,000 to $65,000 /year, salary commensurate with experience\n\nBenefits: Full health, dental, vision insurance and paid time off\n\nExperience: 1-3 year of laboratory experience in a similar industry\n\nEducation: Bachelor's of Science is required at minimum\n\nJob Type: Full-time\n\nPay: $55,000.00 - $65,000.00 per year\n\nBenefits:\n\nDental insurance\nFlexible schedule\nFlexible spending account\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\n\nExperience:\n\nLaboratory experience: 3 years (Preferred)\n\nWork Location: One location",
    "slug": "process-chemist-885e9a4e-4be2-449a-b164-2a885cfabd41",
    "benefits": [
      "Dental insurance",
      "Health insurance",
      "Paid time off",
      "Flexible schedule",
      "Vision insurance"
    ],
    "selectedSkills": [
      "Laboratory experience",
      "Communication skills",
      "Biochemistry",
      "Biotechnology",
      "Bachelor of Science",
      "Bachelor's degree"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=pnqptRbPlKN0Gsc6iQb92yN9RJUVSROyZPEpnqokeBnedLo8a6skRw"
  },
  {
    "position": "HPLC Technician",
    "labName": "Curaleaf",
    "location": "Taneytown, MD",
    "age": "2 days ago",
    "salaryMin": "$43,000 ",
    "salaryMax": " $61,000 a year",
    "jobDescriptionCopy": "Curaleaf Holdings, Inc. (CSE: CURA) (OTCQX: CURLF) (\"Curaleaf\") is a leading international provider of consumer products in cannabis, with a mission to improve lives by providing clarity around cannabis and confidence around consumption. As a high-growth cannabis company known for quality, expertise, and reliability, the company and its brands, including Curaleaf and Select provide industry-leading service, product selection, and accessibility across the medical and adult-use markets. In the United States, Curaleaf currently operates in 23 states with 123 dispensaries, 25 cultivation sites, and over 30 processing sites, and employs over 5,000 team members. Curaleaf International is the leading vertically integrated cannabis company in Europe with a unique supply and distribution network throughout the European market, bringing together pioneering science and research with cutting-edge cultivation, extraction, and production. Home | Curaleaf | Cannabis with Confidence\n\nOur corporate social responsibility is Rooted In Good Diversity, Equity, Inclusion + Social Equity + Sustainability Social Responsibility | Curaleaf | Cannabis with Confidence We believe in taking corporate and social responsibility very seriously, from our educational outreach to national partnerships, state-wide initiatives and local causes. Giving back to the communities where we operate is important to us, and helps to change old attitudes by showing the positive impact of cannabis in creating jobs, changing lives, and helping local communities.\n\nWe educate. We advocate. We give.\n\nThe HPLC Lab Technician carries out day-to-day tasks including: testing, prepping, extracting, and packaging. The HPLC Lab Technician must monitor and maintain production facility in accordance with the state of Maryland and standards set by the Company.\n\nResponsibilities:\nDevelop and execute validation of analytical systems\nOperate spectrophotometer and viscosity meter for QC\nAssist in production; calculating requirements; assembling and weighing plant material and supplies for supercritical CO2 extraction: emptying of extraction vessels.\nOperating highly sophisticated extraction equipment; Processing concentrates and extracts\nCleaning and maintenance of extraction equipment and laboratory facility following current good manufacturing practices (cGMP), and standard operating procedures; complying with legal regulations; monitoring environment\nOperating, maintaining, and making adjustments and repairs to laboratory equipment such as analytical systems, pumps, microscopes, balances, rotary evaporator, centrifuges, and other laboratory equipment\nCreating dilutions, HPLC diagnostics and repair, calibration\nMaintaining inventory records of supplies, materials, and equipment, and preparing requisitions as needed\nStoring supplies and equipment, and keeping laboratory, storerooms and working areas immaculate\nWashing and sterilizing laboratory glassware\nPerforming clerical work related to laboratory activities such as word processing, record keeping, and filing\nAssist in packaging of final products as needed\nAssist in the training of other technicians\nWork with state licensed third party testing lab to ensure QC\nPerforms related duties as assigned\n\nCompliance:\nEnsure processing operation is fully compliant with state and federal regulations\nMaintain analytical and other laboratory waste with registered waste disposal company while following state regulations\nMaintaining material safety data sheets for all department chemicals and products\nAssure that operation adheres to all business and industry license requirements.\nMaintaining strict inventory records of all plant materials, chemicals and equipment used in the laboratory and documents production by completing forms, reports, logs and records\n\nJob Qualification Requirements:\nBachelor's Degree preferred/ 1-2 years' experience in a laboratory or manufacturing setting required\nQA/QC Experience with HPLC and GC analysis\nExperience with Agilent equipment using ChemStation\nMust be at least 21 years of age\nSubject to background check per state cannabis regulations\nCapacity to work independently and/or with vendors, perform troubleshooting and solve complex problems.\nThe qualified individual will possess a keen interest and knowledge of Organic and Inorganic chemistry.\n\nCuraleaf is an Equal Opportunity Employer\n\nCuraleaf is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.",
    "slug": "hplc-technician-bc9528d3-7531-4cb2-ace6-7742752e921a",
    "benefits": [],
    "selectedSkills": [
      "Gas chromatography",
      "Laboratory experience",
      "Analysis skills",
      "Manufacturing",
      "QA/QC",
      "Bachelor's degree",
      "Background check",
      "21 years or older"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=WUFHNQD7pNN-jFDgrlLg71MWHdMC_d64287kQziwLzeZCp2Trt2qoQ"
  },
  {
    "position": "Accounting Clerk",
    "labName": "Kaycha Labs",
    "location": "Fort Lauderdale, FL",
    "age": "4 days ago",
    "type": "Full-time",
    "jobDescriptionCopy": "Company Overview:\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\nEssential Duties & Responsibilities:\n\nEnter A/P invoices\nMatch supporting documentation to Credit Card transactions\nFiling\nMail payments\nOther duties as assigned to support Accounting Manager\n\nEducation & Experience:\n\nBachelor’s degree in accounting, finance or general business administration preferred.\nSage X3 Experience (2-3 years, preferred)\n\nSkills, Abilities and Competencies:\n\nExcellent verbal and written communication skills.\nTeam-oriented individual with strong attention to detail\nSolid organization skills, such as multitasking and effective time-management\nMulti-tasker who can prioritize tasks to achieve time-sensitive deadlines\n\nOther:\n\nMust pass Level 2 background check.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.f.\n\nEssential Functions:\n\nThe physical demands described here are representative of those that an employee must meet to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nWhile performing the duties of this job the employee is frequently required to stand, handle or feel, to speak, and to hear. The employee is occasionally required to walk, sit, reach with hands and arms, bend, kneel, crouch, or crawl. The employee must frequently lift and/or move up to thirty-five (35) pounds.\n\nSpecific vision abilities required for this job include close (proximity) vision, depth perception, and the ability to adjust focus.\n\nWork Environment:\n\nThe work environment described here is representative of that which an employee may encounter while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nThe standard analytical laboratory environment is one in which potential health hazards do exist. Administrative, operations, technical, and professional staff are expected to safely operate in accordance with applicable and appropriate health and safety policies and procedures, as prescribed by the applicable Kaycha manuals and policies and/or federal, state, or local standards.\n\nLaboratory staff can be expected to work in areas where hazards associated are with, but not limited to, airborne pathogens. Biological materials, hazardous substances, and radioactive material exist and are handled. Appropriate training is provided regarding these hazards and staff are expected to adhere to all health and safety policies at all times, whether they are in writing or verbalized by a supervisor.\n\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.\n\nThe above is intended to describe the general content of and requirements for the performance of this job. It is not to be construed as an exhaustive statement of duties, responsibilities, or physical requirements. Nothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions\n\nJob Type: Full-time\n\nPay: From $16.00 per hour\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nDisability insurance\nEmployee assistance program\nFlexible spending account\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nPhysical Setting:\n\nOffice\n\nSchedule:\n\n8 hour shift\nDay shift\nMonday to Friday\nOvertime\n\nApplication Question(s):\n\nBest email and phone number to reach you at?\nDesired compensation?\n\nEducation:\n\nBachelor's (Required)\n\nExperience:\n\nSage X3: 2 years (Preferred)\nAccounts payable: 2 years (Preferred)\n\nWork Location: One location",
    "slug": "accounting-clerk-90c31230-a89e-4867-abab-1ded893d41b1",
    "benefits": [
      "Dental insurance",
      "Health insurance",
      "401(k)",
      "Flexible spending account",
      "Employee assistance program"
    ],
    "selectedSkills": [
      "Sage",
      "Accounts payable",
      "Communication skills",
      "Time management",
      "Bachelor's degree",
      "Background check"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=Pdmo_85aVe0xpAa6sMXLm0aM3AIc8n6-yRQFBlAKMTWitLYUETOY9w"
  },
  {
    "position": "Lab Director (NJ)",
    "labName": "Steep Hill New Jersey",
    "location": "Township of Hamilton, NJ",
    "age": "1 day ago",
    "type": "Full-time",
    "jobDescriptionCopy": "POSITION SUMMARY: This is a high-level managerial position, responsible for the overall operation and administration of the laboratory. Responsible for performing a wide array of laboratory tests, procedures, and analyses, assures compliance with all applicable regulations.\n\nESSENTIAL FUNCTIONS\n\nEnsuring compliance with all state regulatory, corporate, and customer service requirements\nEnsuring that all employees are properly trained in quality-related procedures\nResponsible for the development, modification, verification, and validation of methods\nParticipating in the establishment and ongoing improvement of quality control systems\nEnsuring the safety of all personnel by overseeing the proper use of protective equipment during all sampling and testing activities\nDeveloping and maintaining documentation to comply with record keeping requirements\nVerifying the results of analyses conducted in the laboratory\nCompiles, reviews, and send certificates of analysis to customers\nReviews, approves, and uploads test data to respective state's seed-to-sale tracking system\nDeveloping and implementing analytical techniques and methodology to increase the accuracy and efficiency of all laboratory-related matters\nEncouraging project and process designs that simplify compliance with quality requirements\nInteracting with customers to provide analytical support as needed\nAuditing and updating standard operating procedures\nConducting analytical tests, including but not limited to potency, pesticide, residual solvent, heavy metal and moisture analyses\nCoordinating with customer service team members to proactively respond to customer complaints and inquiries\nImplementing solutions to quality control problems through inspections, investigations and audits\nConsulting with clients and government regulators as needed\nConducting client site visits as needed and\nPerforming other duties as needed for the successful operation of the laboratory.\n\nPOSITION REQUIREMENTS:\n\nGeneral Knowledge/Abilities\n\nAbility to fluently speak and read the English language along with understanding and following both written and verbal direction\nAbility to function independently, have personal integrity, flexibility, and the ability to work effectively with fellow employees\nAnalytical and numerical skills: ability to perform mathematical calculations in different units of measurement\nAbility to use concepts such as fractions, percentages, and ratios demonstrated abilities in troubleshooting and problem-solving\nBasic knowledge of modern office practices and use of Microsoft Office Suite for Word and Excel\nDemonstrated practice of constructive problem-solving and the confidence to challenge and be challenged to achieve the best strategies and solutions\nExperience in driving tasks and meeting deadlines accountable for the completion of assigned goals and objectives\nAbility to build relationships to strengthen partnerships with a focus on customer service\nAbility to perform physically demanding work such as moving and lifting equipment, standing for long periods of time, etc.\n\nExperience, Education, Licenses/Certifications\n\nMaster’s degree in Chemistry or a related field from an accredited college\nProven hand-on experience as a Quality Manager or other similar position\nCustomer service or customer-facing experience and analytical laboratory experience preferred\nIndustry experience in Medical/Recreation Cannabis is a major plus\n\nSUPERVISORY RESPONSIBILITIES: Lab Manager; Scientists/Analysts\n\nJob Type: Full-time\n\nPay: From $95,000.00 per year\n\nBenefits:\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\n\nCOVID-19 considerations:\nVaccination against COVID-19 is required for ALL employees.\n\nEducation:\n\nMaster's (Preferred)\n\nExperience:\n\nAnalytical Laboratory: 5 years (Preferred)\n\nWork Location: One location",
    "slug": "lab-director-nj-270ce744-de96-4bcd-b6ac-0b038ef87073",
    "benefits": [
      "Dental insurance",
      "Health insurance",
      "Paid time off",
      "401(k)",
      "Vision insurance"
    ],
    "selectedSkills": [
      "Analysis skills",
      "Customer service",
      "Microsoft Excel",
      "Laboratory experience",
      "Microsoft Office",
      "Master's degree"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=7S-J5MyXJX-BNdpSzvCD3seQsi5VyCJw_Z1lFnAHzKpHMBqoCqWLug"
  },
  {
    "position": "Microbiologist",
    "labName": "Kaycha Labs",
    "location": "Gainesville, FL",
    "age": "7 days ago",
    "type": "Full-time",
    "salaryMin": "$37,000 ",
    "salaryMax": " $50,000 a year",
    "jobDescriptionCopy": "Company Overview:\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\nJob Purpose:\n\nThe Microbiologist will be responsible for performing, documenting, record checking, and troubleshooting qualitative and quantitative assays on samples using techniques that vary from the use of standard laboratory equipment to highly modern and automated instrumentation.\n\nEssential Duties & Responsibilities:\n\nAnalyze samples consisting of a variety of matrices and cross trained on various laboratory technologies including, but not limited to, bacterial and fungal plating and PCR.\nTrain incoming analysts and technicians on methodology.\nResponsible for troubleshooting instrumentation to ensure data integrity\nPrepare samples for analysis while displaying good laboratory technique to avoid cross contamination or misidentified samples.\nAccurately prepare quality control samples.\nInterpret and evaluate data in terms of accuracy, precision, trends, and quality control requirements.\nProvide scientific interpretation of results to supervisor, management, or customers as requested.\nMaintain a sterile work environment and undergo cleaning procedures as necessary, to ensure ongoing proper workflow. Report contamination issues to supervisor.\nPrioritize samples and provide guidance and support to the sample prep team for assigned analysis.\nPerform method validations, or verifications with minimal supervision as needed.\nTrack inventory of supplies and reagents to ensure no interruption of work-flow\nOversee root cause analysis for quality assurance.\nAssist in SOP edits as needed for assigned testing analysis and alert management when there is a change in procedure\nMay be able to perform method development to respond to changing client needs or regulations\nResearch new technologies and methodologies to improve laboratory processes and techniques and make recommendations to supervisors.\nOther duties and special projects as assigned.\n\nSkills, Abilities and Competencies:\n\nStrong understanding of standard laboratory protocol.\nMaintain high productivity, keen attention to detail, and consistent multi-tasking while yielding a low testing error rate.\nStrong agility, engagement, and flexibility in an ever-changing environment.\nDiligent commitment to logging, organizing, and analyzing data.\nExcellent communication skills and ability to effectively work, problem solve, and communicate with multiple levels of the organization.\nPromote a strong customer service culture while adhering to the highest safety and industry standards, including those that are outlined by the state regulatory body.\n\nEducation & Experience:\n\nMinimum BS/BA in Biology, Chemistry, Physics, Engineering or Environmental Sciences required.\nKnowledge of principles, terminology, practices, techniques, and instrumentation commonly used in a laboratory setting required.\nAt least 2 years of microbiology experience is preferred.\nFood science and/or environmental experience is a plus.\nExposure to the cannabis industry is a plus.\n\nOther:\n\nMust pass the required background check.\nMust be at least 21 years old.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision, 401k plan with company match and PTO.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.\n\nThe above is intended to describe the general content of and requirements for the performance of this job. It is not to be construed as an exhaustive statement of duties, responsibilities, or physical requirements.\n\nCOVID-19 considerations: Face masks required.\n\nJob Type: Full-time\n\nSchedule:\n\n10 hour shift\nMonday to Friday\nWeekend availability\n\nCOVID-19 considerations:\nMask mandate for all employees and visitors.\n\nApplication Question(s):\n\nWhat is your desired compensation?\nBest phone number/email to reach you at?\n\nEducation:\n\nBachelor's (Preferred)\n\nExperience:\n\nMicrobiology: 1 year (Required)\n\nWork Location: One location",
    "slug": "microbiologist-a181f5d4-0f25-4155-aeda-978065f5fb2b",
    "benefits": [
      "Dental insurance",
      "Health insurance",
      "401(k) matching",
      "Paid time off",
      "401(k)"
    ],
    "selectedSkills": [
      "Communication skills",
      "Microbiology",
      "Root cause analysis",
      "Bachelor of Science",
      "Bachelor's degree",
      "21 years or older",
      "US work authorization",
      "Background check"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=bxmMzu6yH2JZpz-BayF1hBOhOGWJSNi25_m1cny80WJK6MF2d8SHxg"
  },
  {
    "position": "Laboratory Agent (Transport)",
    "labName": "CDX Analytics, LLC",
    "location": "Salem, MA",
    "age": "7 days ago",
    "type": "Full-time | Part-time",
    "salaryMin": "$17.60 an hour",
    "jobDescriptionCopy": "Position Type/ Hours of Work\n\nWe offer this position as either full-time with benefits or part-time with flexible shifts. Overtime work may be required as job duties demand.\n\nSummary/Objective\n\nReporting to the Logistics Manager and the Chief Operating Officer, we are seeking a Laboratory Transport Agent to perform courier services for the laboratory, transporting cannabis samples from our client facilities to the laboratory for regulatory testing. Laboratory Transport Agents must have excellent driving skills and excellent customer service skills and must be able to work as part of a small team while completing collections and completing administrative duties as determined by the Logistics Manager.\n\nEssential Functions\n\n· Represent CDX Analytics to our clients by always completing collection services in a punctual and professional manner.\n\n· Transport cannabis samples from licensed cannabis establishments to the laboratory using our company vehicle.\n\n· Cross-check sample weights at arrival before loading.\n\n· Assist clients with completion of manifests and essential paperwork ensuring compliance with Massachusetts Cannabis Control Commission (CCC) requirements.\n\n· Operate company transport vehicle in accordance with company policy and in compliance with Massachusetts state regulations.\n\n· Physically load and unload product from the transport vehicle.\n\n· Perform occasional logistical tasks relating to the operation of the laboratory.\n\nCompetencies\n\n· Minimum high-school diploma or equivalent.\n\n· Operate the company vehicle in a safe manner while obeying all traffic laws.\n\n· Competently operate company communication technology and always maintain required regular communication with the dispatch agent.\n\n· Complete required administrative tasks during transport to ensure compliance with CCC requirements.\n\n· Complete all CDX Analytics internal on-boarding and training requirements.\n\n· Previous driving experience is a plus.\n\n· Customer service experience essential.\n\n· Must be available for full and occasional extended days – start times vary from 7am to 9am depending on the day’s workload. Must be able to maintain a flexible working schedule and adjust if hours are extended during a shift.\n\nRegulatory Requirements\n\n· Employment will be subject to candidate passing a Criminal Offender Record Information (CORI) report.\n\n· Candidates must possess a valid Massachusetts driver's license.\n\n· Must have a clean driving record for the previous five (5) years and be a minimum of 21 years of age.\n\n· Candidate will be licensed with the Massachusetts Cannabis Control Commission as a Laboratory Agent on commencement.\n\n· Candidate must also undergo Responsible Vendor Training (RVT) course before commencing work.\n\nJob Type: Full-time/Part-time\n\nPay rate: $17.60/hour. Must demonstrate required competencies after completion of probationary 90-day training period. May be negotiable to take account of previous experience.\n\nJob Types: Full-time, Part-time\n\nPay: $17.60 per hour\n\nBenefits:\n\nDental insurance\nHealth insurance\nPaid time off\n\nSchedule:\n\n8 hour shift\nMonday to Friday\n\nEducation:\n\nBachelor's (Preferred)\n\nExperience:\n\nSupply Chain & Logistics Occupations: 1 year (Preferred)\n\nWork Location: On the road",
    "slug": "laboratory-agent-transport-bc254331-4323-43ba-89b9-3a52981b9f47",
    "benefits": ["Dental insurance", "Health insurance", "Paid time off"],
    "selectedSkills": [
      "Customer service",
      "Supply chain",
      "Driving",
      "Driver's License",
      "Logistics",
      "Bachelor's degree",
      "21 years or older",
      "Clean driving record",
      "US work authorization"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=PGBjTeqV2_pnn-iEkkXSmFiozreShSgEBDPItG1JurRHUzxqYkx6IA"
  },
  {
    "position": "Tissue Culture Technician",
    "labName": "Tru Clones",
    "location": "Bangor, MI",
    "age": "1 day ago",
    "type": "Full-time",
    "salaryMin": "$18 ",
    "salaryMax": " $22 an hour",
    "jobDescriptionCopy": "Tru Clones is a startup Greenhouse/Outdoor Cannabis cultivation facility with Nursery and Tissue Culture Services, located outside Bangor, MI. We are developing our team and looking for qualified applicants for part-time and full-time positions within our organization.\n\nThe Tissue Culture Technician position is responsible for maintaining the Tissue Culture Production Schedule as well as the Tissue Culture department. Team members will utilize our process to free cultivars from virus, pathogen, or pest pressure as well as provide long term genetic banking for our clients. Tissue Culture Technicians will receive work instructions as well as report to the Director of Cultivation.\n\nThis full-time position is year round Monday through Friday 8AM-4PM. Weekend shifts may be required within the nature of our business. Compensation will range from $16-$20 per hour based on experience.\n\nJob Duties\n\n-Tissue Culture Technicians are responsible for propagating in house as well as third party cultivars though our tissue culture system.\n\n-Team members will assess incoming cultivars and maintain a rigid production schedule for each client.\n\n-Team members will prepare media, sterilize tools and supplies, maintain a clean workspace and monitor the growth of the tissue culture stock.\n\n-Through our training program team members will dissect plant tissues and propagate though various methods in order to deliver hardened plants to clients.\n\n-Team members will prepare tissue culture plants for delivery to clients or movement into our vegetative rotation.\n\n-As necessary the Tissue Culture Technician will assist the Propagation Team with duties in their department.\n\nQualifications\n\n- Over 21 years old\n\n- High School Diploma\n\n- Bachelors degree in related fields (Microbiology, Botany)\n\n- 2+ years experience within tissue culture laboratories\n\n- Exceptional attendance and punctuality\n\n- Reliable transportation\n\n- Ability to work with other team members to complete work instructions\n\n- Display a high level of attention to detail\n\n- Exhibit strong organization, record keeping, and time management skills\n\n- Familiarity with operation of laboratory equipment including: autoclaves, laminar flow hoods, microscopes, and testing equipment\n\n- Must be able to lift and carry 50lbs, and be on your feet or sitting for the entire shift when necessary\n\n- Understanding of Microsoft Office programs and general computer knowledge\n\nJob Type: Full-time\n\nPay: $18.00 - $22.00 per hour\n\nBenefits:\n\nHealth insurance\nPaid time off\n\nSchedule:\n\n8 hour shift\nMonday to Friday\nWeekend availability\n\nAbility to commute/relocate:\n\nBangor, MI 49013: Reliably commute or planning to relocate before starting work (Preferred)\n\nApplication Question(s):\n\nAre you over 21?\n\nWork Location: One location",
    "slug": "tissue-culture-technician-950e592d-4bed-467d-b3a7-0d8858f490e9",
    "benefits": ["Health insurance", "Paid time off"],
    "selectedSkills": [
      "Computer skills",
      "Dissection",
      "Tissue culture",
      "Time management",
      "Microsoft Office",
      "Bachelor's degree",
      "High school diploma or GED",
      "21 years or older",
      "Reliable transportation"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=Juv6H1IYXCJcxd4SYuhx26vbWKRm-S6hpH0FQ_WWqEV-VA7O8-QugA"
  },
  {
    "position": "Business Development Representative",
    "labName": "HighRes Labs, Inc.",
    "location": "Oklahoma City, OK",
    "age": "20 hours ago",
    "type": "Full-time",
    "salaryMin": "$15 ",
    "salaryMax": " $50 an hour",
    "jobDescriptionCopy": "Job description\n\nHighRes Labs has an opening for a team player in the dynamic new industry of medical marijuana testing in Oklahoma. Position yourself as a business professional in the fast paced field of cannabis quality control by leading the sales and marketing for a successful testing laboratory in Edmond, Oklahoma.\n\nHighRes Labs is an ISO-17025 accredited testing laboratory licensed by the Oklahoma State Department of Health and Oklahoma Medical Marijuana Authority. You bring your business development interests, chemistry intrigue, and team player mentality and we will train you in the field of MMJ testing.\n\nResponsibilities:\n\nThe Business Development Representative will manage marketing initiatives, sales strategies, and business development operations. Honesty and ethics are paramount for this position. This role will be directly responsible for driving revenue through customer acquisition, sales execution and customer relationship management.\n\nRequirements:\n\nProven sales leadership experience and success selling B2B\nAbility to work independently with little oversight\nA valid driver’s license and clean driving record\nPersonal transportation to visit existing and potential customers\nExcellent verbal and interpersonal communication skills\nClean criminal history\n\nJob Duties:\n\nDevelop and establish key customer relationships with Medical Cannabis growers, processors, and dispensaries.\nTravel as necessary within Oklahoma for in-person meetings with customers and prospects to develop key relationships.\nMake recommendations for sales strategy within the Oklahoma territory in order to maximize sales productivity.\nDesign, implement and manage sales forecasting, planning, and budgeting processes to establish high levels of quality, accuracy, and process consistency.\nMaintain a CRM of the target customers in Oklahoma.\n\nAdditional Preferences:\n\n1+ years in a similar sales role within the cannabis industry.\nAssociate degree.\nExperience creating and operating a sales pipeline management system.\nRecent sales experience in Oklahoma with existing Medical Cannabis growers, processors and dispensaries will be a plus.\nDirect, no-nonsense communication style that emphasizes transparency and integrity.\n\nWhat we offer:\n\nCompensation: Salary $15/hr ~ $50/hr + commissions.\n\nCommissions ranging from 10% to 15% or more depending on the base salary, prior experience and working performance.\n\nAnd untapped opportunity to develop cannabis testing sales in Oklahoma.\n\nThe candidate will be hired on a probationary basis for three months.\n\nJob Type: Full-time\n\nPay: $15.00 - $50.00 per hour\n\nBenefits:\n\nDental insurance\nFlexible schedule\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\nDay shift\nMonday to Friday\n\nSupplemental Pay:\n\nCommission pay\n\nAbility to commute/relocate:\n\nEdmond, OK: Reliably commute or planning to relocate before starting work (Preferred)\n\nEducation:\n\nAssociate (Preferred)\n\nExperience:\n\nCustomer service: 1 year (Preferred)\n\nWork Location: One location",
    "slug": "business-development-representative-0938b30d-9c82-493f-9722-532753fdbcf7",
    "benefits": [
      "Dental insurance",
      "Health insurance",
      "Paid time off",
      "Flexible schedule",
      "Vision insurance"
    ],
    "selectedSkills": [
      "Customer service",
      "Driver's License",
      "Sales",
      "Customer relationship management",
      "Sales pipeline",
      "Associate's degree",
      "Clean driving record",
      "US work authorization"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=XPS9Jvrkugys01h2GbK0Qfw63jhytX3HxSp3e5Q_FgcFbZTgP6VC1A"
  },
  {
    "position": "Quality Manager",
    "labName": "Certified Testing and Data",
    "location": "Orlando, FL",
    "age": "4 days ago",
    "type": "Full-time",
    "salaryMin": "$57,000 ",
    "salaryMax": " $77,000 a year",
    "jobDescriptionCopy": "Description:\nDepartment: Operations\n\nPosition Title: Quality Manager\n\nReports to: VP of Operations\n\nPosition Type: Full-time, Non-exempt\n\nCompany Description\n\nCertified Testing and Data - The soon to be premier provider in the cannabis and hemp testing space. Founders have extensive experience in Cannabis as well as leading Multi Billion dollar lab companies. Opportunity to participate in the growth and success of the company with a stock grant awarded to founding team members. Prior business led by management was top 15 Fastest growing company by Inc 5000. CTND has great culture, excellent professional growth opportunities, and one of the nicest working lab spaces in the country. Submit your application today.\nCertified Testing and Data, an analytical testing facility, provides consultations and analytical results across the entire spectrum of the plant medicine industry. Building on a record of excellence, Certified Testing and Data features one of the largest full-service testing laboratories in the United States. Dedication to personalized service coupled with superior scientific practices are the foundation of Certified Testing and Data success.\n\nJob Description\n\nThe Quality Manager is responsible for the implementation of CTND’s quality program and ensuring all laboratory activities are in compliance with local & state regulations and ISO/IEC 17025 standards. This role is accountable for knowing and following all Company policies and standards, leads by example, and lives our values.\n\nResponsibilities and Duties\n\nLead the team with dynamic leadership that promotes an environment of support, development, engagement, and high productivity. This includes, but is not limited to, hiring, coaching, performance management, ensuring productivity, disciplinary action, cross-training, rewards and recognition, and succession planning.\nEnsure quality assurance/control compliance and standardization. This requires maintaining current knowledge of internal and external standards, with particular focus on State Regulatory and ISO/IEC 17025 requirements.\nCreate, manage, and facilitate the quality scorecard.\nEffectively communicate quality policies and procedures to all levels of laboratory staff.\nEstablish and maintain documentation and record controls and procedures.\nDevelop and implement quality procedures and standards to ensure production activities meet compliance standards.\nCreate and update laboratory policies and procedures associated with various assays, in partnership with the Lab Director and Quality department.\nMonitor laboratory data performance and customer complaints with tracking and establish corrective measures as needed. Prepare detailed reports, including current, trending, forecasting.\nManage internal and external audits. Investigate findings, work with the affected department(s) to develop appropriate corrective and/or preventive actions, document the findings, and perform appropriate follow-up. Evaluate the efficacy of implemented corrective/preventive methods.\nGenerate audit reports and schedule review with appropriate internal stakeholders.\nManage the proficiency testing (PT) program for the laboratory. This includes PT vendor evaluation, purchasing PT samples, scheduling PT tests, and reviewing submissions.\nMonitor relevant data for performance and trends using statistical methods.\nBuild strong internal, external, and cross-functional relationships.\nOther duties and special projects as assigned.\n\nKnowledge & Skill\n\nThis position needs an advanced knowledge of microbiology and chemistry science obtained from a Master’s degree or equivalent experience, to provide information to customers and employees as well as implement new testing procedures. A thorough knowledge of chemistry and microbiology is necessary to manage the analysis that is conducted in the laboratory. A general knowledge of personal computers is necessary to track laboratory information and produce documents to support the management function. General knowledge of the Laboratory Information Management System (LIMS) is needed to review analysis results and correct any discrepancies. Analytical skills are needed to problem solve and fulfill customer's analysis needs. Strong oral and written communication skills are essential to this position for effective customer contact. Customer relation skills are needed to obtain and provide information to the customer. Planning skills are essential to maintain efficient laboratory operations.\n\nJob Complexity\n\nThis position requires individual analysis of each problem to determine the optimal solution. Problems can occur when the customer requests a test not currently used in the laboratory or when a new product requires a modification of current methods. The incumbent uses previous experience, federal (FDA, USDA, and APHA) publications, field texts, and current journal articles as resources to provide necessary information to solve a problem. Solutions may require innovative alternatives to modify current analysis methods to improve productivity or for solving unique employee relation difficulties. Customer problems are often unique and require the incumbent to select among several different alternatives to maintain customer business. The incumbent is responsible for overall quality of operational activities of the microbiology and chemistry laboratories. This position uses previous experience, guidance from other laboratory leadership and relevant literature to obtain a solution to the problem.\n\nDecision Making or Recommendations\n\nThis position requires decisions to be made regarding laboratory needs and difficulties. Information is available from standard operating procedures, position precedents, federal and state regulations and written company procedures and policies. All of the incumbent's decision making and recommendations must be based on ethics and integrity.\n\nAccountability\n\nThe incumbent receives general direction from the Vice President of Operations (VPO). This position works toward broad long-term objectives established with the VPO. The incumbent, with the authorization of the VPO, determines intermediate sequences. Review of work occurs on a monthly basis to ensure that procedures are followed and no quality issues arise. The incumbent is responsible for maintaining quality, ethics and integrity. This position is responsible for maintaining a work environment that promotes a productive workforce and accurate results for the customer. The Quality Manager ensures that laboratory personnel have the tools and knowledge to perform assigned tasks according to the quality process. Unique or unusual problems may result in consulting the VPO or corporate personnel to suggest possible solutions.\n\nSupervision of Others & Relationships\n\nThis position supports the Lab Director in the supervision of Lab Managers and subordinates. Supervisory responsibilities include quality assessment of work and evaluating work for accuracy and completeness. Coordination with microbiology and chemistry departments is required to provide complete analysis of samples when required. This position coordinates with the corporate departments of accounting, sales, IT, research, human resources and educational services to obtain information to provide quality services to the customer. Internal coordination between the various laboratory functions is needed to achieve the most accurate and timely analysis possible.\n\nWork Environment\n\nThe incumbent works in a laboratory environment with proper lighting and temperature control. Occasional exposure to laboratory fumes, chemicals, and materials will occur when obtaining results or testing status from operations personnel. Client visits may require protective clothing and equipment according to the facility environment. Physical dexterity is necessary to effectively manipulate a keyboard. The incumbent can expect extended time spent in a sitting position. Three to seven nights a month maybe needed to travel to other laboratory locations and attend professional seminars.\n\n. Requirements:\nWorking knowledge of a broad range of plant medicine products, processes, and cultivation preferred (e.g. Cannabis, Hemp, CBD and Fungi).\nExpert knowledge of regulations (local and federal), Good Laboratory Practices, and current official methods with at least 3 years experience working in an accredited laboratory.\nExcellent oral and written communication skills. Demonstrated expertise in plant medicine safety, quality and value.\nMust have strong organizational, leadership, and customer service skills. Excellent interpersonal, communications, public speaking, and presentation skills.\nExpert knowledge of root cause analysis, corrective and preventive action reporting.\nAbility to generate respect and trust from staff and external constituencies.\nBS/BA degree required, MS/MA degree preferred.\nMust be at least 21 years of age and pass required background check\n\nPhysical Requirements\n\nThese physical demands are representative of the physical requirements necessary for an employee to successfully perform the essential functions of the job. Reasonable accommodation can be made to enable people with disabilities to perform the described essential functions. While performing the responsibilities of the job, the employee is required to communicate with coworkers and managers by conversing and exchanging information regarding laboratory functions throughout 50% of the work day. The employee is required to stand 50% of most work days, sit 50% of most work days, and use their hands and fingers to record data on laboratory worksheets, enter data into spreadsheet workbooks, enter data into the LIMS system, and perform chemical analyses. The employee is occasionally required to lift up to 50lbs and pull up to 150lbs while performing laboratory duties such storing or retrieving chemicals. The employee must be able to reach. Vision abilities required by this job include close vision to record data on laboratory worksheets, enter data into spreadsheet workbooks, enter data into the LIMS system, and perform chemical analyses. The employee must be able to move about in the laboratory regularly throughout the work day. The employee must be able to occasionally work in extreme cold (below 32 degrees F) temperatures when retrieving samples, cleaning out retained samples and reorganizing stored samples. The employee must be able to tolerate moderate amounts of noise from laboratory equipment. The employee must be able to regularly tolerate very strong chemical odors. Provided with proper protective equipment, the employee must work with chemical hazards",
    "slug": "quality-manager-47de0c13-1f04-4acf-a27e-08226da3a845",
    "benefits": [],
    "selectedSkills": [
      "Analysis skills",
      "Customer service",
      "GLP",
      "Laboratory information management systems",
      "Succession planning",
      "Bachelor of Science",
      "Bachelor's degree",
      "Master's degree",
      "21 years or older",
      "Background check"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=mNXO7Pp4S6vERCYOIRStmlPuATvzy2ugWHfPNJQuHT9ZZMuniYcJ_A"
  },
  {
    "position": "Microbiologist I",
    "labName": "Cambium Analytica",
    "location": "Traverse City, MI",
    "age": "7 days ago",
    "type": "Full-time",
    "jobDescriptionCopy": "Cambium Analytica is seeking a highly motivated microbiologist who would be responsible for the testing of medical and recreational cannabis and cannabis infused products for microbiological assays, including total coliform, STEC, Salmonella and Aspergillus. Other testing includes viral, pathogenic and gender identification. These tests utilize qPCR via AriaMx Thermocycler.\n\nResponsibilities & Duties:\n\nActively participate as part of the method development, laboratory operations and following Good Laboratory Practices as defined in approved SOPs\nPerform all aspects of assigned technical processes\nPerform instrument QC and preventative maintenance\nParticipate in drafting and execution of study plans to optimize assay/reagent parameters and product configuration\nParticipate in experimental data analysis and interpretation\nPresent data for review and discussion at individual and group laboratory meetings\nFollow laboratory protocols rigorously to execute experiments, thoroughly document all activities and maintain a formal notebook. Understand the experimental goals and results and provide feedback and basic troubleshooting as necessary\nAs part of ongoing technical growth, gain further understanding of experimental principles by reading appropriate literature\nWork cooperatively in a team environment; supporting senior scientific staff and co-workers\nPrepare and qualify all reagents and working standard calibrator aliquots needed for quality assurance of all approved analytical methods\nMay be required to review and update SOPs, tracking logs, and material/reagent specifications under design control processes\nMaterials ordering, receiving and inventory\n\nThe ideal candidate will:\n\nCapable of prioritizing tasks to meet goals and ensure product quality\nAttention to detail and ability to multitask\nProficient in Microsoft Excel and Word\nGeneral familiarity with computers and technology\nExcellent communication skills\n\nJob Type: Full-time\n\nPay: From $45,000.00 per year\n\nBenefits:\n\nDental insurance\nHealth insurance\nHealth savings account\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\n\nSupplemental Pay:\n\nBonus pay\n\nApplication Question(s):\n\nAre you willing to undergo a background check, in accordance with local law/regulations?\nWhat would your co-workers say about you?\nTell me about a time you failed or made a mistake.\n\nEducation:\n\nBachelor's (Required)\n\nExperience:\n\nMicrobiology: 1 year (Preferred)\nLaboratory Experience: 1 year (Preferred)\n\nWork Location: One location",
    "slug": "microbiologist-i-b005c4ba-59ff-4ee0-9c0f-0885dad4c528",
    "benefits": [
      "Health savings account",
      "Dental insurance",
      "Health insurance",
      "Paid time off",
      "Vision insurance"
    ],
    "selectedSkills": [
      "Microsoft Excel",
      "Design controls",
      "Laboratory experience",
      "Communication skills",
      "Microbiology",
      "Bachelor's degree",
      "Background check"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=oLIM3VG4URplNhjh-gfhgXz1jnI3x-8CAZHT9POg3B8dlrUAGceXGg"
  },
  {
    "position": "Extraction Technician",
    "labName": "Columbia Care",
    "location": "Arcadia, FL",
    "age": "3 days ago",
    "jobDescriptionCopy": "Reports to: Facility Manager / Production Supervisor / Laboratory Supervisor\n\nPosition Overview:\nThe Extraction Technician is responsible for the facility’s overall extraction process and day-today production following established protocol and regulations. The Extraction Technician will lead the extraction lab team through the activities required to manufacture, store, maintain equipment and materials necessary to run a world-class extraction lab.\n\nAbout Columbia Care\n\nColumbia Care is one of the largest and most experienced cultivators, manufacturers and providers of cannabis products and related services, with licenses in 18 U.S. jurisdictions and the EU. Columbia Care operates 130 facilities including 99 dispensaries and 31 cultivation and manufacturing facilities, including those under development. Columbia Care is one of the original providers of medical cannabis in the U.S. and now delivers industry-leading products and services to both the medical and adult-use markets. In 2021, the company launched Cannabist, its new retail brand, creating a national dispensary network that leverages proprietary technology platforms. The company offers products spanning flower, edibles, oils, and tablets, and manufactures popular brands including Seed & Strain, Triple Seven, gLeaf, Classix, Plant Sugar, Press, Amber and Platinum Label CBD. For more information on Columbia Care, please visit www.col-care.com.\n\nMajor Areas of Responsibility include:\nFollows policies & procedures for the daily operations and fully complies with state medical marijuana regulations.\nMaintains testing and formulating operations by initiating, coordinating and enforcing operational policies and procedures.\nPerforms QA/QC through analytical testing for quality, consistency and efficacy.\nWorks closely with production team on all elements of the testing and formulating process.\nMasters various techniques for marijuana extraction and infusion, including butane extraction.\nDevelops expertise in testing and formulating methods as well as the purification, separation and isolation of various compounds of cannabis.\nResponsible for inventory, recordkeeping and quality of product at all times, maintaining inventory via seed to sale tracking.\n\nMinimum Qualifications (Skills, Knowledge & Abilities):\nAll applicants must be at least 21 years of age.\nBachelor’s degree preferably in chemistry or similar field.\n1-4 years of experience in related position with an emphasis in an operations production/manufacturing environment.\nExperience must include hands-on responsibility for the full scope production activities, both operations and analysis.\nExperience with analytical testing required and HPLC- specific experience preferred.\nExperience in various cannabis testing or formulation methods preferred.\n\nTravel %: 0-10\n\nFLSA status: Non-exempt\n\nAdditional Abilities Required:\nThe job requires physical activity, including prolonged standing, repetitive bending, climbing, and lifting or moving up to 10 pounds (or more with a coworker). Good visual acuity, hand-eye coordination, manual dexterity, and ability to perform repetitive motions with accuracy is required. The noise level in the work environment is usually moderate.\nNote: Nothing in this job description restricts the company’s right to assign or reassign duties and responsibilities to this position at any time. Reasonable accommodations may be made in appropriate circumstances to enable individuals to perform the essential functions of the position.",
    "slug": "extraction-technician-5fbfd88b-3766-4e0c-b41e-34b5bb60e61c",
    "benefits": [],
    "selectedSkills": [
      "Manufacturing",
      "High-performance liquid chromatography",
      "Bachelor's degree",
      "21 years or older"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=y1DH5acSz9zO7i-bRmlqOEsu05_O7x4tYmpjy4w9hViaZEkbbMZggA"
  },
  {
    "position": "Food Scientist",
    "labName": "Curaleaf",
    "location": "Newton, MA",
    "age": "6 days ago",
    "salaryMin": "$52,000 ",
    "salaryMax": " $75,000 a year",
    "jobDescriptionCopy": "Curaleaf Holdings, Inc. (CSE: CURA) (OTCQX: CURLF) (\"Curaleaf\") is a leading international provider of consumer products in cannabis, with a mission to improve lives by providing clarity around cannabis and confidence around consumption. As a high-growth cannabis company known for quality, expertise, and reliability, the company and its brands, including Curaleaf and Select provide industry-leading service, product selection, and accessibility across the medical and adult-use markets. In the United States, Curaleaf currently operates in 23 states with 123 dispensaries, 25 cultivation sites, and over 30 processing sites, and employs over 5,000 team members. Curaleaf International is the leading vertically integrated cannabis company in Europe with a unique supply and distribution network throughout the European market, bringing together pioneering science and research with cutting-edge cultivation, extraction, and production. Home | Curaleaf | Cannabis with Confidence\n\nOur corporate social responsibility is Rooted In Good Diversity, Equity, Inclusion + Social Equity + Sustainability Social Responsibility | Curaleaf | Cannabis with Confidence We believe in taking corporate and social responsibility very seriously, from our educational outreach to national partnerships, state-wide initiatives and local causes. Giving back to the communities where we operate is important to us, and helps to change old attitudes by showing the positive impact of cannabis in creating jobs, changing lives, and helping local communities.\n\nWe educate. We advocate. We give.\n\nWe are looking for an innovative Food Scientist to provide technical expertise, and to assist with the development and review of formulations for current and future products. Curaleaf's Food Scientist will collaborate with project teams to create new products from conceptualization to commercialization. The Food Scientist will unleash brand potential, and evolve and improve nutritional quality, flavor and texture of food products. The Food Scientist will assist the company to stay on the forefront of new developments and product innovations.\n\nTo be successful in this role, you should interpret and apply scientific findings to food, know how to translate findings into innovative products, and understand how to translate business objectives into clear project goals. Top candidates will be team players and be passionate about product development.\n\nResponsibilities\n\nResearching new cost-reducing manufacturing processes that meet customer and regulatory requirements\nCommunicating with relevant parties regarding food quality and safety concerns\nUtilizing formulation software to create and update formulations\nWorking on new products from conceptualization to launch\nArranging and shipping sales samples\nUpdating product information sheets for sales preparation and updated labels\nRecording, analyzing and summarizing research data\nCoordinating independent laboratory testing\nUpdating and maintaining MRP system\nAdhering to GMP and other safety regulations\nPerforming other duties assigned by supervisor\n\nMUST have Experience with colloids and emulsions ideally in the development of beverage and or gummies to be considered for this role\n\nRequirements\n\nBachelor's degree in Agricultural Science, Biology, Chemistry or a related field\nAbility to use internal and external sources to make technical scientific advances\nProven ability of working in a laboratory\nExperience with confectionary and/or beverage experience\nKnowledge and understanding of data science\nExcellent verbal and written communication skills\nWillingness to travel, and support needs of special projects\n\nCuraleaf is an equal opportunity employer\n\nCuraleaf is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.",
    "slug": "food-scientist-8d6e221a-7de0-4b09-8da4-7b1dd082f846",
    "benefits": [],
    "selectedSkills": [
      "Laboratory experience",
      "Communication skills",
      "MRP",
      "Bachelor's degree"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=f7X-k9ScnYlnGt5WX9zXfQVpvjOhjVT4-GWkgMJbqT7QUsJbDMetxQ"
  },
  {
    "position": "Lab Processing Technician",
    "labName": "Curaleaf",
    "location": "Johnstown, OH",
    "age": "6 days ago",
    "salaryMin": "$34,000 ",
    "salaryMax": " $45,000 a year",
    "jobDescriptionCopy": "Curaleaf Holdings, Inc. (CSE: CURA) (OTCQX: CURLF) (\"Curaleaf\") is a leading international provider of consumer products in cannabis, with a mission to improve lives by providing clarity around cannabis and confidence around consumption. As a high-growth cannabis company known for quality, expertise, and reliability, the company and its brands, including Curaleaf and Select provide industry-leading service, product selection, and accessibility across the medical and adult-use markets. In the United States, Curaleaf currently operates in 23 states with 123 dispensaries, 25 cultivation sites, and over 30 processing sites, and employs over 5,000 team members. Curaleaf International is the leading vertically integrated cannabis company in Europe with a unique supply and distribution network throughout the European market, bringing together pioneering science and research with cutting-edge cultivation, extraction, and production. Home | Curaleaf | Cannabis with Confidence\n\nOur corporate social responsibility is Rooted In Good Diversity, Equity, Inclusion + Social Equity + Sustainability Social Responsibility | Curaleaf | Cannabis with Confidence We believe in taking corporate and social responsibility very seriously, from our educational outreach to national partnerships, state-wide initiatives and local causes. Giving back to the communities where we operate is important to us, and helps to change old attitudes by showing the positive impact of cannabis in creating jobs, changing lives, and helping local communities.\n\nWe educate. We advocate. We give.\n\nThe Lab (Processing) Technician assists the Lab Manager to ensure high quality product and carries out day-to-day tasks including: testing, prepping, extracting, and packaging. The Lab Technician must monitor and maintain production facility in accordance with the state of Ohio and standards set by the Company.\n\nResponsibilities:\nDevelop and execute validation of analytical systems\nOperate spectrophotometer and viscosity meter for QC\nAssist in production; calculating requirements; assembling and weighing plant material and supplies for super critical CO2 extraction: emptying of extraction vessels.\nOperating highly sophisticated extraction equipment; Processing concentrates and extracts\nCleaning and maintenance of extraction equipment and laboratory facility following current good manufacturing practices (cGMP), and standard operating procedures; complying with legal regulations; monitoring environment\nOperating, maintaining, and making adjustments and repairs to laboratory equipment such as analytical systems, pumps, microscopes, balances, rotary evaporator, centrifuges, and other laboratory equipment\nCreating dilutions, HPLC diagnostics and repair, calibration\nMaintaining inventory records of supplies, materials, and equipment, and preparing requisitions as needed\nStoring supplies and equipment, and keeping laboratory, storerooms and working areas immaculate\nWashing and sterilizing laboratory glassware\nPerforming clerical work related to laboratory activities such as word processing, record keeping, and filing\nAssist in packaging of final products as needed\nAssist in the training of other technicians\nWork with state licensed third party testing lab to ensure QC\nPerforms related duties as assigned\n\nCompliance:\nEnsure processing operation is fully compliant with state and federal regulations\nMaintain analytical and other laboratory waste with registered waste disposal company while following state regulations\nMaintaining material safety data sheets for all department chemicals and products\nAssure that operation adheres to all business and industry license requirements\nMaintaining strict inventory records of all plant materials, chemicals and equipment used in the laboratory and documents production by completing forms, reports, logs and records\n\nJob Qualification Requirements:\nBachelor's Degree preferred/ 1-2 years' experience in a laboratory or manufacturing setting required\nQA/QC Experience with HPLC and GC analysis\nExperience with Agilent equipment using ChemStation\nMust be at least 21 years of age\nMust not have been convicted of any felony offenses pursuant to state statues\nCapacity to work independently and/or with vendors, perform troubleshooting and solve complex problems\nThe qualified individual will possess a keen interest and knowledge of Organic and Inorganic chemistry\n\nJob Skills:\nAbility to calculate figures such as proportions and work with mathematical concepts such as probability. Ability to compute rate, ratio, and percent\nAbility to keep precise, highly detailed, and accurate records of calculations, procedures, and inventory of equipment, chemicals, consumables, and production in both hard and soft copies\nRequired candidate would be a motivated self-starter with willingness to learn and dig into documentation and service manuals\nAbility to follow written instruction and work to update SOP's based on needs and changing industry requirements\nFollow good health and safety practices and precautions applicable to a chemistry laboratory\nCapabilities with computer systems, software, and hardware common to laboratories\nAble to critically analyze, draw conclusions about, and summarize test results in a timely manner\nMust be a highly flexible and motivated team player committed to working in a quality environment\n\nPhysical Requirements:\nMust be able to stand for long periods of time, along with frequent bending\nClose vision (clear vision at 20 inches or less)\nManual dexterity sufficient to reach/handle items, work with fingers\nAbility to lift up to 50 pounds and push up to 100 pounds with assistance\n\nCuraleaf is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.",
    "slug": "lab-processing-technician-2ad4cb3a-ff5d-496e-9e78-8be48223e520",
    "benefits": [],
    "selectedSkills": [
      "Gas chromatography",
      "Laboratory experience",
      "Analysis skills",
      "Manufacturing",
      "QA/QC",
      "Bachelor's degree",
      "21 years or older"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=eTLH3vlziWeFv8OOshOJHXlxHberi36s7hHU1gu4JjQGY0-fguN8xg"
  },
  {
    "position": "Lab Analyst (NJ)",
    "labName": "Green Analytics, LLC",
    "location": "Township of Hamilton, NJ",
    "age": "20 hours ago",
    "type": "Full-time",
    "jobDescriptionCopy": "POSITION SUMMARY: This is an analytical position responsible for advanced laboratory support functions to include calibration, standard preparation, instrument tuning, instrument and equipment maintenance, and analysis of data used for laboratory quality control. Daily work involves the use of various types of machinery, lab equipment and complex computer programs to perform tests, record data or findings and present information.\n\nESSENTIAL DUTIES:\n\nWorks with Department Head to ensure lab efficiencies for prioritization, workflow, and sample preparation, as well as the loading and running of instruments\nIdentifies opportunities for improvement; works with Department Head to implement new and improved methods and processes\nAssists with the upkeep and improvement of the quality management system to include Standard Operating Procedures (SOP’s) and the employee training programs\nPrepares calibrations and verifies quality controls for laboratory instruments and methods; uses data to recognize and/or correct possible processing or instrument errors\nAcquires and analyzes data used to perform and report analytical laboratory testing of cannabis products\nAssists with the validation of test methods and with Research and Development (R&D) related activities\nImports data into LIMS and Seed-to-Sale systems; provides for the documentation and tracking of Continuing Calibration Verification (CCV) Standards for Quality Assurance\nPrepares reports related to cannabinoid potency, terpene potency, residual solvents, heavy metals, pesticides, microbiologic organisms, water activity and mycotoxins\nSubmits data reports and Certificates of Analysis for Department Head approval\nProvides guidance and support for all duties commonly assigned to Field Samplers and Lab Technicians\nMay also be called upon to perform the same or similar duties at other laboratory facilities, and for other job-related duties as assigned\n\nPOSITION REQUIREMENTS:\n\nGeneral Knowledge/Abilities\n\nAbility to fluently speak and read the English language along with understanding and following both written and verbal direction\nAbility to function independently, have personal integrity, flexibility and the ability to work effectively with fellow employees\nAnalytical and numerical skills: ability to perform mathematical calculations in different units of measurement\nAbility to use concepts such as fractions, percentages, and ratios; demonstrated abilities in troubleshooting and problem-solving\nBasic knowledge of modern office practices and use of Microsoft Office Suite for Word and Excel\nExperience in driving tasks and meeting deadlines; accountable for the completion of assigned goals and objectives\nAbility to build relationships to strengthen partnerships with a focus on customer service\nAbility to perform physically demanding work such as moving and lifting equipment, standing for long periods of time, etc.\n\nEducation, Licenses/Certifications\n\nBachelor’s degree in Chemistry or a related field from an accredited college or university\n\nPreferred Experience\n\n3 plus years in experience in service based/customer-facing position\n2 plus years non-academic experience in a real-world analytical laboratory\nRelevant industry related experience in Medical Cannabis is a plus\n\nSUPERVISORY RESPONSIBILITIES: None\n\nJob Type: Full-time\n\nPay: From $25.00 per hour\n\nBenefits:\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\nWeekend availability\n\nCOVID-19 considerations:\nVaccination against COVID-19 is required for ALL employees.\n\nEducation:\n\nBachelor's (Required)\n\nExperience:\n\nLaboratory Experience: 5 years (Preferred)\n\nWork Location: One location",
    "slug": "lab-analyst-nj-c16e4e51-0e57-4273-b7e8-4f8ca6cde14e",
    "benefits": [
      "Dental insurance",
      "Health insurance",
      "Paid time off",
      "401(k)",
      "Vision insurance"
    ],
    "selectedSkills": [
      "Analysis skills",
      "Microsoft Excel",
      "Laboratory experience",
      "Microsoft Office",
      "Microsoft Word",
      "Bachelor's degree",
      "US work authorization"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=RbDDEfRkiOsz3Y6MaCujcktdA6lPFQ5_TpXMH_uqSldDMHyZg5C2TA"
  },
  {
    "position": "Analytical Chemist",
    "labName": "Curaleaf",
    "location": "Winslow, NJ",
    "age": "2 days ago",
    "salaryMin": "$42,000 ",
    "salaryMax": " $60,000 a year",
    "jobDescriptionCopy": "Curaleaf Holdings, Inc. (CSE: CURA) (OTCQX: CURLF) (\"Curaleaf\") is a leading international provider of consumer products in cannabis, with a mission to improve lives by providing clarity around cannabis and confidence around consumption. As a high-growth cannabis company known for quality, expertise, and reliability, the company and its brands, including Curaleaf and Select provide industry-leading service, product selection, and accessibility across the medical and adult-use markets. In the United States, Curaleaf currently operates in 23 states with 123 dispensaries, 25 cultivation sites, and over 30 processing sites, and employs over 5,000 team members. Curaleaf International is the leading vertically integrated cannabis company in Europe with a unique supply and distribution network throughout the European market, bringing together pioneering science and research with cutting-edge cultivation, extraction, and production. Home | Curaleaf | Cannabis with Confidence\n\nOur corporate social responsibility is Rooted In Good Diversity, Equity, Inclusion + Social Equity + Sustainability Social Responsibility | Curaleaf | Cannabis with Confidence We believe in taking corporate and social responsibility very seriously, from our educational outreach to national partnerships, state-wide initiatives and local causes. Giving back to the communities where we operate is important to us, and helps to change old attitudes by showing the positive impact of cannabis in creating jobs, changing lives, and helping local communities.\n\nWe educate. We advocate. We give.\n\nAnalytical Chemist\n\nWe are seeking an Analytical Chemist to join our team. This role requires 2 to 3 years of analytical laboratory experience and a BSc in Chemistry or a related science. Experience with GC, GC/MS, and HPLC is a must. Experience in GC/MS/MS and/or LC/MS/MS a plus. This team member will need to be familiar with, or have the ability to quickly learn, a wide range of analytical and sample prep techniques to ensure we are delivering quality products.\n\nRoles/Responsibilities\n\nProvide analytical support to analytical research team utilizing a variety of analytical equipment including GC, GC/MS, GCQQQ, LC, LC/MS, LCQQQ, ICPMS, and NMP, among other equipment types\nWork independently with project assignments, or collaboratively on group projects/programs.\nConduct chemical and physical laboratory tests on raw materials, in-process goods, and finished products.\nPerform QC sample testing of materials and products\nUtilize pipette and syringe based techniques for liquid measurement\nCalibrate and utilize analytical scales or balances for sample weight or mass determinations\nLogin and retain samples for future evaluations\nFollow sample chain-of-custody protocols\nPrepare reagents and standard solutions\nCompile an inventory and maintain stock of laboratory supplies and chemicals\nMaintain logbook records of testing analyses as well as other records as required\nDiagnose analytical system problems and provide solutions as needed\nPerform routine and non-routine maintenance and repair of instruments and equipment as needed\nPerform system qualification and calibration of required equipment as needed\nAssist in training new laboratory personnel\nClean glassware, refill/replace items/solutions as needed\nPerform basic waste disposal per state regulations\nMaintain Safety Data Sheets for all chemicals and products\nConduct stability tests and studies following approved stability protocols\nAssist in approving and releasing materials from inventory for use in product manufacture and/or clear products for sale\nAssist in the investigation of product complaints, including the recording of all testing information\nProcure R&D requested samples as required\nCompose, review, and edit standard operating procedures\nLearn new procedures and complete training in the operation and use of new equipment as required\nSupport laboratory manufacturing as needed\nPerform other duties as required\n\nJob Qualification Requirements\n\nMust be at least 21 years of age\nSubject to background check per state cannabis regulations\nQA/QC Experience\nAdept with GC and LC operation, including MS applications and hardware\nMust have 2 to 3 years' experience with non-academic analytical chemistry\nBachelor's Degree in Chemistry or related field\n\nRequired Skills and Abilities\n\nEffective verbal and written communication skills\nBasic arithmetic and computer skills\nProficiency in MS Office suite\nUse of personal protective equipment including lab coats, safety goggles, and safety glasses\nAnalytical focus with the ability to collect and interpret chemical data\nStrong organizational skills with the ability to multitask and prioritize competing demands\nAbility to comply with established safety standards for the proper use, safe handling, and disposal of harmful chemicals, substances, and hazardous wastes\nExperience with a variety of analytical software platforms with Agilent Chemstation, Agilent MassHunter, Lab Solutions, & Agilent OpenLab CDS experience a plus\nRegular attendance is required\nMust be able to work in a challenging fast-paced environment while maintaining strong attention to details\nSubject to background check per state cannabis requirements\n\nEducation\n\nBSc in Chemistry or similar\n\nCuraleaf is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.",
    "slug": "analytical-chemist-7355dada-0938-4ce9-ae06-8114acee02f5",
    "benefits": [],
    "selectedSkills": [
      "Gas chromatography",
      "QA/QC",
      "Computer skills",
      "Laboratory experience",
      "Communication skills",
      "Bachelor of Science",
      "Bachelor's degree",
      "21 years or older",
      "Background check"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=aibNRpYVvZwqPMpiiSAHMqzRC05o50hatrf8-HLIwsszKyTmwFO6ww"
  },
  {
    "position": "Lab Supervisor",
    "labName": "Cresco Labs",
    "location": "Indiantown, FL",
    "age": "5 days ago",
    "salaryMin": "$48,000 ",
    "salaryMax": " $65,000 a year",
    "jobDescriptionCopy": "COMPANY OVERVIEW\n\nRecently named one of Entrepreneur magazine's Top 100 Cannabis Leaders, Cresco Labs is one of the largest vertically-integrated multi-state cannabis operators in the United States. Cresco is built to become the most important company in the cannabis industry by combining the most strategic geographic footprint with one of the leading distribution platforms in North America. Employing a consumer-packaged goods (\"CPG\") approach to cannabis, Cresco's house of brands is designed to meet the needs of all consumer segments and includes some of the most recognized and trusted national brands including Cresco, Remedi and Mindy's, a line of edibles created by James Beard Award-winning chef Mindy Segal. Sunnyside*, Cresco's national dispensary brand is a wellness-focused retailer designed to build trust, education and convenience for both existing and new cannabis consumers. Recognizing that the cannabis industry is poised to become one of the leading job creators in the country, Cresco has launched the industry's first national comprehensive Social Equity and Educational Development (SEED) initiative designed to ensure that all members of society have the skills, knowledge and opportunity to work in and own businesses in the cannabis industry.\n\nMISSION STATEMENT\n\nAt Cresco, we aim to lead the nation's cannabis industry with a focus on regulatory compliance, product consistency, and customer satisfaction. Our operations bring legitimacy to the cannabis industry by acting with the highest level of integrity, strictly adhering to regulations, and promoting the clinical efficacy of cannabis. As Cresco grows, we will operate with the same level of professionalism and precision in each new market we move in to.\n\nJOB SUMMARY\n\nCresco Labs seeks a Lab Supervisor to join our growing manufacturing team. Our Lab Supervisor will be responsible for overseeing the production processes and ensuring the safety of manufacturing agents during manufacturing operations; oversight of day-to-day functions of the manufacturing production areas; managing all production agents; ensuring that the production agents are qualified, possess appropriate education, training, and experience; ensuring that all manufacturing agents perform their job duties in such a manner as to provide assurance that the cannabis-infused product has the identity, purity, strength, and composition that is represented on the label; creation of master production formulas for each product and entry into the ADP/POS system; approving products for packaging, labeling, and sale after receiving passing test results from the Department-approved laboratory; and ensuring that all company processes, policies and procedures are followed, and that the manufacturing production goals are met.\n\nCORE JOB DUTIES\n\nResponsible for overseeing the packaging and processing staff, facility schedules, production processes, inventory, and vendor relations.\nServes as a role-model and resource for extraction, packaging, and processing staff concerning products and services, policies and procedures, industry news, and changes in regulations.\nRespond to all agent questions, concerns, or suggestions and takes action when necessary to resolve conflicts.\nResponsible for overseeing the delegation of tasks to packaging and processing agents in order to maintain a compliant and clean facility.\nCoordinate with the upper management team to ensure accurate information and documentation is provided.\nEnsure compliance with all state laws and regulations regarding packaging and processing. Coordinate inventory tracking procedures with the inventory manager.\nMaintain accurate records of all packaging and processing activities including employee records, inventory records, deliveries, and returns in accordance with State laws and regulations and Cresco Labs standards.\nResponsible for the preparation and execution of Cresco Labs medically-infused product line through the measuring, mixing, and processing of product in accordance with the State and standards set by Cresco Labs.\nEnsures consistency and efficacy of product through quality control testing and procedures outlined by Cresco Labs.\n\nREQUIRED EXPERIENCE, EDUCATION AND SKILLS\n\nMinimum of 4-year degree in Biochemistry or related field.\nExperience working for a position regulated by the FDA preferred. Experience managing and working in manufacturing in a regulated facility that produces nutraceutical/pharmaceutical products.\nKnowledge of sanitation requirements for the production of nutraceutical/pharmaceutical products.\nThorough understanding of state and local medical cannabis laws and how they apply to the operations of Cresco Labs.\nExcellent communication skills and attention to detail. Effective time-management and ability to multi-task.\nAbility to work in a fast-paced, changing and challenging environment. Proficiency in windows-based software and point of sale applications a plus.\n\nADDITIONAL REQUIREMENTS\n\nMust be 21 years of age or older to apply\nMust comply with all legal or company regulations for working in the industry\n\nCresco Labs is an Equal Opportunity Employer and all applicants will be considered without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran, or disability status.",
    "slug": "lab-supervisor-24400851-94a3-46e6-a1d0-726162bb8426",
    "benefits": [],
    "selectedSkills": [
      "Communication skills",
      "Manufacturing",
      "Sanitation",
      "Windows",
      "Biochemistry",
      "Bachelor's degree",
      "21 years or older"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=A7TecWmOCmjbDT59vbeqxe4HpyE9yA0i17CjTngqzDirrI-PBmgJ_Q"
  },
  {
    "position": "Analytical Chemist",
    "labName": "Method Testing Laboratories",
    "location": "Tampa, FL",
    "age": "23 hours ago",
    "type": "Full-time",
    "salaryMin": "$18 ",
    "salaryMax": " $33 an hour",
    "jobDescriptionCopy": "Analytical Chemist\n\nSummary: A well-capitalized analytical testing laboratory in the hemp and cannabis industry, is seeking an experienced Analytical Chemist. This position will be located in Tampa, Florida and will report to the Senior Director of Laboratory Operations.\n\nResponsibilities:\n\nSupport all aspects of laboratory test work including receiving of samples, homogenization, extractions, dilutions, etc.\nAnalyze samples consisting of a variety of matrices using traditional laboratory techniques using LC/MS, GC/MS, ICP-MS, PCR, etc.\nData entry, sample intake and sample management using the LIMS and word processing as required.\nMaintain inventory of samples, laboratory supplies, sample storage and disposal, cleaning and other supporting lab processes.\nProperly dispose of chemical and biohazard waste.\nCleaning and maintenance of equipment, laboratory glassware and laboratory facility.\nMaintain, calibrate and troubleshoot laboratory instrumentation.\nLead and participates in training and continuous improvement projects.\nTakes ownership of issues and follows through to resolution.\nLead and participate in laboratory investigations and resolution.\nEnsure customer results are reported quickly and accurately, meeting the laboratory performance metrics.\nFollow all regulatory requirements and established SOPs including safety and health, quality assurance and quality control.\nCompliance with all local and state guidelines requiring chain of custody of controlled substances.\nOther duties as assigned.\n\nQualifications:\n\nApplicants Must complete Culture Index Applicant Survey at https://go.apply.ci/s/N231lm38oc prior to applying.\nMust have a bachelor’s degree in chemistry, biochemistry, or a related field.\nMinimum 2-3 years of relevant industry and laboratory experience in a high production laboratory specialized in fast turnaround times – food safety, clinical, forensic, environmental and cannabis experience preferred.\nInstrument experience required – LCMS, GCMS, HPLC, PCR.\nExcellent computer skills in a Microsoft Windows environment, including Word, Excel and PowerPoint.\nAbility to prioritize tasks and maintain a strong work ethic.\nMust be willing to be subjected to a background check to be approved by the Florida Department of Health.\nExperience in a highly regulated industry with GLP, FDA and ISO 17025 requirements preferred.\nAbility to work in a fast-paced, changing and challenging environment.\nMust have excellent written and verbal communication and customer support skills.\nDemonstrated ability to solve technical problems (e.g., Design of Experiments)\n\nAbout us: We are a well-capitalized analytical testing lab in the cannabis industry. We believe strongly that analytical testing is one of the most important aspects of the cannabis supply chain. Laboratory testing and analytics enable our customer’s success, ensure consumer safety and create trust in our new industry. Our team brings together diverse backgrounds including fortune 100 companies, successful start-ups and best-in-class laboratories. We provide honest, fast, flawless, technology driven and customer focused testing for the cannabis and hemp industries.\n\nWhat We Offer:\n\nCompetitive salary\nBenefits package including health, dental and vision\nPaid time off\n\nJob Type: Full-time\n\nPay: $18.00 - $33.00 per hour\n\nBenefits:\n\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\n\nEducation:\n\nBachelor's (Required)\n\nExperience:\n\nHPLC/ICP/or GC: 1 year (Preferred)\nRegulated Laboratory: 1 year (Required)\nCannabis: 1 year (Preferred)\n\nWork Location: One location",
    "slug": "analytical-chemist-5470325b-24a8-4352-98a9-9f2914cf295d",
    "benefits": [
      "Dental insurance",
      "Health insurance",
      "Paid time off",
      "Vision insurance",
      "Life insurance"
    ],
    "selectedSkills": [
      "Microsoft Excel",
      "Windows",
      "Computer skills",
      "GLP",
      "High-performance liquid chromatography",
      "Bachelor's degree",
      "Background check"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=G-jnGXJ2LlH4sWxhaugZs5VFkRaIjelBJycnPrE_vOYqWMHtpBRzTw"
  },
  {
    "position": "Analytical Chemist I",
    "labName": "Kaycha Labs",
    "location": "Natick, MA",
    "age": "6 days ago",
    "type": "Full-time",
    "salaryMin": "$40,000 ",
    "salaryMax": " $53,000 a year",
    "jobDescriptionCopy": "Company Overview:\n\nKaycha Group, LLC is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\nJob Purpose:\n\nThe Lab Analyst, Level I will be responsible for performing, documenting, record checking, and basic troubleshooting of qualitative and quantitative assays on samples using techniques that vary from the use of standard laboratory equipment to highly modern and automated instrumentation.\n\nEssential Duties & Responsibilities:\n\nAnalyze samples consisting of a variety of matrices using traditional laboratory technologies including, but not limited to, HPLC, GC/MS, LC/MS, and ICP/MS.\nPrepare samples for analysis while displaying good laboratory technique to avoid cross-contamination or misidentified samples.\nAccurately prepare calibration curves and quality control samples.\nInterpret and evaluate data in terms of accuracy, precision, trends, and quality control requirements.\nMaintain laboratory equipment by cleaning, and otherwise ensuring ongoing proper working order. Report equipment issues to supervisor\nCollaborate with the laboratory team to meet reporting deadlines.\nAble to perform method validations, or verifications as needed.\nManage inventory supplies and alert supervisor in advance when materials must be ordered\nMay participate in root cause analysis for quality assurance.\nAssist with training incoming analysts and technicians on methodology.\nParticipate in the development or updating of departmental SOP’s.\nOther duties and special projects as assigned.\n\nEducation & Experience:\n\nMinimum BS/BA in Chemistry, Biology, Physics, Engineering or Environmental Sciences required or based on state requirements.\nKnowledge of principles, terminology, practices, techniques, and instrumentation commonly used in a laboratory setting required.\nAt least 1 year of laboratory experience.\nDemonstrated proficiency in at least one analytical instrument preferred.\nFood science and/or environmental experience is a plus.\nExposure to the cannabis industry is a plus.\n\nSkills, Abilities and Competencies:\n\nBasic understanding of standard laboratory protocol.\nMaintain high productivity, keen attention to detail, and consistent multi-tasking while yielding a low testing error rate.\nStrong agility, engagement, and flexibility in an ever-changing environment.\nDiligent commitment to logging, organizing, and analyzing data.\nExcellent communication skills and ability to effectively work, problem solve, and communicate with multiple levels of the organization.\nPromote a strong customer service culture while adhering to the highest safety and industry standards, including those that are outlined by the state regulatory body.\n\nOther:\n\nMust pass the required background check.\nMust be at least 21 years old.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.\n\nEssential Functions:\n\nThe physical demands described here are representative of those that an employee must meet to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nWhile performing the duties of this job the employee is frequently required to stand, handle or feel, to speak, and to hear. The employee is occasionally required to walk, sit, reach with hands and arms, bend, kneel, crouch, or crawl. The employee must frequently lift and/or move up to thirty-five (35) pounds.\n\nSpecific vision abilities required for this job include close (proximity) vision, depth perception, and the ability to adjust focus.\n\nWork Environment:\n\nThe work environment described here is representative of that which an employee may encounter while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nThe standard analytical laboratory environment is one in which potential health hazards do exist. Administrative, operations, technical, and professional staff are expected to safely operate in accordance with applicable and appropriate health and safety policies and procedures, as prescribed by the applicable Kaycha manuals and policies and/or federal, state, or local standards.\n\nLaboratory staff can be expected to work in areas where hazards associated are with, but not limited to, airborne pathogens. Biological materials, hazardous substances, and radioactive material exist and are handled. Appropriate training is provided regarding these hazards and staff are expected to adhere to all health and safety policies at all times, whether they are in writing or verbalized by a supervisor.\n\nThe above is intended to describe the general content of and requirements for the performance of this job. It is not to be construed as an exhaustive statement of duties, responsibilities, or physical requirements. Nothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions\n\nJob Type: Full-time\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nEmployee discount\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nReferral program\nVision insurance\n\nSchedule:\n\n8 hour shift\nMonday to Friday\nWeekend availability\n\nApplication Question(s):\n\nBest email and phone number to reach you?\nAre you open to working weekends and/or evenings when needed?\nWhat is your desired compensation?\n\nEducation:\n\nBachelor's (Required)\n\nExperience:\n\nGCMS: 1 year (Required)\nCannabis testing industry: 1 year (Preferred)\nLCMS: 1 year (Preferred)\n\nWork Location: One location",
    "slug": "analytical-chemist-i-aff066b1-79f8-4c04-9a25-f2aa1a7c0e8b",
    "benefits": [
      "Health savings account",
      "Dental insurance",
      "Employee discount",
      "Health insurance",
      "Referral program"
    ],
    "selectedSkills": [
      "Laboratory experience",
      "Communication skills",
      "Root cause analysis",
      "Bachelor of Science",
      "Bachelor's degree",
      "21 years or older",
      "US work authorization",
      "Background check"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=5jGgshTaOVbdnWsv2O1zjmvoHMpnLtpwV2qb2NqCgz5hA2GLe8mzLQ"
  },
  {
    "position": "LI entry level Chemistry Technician for Food/BioScience Testing Lab",
    "labName": "Deibel Laboratories",
    "location": "Lincolnwood, IL",
    "age": "1 day ago",
    "type": "Full-time",
    "salaryMin": "$16 ",
    "salaryMax": " $18 an hour",
    "jobDescriptionCopy": "Deibel Labs is a private food and cannabis testing facility providing services in both food Microbiology and Chemistry testing. We play an integral role in food and product safety for industry-leading producers, as well as family run operations much like our own. Our location in Lincolnwood, LI is currently looking to hire a full-time Chemistry Technician (40 hours/week and benefits included). We offer a competitive salary based upon knowledge and experience. Deibel pays 100% of health insurance premiums for employee and 50% for dependence. Deibel also offers a self-funded dental plan, vision plan, and 401K option along with profit sharing. Please submit a resume for consideration.\nCheck out our website at www.DeibelLabs.com.\nCompensation: Starting hourly rates at $16 - $18/hr plus competitive benefits package.\nSchedule Offered:\nSunday - Thursday, Tuesday - Saturday, Monday - Friday(with rotating weekends) 9am to 5pm\nJob Description\nResponsibilities\n\nReagent login, makeup, storage, and disposal.\nChemistry Proximate testing which will include liquid-liquid extractions, dilutions, titrations, proper use of a balance.\nAssist in sample preparation, data analysis and paperwork for various instrumental methods used for Protein Leco, spectrometer, HPLC, GC etc.\nGeneral laboratory maintenance and house keeping.\n\nQualifications\nRequirements for Applicant:\n\nHigh School Diploma\n0-1 Years Experience.\nMust be able to stand and work efficiently in a fast paced environment.\nMust be highly motivated, detail oriented, critical thinker with good math skills.\nMust be able to lift 10lbs with each hand and pick up to 50lbs.\nMust be willing to learn Good Documentation Practices.\nMust work occasional holidays.\nMust be willing to have a flexible schedule for days that require overtime.\nMust also live within 40 miles of Lincolnwood IL. No relocation packages available.\nPrior experience working in a fast paced environment\n\nJob Type: Full-time\n\nPay: $16.00 - $18.00 per hour",
    "slug": "li-entry-level-chemistry-technician-for-foodbioscience-testing-lab-2f8f6b0d-2e6e-4dc6-bba7-db32e8c9ef4e",
    "benefits": [
      "Health insurance",
      "401(k)",
      "Vision insurance",
      "Profit sharing"
    ],
    "selectedSkills": ["Math", "Spectrometer", "High school diploma or GED"],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=zgD57F0NR6il8Jf01Lpod58uRxROMarFcLppg_ung-fPGc2WZO7A6Q"
  },
  {
    "position": "Processing Lab Supervisor",
    "labName": "Curaleaf",
    "location": "Homestead, FL",
    "age": "4 days ago",
    "salaryMin": "$55,000 ",
    "salaryMax": " $80,000 a year",
    "jobDescriptionCopy": "Curaleaf Holdings, Inc. (CSE: CURA) (OTCQX: CURLF) (\"Curaleaf\") is a leading international provider of consumer products in cannabis, with a mission to improve lives by providing clarity around cannabis and confidence around consumption. As a high-growth cannabis company known for quality, expertise, and reliability, the company and its brands, including Curaleaf and Select provide industry-leading service, product selection, and accessibility across the medical and adult-use markets. In the United States, Curaleaf currently operates in 23 states with 123 dispensaries, 25 cultivation sites, and over 30 processing sites, and employs over 5,000 team members. Curaleaf International is the leading vertically integrated cannabis company in Europe with a unique supply and distribution network throughout the European market, bringing together pioneering science and research with cutting-edge cultivation, extraction, and production. Home | Curaleaf | Cannabis with Confidence\n\nOur corporate social responsibility is Rooted In Good Diversity, Equity, Inclusion + Social Equity + Sustainability Social Responsibility | Curaleaf | Cannabis with Confidence We believe in taking corporate and social responsibility very seriously, from our educational outreach to national partnerships, state-wide initiatives and local causes. Giving back to the communities where we operate is important to us, and helps to change old attitudes by showing the positive impact of cannabis in creating jobs, changing lives, and helping local communities.\n\nWe educate. We advocate. We give.\n\nProcessing Lab Supervisor Job Description:\nResponsibilities:\nOversees production by creating and reviewing production schedule; studying and clarifying specifications; calculating requirements; assembling and weighing plant materials and supplies for extraction\nQA/QC duties that require analytical testing for quality and consistency, data review\nOperating highly sophisticated extraction equipment; Processing concentrates and extracts\nCleaning and maintenance of extraction equipment and laboratory facility following current good manufacturing practices (cGMP), good documentation practices (GDP), and standard operating procedures; complying with legal regulations; monitoring environment\nOperating, maintaining, and making adjustments and repairs to laboratory equipment such as distillation systems, Rotovaps, balances, centrifuges, and other laboratory equipment\nMaintaining inventory records of supplies, materials, and equipment\nMaintaining STS system for Lab production\nStoring supplies and equipment, disposal of waste according to guidelines, and keeping laboratory, storerooms and working areas immaculate\nWashing and sterilizing laboratory glassware\nCreation of SOPs, training records, and related documentation\nMaintaining material safety data sheets for all department chemicals and products\nMaintaining highest level of compliance to ensure processing operation is fully compliant with state regulations, federal and state laws\nAssures that operation adheres to all business and industry license requirements-able to produce documents as proof immediately upon request\nAssures all safety requirements are adhered to\n\nSkills:\nKnowledge of and hands on experience with Super Critical CO2 Extraction, Rotary Evaporation and Wiped Film Distillation\nAble to oversee analysis on HPLC instrumentation\nAble to implement Food Quality Safe (SQF) standard procedures\nAble to process samples by collection, extraction, preparing for analysis, and quantifying results.\nScientific laboratory procedures and techniques as used in a chemistry laboratory\nScientific laboratory equipment and apparatus\nScientific methods of measurements\nHealth and safety practices and precautions applicable to a chemistry laboratory\nProper and safe handling and disposal of harmful chemicals, substances, and hazardous wastes\nCapabilities with computer systems, software, and hardware common to laboratories\nRecord keeping procedures\n\nPhysical Requirements:\nMust be able to perform repetitive techniques accurately and consistently\nMust be able to stand for long periods of time, along with frequent bending\nClose vision (clear vision at 20 inches or less)\nManual dexterity sufficient to reach/handle items, work with fingers\nAbility to lift up to 50 pounds and push up to 100 pounds with assistance\n\nRequirements:\nBS/BA Degree or greater with at least 4 years' experience in a lab or manufacturing setting required\nQA/QC experience with HPLC analysis highly preferred\nPrior experience with GMP in a food production environment and Safe Quality Food (SFQ) Standards\nScientific writing for processes, training, and procedures that require documentation\nMust be at least 21 years of age\nSubject to background check per state cannabis regulations\n\nCuraleaf is an Equal Opportunity Employer\n\nCuraleaf is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.",
    "slug": "processing-lab-supervisor-15989e82-a3f3-4e86-bd67-20c32e8468c0",
    "benefits": [],
    "selectedSkills": [
      "Laboratory experience",
      "Manufacturing",
      "QA/QC",
      "CGMP",
      "High-performance liquid chromatography",
      "Bachelor of Science",
      "Bachelor's degree",
      "Background check",
      "21 years or older"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=1_1anLWsRcnnYTUxEzumwiDY6Dnv2KtSvl-228hQkwvXLMW6Z-R4cg"
  },
  {
    "position": "Laboratory Chemist II",
    "labName": "ACT Laboratories, LLC",
    "location": "Morton, IL",
    "age": "6 days ago",
    "type": "Full-time",
    "salaryMin": "$23 ",
    "salaryMax": " $26 an hour",
    "jobDescriptionCopy": "ACT Laboratories\n\nJob Description\n\nJob Title: Laboratory Chemist II\n\nReports To: Laboratory Manager\n\nDate: April 12, 2022\n\nJob Summary:\n\nUnder technical supervision, conduct qualitative and quantitative chemical and/or microbiological analyses\n\nEssential Duties and Responsibilities:\n\nPerform sample testing following documented procedures in order to analyze organic or inorganic compounds to determine chemical or physical properties, composition, structure, relationships or reactions using chromatography, spectroscopy or spectrophotometry techniques\nPerform microbiological sample testing following documented procedures to determine presence/absence of bacteria, or other microorganisms\nConduct quality control tests\nMaintain laboratory instruments to ensure proper working order\nPrepare test solutions, compounds or reagents for conducting tests\nMake interpretations of data from microbiological plates\nPerform review of data entered into Laboratory Information Management System\nFollow laboratory safety procedures to ensure compliance with standards or to suggest improvements as needed\nConfer with others to interpret test results\nEstablish and maintain productive working relationships with people inside the laboratory and people outside the laboratory including customers, regulatory staff and corporate staff\n\nSupervisory Responsibilities:\n\nNone\n\nAdditional Responsibilities:\n\nWork with Technical Services to improve current methods\nPerform other duties as may be assigned\n\nQualifications:\n\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skills, and/or abilities required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nEducation and/or Experience:\n\nBachelor's degree in Chemistry, Biology or related science required\nMinimum 3-5 years work-related analytical chemistry experience required\nExperience with HPLC-UV, HS-GC-FID, ICP-MS preferred\nGMP/FDA experience preferred\n\nKnowledge, Skills and Abilities Required:\n\nKnowledge of elementary principles of microbiology and chemistry\nKnowledge of basic clinical laboratory skills\nAbility to operate laboratory equipment\nAbility to use computers and computer software programs and systems and standard office equipment such as phones, photocopiers and fax machines\nGood written and verbal communication skills to convey and receive information effectively (face-to-face, telephone and electronic)\nGood analytical and judgment skills\nDetail-oriented\nAbility to maintain confidentiality regarding test results\nExcellent organizational skills to work independently, prioritize, handle multiple tasks, manage time\n\nCertifications, Licenses, Registrations:\n\nNone\n\nSafety Sensitive Position:\n\nEquipment or vehicles used and activities performed by this position that could cause serious injury or death to the operator, other employees and/or other individuals if not used properly or safely:\n\nWorking with testing equipment with hot surfaces\nHandling chemicals including acids and solvents used in the testing process\n\nPhysical Demands:\n\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nProlonged periods of sitting at a desk and working on a computer, walking/moving around and standing, talking and hearing and using hands to handle, control or feel objects, tools or controls\nOccasional periods of stooping/bending\nLifting up to 25 pounds regularly\nClose vision and ability to focus on computer screens and documents; depth perception; color vision\n\nWork Environment:\n\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. The employee works in a laboratory environment.\n\nWhile performing work-related duties the employee occasionally works with hazardous, toxic or caustic chemicals such as acids and solvents, works around fumes or airborne particles from laboratory chemicals used/fume hoods works with or near moving mechanical parts from laboratory equipment and works with equipment that vibrates. The noise level in the work environment is usually moderate.\n\nStressful Conditions in the Work Environment Affecting This Position:\n\nChallenging work demands including heavy workload/work quantity or quality demands, time demands, conflicting/multiple deadlines or tasks and interpreting data\n\nWork Schedule:\n\n40-hour minimum workweek\nMay require on-call duty and the ability to work outside of scheduled work hours including weekends and holidays when the need arise\n\nJob Type: Full-time\n\nPay: $23.00 - $26.00 per hour\n\nBenefits:\n\n401(k)\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nReferral program\nVision insurance\n\nSchedule:\n\n8 hour shift\nMonday to Friday\n\nAbility to commute/relocate:\n\nMorton, IL 61550: Reliably commute or planning to relocate before starting work (Preferred)\n\nEducation:\n\nBachelor's (Required)\n\nExperience:\n\nLaboratory experience: 2 years (Preferred)\nCannabis: 1 year (Preferred)\nSupervisory: 1 year (Preferred)\n\nWork Location: One location",
    "slug": "laboratory-chemist-ii-482d0253-e2ea-4fdc-9e85-d3300ff4595b",
    "benefits": [
      "Dental insurance",
      "Health insurance",
      "Referral program",
      "401(k)",
      "Paid time off"
    ],
    "selectedSkills": [
      "High-performance liquid chromatography",
      "Spectroscopy",
      "Laboratory experience",
      "Communication skills",
      "Microbiology",
      "Bachelor's degree",
      "Master's degree"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=IVxUMMlmclPqh4zLYntLteaBKu87pECp4TtqhGSLoBHBwnsmWw0JLw"
  },
  {
    "position": "Lab Technician",
    "labName": "Kaycha Labs",
    "location": "Natick, MA",
    "age": "8 days ago",
    "type": "Full-time",
    "salaryMin": "$34,000 ",
    "salaryMax": " $44,000 a year",
    "jobDescriptionCopy": "Company Overview:\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\nJob Purpose:\n\nThe Lab Technician is responsible for working closely with our laboratory team to develop analytical skills and related experience. This position consists of many aspects from homogenizing, weighing and extracting samples, performing quality control checks, verifying various support equipment and properly disposing of all waste.\n\nThe shift schedule for this position is Tuesday - Saturday, 11am-7pm for weekdays and 8am-4pm on Saturday.\n\nEssential Duties & Responsibilities:\n\nExecute laboratory protocol and procedures under the supervision of the Lab Director.\nRegularly display good laboratory technique to avoid cross-contamination or misidentified samples.\nPerform sample preparation procedures including homogenization, weighing and liquid extraction.\nPerform QC duties as assigned, including LCS and matrix spikes.\nPerform qualitative and quantitative tests, as assigned.\nUtilize the LIMS system to create batches, enter sample prep information and maintain physical and electronic records.\nAdhere to ISO 17025 standards as well as state regulatory requirements.\nPromote a strong customer service culture while adhering to the highest safety and industry standards.\nOther duties and/or special projects as assigned.\n\nSkills, Abilities and Competencies:\n\nAbility to maintain an incredibly high degree of attention to detail and accuracy.\nStrong agility, engagement, and flexibility in an ever-changing environment.\nWorking knowledge of logging, organizing, and analyzing data.\nAbility to work in a dynamic, fast-paced deadline environment while successfully managing multiple tasks.\nStrong knowledge of Microsoft Office, including Excel, PowerPoint, and Word.\nWorking knowledge of standard laboratory protocol.\nExcellent communication skills and ability to effectively work, problem solve, and communicate with multiple levels of the organization.\n\nEducation & Experience:\n\nMinimum of Bachelor’s degree in chemistry, biochemistry or related field based on state requirements.\n0-1 year of lab experience.\nKnowledge of principles, terminology, practices, techniques commonly used in a laboratory setting preferred.\nExposure to the cannabis industry is a plus.\n\nOther:\n\nMust pass Level 2 background check.\nMust be at least 21 years old.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status\n\nJob Type: Full-time\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nFlexible spending account\nHealth insurance\nLife insurance\nPaid time off\nReferral program\nVision insurance\n\nSchedule:\n\n8 hour shift\nDay shift\nWeekend availability\n\nApplication Question(s):\n\nWhat is your desired compensation?\nWhat is the best phone # and email to reach you at?\n\nEducation:\n\nBachelor's (Required)\n\nExperience:\n\nLaboratory Experience: 1 year (Preferred)\n\nWork Location: One location",
    "slug": "lab-technician-be6f5124-dc59-4a53-aeaf-51ced36c139b",
    "benefits": [
      "Dental insurance",
      "Health insurance",
      "Referral program",
      "401(k)",
      "Flexible spending account"
    ],
    "selectedSkills": [
      "Microsoft Excel",
      "Microsoft Powerpoint",
      "Laboratory experience",
      "Communication skills",
      "Microsoft Office",
      "Bachelor's degree",
      "21 years or older",
      "Background check"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=KdzMP4KXhF44r3UfimR5fesnqyg5fqIQ1K2RKgKxXsek7D0wPRyFMQ"
  },
  {
    "position": "Analytical Chemist",
    "labName": "The Higher Commitment",
    "location": "Sacramento, CA",
    "age": "7 days ago",
    "type": "Full-time",
    "salaryMin": "$20 ",
    "salaryMax": " $23 an hour",
    "jobDescriptionCopy": "The Higher Commitment Analytical Laboratory is seeking a qualified candidate for an Analytical Chemist I/II position located in Nevada City, CA. We are a commercial cannabis compliance and R&D laboratory. The Analytical Chemist I/II position is responsible for analyzing samples and reviewing data prior to release for compliance testing.\n\nAnalytical Chemist I/II responsibilities:\n\nIntaking and processing raw samples\nRunning cannabis compliance samples\nDocumenting work performed in laboratory notes, instrument logbooks, and worksheets.\nMaintaining a clean and organized workspace.\nWorking with instrumentation software (knowledge of PerkinElmer software a plus)\nMaintaining assigned laboratory instruments and equipment\nPerforming calibrations and routine maintenance on instrumentation\nPerforming data review and interpreting results\n\nRequired Skills and Experience:\n\nBasic understanding of analytical chemistry and analytical methodologies\nExperience with gas chromatography and mass spectrometry\nAttentive to detail with strong deductive reasoning and problem-solving skills\nAbility to work as part of a team, self-motivating, and a positive attitude\nAbility to learn new techniques, perform multiple tasks simultaneously, keep accurate records, and follow instructions\nAdept at interpretation of GC/MS data\nStrong background with analytical chemistry techniques, methods, and calculations\nComfortable in a fast-paced environment and competent in prioritizing responsibilities to maintain laboratory throughput\nExperience with method development and R&D with a knowledge of cannabis and constituents are a plus\nBachelor’s/Master’s degree in relevant field such as chemistry, biochemistry, biology, or chemical engineering. Experience may be substituted for education.\n0-2 years laboratory experience, preferably in a regulated environment (environmental, pharmaceutical, etc.)\n\nPosition is full-time, Monday-Friday, 9:00am-5:00pm. Candidates currently living within commuting distance of Nevada City, CA are encouraged to apply.\n\nJob Type: Full-time\n\nPay: $20.00 - $23.00 per hour\n\nSchedule:\n\n8 hour shift\n\nAbility to commute/relocate:\n\nNevada City, CA 95959: Reliably commute or planning to relocate before starting work (Required)\n\nWork Location: One location",
    "slug": "analytical-chemist-73fa011c-9ba4-4e40-a4f5-36c82f6879ec",
    "benefits": [],
    "selectedSkills": [
      "Gas chromatography",
      "Laboratory experience",
      "Chromatography",
      "Analytical chemistry",
      "Research & development",
      "Bachelor's degree",
      "Master's degree"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=cPcTN6kQ7iUTdBmx7fxY72VO7ZSnnCHLi9IPpAAKU4e7vNfWCWxNIA"
  },
  {
    "position": "HVAC Technician",
    "labName": "Parallel",
    "location": "Franklin, MA",
    "age": "16 hours ago",
    "type": "Full-time",
    "salaryMin": "$27 ",
    "salaryMax": " $30 an hour",
    "jobDescriptionCopy": "Everyone is welcome here. Each of us is unique, and that’s what makes us amazing. We believe in inclusiveness and celebrating each person’s individuality, because there’s power in bringing people with different points of view and life experiences together. That’s why we provide equal employment opportunities (EEO). All applicants are considered regardless of race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, or sexual orientation.\n\nSo, bring yourself and your best ideas; when we feel safe and comfortable being ourselves, there’s no limit to what we can achieve.\n\nIN A NUTSHELL…\n\nThe Facilities HVAC Tech 2 provides support to the facilities operation during the initial set up phase and ongoing operation thereafter. They provide guidance to ensure the Facilities department is operating best in class.\n\nThis role is with NETA, one of the renowned retail brands under the Parallel umbrella. Parallel is one of the largest multi-state cannabis companies in the world, owning and operating in five markets; Florida (Surterra Wellness), Massachusetts (NETA), Pennsylvania (Goodblend), Nevada (The Apothecary Shoppe) and Texas (Goodblend). If you enjoy companies that are growing, moving fast, and constantly challenging themselves to achieve more, then Parallel is for you. We work hard, lean on each other, and are passionate about a pretty ambitious vision … pioneering a new paradigm of what well-being can be for all people, everywhere. For more information, visit www.liveparallel.com.\n\nWHAT YOU WILL BE DOING:\nRepair and maintain Industrial HVAC, plumbing and mechanical equipment in accordance with diagrams, sketches, operating manuals, manufacturers' specifications or supervisor s instructions, using hand and power tools, precision measuring or testing devices. Responsible for complete maintenance of area of assignment.\nRead blueprints; understand and read computerized HVAC, Electrical, plumbing system and building layouts.\nObserve and adjust a wide variety of equipment, machines and devices in operation to assure proper operation, including pumps, refrigerant recovery, engines, motors, compressors and laboratory equipment.\nDismantle machines and devices for servicing, repair, or replacement of parts.\nObserve Parallel Policies & Procedures for daily operations and fully complies with state medical marijuana regulations at all times.\nPerform preventative maintenance and maintains a scheduled maintenance program to ensure proper facilities upkeep, including all mechanical, electrical and plumbing infrastructure and equipment.\nEffectively using CMMS tracking systems to report receipt of maintenance needs and/or other issues.\nRespond to facility related failures or emergencies promptly and prioritizes work orders, while maintaining preventative tasks in accordance with facility needs.\nPerform routine maintenance tasks, preventative systems and repairs.\nComplete all required documentation for utility and facility management, follows up and evaluates effectiveness of all implemented actions to ensure that problem has been resolved effectively.\nEnsure safe work practices are implemented and consistently followed by department staff.\nWork with other departments in addressing and rectifying potentially unsafe work conditions or practices.\nEnsure compliance with applicable building codes, fire and emergency codes, regulatory and other required regulations.\nResponsive and professional in all response and interactions regarding service requests and facility needs.\nAble to work carefully and efficiently in a fast-paced environment.\nWork in coordination with the Supervisor and Manager to help upgrade all systems and streamline as needed to function in the most efficient and effective manner.\nAfter hours on call availability.\nPerform other job duties and tasks as assigned.\n\nEXPERIENCE AND SKILLS YOU’LL BRING:\nTechnical school graduate or equivalent industrial operations experience (Required).\nHVAC Certification and Refrigeration Recycle Recovery license (Required).\nDemonstrate competency in performing routine maintenance tasks, preventative systems and repairs.\nAbility to read blueprints; ability to understand and read computerized HVAC, Electrical, plumbing system and building layouts.\nMin 7 years of progressively responsible work-related experience and any combination of education and training which provides the required knowledge, skills and abilities to perform the essential functions of the job, combined with demonstrated professional growth and achievement.\nAge 21 or over (Required).\nHigh School Diploma or equivalent (Required).\nValid Government-Issued Photo ID (Required).\n\nYOU WILL BE SUCCESSFUL IF YOU…\nAre self-motivated; micro-managing isn’t fun for anyone.\nRoll your sleeves up and do the work; strategy is important, but so is getting stuff done.\nCan work fast and be flexible; our industry is always changing.\nPlay nice with others; we collaborate with each other a lot.\nThink creatively; sometimes, the “traditional” solution isn’t the best one.\n\nWHAT YOU GET:\nConsistent, reliable benefits; Full medical/vision/dental, 401k with a possible company match, access to company-sponsored well-being programs\nBalance and flexibility; paid time off, paid parental leave, flexible work arrangements.\nFinancial opportunity; an incentive program that provides opportunity to earn cash AND equity in a fast-growing company and industry\nEmployee discount.\nChance to make a difference; Employee Relief Fund, community volunteerism opportunities through Benevity.\n\nPHYSICAL REQUIREMENTS:\nThe person in this position frequently communicates with other employees/customers. Must be able to communicate accurate information in these situations.\nMust be able to travel up to 5%-10% of the time.\nMust be able to move around the production facilities up to 30% of the time.\nMust be able to work in an environment which is noisy and with temperature fluctuations from 60 degrees to 90 degrees.\nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\nConstantly operates a computer and other office productivity machinery.\n\nPARALLEL IS UNITED BY OUR VISION, MISSION, & VALUES:\nOur Vision – why we exist – is to pioneer well-being and improve the quality of life for humanity through the benefits of cannabinoids.\n\nOur Mission – how we will do this – is to build a leading, global well-being company through the best talent, our values, trusted and recognized brands, science and technology-based innovation, and a relentless focus on execution and continuous improvement.\n\nOur Values – Integrity | Collaboration | Alignment | Intentionality | Accountability | Agility\n\nWe are an Equal Opportunity Employer. We embrace and encourage our employees’ differences in age, color, disability, ethnicity, gender identity or expression, language, national origin, physical and mental ability, political affiliation, race, religion, sexual orientation, socioeconomic status, veteran status, and other characteristics that make our employees unique.",
    "slug": "hvac-technician-3136aaa1-bd29-4ef6-a1d5-c9fd897d0105",
    "benefits": [
      "Dental insurance",
      "Employee discount",
      "Health insurance",
      "401(k) matching",
      "Paid time off"
    ],
    "selectedSkills": [
      "Precision measuring instruments",
      "CMMS",
      "EPA Refrigeration Certification",
      "HVAC Certification",
      "HVAC",
      "High school diploma or GED",
      "21 years or older"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=t0ngzMtTr8uhw5sigVp9mnXyjYORGM1VdpE2iMB-ekTEfokq3G7dLQ"
  },
  {
    "position": "Medical Doctor",
    "labName": "Best Medical Card Services LLC",
    "location": "Sarasota, FL",
    "age": "7 days ago",
    "type": "Part-time",
    "salaryMin": "$125 ",
    "salaryMax": " $150 an hour",
    "jobDescriptionCopy": "My Medical Card Services is one of the fastest-growing networks of medical marijuana physicians in Florida. My Medical Card Services prides itself on providing compassionate care to Florida patients through evidence-based application of medical cannabis research.\n\nWe are currently looking for a personable physician to oversee our location in Sarasota. We look forward to entrusting the right candidate with a sizable, already established patient base.\n\n2-3 days per week to start, can grow to 5 or even 6 days per week if the candidate prefers.\n\nIn accordance with state law, all Best Medical Card Services physicians must hold an active, unrestricted license as either an allopathic physician or osteopathic physician and be in compliance with all state-mandated education requirements. At this time, educational requirements include completing an annual course and exam administered by either the Florida Medical Association or Florida Osteopathic Medical Association.\n\nAlso in line with Senate Bill 8A, Best Medical Card Services physicians may not be employed by, or have any direct or indirect economic interest in, any medical marijuana treatment centers or marijuana testing laboratories.\n\nMy Medical Card Services may, at its discretion, provide industry training and/or reimbursement for state-required licensure, fees, and courses.\n\nVery competitive compensation arrangements are available. Please inquire for more information.\n\nJob Type: Part-time\n\nPay: $125.00 - $150.00 per hour\n\nSchedule:\n\nWeekend availability\n\nEducation:\n\nDoctorate (Preferred)\n\nLicense/Certification:\n\nBC/BE (Preferred)\nMedical License (Preferred)\n\nWillingness to travel:\n\n25% (Preferred)\n\nWork Location: One location",
    "slug": "medical-doctor-7e03a764-7b13-4acb-b60c-e2ac19fd5fdb",
    "benefits": [],
    "selectedSkills": [
      "BC/BE",
      "Medical License",
      "Doctoral degree",
      "US work authorization"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=KcZ8xRVNaXqvUN3doEzqTo5g6mZH4BqfErkto4R0JPiWG85NvBNk6w"
  },
  {
    "position": "QA Chemist",
    "labName": "Signature Science, LLC",
    "location": "Austin, TX",
    "age": "5 days ago",
    "type": "Full-time",
    "salaryMin": "$43,000 ",
    "salaryMax": " $60,000 a year",
    "jobDescriptionCopy": "Position Purpose:\nTo provide analytical chemistry and quality assurance support to both internal and external projects. External projects include national and homeland security programs with a focus on CBRNe collection and analysis efforts along with Cannabis proficiency testing programs. This role will include approximately 35% laboratory work, 35% desk work, and ~30% travel.\n\nEssential Duties and Responsibilities:\nPlan and implement chemical analysis proficiency tests for methods such as GC/MS, FTIR, LC-MS/MS, HPLC-UV, and RAMAN; activities include developing of proficiency test plans, performing laboratory pilot testing, preparing and verifying proficiency test samples, and packaging samples for shipment\nPerform laboratory activities related to the preparation and verification of proficiency test samples\nLab work will include creation of standards/spiking mixes, sample creation, sample extraction/dilution, and sample analysis using techniques such as gas chromatograph mass spectrometry (GC/MS), liquid chromatography with tandem mass spectrometry (LC-MS/MS), high performance liquid chromatography - ultraviolet (HPLC-UV), and Fourier transform infrared spectroscopy (FTIR)\nMaintain laboratory equipment and laboratory records\nEvaluate proficiency test data, provide input and review of technical reports, identify data trends and other issues\nLead or assist with the validation and/or verification of new methods\nAssist client laboratories in preparing for external ISO/IEC 17025 accreditation audits and attend the audits as an advocate for the client laboratory.\nProvide feedback and help prepare on auditee corrective actions packets for submission to the accreditation body\nContribute to the development and revision of internal and external quality documents, most of which are based on the ISO/IEC 17025 or ISO/IEC 17043 standards\nProvide ISO/IEC 17025 or training on other quality topics to clients\nPerform internal audits of Signature Science systems and procedures against relevant internal or external standards, including audits of the Signature Science Proficiency Test Program and Analytical Laboratory Program against the requirements of ISO/IEC 17043 and ISO/IEC 17025, respectively\nMay regularly communicate with external laboratory staff to help resolve QA, PT, or other quality-related issues\nMay serve as a task leader on one or more projects\n\nRequired Knowledge, Skills & Abilities:\nAnalytical chemistry skills\nStrong written and verbal communication skills\nProactive, self-starter\nAbility to multitask and ensure accurate and timely submission of project deliverables\nKnowledge of GC/MS, LC-MS/MS, HPLC-UV, and/or FTIR techniques preferred\nBasic understanding of ISO/IEC 17025 and/or ISO/IEC 17043 standards preferred\nLaboratory quality assurance experience including auditing and procedure development preferred\nWillingness to obtain the American Society of Quality (ASQ) Certified Quality Auditor (CQA) certification within two years of hire date\n\nEducation/Experience:\nBachelor degree (or higher) in chemistry or related field\n2 - 7 years of experience performing analytical chemistry lab work\nExperience providing quality assurance support to analytical chemistry programs desired\nExperience performing audits desired\nExperience assessing data for trends desired\n\nCertificates and Licenses:\nCertified Quality Auditor (CQA) certification must be obtained within 2 years from date of hire.\n\nClearance:\nCandidate must be able to obtain a Secret level security clearance.\n\nSupervisory Responsibilities:\nN/A\n\nWorking Conditions/ Equipment:\nAbility to work in varying conditions to include:\nTraditional office environments with sedentary extended periods required for voluminous data analysis via office automation (combination of onsite and remote work);\nClimate controlled laboratory environments requiring extended periods of standing when performing laboratory analyses, or during audits and SOP observation;\nMobile laboratories, subject to wide ranges of temperature and humidity requiring extended periods of standing, stooping or kneeling in confined spaces;\nConference rooms, classrooms, or theaters that involve extended periods of standing for training delivery or command briefings; and\nOutdoors in various weather and lighting conditions including heat, humidity, cold, snow, bright sun, and dark night.\nExposure to various chemical and biological materials associated with an analytical lab or facility.\nAbility to wear required personal protective equipment (PPE) including gloves, coats or gowns, shoe cover, tyvek coveralls, safety glasses, respirators, and/or PAPRs.\nSubject to medical monitoring based on lab functions.\nCandidate must be willing to travel up to 50% of the time.\n\nThe above job description is not intended to be an all-inclusive list of duties and standards of the position. Incumbents will follow any other instructions, and perform any other related duties, as assigned by their supervisor.",
    "slug": "qa-chemist-fa92e7e6-fc7d-41af-ba4f-de2bc67153c3",
    "benefits": [],
    "selectedSkills": [
      "Gas chromatography",
      "Analysis skills",
      "High-performance liquid chromatography",
      "Patient monitoring",
      "Spectroscopy",
      "Bachelor's degree"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=c9mHfNgGFVwpeyemJlnzo3Hxpo7rrG2hpwqKZub0hSGaZfZi7NrklA"
  }
]
