[
  {
    "position": "Lab Testing Coordinator",
    "labName": "Solar Therapeutics",
    "location": "Somerset, MA",
    "age": "3 hours ago",
    "type": "Full-time",
    "salaryMin": "$30,000 ",
    "salaryMax": " $44,000 a year",
    "jobDescriptionCopy": "About Us\n\nSolar Cannabis Co. is committed to implementing sustainable and innovative practices to cultivate a better future in Cannabis. Our vision is to set the standard for sustainability in the Cannabis industry.\n\nOur vertically integrated facility in Somerset, MA houses our cultivation operation, product manufacturing, and recreational retail dispensary. Our Seekonk retail location opened in December 2021 and our Dartmouth retail site is expected to open in 2022!\n\nWe offer a competitive salary & benefits package and strive to develop our employees to reach their personal goals within the cannabis industry.\n\nLocations\n\nSomerset (Fully Vertical)\n\nSeekonk (Dispensary - Retail only)\n\nDartmouth (COMING SOON)\n\nThe Position:\nWe are seeking an experienced Lab Testing Coordinator to join our team. In this exciting, newly created role, you will work heavily across multiple departments to coordinate lab samples, testing schedules, and maintain tracking manifests for laboratory transports.\n\nResponsibilities:\nWork across multiple departments to coordinate lab sample production schedule\nBuild and maintain tracking manifest for labs transport\nSchedule and oversee all lab logistics to/from state-certified testing laboratories\nMaintain relationships with key contacts at state-certified testing laboratories\nAct as main point-of-contact for all lab related internal tracking systems and databases\nCoordinate and schedule lab logistics between cultivation/post-harvest teams, cannabis manufacturing teams and kitchen teams\n\nQualifications:\nMETRC experience (Required)\nExcellent written and verbal communication skills\nIntermediate knowledge of Microsoft and Google suites\nStrong organizational and mathematical skills\nMust be able to meet deadlines in a fast-paced and changing environment.\nA proactive approach to problem-solving skills\nMinimum of 21 years of age.\nPossess valid driver’s license or state ID.\nMust pass all required background checks.\nAbility to work nights, holidays and weekends.\nMust be and remain compliant with any and all legal or company regulations for working in the industry.\nOccasionally moves up to 30+ pounds of equipment/materials/product within rooms (100 pounds with assistance).\nThis job function may include being in a stationary position or moving for extended periods of time.\n\nBenefits:\nMedical Insurance\nDental Insurance\nVision Insurance\nEmployee Discount\nPaid Time Off\n401(k) plan\n\nSolar Therapeutics is an Equal Opportunity Employer committed to building a diverse workforce as it values the knowledge, diversity and performance of our employees to make us a great company. Solar Therapeutics is an Equal Opportunity Employer and all applicants will be considered without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran, or disability status. Solar Therapeutics agrees to hire individuals with Cannabis-related CORI offenses.",
    "slug": "lab-testing-coordinator-0801a4ef-b405-4530-b35c-719f7a447509",
    "benefits": [
      "Dental insurance",
      "Employee discount",
      "Health insurance",
      "Paid time off",
      "401(k)"
    ],
    "selectedSkills": [
      "Manufacturing",
      "Driver's License",
      "Laboratory experience",
      "Communication skills",
      "Math",
      "21 years or older"
    ],
    "jobType": "free",
    "applyURL": "https://secure2.entertimeonline.com/ta/SolarTherapeutics.careers?ShowJob=453136640"
  },
  {
    "position": "Environmental Laboratory Technician I",
    "labName": "Montrose Environmental Group, Inc.",
    "location": "Durham, NC",
    "age": "1 day ago",
    "type": "Full-time",
    "jobDescriptionCopy": "ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Durham, NC facility is currently seeking a Full-Time Technician I.\n\nAs a key member of the laboratory team, this role will be responsible for a full range of activities including:\n\nRole and Responsibilities\n\nPreparation of samples for analysis\nPreparation of reagents for lab use and/or shipment\nSample extractions\nDetermining the volume of samples\nCleaning of laboratory glassware\nMaintaining clean laboratory areas\nMaintaining organized records of sample preparation and analysis\nOverhead projects designed to improve efficiency of, or accuracy of analyses\nAssisting the Group Leaders and analysts in acquiring and inventorying consumables, chemicals, and parts for instrumentation\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Lab Director\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nHigh school diploma or general education degree (GED) required, associate's or Bachelor's degree in a scientific field preferred\nA Tech I has shown that they understand the physical and chemical principles underlying why procedures are specified the way they were for each method with which they work.\nTheir documentation, timeliness, and throughput must meet the standard of the laboratory.\n\nPreferred Skills\n\nPrior Laboratory experience required\nKnowledge general lab practices and lab safety\nAbility to work independently and in a team\nGood organizational skills and strong communication skills\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.",
    "slug": "environmental-laboratory-technician-i-bb28ea5f-52ec-4dc7-9449-b55ebdb64195",
    "benefits": [
      "401(k)",
      "Disability insurance",
      "Parental leave",
      "Tuition reimbursement"
    ],
    "selectedSkills": [
      "Laboratory experience",
      "Communication skills",
      "Organizational skills",
      "Bachelor's degree",
      "High school diploma or GED",
      "Associate's degree"
    ],
    "jobType": "free",
    "applyURL": "https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-NC-Durham-Capitola-Drive/Environmental-Laboratory-Technician-I_R2060?mode=job&iis=Job+Board&iisn=Indeed.com"
  },
  {
    "position": "Lab Assistant",
    "labName": "Solar Therapeutics",
    "location": "Somerset, MA",
    "age": "3 hours ago",
    "type": "Full-time",
    "salaryMin": "$36,000 ",
    "salaryMax": " $49,000 a year",
    "jobDescriptionCopy": "About Us\n\nMassachusetts based Solar Therapeutics is New England’s leading producer of wellness and alternative therapies dedicated to state of the art, fully sustainable cultivation & production of pharmaceutical grade cannabis.\n\nThe company’s experienced management team, dedicated board and passionate investors are driven by a singular mission: to provide industry leading alternative therapies with a sustainable carbon-neutral energy footprint.\n\nThe Position\n\nWe are seeking individuals to join our laboratory team here at Solar Therapeutics. The ideal candidates will be detail oriented, have prior extensive experience working in a laboratory setting, and have the ability to work quickly and efficiently with their hands in a fun, fast paced, regulated environment.\n\n\nMinimum of 21 years of age.\nPossess valid driver’s license or state ID.\nMust pass all required background checks.\nMust be and remain compliant with any and all legal or company regulations for working in the industry.\nMust be able to lift, carry and balance up to 30 pounds (100 pounds with assistance). This job function may include walking or standing for extended periods of time, as well as stooping, bending over and/or crouching.\nKey Responsibilities\n\n\nAssist in production calculating requirements; assembling and weighing plant material and supplies for supercritical CO2 extraction: emptying extraction vessels\nOperate intricate equipment, wipe film distillation and rotary evaporator, in accordance with Solar Therapeutics’ Standard Operating Procedures\nMaintaining inventory records of supplies, materials and equipment, and preparing requisitions as needed.\nWork with state licensed third party testing lab to ensure QC\nMake distillate\nOversee cartridge filling\nClean and help maintain laboratory equipment\nComplete data entry into various marijuana tracking systems including METRC\nStore supplies and equipment, dispose of waste according to guidelines, and keep laboratory working areas sanitary and safe\nReport leaks and faulty equipment to Laboratory Manager\nComplete other duties and tasks as assigned by the Laboratory Manager\nQualifications\n\nBachelor’s degree preferred\nGreat interpersonal/communication skills\nDetail-oriented\nHave genuine and positive energy\nGreat work ethic, reliability, and professionalism\nExcellent listening skills\nCannabis industry experience & knowledge preferred\nExperience working in a laboratory strongly preferred\nKnowledge of METRC a plus\nBenefits\n\nMedical Insurance\nDental Insurance\nVision Insurance\nEmployee Discount\nPaid Time Off\n401(k) plan\n\nSolar Therapeutics is an Equal Opportunity Employer committed to building a diverse workforce as it values the knowledge, diversity and performance of our employees to make us a great company. Solar Therapeutics is an Equal Opportunity Employer and all applicants will be considered without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran, or disability status. Solar Therapeutics agrees to hire individuals with Cannabis-related CORI offenses.",
    "slug": "lab-assistant-6d970919-99a4-4aa2-8e82-e55f46cac067",
    "benefits": [
      "Paid time off",
      "Dental insurance",
      "Employee discount",
      "401(k)",
      "Health insurance"
    ],
    "selectedSkills": [
      "Laboratory experience",
      "Communication skills",
      "Driver's License",
      "Bachelor's degree",
      "21 years or older"
    ],
    "jobType": "free",
    "applyURL": "https://secure2.entertimeonline.com/ta/SolarTherapeutics.careers?ShowJob=453136641"
  },
  {
    "position": "Laboratory Technician I (Semi-Volatile)",
    "labName": "Montrose Environmental Group, Inc.",
    "location": "Richmond, VA",
    "age": "1 day ago",
    "type": "Full-time",
    "jobDescriptionCopy": "ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nA Laboratory Technician I is responsible for performing tasks required to meet the expectations of our clients, in addition to efficiently and profitably generating defensible data in a timely manner. The ideal candidate will have experience in working under possibly hazardous conditions (e.g. pathogens or chemicals). He/She/They will be well-trained to maintain safety conditions and will be passionate for doing work that makes things move forward\n\nAs a key member of the Richmond Laboratory team, this role will be responsible for a full range of activities including:\n\nROLES AND RESPONSIBILITIES\n\nReceives environmental samples into the laboratory according to Enthalpy’s SOPs\nPerforms data entry of sample and test information into Laboratory Information System (LIMS)\nLabel sample containers, store them in appropriate locations and/or contact the proper department to inform them of short holding time and/or rush requests.\nAssists in sample bottle preparation\nAssists in sample management/archiving and disposal\nAssists in sample pickup or field sampling, if needed\nAssists in the coordination of daily field sampling/pickup schedule, if needed\nParticipates in focus teams to improve efficiency\nComply with Enthalpy’s Quality Assurance Program\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nHigh School Diploma or GED. Associate’s degree or equivalent and relevant formal academic/vocational qualifications preferred.\nSome lab experience is preferred but not required.\n\nPREFERRED SKILLS\n\nKnowledge of general lab practices and lab safety\nAble to multi-task and communicate effectively (both oral and written)\nAble to work independently and make sound decisions\nWell organized and have an attention to detail\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air, water and soil measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you will get tons of guidance and plenty of support from talented, super-smart colleagues in tackling head-scratching professional challenges. If this scenario attracts you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.",
    "slug": "laboratory-technician-i-semivolatile-a531fe72-f277-4f22-a35e-e97a27e4fd48",
    "benefits": [
      "401(k)",
      "Disability insurance",
      "Parental leave",
      "Tuition reimbursement"
    ],
    "selectedSkills": [
      "Laboratory experience",
      "High school diploma or GED",
      "Associate's degree"
    ],
    "jobType": "free",
    "applyURL": "https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-VA-Richmond-Reymet-Rd/Laboratory-Technician-I--Semi-Volatile-_R2058?mode=job&iis=Job+Board&iisn=Indeed.com"
  },
  {
    "position": "Analytic Laboratory Technician/Analytic Laboratory Technologist- PB Laboratories",
    "labName": "TriCore Reference Laboratories",
    "location": "Albuquerque, NM",
    "age": "1 day ago",
    "type": "Full-time",
    "salaryMin": "$37,000 ",
    "salaryMax": " $47,000 a year",
    "jobDescriptionCopy": "Job ID #: 12278 City, State: NM - Albuquerque\n\nFunctional Area: Health/Medical Department Name:\nPosition Type: Regular - Full Time Education Required: See Minimum Qualifications\nExperience Required: See Minimum Qualifications Relocation Provided:\n\nJob Summary\n\nWe help New Mexico hemp and cannabis growers produce safe, high-quality products by delivering precise, accurate, and reliable laboratory testing.\n\nPrecision Botanical Laboratories provides regulation-compliant laboratory testing to ensure safety and effectiveness of medical and adult-use cannabis and hemp.\n\nThe successful candidate will perform in one of the following capacities based on education and experience:\n\nANALYTIC LABORATORY TECHNICIAN\n\nJOB SUMMARY:\nUnder direct supervision, provides basic skills in the performance of moderate or high complexity laboratory tests for purpose of determining analytic purity and sterility within the scope of training and experience.\n\nESSENTIAL FUNCTIONS:\n1. Assists with the development and validation of analytical methods to achieve specified quality performance requirements.\n\n2. Performs/results laboratory testing using validated methods and procedures.\n\n3. Operates routine laboratory equipment, instruments, and interfaces.\n\n4. Prepares reagents and solutions following standard laboratory formulas and procedures.\n\n5. Performs and documents routine and periodic maintenance and calibration procedures.\n\n6. Performs routine logging for QC/QA purposes. Collects and compiles QA data as directed.\n\n7. Performs basic troubleshooting, identifies testing problems, and notifies appropriate supervisors for corrective action.\n\n8. Participates in regulatory inspections as appropriate.\n\n9. Assists by taking inventory as needed or appropriate. Orders supplies for the Department as directed.\n\n10. Handles hazardous materials and wastes in accordance with safety procedures and regulations.\n\n11. Serves as a liaison with internal and external customers/employees/clients as appropriate.\n\n-\n\nANALYTIC LABORATORY TECHNOLOGIST\n\nJOB SUMMARY:\nUnder direct supervision, provides basic skills in the performance of high complexity laboratory tests for the purpose of determining analytic purity and sterility within the scope of training and experience.\n\nESSENTIAL FUNCTIONS:\n1. Performs/results laboratory testing using validated methods and procedures.\n\n2. Operates routine laboratory equipment, instruments, and interfaces.\n\n3. Prepares reagents and solutions following standard laboratory formulas and procedures.\n\n4. Performs and documents routine and periodic maintenance and calibration procedures.\n\n5. Performs routine logging for QC/QA purposes. Collects and compiles QA data as directed.\n\n6. Performs basic troubleshooting, identifies testing problems, and notifies appropriate supervisors for corrective action.\n\n7. Participates in regulatory inspections as appropriate.\n\n8. Assists by taking inventory as needed or appropriate. Orders supplies for the Department as directed.\n\n9. Handles hazardous materials and wastes in accordance with safety procedures and regulations.\n\n10. Serves as a liaison with internal and external customers/employees/clients as appropriate.\n\nMinimum Qualifications\n\nANALYTIC LABORATORY TECHNICIAN\n\nMINIMUM EDUCATION:\nAssociate of Science\n\nMINIMUM EXPERIENCE:\nNo experience is required.\n\nPREFERENCES:\nCannabis Technician certification\n\n______________________________________\n\nANALYTIC LABORATORY TECHNOLOGIST\n\nMINIMUM EDUCATION:\n\nBachelor’s degree in a chemical, physical or biological science\nMINIMUM EXPERIENCE:\n\nNo experience is required.\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class.",
    "slug": "analytic-laboratory-techniciananalytic-laboratory-technologist-pb-laboratories-e11405c2-8a00-4325-994c-85bb6fc2f47f",
    "benefits": [],
    "selectedSkills": [
      "Laboratory experience",
      "Bachelor's degree",
      "Associate's degree"
    ],
    "jobType": "free",
    "applyURL": "https://careers.peopleclick.com/careerscp/client_tricore/external/jobDetails.do?functionName=getJobDetail&jobPostId=27166&localeCode=en-us"
  },
  {
    "position": "Dispensary Inventory Supervisor",
    "labName": "deep roots harvest",
    "location": "Las Vegas, NV",
    "age": "2 days ago",
    "salaryMin": "$39,000 a year",
    "jobDescriptionCopy": "Reports to:Retail Store Manager\n\nDepartment:Retail\n\nRequired Permits/Licensing/Registration: Marijuana Establishment Agent Card\n\nFLSA Status:Exempt\n\nSupervisory Responsibilities:\nDispensary Inventory Lead\n\nDispensary Hosts\n\nOverview:\nFollowing policies set forth by the Company in concert with the Retail Manager and Sales, provide support in the general operation of the company through the organization and management of Dispensary inventory to maximize operational efficiency.\n\nEssential Functions:\nSupport the operations of the Retail Department by accurate and efficient management of all merchandise and cannabis product inventories.\n\nFulfill daily obligations to the satisfaction of supervisory staff\n\nThorough communication of any obstacle which limits their capability to see individual duties through to completion\n\nRelay to superiors any conditions observed that may affect the successful completion of that day’s work.\n\nComplete or oversee everyday inventory control responsibilities including but not limited to;\n\nAssignment, generation, and application of required packaging tags\n\nIncoming internal and external product transfers (acceptance upon intake)\n\nTransfer manifest acceptance (upon verification of physical inventory received)\n\nVerification of the receipt of all required transfer specific supporting documentation for all products received including:\n\nIndependent Testing Laboratory Certificates of Analysis\n\nSoil Amendments/Disclosures\n\nAddition of saleable products to POS inventory\n\nPerformance of periodic, monthly, and quarterly inventory reconciliations\n\nAll matters related to compliance of State and Federal regulations.\n\nUtilizes internal and Department of Taxation mandated databases to ensure accuracy of incoming shipments and corresponding manifests/invoices\n\nFulfill assigned responsibilities in line with procedures set forth by all department Standard Operating Procedures and subsequent training\n\nOther duties as assigned\n\nJob Specifications:\nOperate under the guidelines provided by company policies and procedures.\n\nAbility to understand and complete all given directives in a timely manner.\n\nAbility to communicate clearly whether verbally or in writing\n\nBasic understanding of compliance software and job specific information technology\n\nAdherence to all industry standards set forth by Local, State, and Federal regulations.\n\nCapacity to work autonomously to achieve daily directives and department goals.\n\nFlexible work schedule required; to include covering a vacant shift and/or facility issues in emergency situations as needed.\n\nRepresent the company in a professional manner when communicating or interacting with all local community, state, or federal officials.\n\nObserve and maintain all safety procedures and protocols\n\nAdditional Functions:\nAbility to be flexible and work in various sectors of the department or company as needed and/or requested by their direct supervisor.\n\nAbility to listen well and communicate effectively orally and in writing with various audiences.\n\nAbility to use initiative and independent judgment appropriately.\n\nAbility to apply appropriate public relations skills in various situations and circumstances and to facilitate change as needed.\n\nThe ability to work in a fast-paced, changing and challenging environment.\n\nMust be proficient in Windows based software and point of sale applications.\n\nMust have excellent communications skills and attention to detail.\n\nAbility to interpret, understand, and comply with complex statutes, ordinances, regulations, standards, and laws.\n\nUnderstanding of applicable federal, state and local laws and regulations as they pertain to the industry, personnel law, safety regulations, local municipal codes and organizational rules, regulations, directives and standard operating procedures.\n\nAbility to establish and maintain effective working relationships with employees, management, governmental agencies, community members and the general public.\n\nAbility to use standard office equipment, computer equipment and software including word processing, database management, spreadsheet applications and electronic mail.\n\nAdditional Requirements:\nMust be a minimum of 21 years of age\n\nMust pass any and all required background checks\n\nMust be and remain compliant with any and all legal or company regulations for working in the industry\n\nMinimum Education and Experience:\nPrevious retail experience preferred\n\nPrevious inventory experience preferred\n\nEquivalent combinations of education and experience may be considered, including internal experience.\n\nWorking Conditions:\nWhile performing the duties of this job, the employee is regularly required to perform grasping, talking, hearing, seeing, standing, sitting, bending, twisting, lifting, climbing, and repetitive motions.\n\nPHYSICAL DEMANDS: Must be able to lift, carry and balance up to 40 pounds (100 pounds with assistance)\n\nMust be able to tolerate dusty, strong smelling marijuana odors, and be able to tolerate exposure to the product.",
    "slug": "dispensary-inventory-supervisor-33c8a32f-e9fc-4065-bd7f-8aae689248a6",
    "benefits": [],
    "selectedSkills": [
      "Writing skills",
      "Windows",
      "Public relations",
      "21 years or older"
    ],
    "jobType": "free",
    "applyURL": "https://secure6.saashr.com/ta/6156038.careers?rnd=JCY&ShowJob=436619334&%40rtm=1"
  },
  {
    "position": "Analytical Lab Technicain",
    "labName": "Default Company",
    "location": "Syracuse, NY",
    "age": "7 days ago",
    "type": "Full-time",
    "salaryMin": "$40,000 ",
    "salaryMax": " $57,000 a year",
    "jobDescriptionCopy": "Job Title: Analytical Laboratory Technician\nWork Location: Syracuse, New York\nDivision/Department: Processing Department\nReports to (Title of Manager): Processing Laboratory Manager\n\nDuties/Responsibilities:\nThe Laboratory Technician will complete tasks as assigned by the Processing Laboratory Manager to monitor and maintain the organization, cleanliness, and efficiency of the laboratory areas. The successful candidate will be detail oriented and able to follow established SOPs to ensure product integrity and quality control in a highly regulated environment.\n\n- Maintain strict inventory records of all plant and oil materials, supplies, and equipment.\n- Maintain immaculate production and laboratory environments adhering to SOPs and manufacturing standards\n- Prepare formulations according to batch records and assist in other formulation related tasks assigned by Processing Laboratory Manager.\n- Collect samples from various product stages\n- Clean and sterilize laboratory glassware and tools maintaining a clean, safe, and organized work environment\n- Assist with the laboratory intake procedures, which include routine sampling and the use of analytical balances\n- Assist Chemist with sample preparations, which includes routine use of chemicals, pipettes, and centrifuge equipment\n- Prepare reagent solutions upon authorization\n- Assist in monthly inventory audits.\n- Properly dispose of waste according to SOP’s.\n- Assist with updating documentation, maintaining records, and training personnel on basic lab equipment.\n- May help in other departments as needed/Other duties as assigned.\nBasic Qualifications:Education and/or Work Experience Requirements:\n\n- Understanding of basic laboratory terminology and concepts.\n- Able to interpret and follow complex, written, verbal and technical instructions. Must be able to adhere to facility SOPs.\n- Computer & equipment operations necessary for laboratory analysis (HPLC, GCMS/MS, analytical balance, automated pipettes, centrifuge, Lab Solutions, OpenLab, Shimadzu and Agilent equipment)\n- Preferred experience in a regulated laboratory setting\n- Pass the State of NY required background check\n- Excellent computer proficiency (MS Office – Word, Excel, and Outlook)\n- Thorough understanding of New York State law governing medical marijuana and Good Manufacturing Practices (preferred)\n- Bachelor's degree in Chemistry, Biology, or related field is (preferred)\n- Familiarity with history and varieties of medical marijuana (preferred)\n- Experience with BioTrack. (preferred/ not necessary)\nAdditional Qualifications:\n\n- Strong analytical and problem-solving ability.\n- Ability to prioritize tasks.\n- Ability to function well in a high-paced and at times stressful environment.\n- Meticulous organizational skills and attention to detail.\n- Sound technical ability and ability to learn complex procedures in a timely manner.\n- Excellent verbal and written communication skills, including ability to effectively communicate with internal and external customers\n- Excellent computer proficiency (MS Office – Word, Excel, and Outlook)\n- Must be able to work under pressure and meet deadlines, while maintaining a positive attitude.\n- Ability to work independently and to carry out assignments to completion within parameters of instructions given, prescribed routines, and standard accepted practices\n- Experience with BioTrack. (preferred/ not necessary)\n- Light to moderate lifting (up to 50lbs); heavier weights with assistance.\n- Must be able to sit or stand for prolonged periods of time.\n- Team player - works well with others.\n- The job is performed indoors in a traditional laboratory setting. Exposure to chemicals and laboratory agents is expected. Protective safety clothing, goggles, gloves, facemasks, hairnets, or hat are required as needed.\nRequired Experience:\n\n- At least 1 year of related work experience in analytical Lab\n- Experience in cannabis potency testing methods (preferably).",
    "slug": "analytical-lab-technicain-6af2c0bd-9f1a-4586-a5d1-9f14cbcd9ebb",
    "benefits": [],
    "selectedSkills": [
      "Analysis skills",
      "Microsoft Excel",
      "Computer skills",
      "Microsoft Outlook",
      "Laboratory experience",
      "Bachelor's degree",
      "Background check"
    ],
    "jobType": "free",
    "applyURL": "https://x.careersincannabis.com/job/3243?utm_source=indeed&utm_medium=dashboard&utm_campaign=promote"
  },
  {
    "position": "Events Coordinator",
    "labName": "American Association For Laboratory Accreditation",
    "location": "Frederick, MD",
    "age": "2 days ago",
    "type": "Full-time",
    "salaryMin": "$49,000 ",
    "salaryMax": " $65,000 a year",
    "jobDescriptionCopy": "Description: A2LA is a non-profit, public service membership organization offering compliance and accreditation services to organizations all over the world. A2LA is dedicated to formally recognizing testing, calibration and other laboratories and related organizations for their quality and technical competency with a variety of international standards (ISO/IEC 17025, ISO 15189, etc.), federal requirements (FDA, GLP, FCC, etc.), state (cannabis, etc.), and local requirements (water testing, etc.).\nWhether it is the clean air that you breathe, the water you drink or the vehicle you drive, A2LA helps make the world a better, safer place by working to ensure that organizations are releasing products and services that are meeting testing and quality standards. Detailed information about our services can be found on our website at https://www.a2la.org/about.\nThe Role:\nDriven and organized professional who works with the Director of Marketing and Communications to advance A2LA’s strategic objectives through trade shows, events, and organizational marketing. This position is responsible for the coordination of trade shows and events, collaborating with internal teams and third parties to align strategy, communication, logistics, staffing, training, execution, and reporting.\nResponsibilities:\n\n\n*\nAnnual Conference*\n\n\nFacility/venue coordination, menu selection, and event layout.\nGridding meeting space and coordinating space requests from staff and affiliates.\nCreate group resume.\nReview venue BEOs.\nCommunicate with sponsors, exhibitors, facilities, and vendors on a regular basis via email, conference calls and face to face meetings.\nTravel as required for site visits and onsite execution of annual meeting.\nArrange social activities such as opening and closing receptions.\n\nTradeshow Management\n\n\nWork with Director of Marketing on Tradeshow strategic plan.\nWork with internal teams to plan pre, during, and post-show promotional activities, including email campaigns, on-site events, lead-retrieval, speaking opportunities, whitepaper submissions, etc.\nWork with marketing team on promotional tactics (external digital and print creatives).\nEnsure uniform branding, coordinating booth staff wearables and promotional items for events.\nCoordinate all show/event operations, including booth floor plan, staffing, lead collection, and other logistics.\nFacilitate a pre-show meeting to discuss expectations and logistics as well as a debrief to assess successes and lessons learned, report to stakeholders.\nUtilize digital tools and platforms to maintain regular communication on progress timelines, and deliverables for stakeholders throughout the planning/execution.\nResearch potential shows we are not currently participating in that could increase our brand awareness.\nPlanning off-site receptions for specific shows for customers and potential customers throughout the country. You may be required to attend those shows.\n\nBoard and Executive Meetings\n\n\nSourcing hotels and working with either corporate sales reps for hotel properties or local meeting and convention bureaus to find properties.\nSelecting menus and room setup.\nResearching and coordinating off-site restaurants and activities for the group.\nWorking with the hotel for all logistics and accommodations and bill reconciliation.\nOther duties as assigned.\n\n. Requirements:\n\n\n1-3 years' experience in coordinating events.\nBachelor’s degree in Event Management, Marketing, or relevant topic preferred, other degrees will be considered.\nStrong proficiency with Microsoft Office and graphic design applications (In-Design, Illustrator, Photoshop), and project management platforms (Asana).\nExperience with building and sustaining successful partnerships with vendors.\nDiligent work habits and continual attention to detail in composing, editing, and proofing materials, establishing priorities and meeting deadlines.\nDemonstrated tact and diplomacy skills with the ability to interact and communicate effectively with individuals at all levels, both internally and externally with clients and vendors.\nTeam player with the ability to collaborate effectively with others, share ideas, and assist other department members on projects as needed.\nExcellent project management skills with the ability to work independently, handle completing tasks in a fast-paced environment.\nSuperior business writing skills, excellent judgement, and professional discretion with information.\n\nJob Type: Full-time\n\n\nWork Location: One location\n",
    "slug": "events-coordinator-5516d522-e72a-459e-a2c9-0db989b2b637",
    "benefits": [],
    "selectedSkills": [
      "Writing skills",
      "Adobe Photoshop",
      "Project management",
      "Editing",
      "Adobe Illustrator",
      "Bachelor's degree"
    ],
    "jobType": "free",
    "applyURL": "https://recruiting.paylocity.com/recruiting/jobs/Details/1080459/American-Association-For-Laboratory-Accreditation/Events-Coordinator"
  },
  {
    "position": "Environmental Laboratory Technician I (Volatile)",
    "labName": "Montrose Environmental Group, Inc.",
    "location": "Richmond, VA",
    "age": "6 days ago",
    "type": "Full-time",
    "jobDescriptionCopy": "ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicity testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nA Laboratory Technician I is responsible for performing tasks required to meet the expectations of our clients, in addition to efficiently and profitably generating defensible data in a timely manner. The ideal candidate will have experience in working under possibly hazardous conditions (e.g. pathogens or chemicals). He/She/They will be well-trained to maintain safety conditions and will be passionate for doing work that makes things move forward\n\nAs a key member of the Richmond Laboratory team, this role will be responsible for a full range of activities including:\n\nROLES AND RESPONSIBILITIES\n\nReceives environmental samples into the laboratory according to Enthalpy’s SOPs\nPerforms data entry of sample and test information into Laboratory Information System (LIMS)\nLabel sample containers, store them in appropriate locations and/or contact the proper department to inform them of short holding time and/or rush requests.\nAssists in sample bottle preparation\nAssists in sample management/archiving and disposal\nAssists in sample pickup or field sampling, if needed\nAssists in the coordination of daily field sampling/pickup schedule, if needed\nParticipates in focus teams to improve efficiency\nComply with Enthalpy’s Quality Assurance Program\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nHigh School Diploma or GED. Associate’s degree or equivalent and relevant formal academic/vocational qualifications preferred.\nSome lab experience is preferred but not required.\n\nPREFERRED SKILLS\n\nKnowledge of general lab practices and lab safety\nAble to multi-task and communicate effectively (both oral and written)\nAble to work independently and make sound decisions\nWell organized and have an attention to detail\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air, water and soil measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you will get tons of guidance and plenty of support from talented, super-smart colleagues in tackling head-scratching professional challenges. If this scenario attracts you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.",
    "slug": "environmental-laboratory-technician-i-volatile-1885c419-2395-48e1-b860-394e1a23bb8a",
    "benefits": [
      "401(k)",
      "Disability insurance",
      "Parental leave",
      "Tuition reimbursement"
    ],
    "selectedSkills": [
      "Laboratory experience",
      "High school diploma or GED",
      "Associate's degree"
    ],
    "jobType": "free",
    "applyURL": "https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-VA-Richmond-Reymet-Rd/Environmental-Laboratory-Technician-I--Volatile-_R2027?mode=job&iis=Job+Board&iisn=Indeed.com"
  },
  {
    "position": "Manager, PB Laboratories Operations",
    "labName": "TriCore Reference Laboratories",
    "location": "Albuquerque, NM",
    "age": "1 day ago",
    "type": "Full-time",
    "salaryMin": "$74,000 ",
    "salaryMax": " $98,000 a year",
    "jobDescriptionCopy": "Job ID #: 12279 City, State: NM - Albuquerque\n\nFunctional Area: Health/Medical Department Name:\nPosition Type: Regular - Full Time Education Required: See Minimum Qualifications\nExperience Required: See Minimum Qualifications Relocation Provided:\n\nJob Summary\n\nPrecision Botanical Laboratories\n\nWe help New Mexico hemp and cannabis growers produce safe, high-quality products by delivering precise, accurate, and reliable laboratory testing.\n\nPrecision Botanical Laboratories provides regulation-compliant laboratory testing to ensure safety and effectiveness of medical and adult-use cannabis and hemp.\n\nResponsible for the overall direction and management of the Precision Botanical Laboratories (PBL) operations (technical performance, personnel, education, training and administrative functions); coordination of activities with other areas of the organization and with internal and external customers to ensure that financial and quality standards are met. Work closely with Director, regarding decisions on matters relating to technical performance, quality and finances.\n\nESSENTIAL FUNCTIONS:\nDEPARTMENT MANAGEMENT AND STAFF OVERSIGHT:\n1. Responsible for the overall supervision of assigned department management staff.\n\na. Ensure that appropriate application, interview and selection processes are established and followed in the division, including, but not limited to interviews with peers and supervisors/tech specialists. Personally interview final candidates and work with Human Capital Management in making final selections.\n\nb. Oversee effective completion of performance evaluations and approve compensation process. Regularly communicate with direct reports regarding their performance and counsel them as needed. Let direct reports know when they are and are not meeting job expectations. Provide guidance to direct reports on how to improve performance.\n\nc. Oversee and conduct employee coaching, counseling and disciplinary actions as needed or appropriate. Manage dismissal actions utilizing Human Capital Management for advice and seeking approval from the appropriate leadership regarding the proposed action.\n\nd. Ensure that appropriate staff recognition programs are in place.\n\ne. Ensure standardized orientation, training programs, and competency programs for new and existing employees are established, maintained, and monitored according to regulatory guidelines.\n\nf. Be available to assist staff with questions and problem solving.\n\ng. Maintain appropriate channels of communication within the division.\n\nh. Provide information to staff regarding job expectation, relevant information concerning workload, workflow, process and procedure changes and general information regarding the department and the organization as a whole.\n\ni. Listen effectively and with the purpose of understanding employee concerns, questions, ideas and opinions. Actively solicit staff input and feedback.\n\nj. Coordinate and conduct department meetings on a regular basis.\n\nEDUCATION AND TRAINING\n\n1. Ensure appropriate training programs are in place and executed for all levels of students assigned for rotations in departments.\n\n2. Oversee client training and educational programs/meetings.\n\n3. Assist with problem resolution for external clients as needed.\n\n4. Consults with clients regarding appropriate testing, test results and interpretations.\n\nFINANCIAL\n\n1. Coordinate preparation and justification of budgets. Review and submit proposed budget to Director, PBL Operations.\n\n2. Approve submitted capital requests and vendor payments/invoices prior to submission for final approval.\n\nQUALITY ASSURANCE (QA)/COMPLIANCE\n\n1. Participate in quality assurance programs to ensure that quality standards are met. Demonstrate ability to consistently improve quality standards. Evaluate the needs and expectations of the “customers” of the area annually and implement new quality programs designed to ensure that the quality of services meet or exceed customers’ expectations. Prepare QA reports as appropriate. Lead, facilitate and/or participate in Quality Management and other process improvement teams as appropriate.\n\n2. In conjunction with the Director, develop, revise and implement department goals and objectives. Ensure that all goals and objectives are appropriately aligned and prioritized with company strategic goals.\n\n3. Actively support and implement company and department procedures, policies and strategies to support the corporate vision.\n\n4. Assures regulatory and accreditation compliance by working with Quality and the Director.\n\n5. Ensure patient, employee and organizational confidentiality.\n\nWORKFLOW/EFFICIENCY\n\n1. Oversee workflow and productivity.\n\n2. Develop, revise and implement appropriate work systems within the department that are designed to meet the needs of the organization as well as the needs of internal and external customers. Identify opportunities for new or improved service to both internal and external customers and implement new or improved services as appropriate.\n\n3. Responsible for ensuring that the department operates efficiently. Look for ways to get maximum benefit from all resources. Continually assess department staffing levels and needs including scheduling strategies and full time vs. part time ratios when employees leave, examine current staffing levels and needs, and determine appropriate replacement needs. Continually assess department resources and needs. Initiate requests for additional resources as appropriate, including cost justifications. Develop and monitor standards for measuring cost effectiveness.\n\n4. Provide backup or coordinate fill in for department staff during times of unusually high workload or other special circumstances.\n\nCUSTOMER SERVICE AND COMMUNICATION\n\n1. Maintain effective communication and coordination with other departments within the organization.\n\n2. Serve as a liaison to the external communication process to keep customers informed of testing and service changes. Assures that all relevant customer needs are met. Coordinate the scheduling of tests to meet customer expectations.\n\nTECHNICAL\n\n1. Maintain an up-to-date understanding of new requirements and technology through continuing education.\n\n2. Coordinate with the Director to ensure that test menus and services are consistent with the client expectations and financial expectations.\n\nOTHER RESPONSIBILITIES:\n1. Attend all managerial meetings and other meetings or workgroups as assigned.\n\n2. Maintain working relationships with vendors.\n\n3. Participate in the development and implementation of strategic initiatives.\n\nThe above statements describe the general nature and level of work being performed by individuals assigned to this classification. This is not intended to be an exhaustive list of all responsibilities and duties required of personnel so classified.\n\nMinimum Qualifications\n\nMINIMUM EDUCATION\n\nBachelor's degree in a relevant science.\n\nMINIMUM EXPERIENCE:\nSix (6) years of experience in a clinical or analytical laboratory with at least one year of management/supervisory experience.\n\nPREFERENCES:\nMaster’s degree.\nCannabis certification.\n\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class.",
    "slug": "manager-pb-laboratories-operations-a9e4efa9-e321-4364-ac66-7b8061d3f88e",
    "benefits": [],
    "selectedSkills": [
      "Clinical laboratory experience",
      "Laboratory experience",
      "Supervising experience",
      "Bachelor's degree",
      "Master's degree"
    ],
    "jobType": "free",
    "applyURL": "https://careers.peopleclick.com/careerscp/client_tricore/external/jobDetails.do?functionName=getJobDetail&jobPostId=27170&localeCode=en-us"
  },
  {
    "position": "Extraction Technician",
    "labName": "Default Company",
    "location": "Syracuse, NY",
    "age": "7 days ago",
    "type": "Full-time",
    "salaryMin": "$32,000 ",
    "salaryMax": " $43,000 a year",
    "jobDescriptionCopy": "Essential Duties and Responsibilities:\nThe Extraction Technician will assist with the production of high-quality cannabis extracts along with cleaning and maintaining laboratory grade equipment, recording, and entering data in multiple forms, and associated tasks delegated by management. The Extraction Technician will be responsible for consistent, sanitary, and safe production of extracts adhering to company policies to successfully uphold quality control and consistent product production. The individual has the responsibility of extracting, refining and purifying cannabinoids from plant material into a concentrated form using solvents.\nPreparing biomass for solvent based extraction and post processing.\nSample preparations and logging for analytical testing.\nAdhere to specific quality control SOP’s regarding procedural operations and quality of product produced.\nIdentify unsafe scenarios as they pertain to the Manufacturing Department.\nPerforms daily safety inspections for extraction systems.\nSafely and effectively perform all methods of the cannabis extraction and refinement process practiced at the Syracuse facility as directed by Management, including but not limited to, ethanol and CO2 extractions, winterization, filtration, color remediation, ethanol recovery and distillation.\nComplies with Syracuse facility SOPs and New York State guidance on proper disposal methods for solvent and cannabis contaminated waste.\nManage high-stress situations and be flexible and adaptable in a fast-paced environment when the situation requires.\nPerform general routine maintenance on lab equipment - troubleshooting, preventative maintenance, and regular data logging.\nWash and sanitize lab surfaces, glassware, equipment, and any other ancillary lab equipment.\nRecord all cleaning activities in daily logs.\nMaintain and log all data sheets for chemicals and products physically and digitally.\nEffective communication with the Management Team to ensure all operational needs are met and any procedural problems are addressed and resolved proactively\nOpen to constructive criticism and guidance and offer the same to others in the department.\nAbility to work a varying schedule including nights, weekends, and overtime as determined by process demands.\nSupport as necessary other departmental personnel and activities as process demands.\nPunctuality – Must arrive on time for each shift and take breaks/ lunch as scheduled.\nMay help in other departments as needed/Other duties as assigned.\n\nBasic Qualifications:Education and/or Work Experience Requirements:\nStrong analytical and problem-solving ability.\nAbility to prioritize tasks.\nAbility to function well in a high-paced and at times stressful environment.\nUnderstanding of basic laboratory terminology and concepts.\nMeticulous organizational skills and attention to detail.\nAble to interpret and follow complex, written, verbal and technical instructions. Must be able to adhere to facility SOPs.\nSound technical ability and ability to learn complex procedures in a timely manner.\n\n- Pass the State of NY required background check\nHigh School Diploma or equivalent.\nBachelor’s degree in biology, chemistry, or related field.\n\nAdditional Qualifications:\n\n- Excellent verbal and written communication skills, including ability to effectively communicate with internal and external customers\n- Excellent computer proficiency (MS Office – Word, Excel, and Outlook)\n- Must have certification\n- Must be able to work under pressure and meet deadlines, while maintaining a positive attitude and providing exemplary customer service\n- Ability to work independently and to carry out assignments to completion within parameters of instructions given, prescribed routines, and standard accepted practices\n- Proficient with BioTrack.\n- Light to moderate lifting (up to 70lbs); heavier weights with assistance.\n- Must be able to sit or stand for prolonged periods of time.\n- Learn complex technical procedures in a timely manner.\n- Pass the State of NY required background check\n- Team player - works well with others.\n- Must wear provided lab coat, hair/beard nets, gloves, surgical masks, and safety glasses/ goggles/ splash shield, while working in the lab.",
    "slug": "extraction-technician-ce11836a-113d-4edf-8880-ab160867f3c4",
    "benefits": [],
    "selectedSkills": [
      "Analysis skills",
      "Microsoft Excel",
      "Computer skills",
      "Microsoft Outlook",
      "Communication skills",
      "Bachelor's degree",
      "High school diploma or GED",
      "Background check"
    ],
    "jobType": "free",
    "applyURL": "https://x.careersincannabis.com/job/3245?utm_source=indeed&utm_medium=dashboard&utm_campaign=promote"
  },
  {
    "position": "Sr. Analytic Lab Technologist- PB Laboratories",
    "labName": "TriCore Reference Laboratories",
    "location": "Albuquerque, NM",
    "age": "1 day ago",
    "type": "Full-time",
    "salaryMin": "$60,000 ",
    "salaryMax": " $80,000 a year",
    "jobDescriptionCopy": "Job ID #: 12280 City, State: NM - Albuquerque\n\nFunctional Area: Health/Medical Department Name:\nPosition Type: Regular - Full Time Education Required: See Minimum Qualifications\nExperience Required: See Minimum Qualifications Relocation Provided:\n\nJob Summary\n\nPrecision Botanical Laboratories\n\nWe help New Mexico hemp and cannabis growers produce safe, high-quality products by delivering precise, accurate, and reliable laboratory testing.\n\nPrecision Botanical Laboratories provides regulation-compliant laboratory testing to ensure safety and effectiveness of medical and adult-use cannabis and hemp.\n\nJOB SUMMARY:\nUnder general supervision, provides advanced skills in the performance of high complexity laboratory tests for the purpose of determining analytic purity and sterility within the scope of training and experience.\n\nESSENTIAL FUNCTIONS:\n1. Performs/results laboratory tests within scope of training and experience with a high degree of proficiency.\n\n2. Operates laboratory equipment, interfaces and instruments, performs and documents basic and advanced maintenance and complex calibration procedures. Serves as Key Operator for assigned instrument(s) as needed or directed.\n\n3. Performs routine logging for QC/QA purposes. Collects and compiles QA data as directed. Monitors QC for trends and takes corrective action as needed or directed.\n\n4. Performs all troubleshooting procedures. Identifies testing problems and recommends appropriate solutions using defined guidelines.\n\n5. Coordinates and/or assists in preparing work schedules for department as directed.\n\n6. Actively participates in preparation for regulatory inspections, taking responsibility for section and/or department as assigned.\n\n7. Researches, evaluates and develops new assay technology and/or assay improvements for assigned projects in collaboration with directors and technologists.\n\na) Research and develop assay protocols upon approval by Director.\n\nb) Plan and perform assay validation.\n\nc) Present cost analysis\n\nd) Draft SOP for departmental approval.\n\ne) Complete and submit IT System change request.\n\nf) Complete projects within expected deadlines.\n\ng) Ability to work on three or more projects simultaneously.\n\n8. Carries out laboratory projects that include feasibility studies, new product evaluation/testing, and workflow analysis.\n\n9. Participates in training new employees and students where appropriate, providing instruction and information. Tracks progress and assesses trainee competency.\n\n10. Participates in taking inventory as needed or appropriate. Orders supplies for the Department as directed.\n\n11. Identifies and reports abnormalities in results and test procedures. Troubleshoots as appropriate.\n\n12. Handles hazardous materials and wastes in accordance with safety procedures and regulations.\n\n13. Serves as a liaison with internal and external customers/employees/clients as appropriate.\n\nThe above statements describe the general nature and level of work being performed by individuals assigned to this classification. This is not intended to be an exhaustive list of all responsibilities and duties required of personnel so classified.\n\nMinimum Qualifications\n\nMINIMUM EDUCATION:\n\nMaster’s degree in a chemical, physical or biological science\nMINIMUM EXPERIENCE:\n\nFive (5) years of academic and/or work experience with complex testing techniques.\nPREFERENCES:\nCannabis Technician certification\n\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class.",
    "slug": "sr-analytic-lab-technologist-pb-laboratories-6fcac496-2c38-4f60-9f48-4f54ae306554",
    "benefits": [],
    "selectedSkills": ["Master's degree"],
    "jobType": "free",
    "applyURL": "https://careers.peopleclick.com/careerscp/client_tricore/external/jobDetails.do?functionName=getJobDetail&jobPostId=27164&localeCode=en-us"
  },
  {
    "position": "Research Assistant",
    "labName": "Brown University",
    "location": "Providence, RI",
    "age": "3 days ago",
    "type": "Full-time",
    "salaryMin": "$31,000 ",
    "salaryMax": " $43,000 a year",
    "jobDescriptionCopy": "Job Description:\nThis Research Assistant (RA) will support a mixed-methods (laboratory and field-based) study of cannabis and alcohol and cannabis co-use on alcohol outcomes. Activities will include participant recruitment and screening, following project protocol for retention of participants, collecting data, data entry, and general support work of the project. The RA is expected to work with individuals participating in addictions-related research to be assessed during laboratory and field-based research protocols. The RA is expected to screen and assess individuals for eligibility and to collect laboratory data involving the administration of alcohol and cannabis, train participants in protocol for a field-based data collection and monitor that data collection daily. The RA is expected to help with organization and maintenance of project documents and files and help with assembling materials for IRB modifications and progress reports. Finally, the RA may be required to have their own form of transportation, as they will possibly travel within ~25 miles of Providence, RI to conduct brief assessments at participants’ homes or neutral off-site locations. RA will be compensated for the mileage.\n\nNote: This is a fixed term position with an end date of 5/1/2027, which may be extended based upon available funding.\n\nMajor Responsibility: Laboratory data collection with research participants. 30 %\n\nSupporting Actions: The RA will be responsible for collection of psychological, behavioral, and cognitive data from research participants in accordance with a standardized protocol involving laboratory cannabis and alcohol administration. The RA will conduct in-person and telephone interviews with research participants and administer clinical diagnostic interviews and standardized tests. Valid data collection requires a clear understanding of project objectives and assessment instruments. The RA will be responsible for administration of cannabis and alcohol to participants following standardized procedures. The RA will administer the study testing materials including assessment battery, computer-based behavioral tests, clinical diagnostic interviews, urine drug and pregnancy tests, and other biological indicators of alcohol, tobacco, and drug use in accordance with standardized research protocol. The RA will be responsible for scheduling and meeting with research participants and administering the study assessment protocol and sobriety evaluation at the end of the study visits. The RA will administer informed consent to study participants and will ensure that informed consent forms are collected and securely stored. The RA will be prepared to handle potential adverse reactions and intoxication following appropriate training in protocol procedures and seek guidance as per the study protocol. They will ensure that data are collected in a timely and complete manner and will reviews data packets for compliance with research protocol. The RA will ensure that study protocol is executed with great attention to detail and following exact study procedures. The RA will ensure that all study assessments are conducted with a high degree of reliability, accuracy, and in adherence with the study protocol. The RA will be responsible for understanding and implementing all study procedures related to participant safety and confidentiality. Excellent communication skills are necessary for interactions with the research team and study participants. Excellent organization skills, attention to detail, and ability to work independently are necessary to implement the study protocol correctly and efficiently.\n\nMajor Responsibility: Field-based data collection with research participants 30 %\n\nSupporting Actions: The RA will be expected to assist the PI in programming and monitoring screening logs and surveys in Qualtrics and smartphone-based ecological momentary assessment (EMA) surveys. The RA will also track participants during the EMA portion of the study using detailed logs; and correspond with participants regarding compliance. The RA will train participants in mobile data collection procedures and conduct daily tracking of survey completion to monitor participant compliance. Finally, the RA will need to travel to a participant's home or neutral location to conduct data collection.\n\nMajor Responsibility: Participant recruitment and retention 20 %\n\nSupporting Actions: The RA will be expected to post advertisements (virtually and physically around town), field contact attempts from interested participants, manage screening, and schedule eligible participants. In addition, once enrolled the RA will be expected to keep in regular contact with participants with the goal of retaining them in the study, including reminder calls, texts, and emails.\n\nMajor Responsibility: Administrative duties related to research 10 %\n\nSupporting Actions: The RA will be responsible for tracking research participants, scheduling study visits, and arranging transportation for participants. The RA will disburse and record participant payments in a timely manner according to established protocol. The RA will maintain complete and up-to-date records on participant study completion and monitor participant status. Other administrative duties include generation of internal reports on project progress, tracking of study supplies, and calibration of basic research equipment such as digital breath analysis devices. Provide assistance to the PI and project coordinator in preparing IRB submissions and assist with continuing review materials for the various agencies that provide monitoring and oversight of the study (NIH, FDA, DEA).\n\nMajor Responsibility: Data Management. 10%\n\nSupporting Actions: The RA will be involved in data collection and processing (e.g., creating and monitoring online surveys). They will be trained on cleaning statistical data including running computerized error checks on data sets, checking raw data for errors, and identifying data irregularities.\n\nDecisions free to make:\nTime and tasks can be managed independently\n\nScheduling study subjects for interviews and lab sessions which includes time, place, and provision of transportation from the experimental session.\n\nAppropriate strategies which fall within project protocols for locating a participant, taking into consideration the importance of maintaining the participant’s right to confidentiality.\n\nDecides whether participant responses to assessments are acceptable or not. If responses are not acceptable, must probe further without making the participant feel like his/her behavior is being judged. Decisions made are based on scientific knowledge of assessment, established objectives, policies, precedents, or procedures.\n\nUsing established codebooks as guides, how to score and enter the data that have been collected.\n\nCommunications with participants related to completing follow-ups and payment-related questions, following guidelines established by team and IRB approvals.\n\nOrganizing and reporting participant payment data, consistent with policies of Center and University\n\nImplementing follow-up prompts and communications, consistent with study protocol\n\nDecisions that depend on supervisory advice:\nModifications/improvements to data integrity or established study protocols.\n\nEstablishing procedures for protocols for new projects.\n\nRecommendations for ways in which methodologies of study could be improved.\n\nScientific decisions about ways to present summary data for reports.\n\nDimensions\n\nUp to 300 participants to be recruited to obtain the final sample with complete data of N =200: Responsible for following participants from recruitment through end of study.\n\n5 year project.\n\n4 in-person study visits per participant, followed by 4 weeks of field-based data collection, with the overall study participation to be completed over the course of 2-3 months.\n\nParticipant payments to be managed over the course of project.\n\nWeekly report of research participants’ status\n\nDaily monitoring of participant compliance to EMA surveys and study protocols\n\nJob Qualifications\n\nEducation and Experience\n\nBA or BS in psychology or related field with 1-2 years’ experience (other degrees considered based on work experience) or equivalent combination of education and experience.\n\nProficiency in Word, Excel, and Powerpoint is required.\n\nExperience with human subjects applications and modifications is preferred.\n\nCoursework in research design and statistics and addiction/substance use is preferred.\n\nKnowledge of research methodology and reporting; experience and familiarity with IRB procedures.\n\nExperience in programming online surveys (e.g., Qualtrics software) is preferred\n\nExperience managing databases is preferred\n\nJob Competencies\n\nIndicate the essential job competencies. Competencies are required knowledge, skills and abilities necessary to perform the job successfully.\n\nStrong verbal abilities and communication skills; excellent interpersonal and organizational skills; attention to detail; maturity, and responsibility.\n\nAccess to a personal vehicle and willingness to drive within 25 mile radius is preferred (note: reimbursement for mileage is provided).\n\nDemonstrated ability to work independently, prioritize tasks, perform multiple tasks efficiently and accurately, take initiative and maintain organized working conditions required.\n\nAbility to function as a research team member and leader.\n\nMust be able to work late afternoons, evenings, and some weekends when necessary.\n\nMust be available to work onsite at Brown University\n\nTwo-year commitment is required and long-term commitment preferred.\n\nPossess a willingness and ability to support and promote a diverse and inclusive campus community.\n\nPhysical Demands and Working Conditions\n\nGeneral Physical Demands\n\nRequires ability to read\n\nRequires moving around campus\n\nRequires occasionally standing, sitting, walking; using hands to finger, handle, or feel objects, tools or controls; reaching with hands and arms; climbing stairs; hearing; talking\n\nRequires frequently moving about inside the office to access printer, files, and other materials/equipment\n\nOperates a computer and other office equipment\n\nSome travel may be required\n\nLift/Carry/Push/Pull\n\nTypically less than 10 pounds\n\nUse of Chemicals\nN/A\n\nAdditional physical demands and working conditions:\nThis position requires responsibility, accountability, flexibility, creativity, willingness to adapt to and meet changing priorities, ability to work as part of a team using a problem-solving orientation. This position requires completion of EHS and job-specific training for handling of biological specimens in a laboratory setting. This position involves all aspects of a clinical trial. Flexibility in work schedule is required, including some weekends. This position involves monitoring (including background check) and oversight by the DEA and the FDA and working with Schedule I drug.\n\nRecruiting Start Date:\n2022-05-02-07:00\n\nJob Posting Title:\nResearch Assistant\n\nDepartment:\nCenter for Alcohol & Addiction Studies\n\nGrade:\nGrade 8\n\nWorker Type:\nEmployee\n\nWorker Sub-Type:\nFixed Term (Fixed Term)\n\nTime Type:\nFull time\n\nScheduled Weekly Hours:\n37.5\n\nPosition Classification:\nHybrid Eligible\n\nSubmission Guidelines:\nPlease note that in order to be considered an applicant for any staff position at Brown University you must submit an application form for each position for which you believe you are qualified. Applications are not kept on file for future positions. Please include a cover letter and resume with each position application.\n\nVaccination Requirements:\nIn order to maintain 90% or greater universal vaccination rates on campus, all newly hired employees at Brown University must receive the final dose of the COVID-19 vaccine before they begin work, unless they are approved for a medical or religious exemption. All employees must also receive a COVID-19 booster within thirty (30) days of becoming eligible. For more information, please visit the Healthy Brown site.\n\nStill Have Questions?\n\nIf you have any questions you may contact employment@brown.edu.\n\nEEO Statement:\nBrown University is an E-Verify Employer.\n\nBrown University is committed to fostering a diverse and inclusive academic global community; as an EEO/AA employer, Brown considers applicants for employment without regard to, and does not discriminate on the basis of, gender, sex, sexual orientation, gender identity, national origin, age, race, protected veteran status, disability, or any other legally protected status.",
    "slug": "research-assistant-f281a088-44b5-46fe-b8a5-84d116453a97",
    "benefits": ["Mileage reimbursement"],
    "selectedSkills": [
      "Microsoft Excel",
      "Microsoft Powerpoint",
      "Communication skills",
      "Organizational skills",
      "Qualtrics",
      "Bachelor of Science",
      "Bachelor's degree",
      "Current immunizations",
      "Background check"
    ],
    "jobType": "free",
    "applyURL": "https://brown.wd5.myworkdayjobs.com/en-US/staff-careers-brown/job/121-South-Main-Street/Research-Assistant_REQ179091?source=indeed"
  },
  {
    "position": "Director, PBL Operations",
    "labName": "TriCore Reference Laboratories",
    "location": "Albuquerque, NM",
    "age": "1 day ago",
    "type": "Full-time",
    "salaryMin": "$84,000 ",
    "salaryMax": " $120,000 a year",
    "jobDescriptionCopy": "Job ID #: 12281 City, State: NM - Albuquerque\n\nFunctional Area: Health/Medical Department Name:\nPosition Type: Regular - Full Time Education Required: See Minimum Qualifications\nExperience Required: See Minimum Qualifications Relocation Provided:\n\nJob Summary\n\nPrecision Botanical Laboratories\n\nWe help New Mexico hemp and cannabis growers produce safe, high-quality products by delivering precise, accurate, and reliable laboratory testing.\n\nPrecision Botanical Laboratories provides regulation-compliant laboratory testing to ensure safety and effectiveness of medical and adult-use cannabis and hemp.\n\nJOB SUMMARY:\nResponsible for the strategic, financial, quality and scientific performance of Precision Botanical. Laboratories (PBL). The Director of Operations will plan, develop, and coordinate all activities and functions in order to achieve the objectives of the organization and to assure coordination of these functions with those of the rest of the organization. This position works closely with the Executive Management Team and scientific staff to assure regulatory compliance for the laboratory operations. Responsible for the design and/or selection and implementation of equipment, policies and procedures to facilitate processes and resolve procedural problems. Directs and coordinates activities with other areas of the organization and with internal and external customers to ensure that quality standards are met. Responsible for ensuring service quality to the satisfaction of internal and external customers.\n\nESSENTIAL FUNCTIONS:\nTogether with the Chief Scientific Officer, and Chief Operating Officer:\n\n1. Assure the selection, evaluation, validation and maintenance of appropriate test methodologies and instruments necessary to meet the objectives of the organization and clients served.\n\n2. Assure the maintenance of complete and current laboratory procedure manuals.\n\n3. Assure compliance with all relevant federal and state legal and regulatory requirements for the laboratory, including but not limited to ISO/IEC 17025.\n\n4. Oversee processes to assure coordination of quality control, quality assurance, compliance and adherence to company policies and procedures.\n\n5. Prepare and monitor an annual strategic plan for the company in support of the strategic priorities of the organization as set by the Executive Committee and the Board of Directors.\n\n6. Recommend “Best Practices” and new innovative processes to constantly improve quality and financial standards.\n\nAs a member of Senior Leadership:\n1. Ensure appropriate representation on TriQual, Organizational Compliance Committee, Vendor Business Reviews, New Business Pipeline, and Executive Projects.\n\n2. Assure the development and management of the expense budget of all areas of responsibility, establishing key performance indicators to monitor performance. Take necessary action to correct significant variances in a timely fashion to meet the financial goals of the organization.\n\n3. Ensures that appropriate progress is being made against defined strategies; proactively raises issues and recommendations for resolutions.\n\n4. Periodically review tactical implementation on operational goals and provide corrective action plans as necessary.\n\n5. Prepare and present, as requested, periodic summary reports to the Executive Management Team.\n\n6. Participate in a collaborative and professional manner.\n\nIndividual Activities and Responsibilities:\n1. Work closely with executive management, corporate strategy, finance, sales and marketing, and operations business units to develop the PBL strategy, including Operational and Business Development strategies.\n\n2. Serve as primary contact with key clients. Responsible for ensuring that all activities and test menus are consistent with the client’s expectations. Serve as a liaison between clients and the organization.\n\n3. Complete evaluations and analyses of potential clients.\n\n4. Develop the Business Pipeline including, but not limited to, pricing negotiations and contract management.\n\n5. Prepare appropriate legal documentation (in conjunction with legal team).\n\n6. Coordinate policies and procedures with all sections of the company and with other stakeholders as needed.\n\n7. Oversee the scheduling of company personnel to ensure availability of testing to meet published schedules. Evaluate demand and work to modify schedules as appropriate.\n\n8. Interview, select, and hire staff as needed.\n\n9. Evaluate staff performance, providing coaching, counseling and discipline as appropriate.\n\n10. Develop and maintain criteria for training and in-service programs for company staff so that all laboratory procedures are understood and consistently performed.\n\n11. Maintain up to date knowledge of new development in the industry and economics through continuing education and other relevant sources.\n\nOTHER RESPONSIBILITIES\n\na. Attend supervisory/management meetings.\nb. Other duties and special projects as assigned.\n\nThe above statements describe the general nature and level of work being performed by individuals assigned to this classification. This is not intended to be an exhaustive list of all responsibilities and duties required of personnel so classified.\n\nMinimum Qualifications\n\nMINIMUM EDUCATION\nBachelor's degree in Chemical, Physicial or biological science.\n\nMINIMUM EXPERIENCE:\nTwelve (12) years laboratory experience.\nEight (8) years management experience in a laboratory.\nFive (5) years of business development and customer relation experience.\n\nPREFERENCES:\nMaster's degree desired.\n\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class.",
    "slug": "director-pbl-operations-c49f6803-5ada-474e-ab9b-a25c22834928",
    "benefits": [],
    "selectedSkills": [
      "Laboratory experience",
      "Management",
      "Business development",
      "Bachelor's degree",
      "Master's degree"
    ],
    "jobType": "free",
    "applyURL": "https://careers.peopleclick.com/careerscp/client_tricore/external/jobDetails.do?functionName=getJobDetail&jobPostId=27168&localeCode=en-us"
  },
  {
    "position": "Project Manager: AI/Machine Learning (Hybrid Work)",
    "labName": "Agilent Technologies, Inc.",
    "location": "Santa Clara, CA",
    "age": "6 days ago",
    "type": "Full-time",
    "jobDescriptionCopy": "To protect the health and safety of our employees, contractors, customers and communities, employees in the U.S. and Puerto Rico are required to be fully vaccinated against COVID-19, unless an approved exemption has been granted for a medical reason, sincerely held religious belief, or an employee is otherwise exempt under applicable law.\n\nAgilent inspires and supports discoveries that advance the quality of life. We provide life science, diagnostic and applied market laboratories worldwide with instruments, services, consumables, applications and expertise. Agilent enables customers to gain the answers and insights they seek - so they can do what they do best: improve the world around us. Information about Agilent is available at www.agilent.com.\n\nAgilent has a great culture based on the belief that our people are our greatest asset. Our values are present in all we do – innovation, trust, respect, teamwork, uncompromising integrity, speed, focus, and accountability. Agilent culture provides flexibility to manage job and personal demands by offering hybrid work arrangements. We want employees to work at Agilent offices part of the week to strengthen teamwork and preserve our strong company culture, and work from home the balance of the week to offer our employees more flexibility. We value flexibility and consider it critical to employee engagement and retention.\n\nUnique position in a global corporation requires unique Project Manager talent. Leadership opportunity to join a team of \"intrapreneurs\" from a recently acquired start-up and growing AI/machine learning development organization with Agilent Technologies in the heart of Silicon Valley.\n\nThis role will be strategically located at Agilent HQ in Silicon Valley and will be responsible for leading cross-functional teams and projects that interacts with all levels and geographies within Agilent. There will be close interaction with the actual development teams and machine learning engineers in addition to leading new strategic corporate initiatives.\n\nCandidates should excel in communication, software project management, and initiative. We seek those candidates who seek out challenges and are motivated to make a positive impact through their work.\n\nAgilent touches almost every global industry from bio-tech, pharma, medical, food, cannabis, to oil/gas, and environmental testing. We are at the forefront of these industries and the opportunity to have an impact through machine learning and new solutions is incredible.\n\nWhat you will do:\nWork closely with Product Managers to refine product requirements\n\nSetup scrum boards and create stories based on the Product Requirement Document\n\nLead daily stand ups and other technical meetings\n\nCollaborate with developers\n\nTrack the projects status, mediate issues, provide weekly status reports\n\nResponsible to set up and maintain the project documentation\n\nIdentify product requirements and limitations to ensure system functionality\n\nDemo features for internal and external presentations\n\nResearch technical issues and aid the debugging of issues and become an expert on new features during development and after deployment\n\nA key liaison between QA, leadership, engineers, and the customer-facing team\n\nPromote collaboration among team members and direct the team towards upcoming goals\n\nAbout You:\n3+ year experience in software project management\n\n3+ years experience in software product development\n\nSoftware developer or similar technical background will make you a stand out candidate\n\nPrevious experience working with Jira and Confluence\n\nKnowledge of working in an Agile Scrum team\n\nUnderstanding of AI/machine learning is an important requirement for managing these projects\n\nUnderstanding of Full Stack applications Java, JavaScript, and C++ is beneficial\n\nYou thrive in a fast-paced environment\n\nPositive, friendly, and collaborate well internationally\n\nStrong mediation and interpersonal skills that enable you to solve technical and resources challenges\n\nFun! We work hard and have a lot of fun doing it!\n\nAgilent Technologies, Inc. is an Equal Employment Opportunity and Affirmative Action employer. We value diversity at all levels. All individuals, regardless of personal characteristics, are encouraged to apply. All qualified applicants will receive consideration for employment without regard to sex, pregnancy, race, religion or religious creed, color, gender, gender identity, gender expression, national origin, ancestry, physical or mental disability, medical condition, genetic information, marital status, registered domestic partner status, age, sexual orientation, military or veteran status, protected veteran status, or any other basis protected by federal, state, local law, ordinance, or regulation and will not be discriminated against on these bases.\n\nAgilent Technologies, Inc., is committed to diversity in the workplace and strives to support candidates with disabilities. If you have a disability and need assistance with any part of the application or interview process or have questions about workplace accessibility, please email job_posting@agilent.com or contact +1-262-754-5030.\n\nFor more information about equal employment opportunity protections, please see all of our notices for EEO below.",
    "slug": "project-manager-aimachine-learning-hybrid-work-49f2800d-3c58-47ce-952c-94fec550bee9",
    "benefits": ["Work from home"],
    "selectedSkills": [
      "Software deployment",
      "Project management",
      "Confluence",
      "Full-stack development",
      "Jira"
    ],
    "jobType": "free",
    "applyURL": "https://recruiting.adp.com/srccar/public/RTI.home?r=5000844785006&c=2167807&d=External&rb=INDEED"
  },
  {
    "position": "Government Relations Associate",
    "labName": "American Association For Laboratory Accreditation",
    "location": "Frederick, MD",
    "age": "4 days ago",
    "type": "Full-time",
    "salaryMin": "$53,000 ",
    "salaryMax": " $73,000 a year",
    "jobDescriptionCopy": "Description: A2LA is a non-profit, public service membership organization offering compliance and accreditation services to organizations all over the world. A2LA is dedicated to formally recognizing testing, calibration and other laboratories and related organizations for their quality and technical competency with a variety of international standards (ISO/IEC 17025, ISO 15189, etc.), federal requirements (FDA, GLP, FCC, etc.), state (cannabis, etc.), and local requirements (water testing, etc.).\nWhether it is the clean air that you breathe, the water you drink, or the vehicle you drive, A2LA helps make the world a better, safer place by working to ensure that organizations are releasing products and services that are meeting testing and quality standards. Detailed information about our services can be found on our website at https://www.a2la.org/about.\nThe Role\nA2LA is seeking a detail-oriented professional to assist the Director of Government Relations in advancing and directing policies and objectives of the association involving local, state and federal government, and regulatory affairs. This person will be responsible for tracking and mining for legislation requiring A2LA’s response and proposing suggested actions and providing example template responses. This is an exceptional opportunity to improve public safety through regulation.\nAbout You\nYou have proven excellent communication skills and have the ability to build meaningful relationships. You are passionate about government relations and advancing public safety through policy. You have a strong customer first mindset and collaborate well with others. You are someone who can manage their priorities and stay organized.\nResponsibilities\n\n\nCreate campaign material like advocacy materials, policy arguments, talking points and white papers on key issues, legislation, and regulatory issues.\nIdentify congressional members or committees to target and schedule meetings with them to discuss the importance of accreditation and public safety.\nWork with other departments in the implementation and execution of government and regulatory affairs in other programs.\nReview, evaluate and monitor current, pending, and historical legislative actions.\nSupport information mining – observing, receiving, and otherwise obtaining information from all relevant sources.\nTrack new legislation using FiscalNote and monitor the Federal Register, notifying individuals when necessary.\nInform other staff of upcoming legislation and other governmental rule-making.\nTarget A2LA’s members to support accreditation efforts.\nStay current in market trends through continuing education, memberships, and subscriptions to relevant organizations.\nOversee the maintenance of all government contacts in relevant databases.\nOther duties and projects as assigned.\n\n. Requirements: A2LA may provide exceptions to educational requirements for veterans who demonstrate the ability to perform the duties listed in this job posting.\nA successful candidate for these positions typically meets the following criteria:\n\n\nBachelor’s degree in political science or related field\n5 years of experience with government affairs including meeting congressional offices and regulators\nProficient knowledge of the legislative process\nBasic understanding of accreditation strongly preferred\nGovernment relations experience in the infrastructure sector\nRegistered lobbyist\n\nBenefits and Compensation\nThe salary for this position is commensurate with experience. In addition, A2LA offers a robust 403(b) retirement plan and benefits package including medical, dental, HSA, FSA (medical and dependent), life insurance, short- and long-term disability, employee assistance program (EAP), AFLAC, tuition reimbursement and other pre-taxed benefits, paid-time off, 10 paid government holidays, 1 floating holiday, training and development, career advancement opportunities, and much more!\nWorking Environment & Physical Requirements\nThe physical demands and work environment described here reflect those of a person, in this position, will typically encounter.\n\n\nPhysical Demands: While performing the duties of this job, the employee is required to walk; sit for long hours, use hands for typing; talk and hear. Specific vision abilities required by the job include close vision for reviewing electronic and hard copy documents. Moderate lifting of up to 40 lbs. may be expected.\nWork Environment: Work is typically performed in an office setting. Hours are flexible, but they should normally encompass at least the core hours of 9:00AM to 3:00PM, total at least forty (40) hours for each work week, and suit the needs of various training clients, where appropriate.\n\nTo perform this job successfully, an individual must be able to perform the essential duties satisfactorily. The requirements listed above are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\nA2LA is an equal opportunity employer. A2LA does not discriminate in employment based upon race, color, religion, national origin, citizenship status, ancestry, age, sex (including sexual harassment), sexual orientation, marital status, physical or mental disability, military status or unfavorable discharge from military service, or any other federally protected classification.\nMilitary/Military Spouse Personnel are encouraged to apply.\n\n\nJob Type: Full-time\n\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\n\nWork Location: One location\n",
    "slug": "government-relations-associate-3bcca2b3-2024-4fa6-97b1-0c3962638c08",
    "benefits": [
      "Health savings account",
      "Dental insurance",
      "403(b)",
      "Health insurance",
      "Employee assistance program"
    ],
    "selectedSkills": [
      "Legislation",
      "Communication skills",
      "Bachelor's degree"
    ],
    "jobType": "free",
    "applyURL": "https://recruiting.paylocity.com/recruiting/jobs/Details/1073745/American-Association-For-Laboratory-Accreditation/Government-Relations-Associate"
  },
  {
    "position": "IT Software Developer",
    "labName": "CannaSafe",
    "location": "Van Nuys, CA",
    "age": "5 days ago",
    "salaryMin": "$89,000 ",
    "salaryMax": " $110,000 a year",
    "jobDescriptionCopy": "Job Summary\n\nThe Developer is responsible for the development, design, and implementation of new and modified software products and ongoing business projects. A key area of focus is our custom internally developed software including our web-based Laboratory Information Management System (LIMS).\n\nEssential Duties and Responsibilities\n\nLearn and understand the desired user experience and business results for our internally developed software.\nResearch, design, write, implement, and manage efficient code.\nIdentify areas of modification in existing programs and subsequently develop these modifications and/or upgrades.\nPerform testing from scripted test cases as well as write test cases based on business requirements.\nPerform smoke testing and regression testing to ensure comprehensive analysis of issues and resolutions. This includes debugging pre-released software for defects.\nPartner closely with other Developers, UX designers, and business/systems analysts.\nAuthor documentation regarding newly created features and related SOPs/how-to guides.\nDeploy software tools, processes, and metrics.\nDevelop quality assurance procedures.\nProvide comprehensive reporting as well as effective training and support for users.\nOffer recommendations regarding process improvement.\nPrioritize and juggle multiple projects at once.\nOther duties and special projects as assigned.\n\nKnowledge, Skills, and Abilities\n\nAbility to maintain an incredibly high degree of attention to detail and accuracy.\nAbility to maintain confidence, confidentially, and composure during difficult and/or complex situations.\nAbility to work in a dynamic, fast-paced deadline environment (both collaborative and autonomous environments) while successfully managing multiple tasks.\nStrong knowledge of standard laboratory protocol, including ISO/IEC 17025 standards.\nExcellent communication skills and ability to effectively work, problem solve, and communicate with all levels of the organization.\nProven track record of developing software code for custom business platforms.\n\nEducation and Experience\n\nRequired: A high school diploma (or GED) plus least three (3) years of relevant programming experience.\nRequired: At least two (2) years of experience with JavaScript, Vue.js, Ruby, PostgreSQL, and GraphQL.\n\nPreferred: Familiarity with Agile development concepts, test automation, Antd ui component library, Bootstrap, and React, AWS, and Heroku.\nOptional: Exposure to the cannabis industry.\n\nEssential Functions\n\nThe physical demands described here are representative of those that an employee must meet to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nWhile performing the duties of this job the employee is frequently required to stand, handle or feel, to speak, and to hear. The employee is occasionally required to walk, sit, reach with hands and arms, bend, kneel, crouch, or crawl. The employee must frequently lift and/or move up to thirty-five (35) pounds. Specific vision abilities required for this job include close (proximity) vision, depth perception, and the ability to adjust focus.",
    "slug": "it-software-developer-4824dc3c-eb41-4194-b0f2-5ffbf49f7756",
    "benefits": [],
    "selectedSkills": [
      "React",
      "Vue.js",
      "GraphQL",
      "Bootstrap",
      "Communication skills",
      "High school diploma or GED"
    ],
    "jobType": "free",
    "applyURL": "https://csalabs.com/careers/?gnk=job&gni=8a78859e7ce7e880017cec44809c31e9&gns=Indeed+Free"
  },
  {
    "position": "National QA Director",
    "labName": "Montrose Environmental Group, Inc.",
    "location": "Durham, NC",
    "age": "6 days ago",
    "type": "Full-time",
    "jobDescriptionCopy": "ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicity testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nThe National QA Director oversees quality management systems for all of Enthalpy’s laboratories and service centers. This position is responsible for covering all aspects of internal audit activity and aims to provide leadership reasonable assurance that work performed by the department conforms with audit methodology and meets quality standards (e.g., industry standards and regulatory requirements). The National QA Director role is expected to independently own audit quality assurance activities and execute timely deliverables, regionally and nationally, while also contributing to the advancement of departmental objectives.\n\nEssential Job Functions:\nOversee two Regional Quality Assurance Directors and support staff (~30)\nAssure that all laboratories are operating under QMSs that assure compliance with regulatory requirements for the affected labs and assure that data produced by each laboratory meets the needs of Enthalpy’s customers\nWork toward harmonization of QMSs where appropriate. Assure that all QMSs meet minimum levels of specificity, are current regarding ongoing updates, and that each QAU is engaging in activities that result in continual improvement for their laboratory.\nDesign and implement improvements in data quality and operational efficiency in quality management systems\nVerify QA groups operate independently from production and financial pressures that might impact data quality.\nDesign and implement training for QA personnel\nManage ethics and data integrity training program\nAssure that each laboratory is compliant with corrective action and preventive action plans and timelines.\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned\n\nRequirements/Education:\nBachelor's degree or equivalent and relevant formal academic / vocational qualifications.\nMinimum of five years’ experience as a Quality Manager or QA Director\n\nPreferred Skills:\nGood working knowledge of scientific terminology, analytical procedures, and/or research concepts\nGood knowledge of software used in word processing, spreadsheets, table and graph and portable document file (pdf) generation\nUnderstand the basic functions of a LIMS\nCollaboration and team building skills\nWorking knowledge of analytical laboratory procedures\nWorking knowledge of industry regulations, ISO 17025/GLP/OECD or other regulated environments\nEffective written and oral communication skills\nDetail oriented\nTime management skills\nGood editorial and proofreading skills\nGood problem solving and troubleshooting abilities\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.",
    "slug": "national-qa-director-056a884a-756c-4e95-b293-79f001578d6a",
    "benefits": [
      "Disability insurance",
      "Tuition reimbursement",
      "401(k)",
      "Parental leave"
    ],
    "selectedSkills": [
      "Word processing",
      "Laboratory procedures",
      "Research",
      "GLP",
      "Communication skills",
      "Bachelor's degree"
    ],
    "jobType": "free",
    "applyURL": "https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-NC-Durham-Capitola-Drive/National-QA-Director_R2030?mode=job&iis=Job+Board&iisn=Indeed.com"
  },
  {
    "position": "Chief Equity Officer (Deputy Director, NS)",
    "labName": "Office of Cannabis Management",
    "location": "Albany, NY",
    "age": "7 days ago",
    "type": "Full-time",
    "jobDescriptionCopy": "Bachelor’s degree and seven years of relevant experience or a comparable combination of education and/or experience in cannabis laws, regulations, and/or the history of cannabis enforcement in New York State with two years of experience at a managerial level.\n\nPreferred qualifications:\nIdeal candidates will have 3 years at a managerial level and demonstrate commitment to social justice, leadership skills, sound judgment, strong oral and written skills, and experience and willingness to collaborate with people who have diverse backgrounds, experiences, and roles in local and state affairs. Understanding of New York State government, geography and culture is preferred.\n\nDuties DescriptionReporting to the Executive Director, the Chief Equity Officer carries out the policy objectives of social and economic equity for the Office of Cannabis Management (Office). This effort involves identifying and engaging with communities that have been affected by the prohibition and criminalization of cannabis and linking them to education, resources, and technical assistance to provide opportunities in the regulated cannabis industry. The Chief Equity Officer will also assist in the development and implementation of the Office’s social and economic equity plan and defining communities disproportionally impacted by cannabis prohibition.\n\nDuties include, but are not limited to:\n\nReport to the Executive Director on all matters related to social and economic equity and work in consultation with the Cannabis Control Board as required by statute.\nAssist with the development and implementation of and ensure the Cannabis Control Board and the Office of Cannabis Management’s continued compliance with, the social and economic equity plan, required to be developed.\nEstablish public education programming dedicated to providing communities that have been impacted by cannabis prohibition with information detailing the licensing process and informing individuals of the support and resources that the office can provide to individuals and entities interested in participating in obtaining licensure.\nCoordinate with the Economic Development and Equity Unit and other state agencies such as empire state development to provide access to financial capital, including a small business revolving loan fund, low or zero interest loans, capital development programs and exposure and vetting of private venture firms.\nProvide reports to the board on an annual basis, of the activities in ensuring compliance with the social and economic equity plan. The Board will present these reports to the Governor and Legislature.\nIn consultation with the Board and the Executive Director, assist with the promulgation of any and all necessary rules and regulations governing the cultivation, manufacture, processing, transportation, distribution, testing, delivery and sale of medical cannabis, adult-use cannabis, and cannabinoid hemp and hemp extract, including but not limited to the registration of organizations authorized to sell medical cannabis, licensing and/or permitting of adult-use cannabis cultivators, processors, cooperatives, microbusiness, distributors, laboratories, and retailers, and the licensing of cannabinoid hemp and hemp extract producers and processors.\nIn consultation with the Board and the Executive Director create a social responsibility framework agreement that fosters racial, ethnic, and gender diversity in the workplace and make the adherence to such agreement a conditional requirement for license renewal.\nWork collaboratively with the communications unit on timely updates to the Office of Cannabis Management’s website content and publications relating to opportunities for social and economic equity applicants.\nCoordinate with the Office of Cannabis Management’s intergovernmental and public affairs units to conduct follow-up activities raised at forums, events and questions received to the Office.\nAnalyze program data from surveys to recommend opportunities for program improvement.\nProvide verbal and written communications to internal and external stakeholders, including but not limited to, practitioners, patients and registered organizations with inquiries pertaining to the Program.\nPresent at forums and public events about the Office of Cannabis Managements social and economic equity program and, track follow-up activities on issues raised at forums.\nAdditional CommentsWork location and telecommuting opportunities to be discussed at interview. All Office of Cannabis Management (OCM) employees are required to be tested weekly for COVID-19 unless they are fully vaccinated. Employees who are vaccinated must provide proof of vaccine status through a secure online portal. Salary will be commensurate with experience. Positions located in NYC will receive an annual downstate adjustment payment of $3,026 in addition to the regular salary.\n\nWe offer a comprehensive benefits plan, which includes:\n\nLow-cost and competitive health insurance plan choices\nDental & vision insurance at no additional cost\nMembership in the NYS Retirement System\nDeferred Compensation Investment Plan\nMinimum of 13 vacation days per year\nUp to 13 days of paid sick leave annually for PEF/CSEA\nUp to 8 days of paid sick leave annually for M/C\n5 days of personal leave per year\n13 paid holidays per year\nTuition reimbursement\nPublic Service Loan Forgiveness (PSLF)\nTraining & development opportunities",
    "slug": "chief-equity-officer-deputy-director-ns-7574dbef-c931-48bd-b448-8716b8bc9b1a",
    "benefits": [
      "Paid time off",
      "Dental insurance",
      "Paid sick time",
      "Health insurance",
      "Loan forgiveness"
    ],
    "selectedSkills": ["Leadership", "Bachelor's degree"],
    "jobType": "free",
    "applyURL": "https://statejobs.ny.gov/employees/vacancyDetailsView.cfm?id=104079#jobspecifics"
  },
  {
    "position": "Client Services Manager",
    "labName": "Montrose Environmental Group, Inc.",
    "location": "Richmond, VA",
    "age": "6 days ago",
    "type": "Full-time",
    "jobDescriptionCopy": "ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow. We should update this, MEG is up to 2500 employees\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of 10 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nWe are looking for a Client Services Manager with strong technical and industry knowledge to join our growing and dynamic laboratories. This on-site Client Service Manager will lead our client service team of experienced laboratory project managers (PM) at our Richmond, VA environmental laboratory. They are responsible for contributing and implementing the company’s strategic plan.\n\nAs a key member of the Project Management team, this role will be responsible for a full range of activities including:\n\nGrow and guide PMs and sample receiving teams by promoting teamwork, ownership and exceptional customer service\nSolving client challenges and building a strategic vision that is best for our customers and operation\nWorking closely with the Business Development and Proposal teams to grow the existing customer base and identify new business opportunities\nCollaborating and communicating effectively with the clients as well as the field services team to ensure that client’s laboratory and logistical needs are met\nReviewing the efficiency of staff resources with other managers as well as provide and implement process improvements\nHiring, training, coaching and performing annual performance reviews of Client Services department, including PM and sample receiving\nProviding technical resources to both external and internal clients\nEnsuring that the PM team performs all tasks within the required timeline and meet project driven turnaround time goals\nPromoting a positive and collaborative culture between the PMs, business development group and operations\nExhibiting exemplary leadership model that supports overall company’s success\nAble to provide supervisory oversight on-site, Monday through Friday\nWorking closely with the Lab Director in developing annual budgets and initiatives\nComply with Enthalpy’s Health and Safety Plan and other company policies\nAble to review data, and ability to finalize/approve Certificates of Analysis\nOther duties, as assigned by the Laboratory Director\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nBachelor’s Degree in Chemistry, Biology or a related science field\nMeet the qualifications of a Project Manager II/Senior Project Manager\nMinimum of seven (7) years of technical and customer service experience, in the environmental field\nMust be able to work on-site\n\nPreferred Skills\n\nExcellent customer service, communication, problem solving, and negotiation skills are required\nHigh degree of initiative and independent execution\nStrong written & verbal communication\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.",
    "slug": "client-services-manager-96a05afd-92df-4692-a0c6-2246058e4f51",
    "benefits": [
      "Disability insurance",
      "Tuition reimbursement",
      "401(k)",
      "Parental leave"
    ],
    "selectedSkills": [
      "Customer service",
      "Negotiation",
      "Laboratory experience",
      "Communication skills",
      "Bachelor's degree"
    ],
    "jobType": "free",
    "applyURL": "https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-VA-Richmond-Reymet-Rd/Client-Services-Manager_R2025?mode=job&iis=Job+Board&iisn=Indeed.com"
  },
  {
    "position": "ICP-MS Laboratory Chemist - Cannabis Testing",
    "labName": "Hunter Care Health",
    "location": "Oklahoma City, OK",
    "age": "6 days ago",
    "type": "Full-time",
    "salaryMin": "$43,000 ",
    "salaryMax": " $60,000 a year",
    "jobDescriptionCopy": "Job Title: ICP-MS Laboratory Chemist\n\nJob Type: Full Time\n\nResponsibilities:\nThe ICP-MS Laboratory Chemist will be responsible for processing and analyzing samples to provide information on compounds or quantities of metals present in samples using a variety of analytical instrumentation. Should be a subject matter expert on analysis of metals using ICP-MS.\n\nEssential Job Duties Include:\n\nSubject matter expert on analysis of heavy metals using ICP-MS, including microwave digestion procedures and routine instrument maintenance.\nFamiliarity with HPLC, GC-MS, LC-MS/MS is preferred.\nResponsible for sample preparation, instrument operation, instrument troubleshooting, and data analysis.\nPrepare and analyse samples from cannabis products to meet the rules and regulations governing medical marijuana testing in the State of Oklahoma.\nPrepare chemical solutions for use in processing samples following standardised formulas or experimental procedures.\nDocument quality control and scheduled maintenance activities.\nDemonstrates basic knowledge of laboratory quality control and assurance procedures in compliance with ISO regulations.\nResponsible for testing, calibrating, and performing quality control tests on lab equipment.\nPromotes a positive & safe work environment through understanding of safety (OSHA) regulations, practices, and procedures.\nFollows all company policies and laboratory procedures to ensure product integrity and quality control.\nWorks with laboratory information management system (LIMS).\nReports directly to the laboratory manager.\nWilling to meet on-call obligations as needed.\nKnowledge, Skills and Abilities:\n\nExperience with ICP-MS\nBachelors of Science in analytical chemistry or chemistry related science.\nIndustrial chemistry lab experience using a variety of analytical techniques and instrumentation. GLP experience preferred.\nExcellent communication skills (listening, verbal, and written) and driven with strong organizational and teamwork skills.\nSpecial Requirements:\n\nValid Driver’s License\nMust be able to legally work in the United States.\nPhysical Requirement:\n\nAble to lift/carry up to 25 pounds.\nAbility to bend at the waist, squat.\nAbility to work with hands, see, and hear.\nConditions of Employment:\n\nContingent upon a favorable background check.\nContingent on passing a pre-employment drug screen.\nMust maintain a valid driver’s license.\nThe above primary duties, responsibilities, and position requirements are not all inclusive.",
    "slug": "icpms-laboratory-chemist-cannabis-testing-0e2bea1e-671c-4fdc-b730-e502e5baeeb0",
    "benefits": [],
    "selectedSkills": [
      "Driver's License",
      "GLP",
      "High-performance liquid chromatography",
      "OSHA",
      "Laboratory experience",
      "Bachelor of Science",
      "Bachelor's degree",
      "Pass drug screening",
      "US work authorization",
      "Background check"
    ],
    "jobType": "free",
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=mshBIPmPmsBa2KzUz67tJcWcU0RwrD6VGneGJAm3i0_oaoY-qCE4uw"
  },
  {
    "position": "Cannabis Extraction Technician",
    "labName": "Kaycha Labs",
    "location": "Denver, CO",
    "age": "17 hours ago",
    "type": "Part-time",
    "salaryMin": "$21.63 an hour",
    "jobDescriptionCopy": "Company Overview:\n\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\n\nJob Purpose:\n\n\nThe Lab Technician, Level I is responsible for working closely with our laboratory team to develop analytical skills and related experience. This position consists of many aspects from homogenizing, weighing and extracting samples, performing quality control checks, verifying various support equipment and properly disposing of all waste.\n\n\nEssential Duties & Responsibilities:\n\n\nExecute laboratory protocol and procedures under the supervision of the Lab Director.\nRegularly display good laboratory technique to avoid cross-contamination or misidentified samples.\nPerform sample preparation procedures including homogenization, weighing and liquid extraction.\nPerform QC duties as assigned, including LCS and matrix spikes.\nPerform qualitative and quantitative tests, as assigned.\nUtilize the LIMS system to create batches, enter sample prep information and maintain physical and electronic records.\nAdhere to ISO 17025 standards as well as state regulatory requirements.\nPromote a strong customer service culture while adhering to the highest safety and industry standards.\nOther duties and/or special projects as assigned.\n\nSkills, Abilities and Competencies:\n\n\nAbility to maintain an incredibly high degree of attention to detail and accuracy.\nStrong agility, engagement, and flexibility in an ever-changing environment.\nWorking knowledge of logging, organizing, and analyzing data.\nAbility to work in a dynamic, fast-paced deadline environment while successfully managing multiple tasks.\nStrong knowledge of Microsoft Office, including Excel, PowerPoint, and Word.\nWorking knowledge of standard laboratory protocol.\nExcellent communication skills and ability to effectively work, problem solve, and communicate with multiple levels of the organization.\n\nEducation & Experience:\n\n\nMinimum of Bachelor’s degree in chemistry, biochemistry or related field based on state requirements.\n0-1 year of lab experience.\nKnowledge of principles, terminology, practices, techniques commonly used in a laboratory setting preferred.\nExposure to the cannabis industry is a plus.\n\nOther:\n\n\nMust pass Level 2 background check.\nMust be at least 21 years old.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status\n\nJob Type: Part-time\n\n\nPay: $21.63 per hour\n\n\nBenefits:\n\n\nPaid time off\n\nSchedule:\n\n\n8 hour shift\nDay shift\nMonday to Friday\n\nCOVID-19 considerations:\nFace masks required.\n\n\nApplication Question(s):\n\n\nDo you have any lab experience?\nWhat is your desired compensation?\n\nEducation:\n\n\nBachelor's (Preferred)\n\nWork Location: One location\n",
    "slug": "cannabis-extraction-technician-1480a1e3-ec97-4f80-809a-80e4f85a4156",
    "benefits": [
      "Dental insurance",
      "Health insurance",
      "Paid time off",
      "Vision insurance"
    ],
    "selectedSkills": [
      "Analysis skills",
      "Microsoft Excel",
      "Microsoft Powerpoint",
      "Laboratory experience",
      "Communication skills",
      "Bachelor's degree",
      "21 years or older",
      "Background check"
    ],
    "jobType": "free",
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=B-FoMnUZMIYmp4lgY0JDhT-R-f_4Jl8ECgqXmFcQxvC2uZmpKFHlqA"
  },
  {
    "position": "Lab Distillation Technician",
    "labName": "Arvida Labs LLC.",
    "location": "Fort Lauderdale, FL",
    "age": "7 days ago",
    "type": "Full-time",
    "salaryMin": "$16 ",
    "salaryMax": " $25 an hour",
    "jobDescriptionCopy": "At Arvida Labs, we are coordinating a hard-working and exciting team to operate and scale-up our production processes in a compliant and efficient manner. This business is growing fast, and there is opportunity for higher levels of responsibility as performance standards are met. We value incredible people with incredible skills, but your commitment to a greater cause is what we value most.\n\n\nPosition:\n\n\nThis position will work in multiple processes in the production lab to create hemp-derived cannabinoid products. This role will be responsible for duties including distillation, reactions, analytical testing, and production of other products as needed. This role operates in a fast-paced environment to accomplish larger production goals with the rest of the team. Employee should be aware of, and able to maintain GMP regulations and handle food products in a sanitized workspace. Person must be highly motivated and capable of multitasking.\n\n\nDuties:\n\n\nEffectively fulfill duties by GMP compliant standards\nManage inventories by following the production plan and maintain accurate records\nWork efficiently in a team environment\nCarefully follow SOP’s (Standard Operating Procedures)\nHandle sensitive glassware and solvents\nIdentify and report dysfunctional equipment\nSolve or report issues relating to production efficiency\nOperate attentively and follow facility protocols and standards\nMaintain a proactive behavior around the manufacturing facility.\nDevelop expertise in distillation, testing, and formulating methods of various cannabinoid compounds.\nOperate, clean, and maintain laboratory equipment. Perform corrective and preventative maintenance on associated equipment as required.\nEnsure compliance and accuracy involving all product tracking, product security, and product movement procedures.\nPerform in-process and post-process quality assurance sampling, testing, and visual inspections to ensure all products meets or exceeds Arvida Labs’ specifications, along with patient and customer expectations. Such quality assurance work shall include, but not limited to:\nRecord and monitor process conditions to ensure compliance to standard operating procedures.\nProper weighing, data recording, and batch tracking throughout our process.\n\nRequired Experience/ Capabilities:\n\n\nQuality control\nKeeps a clean, pristine and organized work environment\nAble to prioritize\nFollows directions with a positive attitude\nDemonstrates interpersonal skills, professionalism, flexibility and teamwork.\n\nOur culture can be described as:\n\n\nDetail-oriented -- quality and precision-focused\nOutcome-oriented -- results-focused with strong performance culture\nTeam-oriented -- cooperative and collaborative\n\nQualifications\n\n\nBachelor's (Preferred)\nExperience: The ideal candidate will have at least one (1) to three (3) years of experience in manufacturing or laboratory environments in the food, pharmaceutical industries, or cannabis industries. Experience with short path and wiped film distillation is preferred.\n\nArvida Labs, LLC provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age disability or genetics. We value diversity, military service, and law enforcement experience. Compensation is competitive and will be commensurate with experience.\n\n\nJob Type: Full-time\n\n\nPay: $16.00 - $25.00 per hour\n\n\nBenefits:\n\n\nEmployee discount\nHealth insurance\nPaid time off\n\nSchedule:\n\n\nMonday to Friday\nNight shift\n\nCOVID-19 considerations:\nPersonal protective equipment provided. Sanitizing, disinfecting, and cleaning procedures in place.\n\n\nExperience:\n\n\nResearch & Development Laboratory Technicians: 1 year (Preferred)\n\nWork Location: One location\n",
    "slug": "lab-distillation-technician-98c8243c-56f3-4e11-941f-f4682bd1382c",
    "benefits": ["Employee discount", "Health insurance", "Paid time off"],
    "selectedSkills": [
      "Manufacturing",
      "Research",
      "Sanitation",
      "Law enforcement",
      "Laboratory experience",
      "Bachelor's degree"
    ],
    "jobType": "free",
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=F1IsUCVPSptFLnKPPA5j271Dtz6_oGZ0mAJzgOL0F11c85Pa1pmb8A"
  },
  {
    "position": "QA Associate",
    "labName": "Method Testing Laboratories",
    "location": "Tampa, FL",
    "age": "4 days ago",
    "type": "Full-time",
    "jobDescriptionCopy": "Summary: A well-capitalized analytical testing laboratory in the hemp and cannabis industry is seeking a professional and experienced Quality Assurance Associate. This position will be located in Tampa, FL, and will report to the Director, Quality Assurance Director. As a Quality Assurance Associate, the position works to ensure that laboratory testing data is accurate, verifiable, and reproducible.\n\n\nResponsibilities:\n\n\n1. Auditing laboratory processes to ensure both internal and external regulations and standards are being adhered to.\n\n\n2. Ensuring internal auditing activities and laboratory documentation is kept up to date.\n\n\n3. Review documentation to ensure company processes comply.\n\n\n4. Train laboratory staff on quality procedures, protocols, and documentation.\n\n\n5. Maintain Quality Assurance documentation.\n\n\n6. Write and update existing Standard Operating Procedures (SOPs) for stakeholders.\n\n\n7. Investigate and review root causes and corrective actions taken by stakeholders.\n\n\n8. Review raw test data and assemble associated data packages.\n\n\n9. Review and approve data in a Laboratory Information Management System.\n\n\n10. Lead and participates in training and continuous improvement projects\n\n\n11. Stays current with developments in the field, read technical publications, and participate in educational opportunities\n\n\n12. Ensure a culture of safety in the laboratory.\n\n\n13. Strong communication skills, capable of communicating ideas and motivating colleagues\n\n\n14.. Other duties as assigned or requested\n\n\nQualifications:\n\n\n1. Must have a minimum of two (2) years of experience in Quality Assurance in a regulated industry.\n\n\n2. Proficient with Microsoft Office software, Adobe, and Laboratory Information Management System software.\n\n\n3, Ability to prioritize tasks and maintain a strong work ethic\n\n\n4. Possess exceptional attention to detail\n\n\n5. Must have a bachelor’s degree in natural science, including biology, chemistry, physics, engineering, or environmental sciences\n\n\n6. Must be willing to be subjected to a state required background check.\n\n\nJob Type: Full-time\n\n\nPay: From $43,000.00 per year\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\nMonday to Friday\n\nExperience:\n\n\nQA/QC: 2 years (Preferred)\n\nShift availability:\n\n\nDay Shift (Preferred)\n\nWork Location: One location\n",
    "slug": "qa-associate-00001229-8997-4da1-b42b-6b0b8f811e4c",
    "benefits": [
      "Dental insurance",
      "Health insurance",
      "Paid time off",
      "Vision insurance",
      "Life insurance"
    ],
    "selectedSkills": [
      "QA/QC",
      "Quality assurance",
      "Communication skills",
      "Microsoft Office",
      "Bachelor's degree",
      "Background check"
    ],
    "jobType": "free",
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=0nnUgjsAf296hyV1f6BlFyUFR5LfWkxdQdOE6BtUHQpUC17E1tlrZA"
  },
  {
    "position": "Laboratory Director (Cannabis)",
    "labName": "Trusted Human Capital",
    "location": "Boston, MA",
    "age": "4 days ago",
    "type": "Full-time",
    "salaryMin": "$110,000 ",
    "salaryMax": " $140,000 a year",
    "jobDescriptionCopy": "Laboratory Director needed in MA, third-party analytical Cannabis testing lab.\n\n\nThird-party testing lab experience required\nMaster's degree or advanced degree required\nCannabis testing experience or related field required\n\nPlease reach out for additional and specific information on this opportunity.\n\n\nJob Type: Full-time\n\n\nPay: $110,000.00 - $140,000.00 per year\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nParental leave\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\n\nSupplemental Pay:\n\n\nBonus pay\nSigning bonus\n\nEducation:\n\n\nMaster's (Preferred)\n\nExperience:\n\n\nThird-party lab: 2 years (Preferred)\nAnalytical Cannabis Chemsitry: 2 years (Required)\n\nWork Location: One location\n",
    "slug": "laboratory-director-cannabis-977fd5f1-a42e-4ad1-b426-fc05addd887e",
    "benefits": [
      "Dental insurance",
      "Health insurance",
      "Paid time off",
      "401(k)",
      "Vision insurance"
    ],
    "selectedSkills": [
      "Laboratory experience",
      "Master's degree",
      "US work authorization"
    ],
    "jobType": "free",
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=YrTP6wZQRUL2g6PuQE2hD8hEMVzNzKyEUtxbcH6mbxbDtB7F5lWz-Q"
  },
  {
    "position": "Laboratory Technician",
    "labName": "ProForma Labs",
    "location": "Salinas, CA",
    "age": "5 days ago",
    "type": "Full-time",
    "salaryMin": "$40,000 ",
    "salaryMax": " $56,000 a year",
    "jobDescriptionCopy": "Lab Technician\n\n\nABOUT US:\n\n\nWe are a Quality Control Laboratory organized to support the Cannabis Industry with a focus on executing the mandated testing set forth by the Department of Cannabis Control regulations.\n\n\nWe work in a highly regulated industry that requires close adherence to rules & regulations set forth by the state. We are an equal opportunity employer who are dedicated to providing a safe, professional, and productive work environment for our team members.\n\n\nWe are actively looking for a motivated and energetic individual to join our team in Salinas CA to be a part of our dynamic team with a ground floor opportunity to work within a progressive lab in the Monterey and Santa Cruz area with a great potential for future advancement. Given the fast-paced cross-discipline environment of our lab, the Laboratory Technician will have a strong interest and background in science, can communicate effectively, and supports the values of our organization.\n\n\nThe next laboratory team member:\n\n\nThe Lab Technician will serve two critical roles within the organization. The primary role will be to play an influential part in our sample intake department. This position will employ various techniques that vary from use of standard laboratory equipment to using highly modern instrumentation. The skill sets developed by training with the team require dedicated attention to detail and a foundational understanding of scientific principles.\n\n\nDuties and Responsibilities:\n\n\nFollows procedures for logging samples into LIMS and accessioning of samples for analysis.\nContributes to monitoring and maintaining inventory for general laboratory consumables, solvents, internal standards, and hazardous waste.\nAssures proper verification and function of various analytical equipment.\nRegularly display good laboratory technique to avoid cross-contamination or misidentified samples.\nPerform sample preparation and complete QC duties, as assigned.\nPerform routine and non-routine maintenance and verification on various instruments, as assigned.\nMaintain physical and electronic records.\n\nKnowledge, Skills, and Abilities:\n\n\nAdheres to current Good Laboratory Practices (GLP)\nStrong understanding of standard laboratory protocol.\nExcellent organization, multitasking, data analysis skills.\nDemonstrated excellence in working with groups with diverse backgrounds and communicating effectively in a collaborative small team environment.\nProficiency with Microsoft Office (Emphasis on Excel, Word, and SharePoint).\nAptitude to maintain a very high level of attention to detail and accuracy.\n\nEducation and Experience:\n\n\nRequired:\n\n\nMust be 21 years old\nCompleted 2 years of college or university education that included coursework in biological, chemical, agricultural, environmental, or related sciences from an accredited college or university, plus at least 3 years of full-time practical experience. Knowledge of principles, terminology, practices, techniques, and instrumentation commonly used in a laboratory setting.\nMust be able to lift/ move items up to 35lbs.\nMust be able to stand/sit for extended periods of time.\n\nPreferred:\n\n\nAt least two (2) years of relevant work experience in USDA, FDA, EPA, NELAC, or other regulatory frameworks.\nBS. In Chemistry, Biochemistry, Biology, or related discipline.\n\nAdditional Details:\n\n\nThis position is full-time hourly with opportunities for overtime\nEmployees are expected and encouraged to assist in cross-department training/duties as needed.\nBenefit package includes paid time off, holidays, and a company sponsored health insurance plan.\n\nWork Environment:\n\n\nReasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nThe analytical laboratory environment is one in which potential health hazards do exist. Administrative, operations, technical, and professional staff are expected to safely operate in accordance with applicable and appropriate health and safety policies and procedures, as prescribed by the applicable manuals and policies and/or federal, state, or local standards.\n\n\nLaboratory staff can be expected to work in areas where hazards associated are with, but not limited to, airborne pathogens, corrosive, and flammable materials.\n\n\nAppropriate training is provided regarding these hazards and staff are expected to always adhere to all health and safety policies, whether they are in writing or verbalized by a supervisor\n\n\nJob Type: Full-time\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\nWeekend availability\n\nApplication Question(s):\n\n\nPlease list any analytical instruments you've previously worked with in the past (identify manufacturer if possible).\n\nExperience:\n\n\nLaboratory experience: 1 year (Preferred)\n\nWork Location: One location\n",
    "slug": "laboratory-technician-931c81d4-ebab-4405-b1cf-e9c8d1de9e1f",
    "benefits": [
      "Dental insurance",
      "Health insurance",
      "Paid time off",
      "Opportunities for advancement",
      "Vision insurance"
    ],
    "selectedSkills": [
      "Microsoft Excel",
      "SharePoint",
      "FDA regulations",
      "Laboratory experience",
      "Data analysis skills",
      "Bachelor of Science",
      "Bachelor's degree",
      "21 years or older"
    ],
    "jobType": "free",
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=pbtQWtBW4Ei-KiRia93BY8dE13MEE3ABn0_AS4SXCkCDVoFj34qmzg"
  },
  {
    "position": "Laboratory Analyst",
    "labName": "ProForma Labs",
    "location": "Salinas, CA",
    "age": "5 days ago",
    "type": "Full-time",
    "salaryMin": "$39,000 ",
    "salaryMax": " $54,000 a year",
    "jobDescriptionCopy": "Laboratory Analyst\n\n\nABOUT US:\n\n\nWe are a Quality Control Laboratory organized to support the Cannabis Industry with a focus on executing the mandated testing set forth by the Department of Cannabis Control regulations.\n\n\nWe work in a highly regulated industry that requires close adherence to rules & regulations set forth by the state. We are an equal opportunity employer who are dedicated to providing a safe, professional, and productive work environment for our team members.\n\n\nWe are actively looking for a motivated and energetic individual to join our team in Salinas CA to be a part of our dynamic team with a ground floor opportunity to work within a progressive lab in the Monterey and Santa Cruz area with a great potential for future advancement. Given the fast-paced cross-discipline environment of our lab, the Laboratory Analyst will have a strong interest and background in science, can communicate effectively, and supports the values of our organization.\n\n\nThe next laboratory team member:\n\n\nThe primary role of the Laboratory Analyst will be to work along side our Lead Chemist and Laboratory Director to perform chemical analysis for state mandated regulatory testing. The individual will utilize laboratory derived standard operating procedures and will employ various techniques that vary from use of standard laboratory equipment to using advanced instrumentation and methodology. The individual will be primarily responsible for analysis on HPLC and GCMS with the opportunity for training on various other laboratory instruments.\n\n\nDuties and Responsibilities:\n\n\nPerform analysis of our validated methods such as: pesticides, mycotoxins, residual solvents, cannabinoids, heavy metals and terpenes per company SOPs.\nMaintain excellent organization & document the current inventory of certified reference materials, reagents, consumables, and other laboratory supplies applicable to the mass spec assays.\nMaintain proper custodianship of instruments, including gases, mobile phases, preventative maintenance, & spearhead service requests from the manufacturer as needed.\nAuthorship of technical reports, and compliance documents.\nMaintain, troubleshoot, and repair instruments as needed.\nInterface with manufacturers to perform preventative maintenance and performance qualification of instruments on a regular basis.\nInterface with coworkers, including the Laboratory Director, efficiently through app-based communication tools for efficient lab processes (including chat, channel & message board features). Installation of Microsoft Outlook on employee portable device (phone or tablet) is required.\nStrive for excellence in quality systems documentation. Maintain records with precision and accuracy.\nDemonstrate flexibility in a fast-paced environment prone to change. Be a team player, strive for synergy and productivity in the laboratory. Problem-solve with a positive attitude.\n\nKnowledge, Skills, and Abilities:\n\n\nExperience with variety of analytical techniques\nExperience working in a high-throughput commercial laboratory preferable.\nExpertise in chromatographic techniques including HPLC, LCMS and GCMS. Preference given to candidates with direct experience using Shimadzu hardware and software.\nKnowledge of Quality System Management including as related to ISO 17025 and/or TNI 2009.\nAbility to maintain SOPs within a document control system.\nAbility to learn and implement new software, such as LIMS.\nWillingness to perform tasks outside of defined job description to support the team.\nAbility to collaborate, problem solve, and strategize with team members.\nAbility & willingness to utilize modern app-based communication tools effectively.\nAbility to work effectively in fast-paced laboratory environment with multiple tasks at hand; weekend flexibility a plus.\nDemonstrated excellence in working with groups comprised of diverse backgrounds and communicating effectively in a collaborative small team environment.\n\nEducation and Experience:\n\n\nRequired:\n\n\nMust be 21 years old\nCompleted 2 years of college or university education that included coursework in biological, chemical, agricultural, environmental, or related sciences from an accredited college or university, plus at least 3 years of full-time practical experience. Knowledge of principles, terminology, practices, techniques, and instrumentation commonly used in a laboratory setting.\nMust be able to lift/move items up to 35lbs.\nMust be able to stand/sit for extended periods of time.\n\nPreferred:\n\n\nBS in Chemistry, Biochemistry, Biology, or related discipline.\nAt least two (2) years of relevant work experience in USDA, FDA, EPA, NELAC, or other regulatory frameworks.\n\nAdditional Details:\n\n\nEmployees are expected and encouraged to assist in cross-department training/duties as needed.\nBenefit package includes paid time off, holidays, and a company sponsored health insurance plan.\n\nWork Environment:\n\n\nReasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nThe analytical laboratory environment is one in which potential health hazards do exist. Administrative, operations, technical, and professional staff are expected to safely operate in accordance with applicable and appropriate health and safety policies and procedures, as prescribed by the applicable manuals and policies and/or federal, state, or local standards.\n\n\nLaboratory staff can be expected to work in areas where hazards associated are with, but not limited to, airborne pathogens, corrosive, and flammable materials.\n\n\nAppropriate training is provided regarding these hazards and staff are expected to always adhere to all health and safety policies, whether they are in writing or verbalized by a supervisor\n\n\nJob Type: Full-time\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\nWeekend availability\n\nApplication Question(s):\n\n\nPlease list any analytical instruments you've previously worked with in the past (identify manufacturer if possible).\nWhat is your desired/expected salary requirements?\n\nExperience:\n\n\nLaboratory: 1 year (Preferred)\n\nWork Location: One location\n",
    "slug": "laboratory-analyst-d908c0f1-06cc-4dd1-88e1-5d9acd513d75",
    "benefits": [
      "Dental insurance",
      "Health insurance",
      "Paid time off",
      "Opportunities for advancement",
      "Vision insurance"
    ],
    "selectedSkills": [
      "FDA regulations",
      "Laboratory experience",
      "EPA",
      "Bachelor of Science",
      "Bachelor's degree",
      "21 years or older"
    ],
    "jobType": "free",
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=m7jlGw3fBgY5dOPnB1w2vpq1EysvoPeFUP6GojzPEdP2rb_hqdK4Uw"
  },
  {
    "position": "Microbiologist I",
    "labName": "ProVerde Laboratories",
    "location": "Milford, MA",
    "age": "6 days ago",
    "type": "Full-time",
    "salaryMin": "$50,000 ",
    "salaryMax": " $55,000 a year",
    "jobDescriptionCopy": "Company Description:\n\n\nProVerde is an analytical testing and research laboratory comprised of dedicated scientists working on cutting edge and next-generation analysis methods. ProVerde provides analytical, consulting, and process development services for a wide range of consumer products including cannabis and hemp products, health and wellness supplements, and natural/botanical products. ProVerde is recognized and used internationally as a standard of excellence with one of the broadest accreditation scopes for services offered within the industry.\n\n\nProVerde Labs is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.\n\n\nTitle & Position Overview: Microbiologist I\n\n\nProVerde is seeking a highly motivated self-starter to join our laboratory team! The Microbiologist/Microbiological Technician position requires, but is not limited to, excellent manual dexterity and aseptic technique, efficient workload management, attention to detail in an ISO 17025 regulated environment, and excellent documentation skills. This position is intended for internal growth and professional development.\n\n\nEducation and Experience:\n\n\nMinimum of a bachelor’s degree in Microbiology, with 0-2 years of microbiological experience is required. Entry level candidates will be considered. Experience in a technical or life sciences field, production, industrial, agricultural, quality control, analytical laboratory, or cannabis products testing is highly desirable.\n\n\nJob Responsibilities:\n\n\nConducts work in a manner that is compliant with the Quality System and all ISO 17025 requirements.\nPrepare customer samples of all matrix types for analysis on various microbiological platforms.\nAnalyze and screen samples for microbiological contaminants such as total aerobic bacterial count, total coliform, total bile-tolerant gram-negative bacteria and total yeast and mold, salmonella and E. coli using system platforms such as the TEMPO and VIDAS technologies, plating methods, and DNA microarray system (PathogenDx).\nRecord and report sample results according to SOPs.\nOperate, maintain, and troubleshoot lab equipment including autoclaves, incubators, refrigerators, freezers, culture media, reagents, pipettes, or other related to microbiology.\nMaintain an organized and sterile microbiological lab area and monitor environmental conditions.\nPrepare microbiological reagents or culture materials.\nPrepare microbiological standards and evaluate system performance.\nParticipate in proficiency testing programs for national accreditation and standardization.\nValidate newly developed microbiological methods as needed.\nMaintain familiarity with applicable test methods and ensure all analyses are conducted in conformance with established methods and laboratory SOPs.\nAssist with proper sample and laboratory waste disposal according to appropriate regulations.\nMonitor inventory levels, order materials and supplies in accordance with procedures.\nIdentify process difficulties and propose solutions to manager. Review data per QC and technical requirements, discuss any outliers with manager.\n\nRequired Skills:\n\n\nBachelor’s degree in Microbiology, Biology, Biochemistry, Food Science, or related life science field\n0-2 years of experience with microbiology for quality control, analytical or production.\nFamiliarity with aseptic technique and the fundamental principles associated therein.\nStrong knowledge and experience with wet lab, organic lab, and microbiological lab techniques.\nDemonstrated ability to handle multiple tasks simultaneously working on a team or as an individual.\nAptitude to mentor team members and provide technical guidance.\nProficient in Microsoft Office particularly Excel and Word with the ability to summarize work for clients and management.\nDetail-oriented individual with positive demeanor. Highly competent as a member of a team.\nMust be able to work with minimal supervision and have excellent attention to detail with a high volume work load.\nMust maintain excellent attendance to ensure accurate culture results, with an ability to periodically work on weekends to maintain in-process bioreactors.\nStrong communication skills with team members, managers, and customers.\nDemonstrated experience learning or mastering a new skill or task with proficiency and expediency.\n\nDesired Skills:\n\n\n2+ years of laboratory experience in an analytical (biological, pharmaceutical, consumer products) or production setting.\n2+ years of regulated quality control experience and/or experience with quality control chemistry including sample handling.\nExtensive experience with PCR and ELFA techniques.\nStrong understanding of standardized test methods for microbiology (AOAC, BAM, USDA, FDA, EPA, etc).\nStrong aptitude for identifying microbial species based on observations, experience, and functional expertise.\nStrong aptitude for learning and continual growth. Ability to take on more responsibility and autonomy with increased experience.\nKnowledge of primer/probe and fluorescence chemistry for PCR techniques is preferable.\n\nJob Type: Full-time\n\n\nPay: $50,000.00 - $55,000.00 per year\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\n\nEducation:\n\n\nBachelor's (Preferred)\n\nWork Location: One location\n",
    "slug": "microbiologist-i-9154286a-461e-4d2b-b6f8-cf7a6b61cd10",
    "benefits": [
      "Dental insurance",
      "Health insurance",
      "Paid time off",
      "401(k)",
      "Vision insurance"
    ],
    "selectedSkills": [
      "Microsoft Excel",
      "PCR",
      "Laboratory experience",
      "Communication skills",
      "Microbiology",
      "Bachelor's degree"
    ],
    "jobType": "free",
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=zTHq9TNEoOoTVio2eeaCQdsncujZuqOL5MNv-UxvcA-D83ZJwX3dOg"
  },
  {
    "position": "Analytical Chemist, LCMS/MS",
    "labName": "Decano Analytical Laboratories, LLC.",
    "location": "Los Angeles, CA",
    "age": "5 days ago",
    "type": "Full-time",
    "salaryMin": "$50,000 ",
    "salaryMax": " $75,000 a year",
    "jobDescriptionCopy": "Overview\n\n\nThe Decano Analytical Laboratories, LLC. provides a broad range of testing and analytical services to a cannabis industry. We at the forefront of the testing services industry, building an enviable reputation. The Decano Analytical Laboratories, LLC. provides a diversified line of independent analytical services to a wide range of top-tier customers. Our diverse laboratories perform routine and specialty analytical testing for compliance, safety, certification and verification purposes.\nGeneral Accountability:\nThe primary purpose of this position is to prepare, analyze and evaluate samples using HPLC, LC/MS/MS and to report data for release to clients and regulatory bodies. Knowledge of computers and mathematics are required. Ability to work independently is preferred. Duties will include maintenance of instruments and development of new methods.\nResponsibilities\n\n\nSpecific Responsibilities:\n\n\nPrepare and analyze samples for LC/MS;\nResponsible for meeting calibration and QA requirements;\nDocument activities and report results in a concise and accurate manner using LC/MS software LIMS;\nCoordinate with other laboratory analysts;\nPerform routine instrument maintenance procedures;\nPeer review HPLC and LC/MS data;\nReport data and review reported results;\nOther duties as assigned.\n\nRequired Knowledge, Skills & Abilities:\n\n\nPossess a general knowledge of chemistry fundamentals and the ability to perform concentration and solution calculations; ability to understand terminology and principals in order to comply with analytical methods;\nPossess strong computer skills with knowledge in Excel and Microsoft Word; experience with or ability to learn industry specific software such as Agilent Masshunter and OpenLab CDS\nOrganized, detail oriented, and possess excellent problem solving capabilities; be able to work independently of supervision and work well with other analysts on the team;\nAbility to work overtime when necessary to meet the Decano Analytical Laboratories needs.\n\nJob Type: Full-time\n\n\nSalary: $50,000.00 - $75,000.00 per year\n\n\nSchedule:\n\n\n8 hour shift\n\nAbility to commute/relocate:\n\n\nLos Angeles, CA 90040: Reliably commute or planning to relocate before starting work (Preferred)\n\nEducation:\n\n\nMaster's (Preferred)\n\nExperience:\n\n\nCGMP: 1 year (Preferred)\n\nWork Location: One location\n",
    "slug": "analytical-chemist-lcmsms-1d14da8c-28f8-424a-ad36-2c8b119e3d2a",
    "benefits": [],
    "selectedSkills": [
      "Microsoft Excel",
      "Computer skills",
      "CGMP",
      "Microsoft Word",
      "Master's degree"
    ],
    "jobType": "free",
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=TL9AkCkxm0acKKInH3-33-piJzwKNh38HsuENxaflMr35TcZZcaDCg"
  },
  {
    "position": "Lab Technician",
    "labName": "Organic Remedies",
    "location": "Chaffee, MO",
    "age": "5 days ago",
    "type": "Full-time",
    "salaryMin": "$31,000 ",
    "salaryMax": " $45,000 a year",
    "jobDescriptionCopy": "Organic Remedies Extraction Technician to support our extraction and production operations. You should be very technically astute in mechanical, electrical, and computer operated systems utilized in production/manufacturing environments. You need to be proactive, quick thinking and innovative in your approach.\n\nKey Duties and Responsibilities:\n\nPreparation of equipment and plant materials for extraction\nExecution of extraction and processing in accordance with state regulations and company standard operating procedures\nEnsure consistency and efficiency of product through quality control testing and procedures\nCleaning and maintenance of extraction equipment and manufacturing facility\nMaintaining strict inventory records of all plant materials, chemicals, and equipment used in work area\nOversee day-to-day operations of the entire extraction space beginning with storing the raw cannabis through the extraction process and all the way to fulfillment of orders\nOperating, maintaining, extraction equipment\nStoring supplies and equipment and disposal of waste according to guidelines\nComplete the cleaning and sanitization of all production equipment, work surfaces, and tools\nMaintaining inventory records of supplies, materials, and equipment and preparing requisitions as needed\nFollowing all standard operating procedures regarding product creation and lab safety\nAssist in packaging and labeling of finished products\nWorks with testing laboratory as defined by state guidelines\nProduction of infused products\nAll other duties as assigned\nPOSITION REQUIREMENTS\n\nSKILLS AND QUALIFICATIONS:\n\nBachelor's or Associate degree or its equivalent, from a recognized college or university, with a major in chemistry or biology preferred\n1 year of lab experience\nUnderstanding of state and local laws\nUnderstanding of proper and safe handling of hazardous materials\nFamiliarity with separations, isolations and fractionation\nKnowledge of solvent and non-solvent extraction methods\nStay current of practices and new developments in the cannabis extraction industry\nAbility to work quickly without compromising accuracy\nAbility to discern the quality of plant material and finished products\nStrong computer and social skills\nPHYSICAL REQUIREMENTS:\n\nMust be able to push, pull, move, and/or lift a minimum of 25lbs to a minimum height of 5 feet and able to push, pull, move, and/or carry such weight a minimum distance of 50 feet, with or without mechanical assistance\nMust be able to work seated/standing as appropriate at workstations for extended periods of time, maintain body equilibrium while climbing ladders, stairways, stopping, kneeling, crouching, and reaching, and use hands/fingers to hold, grasp, turn, pick, pinch frequently/constantly to complete tasks\nMust be able to handle organic matter daily, able to wear PPE as appropriate (eye, face, hand, arm, head, foot, body, fall protection), and able to be exposed to hot, cold, wet, humid, or windy conditions while wearing PPE (95 degrees or greater)\nMust have visual acuity with/without job aids to perform activities such as; reading, viewing a computer terminal, visual inspection involving small parts/details. Clarity of vision at 20 ft or more in day and night/dark conditions\nMust be able to speak and communicate verbally at conversation levels with co-workers, vendors, etc. (Moderate noise)\nWORK SCHEDULE:\n\n40+ hours weekly with flexible hours depending on department needs. Must be available to work occasional evenings, weekends, and holidays\nEqual Opportunity Employer",
    "slug": "lab-technician-884845e2-787d-4c93-b8c5-3d8b854cfc20",
    "benefits": ["Flexible schedule"],
    "selectedSkills": [
      "Laboratory experience",
      "Computer skills",
      "Bachelor's degree",
      "Associate's degree"
    ],
    "jobType": "free",
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=DM2NbWzggV6yB_IAgOOlOC4W7D_WhJsODRpLPo0RkXlqnPNOZ6xU_Q"
  },
  {
    "position": "Lab Technician, Extraction",
    "labName": "Kaycha Labs",
    "location": "Davie, FL",
    "age": "4 days ago",
    "type": "Full-time",
    "salaryMin": "$26,000 ",
    "salaryMax": " $37,000 a year",
    "jobDescriptionCopy": "Company Overview:\n\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\n\nJob Purpose:\n\n\nThe Lab Technician is responsible for working closely with our laboratory team to develop analytical skills and related experience. This position consists of many aspects from homogenizing, weighing and extracting samples, performing quality control checks, verifying various support equipment and properly disposing of all waste.\n\n\nEssential Duties & Responsibilities:\n\n\nExecute laboratory protocol and procedures under the supervision of the Lab Director.\nRegularly display good laboratory technique to avoid cross-contamination or misidentified samples.\nPerform sample preparation procedures including homogenization, weighing and liquid extraction.\nPerform QC duties as assigned, including LCS and matrix spikes.\nPerform qualitative and quantitative tests, as assigned.\nUtilize the LIMS system to create batches, enter sample prep information and maintain physical and electronic records.\nAdhere to ISO 17025 standards as well as state regulatory requirements.\nPromote a strong customer service culture while adhering to the highest safety and industry standards.\nOther duties and/or special projects as assigned.\n\nSkills, Abilities and Competencies:\n\n\nAbility to maintain an incredibly high degree of attention to detail and accuracy.\nStrong agility, engagement, and flexibility in an ever-changing environment.\nWorking knowledge of logging, organizing, and analyzing data.\nAbility to work in a dynamic, fast-paced deadline environment while successfully managing multiple tasks.\nStrong knowledge of Microsoft Office, including Excel, PowerPoint, and Word.\nWorking knowledge of standard laboratory protocol.\nExcellent communication skills and ability to effectively work, problem solve, and communicate with multiple levels of the organization.\n\nEducation & Experience:\n\n\nMinimum of Bachelor’s degree in chemistry, biochemistry or related field based on state requirements.\n0-1 year of lab experience.\nKnowledge of principles, terminology, practices, techniques commonly used in a laboratory setting preferred.\nExposure to the cannabis industry is a plus.\n\nOther:\n\n\nMust pass Level 2 background check.\nMust be at least 21 years old.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status\n\nJob Type: Full-time\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nEmployee assistance program\nFlexible spending account\nHealth insurance\nLife insurance\nPaid time off\nReferral program\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nMonday to Friday\nWeekend availability\n\nCOVID-19 considerations:\nFace masks required.\n\n\nApplication Question(s):\n\n\nWhat is your desired compensation?\nWhat is the best phone # and email to reach you at?\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nLaboratory Experience: 1 year (Preferred)\n\nWork Location: One location\n",
    "slug": "lab-technician-extraction-f8fd9773-4430-4248-9af3-d14762e6a001",
    "benefits": [
      "Dental insurance",
      "Health insurance",
      "Referral program",
      "401(k)",
      "Flexible spending account"
    ],
    "selectedSkills": [
      "Microsoft Excel",
      "Microsoft Powerpoint",
      "Laboratory experience",
      "Communication skills",
      "Microsoft Office",
      "Bachelor's degree",
      "21 years or older",
      "Background check"
    ],
    "jobType": "free",
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=pbOlswrc792TzG4VeEkl1H0q0CWETwTKYspJVosftZpbEx0w9S06Mw"
  },
  {
    "position": "Analytical Chemist I",
    "labName": "Kaycha Labs",
    "location": "Albany, NY",
    "age": "4 days ago",
    "type": "Full-time",
    "salaryMin": "$37,000 ",
    "salaryMax": " $52,000 a year",
    "jobDescriptionCopy": "Company Overview:\n\n\nKaycha Group, LLC is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\n\nJob Purpose:\n\n\nThe Lab Analyst, Level I will be responsible for performing, documenting, record checking, and basic troubleshooting of qualitative and quantitative assays on samples using techniques that vary from the use of standard laboratory equipment to highly modern and automated instrumentation.\n\n\nEssential Duties & Responsibilities:\n\n\nAnalyze samples consisting of a variety of matrices using traditional laboratory technologies including, but not limited to, HPLC, GC/MS, LC/MS, and ICP/MS.\nPrepare samples for analysis while displaying good laboratory technique to avoid cross-contamination or misidentified samples.\nAccurately prepare calibration curves and quality control samples.\nInterpret and evaluate data in terms of accuracy, precision, trends, and quality control requirements.\nMaintain laboratory equipment by cleaning, and otherwise ensuring ongoing proper working order. Report equipment issues to supervisor\nCollaborate with the laboratory team to meet reporting deadlines.\nAble to perform method validations, or verifications as needed.\nManage inventory supplies and alert supervisor in advance when materials must be ordered\nMay participate in root cause analysis for quality assurance.\nAssist with training incoming analysts and technicians on methodology.\nParticipate in the development or updating of departmental SOP’s.\nOther duties and special projects as assigned.\n\nEducation & Experience:\n\n\nMinimum BS/BA in Chemistry, Biology, Physics, Engineering or Environmental Sciences required or based on state requirements.\nKnowledge of principles, terminology, practices, techniques, and instrumentation commonly used in a laboratory setting required.\nAt least 1 year of laboratory experience.\nDemonstrated proficiency in at least one analytical instrument preferred.\nFood science and/or environmental experience is a plus.\nExposure to the cannabis industry is a plus.\n\nSkills, Abilities and Competencies:\n\n\nBasic understanding of standard laboratory protocol.\nMaintain high productivity, keen attention to detail, and consistent multi-tasking while yielding a low testing error rate.\nStrong agility, engagement, and flexibility in an ever-changing environment.\nDiligent commitment to logging, organizing, and analyzing data.\nExcellent communication skills and ability to effectively work, problem solve, and communicate with multiple levels of the organization.\nPromote a strong customer service culture while adhering to the highest safety and industry standards, including those that are outlined by the state regulatory body.\n\nOther:\n\n\nMust pass the required background check.\nMust be at least 21 years old.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.\n\nEssential Functions:\n\n\nThe physical demands described here are representative of those that an employee must meet to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nWhile performing the duties of this job the employee is frequently required to stand, handle or feel, to speak, and to hear. The employee is occasionally required to walk, sit, reach with hands and arms, bend, kneel, crouch, or crawl. The employee must frequently lift and/or move up to thirty-five (35) pounds.\n\n\nSpecific vision abilities required for this job include close (proximity) vision, depth perception, and the ability to adjust focus.\n\n\nWork Environment:\n\n\nThe work environment described here is representative of that which an employee may encounter while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nThe standard analytical laboratory environment is one in which potential health hazards do exist. Administrative, operations, technical, and professional staff are expected to safely operate in accordance with applicable and appropriate health and safety policies and procedures, as prescribed by the applicable Kaycha manuals and policies and/or federal, state, or local standards.\n\n\nLaboratory staff can be expected to work in areas where hazards associated are with, but not limited to, airborne pathogens. Biological materials, hazardous substances, and radioactive material exist and are handled. Appropriate training is provided regarding these hazards and staff are expected to adhere to all health and safety policies at all times, whether they are in writing or verbalized by a supervisor.\n\n\nThe above is intended to describe the general content of and requirements for the performance of this job. It is not to be construed as an exhaustive statement of duties, responsibilities, or physical requirements. Nothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions\n\n\nJob Type: Full-time\n\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\nWeekend availability\n\nApplication Question(s):\n\n\nWhat is your desired compensation?\nBest email and phone # to reach you at?\nAre you open to working weekends and/or evenings when needed?\nWhat is your desire compensation?\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nHPLC: 1 year (Required)\nCannabis testing industry: 1 year (Preferred)\nLCMS: 1 year (Required)\n\nWork Location: One location\n",
    "slug": "analytical-chemist-i-2bbf9869-f01b-4d5f-938b-efd5dd81d194",
    "benefits": ["Dental insurance", "Health insurance", "Vision insurance"],
    "selectedSkills": [
      "High-performance liquid chromatography",
      "Laboratory experience",
      "Communication skills",
      "Root cause analysis",
      "Bachelor of Science",
      "Bachelor's degree",
      "21 years or older",
      "US work authorization",
      "Background check"
    ],
    "jobType": "free",
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=RxtuOJWaVH1Z9104FqQ13D3mcPgcQRgt5O4YKlyQVFFqKbxeUiOMqg"
  },
  {
    "position": "QA Manager",
    "labName": "Cresco Labs",
    "location": "Phoenix, AZ",
    "age": "4 days ago",
    "salaryMin": "$85,000 ",
    "salaryMax": " $110,000 a year",
    "jobDescriptionCopy": "COMPANY OVERVIEW\n\nRecently named one of Entrepreneur magazine's Top 100 Cannabis Leaders, Cresco Labs is one of the largest vertically-integrated multi-state cannabis operators in the United States. Cresco is built to become the most important company in the cannabis industry by combining the most strategic geographic footprint with one of the leading distribution platforms in North America. Employing a consumer-packaged goods (\"CPG\") approach to cannabis, Cresco's house of brands is designed to meet the needs of all consumer segments and includes some of the most recognized and trusted national brands including Cresco, Remedi and Mindy's, a line of edibles created by James Beard Award-winning chef Mindy Segal. Sunnyside*, Cresco's national dispensary brand is a wellness-focused retailer designed to build trust, education and convenience for both existing and new cannabis consumers. Recognizing that the cannabis industry is poised to become one of the leading job creators in the country, Cresco has launched the industry's first national comprehensive Social Equity and Educational Development (SEED) initiative designed to ensure that all members of society have the skills, knowledge and opportunity to work in and own businesses in the cannabis industry.\n\nMISSION STATEMENT\n\nAt Cresco, we aim to lead the nation's cannabis industry with a focus on regulatory compliance, product consistency, and customer satisfaction. Our operations bring legitimacy to the cannabis industry by acting with the highest level of integrity, strictly adhering to regulations, and promoting the clinical efficacy of cannabis. As Cresco grows, we will operate with the same level of professionalism and precision in each new market we move in to.\n\nJOB SUMMARY\n\nCresco Labs is seeking Quality Manager to join our manufacturing facility in Mendota, CA. The Quality Manager position will report directly into the Regional Site Quality Director – West Coast. As a Quality Manager, you will be responsible for overseeing quality-related activities at the facility associated with sampling and inspection of in-process and finished products, customer complaints, product investigations, and Corrective and Preventive Action (CAPA) plans. Product families include cannabis oil, vape pens/cartridges, infused products and concentrates. This position will be responsible for ensuring products are being produced in a manner that meets all specifications and brand consistency and promoting a culture of Quality across all departments. You will also lead efforts to identify potential quality risks and working with operations personnel to develop improvement opportunities. The ideal candidate must possess a strong attention to detail and experience working within a highly regulated industry.\n\nCORE JOB DUTIES.\n\nResponsible for management of all quality related activities as the site.\nIntricate part of the site Leadership Team.\nPerforms incoming packaging component, raw material, bulk material, in-process and finished product sampling and inspection.\nPerforms and ensures equipment and product line clearances before production runs.\nPerforms cleaning and sanitation verification.\nPerforms and ensures scale and thermometer verification\nManages and writes customer complaint and product investigations, helping to assess risk, identify root cause, plan CAPA activities, and implement solutions with business partners.\nAssist with Quality Systems document writing and revisions, including routing and/or approval of change request packages.\nInspects and verifies compliance labels for finished goods.\nReviews COAs for regulatory compliance and specification adherence.\nInspects packaged orders to ensure correct content and quantities, as deemed necessary.\nInspects retain samples and customer return samples, as deemed necessary.\nManage and track stability sampling and testing per state regulation.\nReviews batch manufacturing records, logbooks, test results, and ensures good documentation practices are followed.\nDiscusses issues and concerns directly with line personnel and operations management so any corrections and improvements can be made in a timely manner.\nPerforms GMP facility inspections.\nParticipates in corporate Quality internal audits as assigned.\nCollaborates with operational functions to troubleshoot manufacturing and production defects, CAPA, and customer complaints. Provides advice with process improvements to eliminate errors and reduce risk.\nMonitors compliance to established Good Manufacturing Practice (GMP) and GFSI (Global Food Safety Initiative) guidance such as BRC, SQF, and FSSC 22000\nFacilitates creation of and/or updates to product safety plans or product process parameters.\nOverall accountability for product discontinuation, quarantine, destruction, rework, withdrawal/recall to operations and quality management.\nPerform batch record review and release of batches/lots.\nPerforms data analysis and reporting including but not limited to KPIs, potency, microbiological results, and pesticide results.\nLeads mock recalls/withdrawals.\nConducts all duties in compliance with safety rules, applicable SOPs, and other applicable guidelines.\n5-10% travel to other facilities and states to help with new market launches, training, etc.\n\nREQUIRED EXPERIENCE, EDUCATION AND SKILLS\n\nBachelor's Degree, 5+ years experience in a quality role\nPrior experience in highly regulated industry: healthcare, medical devices, pharmaceutical, consumer packaged goods (food), cannabis, agricultural or tobacco.\nHighly desirable: FDA, HACCP, GFSI (Global Food Safety Initiative) such as BRC, SQF, and FSSC 22000\nPrior experience in Quality Assurance or Quality Control function.\nPrior experience with product sampling, inspection procedures, customer complaints, product investigations, and CAPA\nPrior experience in regulatory agency audits and correspondence.\nAbility to follow written procedures and monitor others for adherence to written procedures\nAbility to create or update written procedures with site operations personnel.\nStrong written and verbal communication skills, including writing executive summaries and communicating with senior level operations, quality management team, and regulatory agencies.\nDetail-oriented\nUtilizes critical thinking to troubleshoot issues, work collaboratively with a team to brainstorm solutions, and implement improvement solutions\nAble to manage personnel effectively, including performance issues, setting vision, priorities, etc.\nDemonstrates high sense of urgency and proactive thinking.\nExperience with Continuous Improvement initiatives is a plus.\nExperience with Good Agricultural Practice (GAP) is a plus.\nExperience with Regulatory Agency Investigations is a plus\nExperience with leading Analytical Laboratories (chemical, microbiology) is a plus\n\nADDITIONAL REQUIREMENTS\n\nMust be 21 years of age or older to apply\nMust comply with all legal or company regulations for working in the industry\n\nCresco Labs is an Equal Opportunity Employer and all applicants will be considered without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran, or disability status.",
    "slug": "qa-manager-717bf1ed-40c3-4d23-91b8-c8c8c59b9931",
    "benefits": [],
    "selectedSkills": [
      "Writing skills",
      "Continuous improvement",
      "Quality assurance",
      "Communication skills",
      "QA/QC",
      "Bachelor's degree",
      "21 years or older"
    ],
    "jobType": "free",
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=Zi1_qKF66vyO2o1MPW0Edxpc1zo3QvKNRgXs1VIvI-FqC7sL0vp-_Q"
  },
  {
    "position": "HPLC Technician",
    "labName": "Curaleaf",
    "location": "Johnstown, OH",
    "age": "16 hours ago",
    "salaryMin": "$37,000 ",
    "salaryMax": " $49,000 a year",
    "jobDescriptionCopy": "Curaleaf Holdings, Inc. (CSE: CURA) (OTCQX: CURLF) (\"Curaleaf\") is a leading international provider of consumer products in cannabis, with a mission to improve lives by providing clarity around cannabis and confidence around consumption. As a high-growth cannabis company known for quality, expertise, and reliability, the company and its brands, including Curaleaf and Select provide industry-leading service, product selection, and accessibility across the medical and adult-use markets. In the United States, Curaleaf currently operates in 23 states with 130 dispensaries, 25 cultivation sites, and over 30 processing sites, and employs over 5,000 team members. Curaleaf International is the leading vertically integrated cannabis company in Europe with a unique supply and distribution network throughout the European market, bringing together pioneering science and research with cutting-edge cultivation, extraction, and production. Home | Curaleaf | Cannabis with Confidence\n\nOur corporate social responsibility is Rooted In Good Diversity, Equity, Inclusion + Social Equity + Sustainability Social Responsibility | Curaleaf | Cannabis with Confidence We believe in taking corporate and social responsibility very seriously, from our educational outreach to national partnerships, state-wide initiatives and local causes. Giving back to the communities where we operate is important to us, and helps to change old attitudes by showing the positive impact of cannabis in creating jobs, changing lives, and helping local communities.\n\nWe educate. We advocate. We give.\n\nThe HPLC Lab Technician carries out day-to-day tasks including: testing, prepping, extracting, and packaging. The HPLC Lab Technician must monitor and maintain production facility in accordance with the state of Ohio and standards set by the Company.\n\nResponsibilities:\nDevelop and execute validation of analytical systems\nOperate spectrophotometer and viscosity meter for QC\nAssist in production; calculating requirements; assembling and weighing plant material and supplies for supercritical CO2 extraction: emptying of extraction vessels.\nOperating highly sophisticated extraction equipment; Processing concentrates and extracts\nCleaning and maintenance of extraction equipment and laboratory facility following current good manufacturing practices (cGMP), and standard operating procedures; complying with legal regulations; monitoring environment\nOperating, maintaining, and making adjustments and repairs to laboratory equipment such as analytical systems, pumps, microscopes, balances, rotary evaporator, centrifuges, and other laboratory equipment\nCreating dilutions, HPLC diagnostics and repair, calibration\nMaintaining inventory records of supplies, materials, and equipment, and preparing requisitions as needed\nStoring supplies and equipment, and keeping laboratory, storerooms and working areas immaculate\nWashing and sterilizing laboratory glassware\nPerforming clerical work related to laboratory activities such as word processing, record keeping, and filing\nAssist in packaging of final products as needed\nAssist in the training of other technicians\nWork with state licensed third party testing lab to ensure QC\nPerforms related duties as assigned\n\nCompliance:\nEnsure processing operation is fully compliant with state and federal regulations\nMaintain analytical and other laboratory waste with registered waste disposal company while following state regulations\nMaintaining material safety data sheets for all department chemicals and products\nAssure that operation adheres to all business and industry license requirements.\nMaintaining strict inventory records of all plant materials, chemicals and equipment used in the laboratory and documents production by completing forms, reports, logs and records\n\nJob Qualification Requirements:\nBachelor's Degree preferred/ 1-2 years' experience in a laboratory or manufacturing setting required\nQA/QC Experience with HPLC and GC analysis\nExperience with Agilent equipment using ChemStation\nMust be at least 21 years of age\nSubject to background check per state cannabis regulations\nCapacity to work independently and/or with vendors, perform troubleshooting and solve complex problems.\nThe qualified individual will possess a keen interest and knowledge of Organic and Inorganic chemistry.\n\nCuraleaf is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.",
    "slug": "hplc-technician-cae4d320-7116-4c3c-a163-90ad575615bd",
    "benefits": [],
    "selectedSkills": [
      "Gas chromatography",
      "Laboratory experience",
      "Analysis skills",
      "Manufacturing",
      "QA/QC",
      "Bachelor's degree",
      "Background check",
      "21 years or older"
    ],
    "jobType": "free",
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=mZznnmgmxIKft8d2jkKSDkv4gCSdyR_zBtSh9q3X07vt4as6hbxRJA"
  },
  {
    "position": "Laboratory Manager",
    "labName": "ACT Laboratories, LLC",
    "location": "Ballston Spa, NY",
    "age": "8 days ago",
    "type": "Full-time",
    "salaryMin": "$65,000 ",
    "salaryMax": " $80,000 a year",
    "jobDescriptionCopy": "ACT Laboratories\n\n\nJob Description\n\n\nJob Title: Laboratory Manager\n\n\nReports To: Chief Operating Officer\n\n\nDate: May 3, 2022\n\n\nJob Summary:\n\n\nCoordinate and oversee daily activities of an assigned production laboratory facility and provide leadership to a laboratory operations team performing chemical, microscopic and/or microbiological testing procedures\n\n\nEssential Duties and Responsibilities:\n\n\nEnsure testing samples are properly received, organized and prepared for testing procedures\nEnsure laboratory testing is completed accurately and timely according to all standard operating procedures and in compliance with federal, state and/or local regulations\nEnsure test results and other data are accurately and timely entered into the Laboratory Information Management System\nEnsure test results are timely and accurately transmitted/delivered to customers; discuss results with customers and address customer questions, comments and concerns\nEnsure all Quality Control / Quality Assurance protocols are followed and verified\nPrioritize work, manage workflow and coordinate employee efforts to achieve accurate and timely results\nPerform audits; respond timely and address items identified during audits/inspections\nEnsure laboratory is clean, organized and efficiently operating and laboratory equipment is properly calibrated and maintained\nReview and update standard operating procedures as needed; ensure standard operating procedures are appropriately and timely implemented at the assigned laboratory\nPerform work of laboratory employees as needed based upon workflow and staffing\nPerform initial troubleshooting of testing issues and inform technical experts of existing issues in a timely fashion\nInform leadership on emerging compliance and customer issues\nWork with leadership to define and maintain laboratory capacity\nSupport laboratory operations key initiatives\nAssume bottom-line responsibility for laboratory operations including identifying areas of operational efficiencies\nEstablish and maintain productive working relationships with people inside the laboratory and people outside the laboratory including customers, regulatory staff and corporate staff\n\nSupervisory Responsibilities:\n\n\nManage employees that may include Lead Laboratory Technicians, Laboratory Technicians, Drivers / Samplers and Administrative Assistants\nCarry out supervisory responsibilities in accordance with the organization’s policies and applicable laws; responsibilities include: interviewing, hiring and training, onboarding, staffing/workplace planning, assigning and directing work, scheduling, evaluating performance, recognizing and rewarding, disciplining, addressing complaints and resolving problems\n\nAdditional Responsibilities:\n\n\nVisit customer sites to investigate/advise customers on issues including contamination\nConduct or oversee inventory and order/arrange for pick up or delivery of laboratory reagents/supplies/materials as needed\nPerform/participate in research and development initiatives/projects\nPerform other duties as may be assigned\n\nQualifications:\n\n\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skills, and/or abilities required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nEducation and/or Experience:\n\n\nBachelor’s degree with a major in chemistry, biology or other related science major required\nLaboratory experience required\n3-5 years supervisory experience preferred\n\nKnowledge, Skills and Abilities Required:\n\n\nKnowledge of federal, state and local laws regarding testing, cultivation, processing and transport of cannabis products\nKnowledge of laboratory applications of biology, microbiology and chemistry\nExemplary customer service skills\nAbility to use a variety of laboratory equipment and instruments including incubators, scales/balances, pipettes, chromatographs, PCR equipment and mass spectrometers\nAbility to use computers and computer software programs and systems and standard office equipment such as phones, photocopiers and fax machines\nGood written and verbal communication skills to convey and receive information effectively (face-to-face, telephone and electronic)\nGood analytical and judgment skills\nDetail-oriented\nAbility to maintain confidentiality regarding test results, personnel and/or financial data\nExcellent organizational skills to work independently, prioritize, handle multiple tasks, manage time\nLeadership skills including comfort with decision-making responsibilities, coaching, teaching and counseling, ability to inspire and build confidence in others and forge alliances and garner support\n\nCertifications, Licenses, Registrations:\n\n\nValid driver/operator license\n\n\nSafety Sensitive Position:\n\n\nEquipment or vehicles used and activities performed by this position that could cause serious injury or death to the operator, other employees and/or other individuals if not used properly or safely:\n\n\nDriving/operating cars/vans\nWorking with testing equipment with hot surfaces\nHandling chemicals including acids and solvents used in the testing process\n\nPhysical Demands:\n\n\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nProlonged periods of sitting at a desk and working on a computer, walking/moving around and standing, talking and hearing and using hands to handle, control or feel objects, tools or controls\nOccasional periods of stooping/kneeling, bending\nLifting up to 10 pounds regularly and up to 25 pounds occasionally\nClose vision and ability to focus on computer screens and documents; distance vision; peripheral vison; depth perception; color vision\n\nWork Environment:\n\n\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. The employee works in a laboratory environment.\n\n\nWhile performing work-related duties the employee occasionally works with hazardous, toxic or caustic chemicals such as acids and solvents, works around fumes or airborne particles from laboratory chemicals used/fume hoods works with or near moving mechanical parts from laboratory equipment and works with equipment that vibrates. The noise level in the work environment is usually moderate.\n\n\nStressful Conditions in the Work Environment Affecting This Position:\n\n\nChallenging work demands including heavy workload/work quantity or quality demands, time demands, conflicting/multiple deadlines or tasks, infrequent rest breaks, long or unpredictable work hours and shiftwork\nChallenging situations including dealing with difficult customers/vendors/employees and interpreting data\n\nWork Schedule:\n\n\n40-hour minimum workweek; Monday - Friday\nMay require on-call duty and the ability to work outside of scheduled work hours including weekends and holidays when the need arises\nSome travel during the day and overnight - to other laboratories, attend seminars, training and/or conferences\n\nThis job description is intended to describe the essential functions of and requirements for the successful performance of this position. It is not to be interpreted as an exhaustive statement of duties, responsibilities or requirements of this position, nor is it intended to limit the authority of any manager to assign and direct the activities of employees under his or her direction.\n\n\nJob Type: Full-time\n\n\nPay: $65,000.00 - $80,000.00 per year\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\n\nSupplemental Pay:\n\n\nBonus pay\n\nAbility to commute/relocate:\n\n\nBallston Spa, NY 12020: Reliably commute or planning to relocate before starting work (Preferred)\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nSupervising experience: 3 years (Preferred)\n\nWork Location: One location\n",
    "slug": "laboratory-manager-8da1ae61-eb30-4d7d-bb16-36dc93a06fac",
    "benefits": [
      "Dental insurance",
      "Health insurance",
      "401(k)",
      "Paid time off",
      "Vision insurance"
    ],
    "selectedSkills": [
      "Laboratory experience",
      "Leadership",
      "Communication skills",
      "Microbiology",
      "Spectrometer",
      "Bachelor's degree"
    ],
    "jobType": "free",
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=M1NDYctnrwAh0_0tQgslg9HneVJDTBgmK5nmNO_skfH0DNINS0eAKw"
  },
  {
    "position": "Laboratory Analyst",
    "labName": "Greenleaf Labs",
    "location": "Poteau, OK",
    "age": "4 days ago",
    "type": "Full-time",
    "salaryMin": "$34,000 ",
    "salaryMax": " $43,000 a year",
    "jobDescriptionCopy": "Strong leadership, troubleshooting instrumentation, work with vendors, take direction from management, be organized and prepared, understand and meet timelines. Data management reporting and ability to follow standard operating procedures a must. Chemical extraction, sample preparation and analysis for cannabis using LCMS/MS, HPLC, ICPMS, GCMS, and qPCR. Willingness to follow internal quality system requirements. Ensuring SOP's are written or up-to-date for laboratory processes. Familiar with Oklahoma State regulation for cannabis a plus. Implements and maintains appropriate quality control processes and procedures to guarantee accuracy of analysis and quality of results. Performs review of reported data and associated quality control and preparing reports for delivery to client. Responsibilities may include general instrument troubleshooting. Responsible for ensuring that inventory is properly maintained and ordered on time to meet production demands.\n\n\nMust have laboratory experience and be familiar with ISO 17025 requirements. Must have a history of working in a laboratory and an understanding of meeting deadlines. Must understand calculating workflow, turnaround times, and streamlined approaches. Must be able to prioritize and multi-task. MUST HAVE: Minimum Bachelor's Degree applicable to a laboratory testing environment, with a minimum of two (2) years of experience.\n\n\nJob Type: Full-time\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\nDay shift\n\nWork Location: One location\n",
    "slug": "laboratory-analyst-a3f4c9fb-2d4f-4d39-93aa-dece4c5c8712",
    "benefits": [
      "Paid time off",
      "Dental insurance",
      "Health insurance",
      "Vision insurance"
    ],
    "selectedSkills": ["Laboratory experience", "Bachelor's degree"],
    "jobType": "free",
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=0hW5jfWnH5sVhn2GtHTh5RFpFEx62eX5WtaO6KRVFKXbdsBgU_2Gmw"
  },
  {
    "position": "Microbiology Lab Analyst",
    "labName": "Columbia Food Laboratories",
    "location": "Portland, OR",
    "age": "7 days ago",
    "type": "Full-time",
    "salaryMin": "$18 ",
    "salaryMax": " $25 an hour",
    "jobDescriptionCopy": "Columbia Laboratories is looking for a Microbiology Laboratory Analyst to join our team. We are a long standing, accredited food safety, cannabis/hemp, and water testing laboratory in Portland, OR. Columbia Labs is a proud member of the Tentamus Group, a global team of laboratories focused on human wellness. The ideal candidate will ensure laboratory services are communicated with potential clients and that customer satisfaction remains paramount.\n\n\nDuties:\n\n\nSample batching in LIMs and preparation of samples for testing.\nRecord accurate quality control/traceability information in various equipment/media logs.\nTrack expiration dates and quantities of all consumables, add ensure lab consumable stocks are inline with production expectations.\nProper labeling of various test media, plates, films.. etc.\nUpdating and maintain shelf life testing calendar.\nPerform testing on lab QC and maintenance of QC systems.\nCalibrations for lab equipment; thermometers, pipettes, pH probes, and balances.\nInterpret results post incubation and record results.\nOccasionally assist with recycling, autoclave of bio-hazard material and overall lab cleanliness.\n\nEducation and Experience:\n\n\nBachelor’s in microbiology or related field.\nEmphasis in microbiology and aseptic techniques preferred\nPreferred candidates will have at least 2-5 years of related lab experience, working in an environmental water or food safety testing laboratory.\nExcellent knowledge of microbiological methods for the analysis of environmental, food and hemp samples. Including Standard Methods, EPA, AOAC, FDA BAM, and USP.\nExperience with PCR – pathogens by Gene-up and 3M MDS systems.\nFollow good lab practices (GLP)\n\nSkills Required:\n\n\nWell organized and utilize time management effectively\nProblem solver and motivated\nTeam player\n\nWho we are:\n\n\nTentamus Group is a global product and safety firm with a core presence in Europe, Israel, China, Japan, and North America. Tentamus evaluates and consults on products involving the human body with strong focus on food, nutraceuticals, and cosmetics. Tentamus is represented in over 80 locations worldwide with more than 3,500 highly trained staff members.\n\n\nwww.tentamus.com\n\n\nwww.columbialaboratories.com\n\n\nhttps://www.linkedin.com/company/tentamus-group/\n\n\nJob Type: Full-time\n\n\nPay: $18.00 - $25.00 per hour\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nFlexible spending account\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nWeekend availability\n\nAbility to commute/relocate:\n\n\nPortland, OR 97230: Reliably commute or planning to relocate before starting work (Preferred)\n\nEducation:\n\n\nBachelor's (Preferred)\n\nExperience:\n\n\nProduction Laboratory: 2 years (Required)\n\nWork Location: One location\n",
    "slug": "microbiology-lab-analyst-f01d4c2f-7803-46ff-ade9-93496fd31496",
    "benefits": [
      "Health savings account",
      "Dental insurance",
      "Health insurance",
      "401(k) matching",
      "Paid time off"
    ],
    "selectedSkills": [
      "FDA regulations",
      "PCR",
      "Laboratory experience",
      "Microbiology",
      "Bachelor's degree"
    ],
    "jobType": "free",
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=LFLseVSL8_WuDNFbNkILy9YejL7m8iJpEAv5-ulzAk7HfhOxjXQwpQ"
  },
  {
    "position": "R&D Lab Technician",
    "labName": "Green Thumb",
    "location": "Centreville, MD",
    "age": "5 days ago",
    "salaryMin": "$35,000 ",
    "salaryMax": " $46,000 a year",
    "jobDescriptionCopy": "The Role\n\nThe R&D Laboratory Technician performs many of the day to day tasks and demands of the Research & Development Lab. This position is responsible for assisting with the research and development lab, which tackles a wide variety of tasks including (but not limited to) extraction, winterization, distillation, analytical equipment, and production of cannabis infused products. They also keep a sharp eye on compliance, documentation, and workplace safety. The ideal candidate is naturally curious, and excited about creation & innovation within the cannabis space. The ideal candidate will have experience in a cannabis extraction lab.\n\nRequirements\n\nExecute lab scale and small batch experimentation to support all levels of formulation, analytics, and processing for multiple cannabis-based research projects.\nAid in the maintenance of inventories for research and developments raw materials, chemicals, and equipment, as well as formulation spreadsheets, inventories, traceability logs, tracking logs, etc.\nFollow complex instructions and formulations in the preparation of cannabis extract, concentrates, and infused products.\nEvaluate and updates technologies and operating procedures associated with research and development.\nAid compliance and accuracy involving all product tracking, product security, and product creation.\nOperate laboratory instruments, makes observations, calculates and records results.\nAssist in monitoring of production line and collecting samples for various testing and stability programs.\nTake personal responsibility to ensure compliance and meet Good Laboratory Practices and Good Manufacturing Practices compliance.\nPractice highly sterile laboratory cleaning procedures throughout the facility with focus and personal contributions towards a clean and organized assigned work area at the end of the assigned shift.\nCapable of troubleshooting, fixing, and services a wide range of equipment and software with little to no assistance.\nOther duties as assigned\nQualifications\nBachelor's or Associate's degree preferred in biology, chemistry, or physics.\nPrior Laboratory experience.\nEquivalent combinations of education and experience may be considered, including internal experience.\nPrior experience in research.\nIntermediate math skills.\nExcellent verbal and written communication skills with coworkers and management.\nFamiliarity with OSHA guidelines for dealing with hazardous chemicals.\nFlexibility and the ability to shift work schedule according to research and development needs.\nAbility to use standard office equipment, computer equipment and software including word processing, database management, spreadsheet applications and email.\nEnthusiasm for research and formulating/improving product formulations.\nMust be able to carry out repetitive tasks at a continuously high level of quality.\nCapable of working with hazardous chemicals and able to identify and report unsafe equipment, conditions and practices so that they may be corrected prior to an incident.\nAdditional Requirements\nMust be a minimum of 21 years of age.\nMust pass all required background checks.\nMust be and remain compliant with all legal & company regulations for working in the industry.\nMust be approved by the State of Maryland to receive a badging in order to handle cannabis\nWorking Conditions\nWhile performing the duties of this job, the employee is regularly required to perform grasping, talking, hearing, seeing and repetitive motions\nPhysical demands – May be required to stand and/or walk for extended periods of time. Must be able to lift, carry and balance up to 50 pounds (200 pounds with assistance).",
    "slug": "rd-lab-technician-836d2780-a0da-47fe-97dc-bc327af68478",
    "benefits": [],
    "selectedSkills": [
      "Laboratory experience",
      "Communication skills",
      "Research",
      "Math",
      "OSHA",
      "Bachelor's degree",
      "Associate's degree",
      "21 years or older"
    ],
    "jobType": "free",
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=wJxI2xcSVXdLkGqxjWFPKO501Rw-vwQiDLJZRU75zu7Da-LAu_ZPkg"
  },
  {
    "position": "Scientist Biologist",
    "labName": "Lifted Productions, LLC",
    "location": "Warwick, RI",
    "age": "1 day ago",
    "type": "Full-time | Part-time | Internship",
    "salaryMin": "$38,000 ",
    "salaryMax": " $52,000 a year",
    "jobDescriptionCopy": "Qualifications\n\n\nMust possess at a minimum a Bachelors or Masters degree in biology and at least a year of laboratory experience.\n\n\nKey Responsibilities\n\n\nResponsible for maintaining updated understanding and knowledge of the methods employed in the laboratory.\nProvides accurate and appropriate testing of specimens received in the laboratory, according to established laboratory protocol and procedures to fulfill the requests of the customer.\nPrepare samples for analysis using various methods in accordance with ISO standard operating procedures.\nPerform sample preparation and analysis of cannabis and cannabis products for the detection of Salmonella, E. coli (STEC), bile-tolerant Cram-negative bacteria, total coliform, total viable aerobic bacteria and total yeast and mold.\nPerform water activity analysis.\nPerform plating techniques for the detection of viable yeast and mold.\nExecute method validation in accordance with ISO 17025 requirements.\nReview raw and QA/QC data ensuring it meets established criteria and upload final results into the LIMS using GLP.\nSubmit non-conforming work to the Corrective Action/Preventative Action workflow.\nWork with the Lab Director to prepare and review SOPs and other controlled documentation.\nTake inventory of supplies and create orders for supplies needed.\nWork with a team of scientists in a fast-paced environment to design and implement analytical strategies.\nPrepare technical reports.\nBe responsible for the day-to-day management and operation of the microbiology lab and to ensure the achievement and maintenance of quality standards of practice.\nEnsure the accurate performance of all tests in the microbiology lab including the submission of appropriate reports on all tests.\nEstablish and adhere to written policies and procedures for a comprehensive quality assurance program.\nPreparation of all samples, standards and reagents for analysis.\nPreparation of samples for Method Detection Limits (MDL), Initial Demonstration of Capacity (IDOC), proficiency test samples (PTS), and other forms of quality control samples.\n\nAdditional Duties May Include:\n\n\nReceipt of samples from clients, couriers and mail.\nVerification of Chain of Custodies, sample packaging, temperature, and contents upon receipt.\nSubmission of samples in the LIMS system, including identification of parameters to be analyzed and descriptions.\nCross-training on separate analytical methods (HPLC, GC-MS, LC-MS/MS, ICP-MS)\nTraining scientific staff\n\nJob Types: Full-time, Part-time, Internship\n\n\nPay: $38,000.00 - $46,000.00 per hour\n\n\nBenefits:\n\n\nPaid time off\nRelocation assistance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nHolidays\nMonday to Friday\nNight shift\nOn call\nOvertime\nWeekend availability\n\nSupplemental Pay:\n\n\nBonus pay\n\nAbility to commute/relocate:\n\n\nWarwick, RI: Reliably commute or willing to relocate with an employer-provided relocation package (Preferred)\n\nExperience:\n\n\nCell & Molecular Biologists: 1 year (Preferred)\nMolecular biology: 1 year (Preferred)\n\nWork Location: One location\n",
    "slug": "scientist-biologist-6a2635da-3317-49eb-bae2-1f673d763155",
    "benefits": ["Paid time off", "Relocation assistance"],
    "selectedSkills": [
      "Laboratory experience",
      "Molecular biology",
      "Bachelor's degree",
      "Master's degree"
    ],
    "jobType": "free",
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=bvGnZug4Cyb4oFO1V0R8E2AQ51u45K6ORAI770l_m3xgBJqvERGeNw"
  },
  {
    "position": "Extraction Technician",
    "labName": "Fine Fettle Dispensary",
    "location": "Hinsdale, MA",
    "age": "22 hours ago",
    "type": "Full-time",
    "salaryMin": "$35,000 ",
    "salaryMax": " $44,000 a year",
    "jobDescriptionCopy": "We are looking for passionate, detail oriented, hardworking individuals to assist in our medical cannabis extraction lab. Previous experience in Cannabis and Scientific background is preferred but not required as we are willing to train the right candidates. The main role of this position is working with the Extraction Manager to create high quality cannabis concentrates, cartridges, and other infused products in a highly regulated environment while always putting safety first. This job is very fast paced and physically demanding, requiring constant standing, crouching, bending, and lifting. If you have a passion for cannabis, are mechanically inclined, and are looking for a career in the rapidly growing industry this may be the role for you.\n\n\nDaily Duties and Responsibilities:\n\n\nPreparation of biomass for hydrocarbon extraction process.\n\n\nCarry out all extraction, extract processing, product formulation, cartridge filling, and manufacturing procedures including equipment set up and breakdown in an efficient manner that also complies with State Regulations.\n\n\nPerform duties in a safe manner and environment while adhering to all governmental regulations, and company policies.\n\n\nProper weighing, data recording, and batch tracking throughout the extraction process.\n\n\nInventory tracking of supplies, consumables, spare parts etc\n\n\nPackaging various types and weights of cannabis products.\n\n\nMaintain a clean and orderly workspace, cleaning and organizing the workspace on a frequent basis.\n\n\nClean, organize, and store extraction and related equipment.\n\n\nProper tracking and disposal of cannabis waste in accordance with State regulations.\n\n\nCreating and continuingly updating extraction and post processing related SOPs.\n\n\nKeeping up to date on current laws, regulations, and changes to operational procedure.\n\n\nWorking with third party Testing Labs for batch test sample analysis in compliance with CCC regulations.\n\n\nComplete data entry into marijuana tracking systems including METRC.\n\n\nOther duties as assigned.\n\n\nSkills and qualifications:\n\n\nScientific background as well as previous laboratory experience strongly preferred.\n\n\nAssociate degree preferred, with relevant college courses in biology, chemistry, or physics.\n\n\nExperience and background in the cannabis industry is a plus but not required.\n\n\nAbility to follow and adhere to strict safety and sanitation protocols.\n\n\nAbility to work independently, and collaboratively within a team environment\n\n\nThroughout extended periods must be capable of sitting, squatting, standing, kneeling, bending, or walking through the workday.\n\n\nAbility to maintain a sanitary work environment.\n\n\nComfortable working in a fast-paced environment.\n\n\nComfortable working with medical cannabis and similar products.\n\n\nAbility to follow all safety protocols including wearing all proper PPE.\n\n\nExperience in a highly regulated industry is a plus.\n\n\nExcellent communication skills with the ability to communicate with superiors and team members clearly and concisely.\n\n\nEnvironmental Factors:\n\n\nExposure to plant particulates through skin contact and inhalation including odor, that may cause allergic reactions to some.\n\n\nExposure to compounds that may be flammable, corrosive, and hazardous.\n\n\nGeneral background noise that may be loud.\n\n\nRequirements:\n\n\nMust be 21+\n\n\nAbility to pass comprehensive Background Check\n\n\nReliable transportation to the facility with a valid driver’s license\n\n\nAbility to adapt to change\n\n\nAbility to cross train with other departments as needed\n\n\nAbility to perform repetitive tasks\n\n\nAbility to lift to 50lbs alone and 100lbs with assistance\n\n\nBasic math skills\n\n\nMust be and remain compliant with any and all legal or company regulations for working in the industry\n\n\nLocation- Hinsdale, MA\n\n\nAMERICANS WITH DISABILITIES STATEMENT:\n\n\nMust be able to perform all essential functions of this position with reasonable accommodation. If you need accommodation during the application and/or hiring process please reach out to our HR representative.\n\n\nEEO Statement:\n\n\nWe are an Equal Opportunity Employer. Our goal is to be a diverse workforce that is representative, at all job levels, of the communities we serve. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, gender expression, national origin, protected veterans’ status, and will not be discriminated against on the basis of disability or or any other applicable legally protected characteristic.\n\n\nIf interested please submit a cover letter and resume.\n\n\nJob Type: Full-time\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nEmployee discount\nHealth insurance\nLife insurance\nPaid time off\nReferral program\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\nWeekend availability\n\nAbility to commute/relocate:\n\n\nHinsdale, MA 01235: Reliably commute or planning to relocate before starting work (Required)\n\nEducation:\n\n\nAssociate (Preferred)\n\nWork Location: One location\n",
    "slug": "extraction-technician-fcf9d487-db40-4518-9fbb-59a38f698383",
    "benefits": [
      "Dental insurance",
      "Employee discount",
      "Health insurance",
      "401(k) matching",
      "Paid time off"
    ],
    "selectedSkills": [
      "Sanitation",
      "Basic math",
      "Driver's License",
      "Laboratory experience",
      "Communication skills",
      "Associate's degree",
      "21 years or older",
      "US work authorization",
      "Background check",
      "Reliable transportation"
    ],
    "jobType": "free",
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=rHm-sD4ZxOVjNMG-Occ6jiRosGRd58OAtKRgonLy9VlhRkRrVpN9wQ"
  },
  {
    "position": "Analytical Chemist GC/MS/MS",
    "labName": "Decano Analytical Laboratories, LLC.",
    "location": "Los Angeles, CA",
    "age": "5 days ago",
    "type": "Full-time",
    "salaryMin": "$50,000 ",
    "salaryMax": " $75,000 a year",
    "jobDescriptionCopy": "Overview\n\n\nThe Decano Analytical Laboratories, LLC. provides a broad range of testing and analytical services to a cannabis industry. We at the forefront of the testing services industry, building an enviable reputation. The Decano Analytical Laboratories, LLC. provides a diversified line of independent analytical services to a wide range of top-tier customers. Our diverse laboratories perform routine and specialty analytical testing for compliance, safety, certification and verification purposes.\nGeneral Accountability:\nThe primary purpose of this position is to prepare, analyze and evaluate samples using GSMS/MS, GC-MSD-HS and to report data for release to clients and regulatory bodies. Knowledge of computers and mathematics are required. Ability to work independently is preferred. Duties will include maintenance of instruments and development of new methods.\nResponsibilities\n\n\nSpecific Responsibilities:\n\n\nPrepare and analyze samples for GC/MS;\nResponsible for meeting calibration and QA requirements;\nDocument activities and report results in a concise and accurate manner using GC/MS software LIMS;\nCoordinate with other laboratory analysts;\nPerform routine instrument maintenance procedures;\nPeer review GCMS data;\nReport data and review reported results;\nOther duties as assigned.\n\nRequired Knowledge, Skills & Abilities: * Possess a general knowledge of chemistry fundamentals and the ability to perform concentration and solution calculations; ability to understand terminology and principals in order to comply with analytical methods;\n\n\nPossess strong computer skills with knowledge in Excel and Microsoft Word; experience with or ability to learn industry specific software such as Agilent Masshunter and OpenLab CDS\nOrganized, detail oriented, and possess excellent problem solving capabilities; be able to work independently of supervision and work well with other analysts on the team;\nAbility to work overtime when necessary to meet the Decano Analytical Laboratories needs.\n\nJob Type: Full-time\n\n\nSalary: $50,000.00 - $75,000.00 per year\n\n\nSchedule:\n\n\n8 hour shift\n\nAbility to commute/relocate:\n\n\nLos Angeles, CA 90040: Reliably commute or planning to relocate before starting work (Preferred)\n\nEducation:\n\n\nMaster's (Preferred)\n\nWork Location: One location\n",
    "slug": "analytical-chemist-gcmsms-40e69436-646a-4c5b-a3f0-5a404e68b70c",
    "benefits": [],
    "selectedSkills": [
      "Microsoft Excel",
      "Computer skills",
      "Microsoft Word",
      "Master's degree"
    ],
    "jobType": "free",
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=5&job=yO2AfeJCAzq2Yb2a5KCfQesKMwnlBy3fs5NUWDbsTgtuVgwqb4tPRA"
  },
  {
    "position": "MIPs Manager",
    "labName": "House of Dankness",
    "location": "Denver, CO",
    "age": "18 hours ago",
    "type": "Full-time",
    "salaryMin": "$50,000 ",
    "salaryMax": " $80,000 a year",
    "jobDescriptionCopy": "Position Summary:\nThe MIPs Manager leads the activities and operations required to complete the functions of the department. This role is responsible for cannabis infused products synthesis, which includes but is not limited to formulation, emulsification, blending, unit production, and production of cannabis-infused products. The MIPs Manager will report directly to the Vice President and have a consistent impact across the organization - advancing the mission of customer service, product development, and brand growth through the execution of the company’s core values.\n\nCore Expectations:\nProvide effective leadership to employees to ensure a complete understanding of, and alignment to the Company’s vision, mission, and values to maintain a positive work environment and a high level of morale.\nResponsible for managing the daily activities of cannabis infused products production within production laboratory facilities and operations.\nBe an effective leader who understands modern (21st century) business practices applicable to the global marketplace.\nAbility to lift 50 - 80 lbs.\nPossess a thorough and honest understanding of the cannabis moment, including passion for cannabis science, and application of same.\nPractice authentic and excellent interpersonal skills, with an unrehearsed ability to understand and manage human affairs.\nPositively respond to the team's questions, concerns and suggestions and takes immediate action as necessary to effectively resolve conflicts.\nDeliberately and consciously practice professionalism, and righteous transformational initiatives.\nHave a thirst for continuous learning.\nVersed in planning, organizing, assigning, and coordinating the activities and resources of the department.\nRobust understanding and application of basic scientific principles as well as production laboratory operations.\nAbility to follow written instruction and maintain a laboratory notebook as well as production records and production logs.\nDevelops, maintains, and implements standard operating procedures for all cannabis infused products and techniques developed.\nMust follow all applicable policies, procedures, and guidelines. This includes the safe and proper operation of any/all relevant machinery, instrumentation, and equipment.\nSets up, operates, and maintains production laboratory equipment, monitors experiments, makes observations, calculates mathematically and records results.\nKnowledge of manufacturing analytical testing, (which includes but is not limited to, HPLC, GC, ICP MS, UV/VIS, IR, Moisture Analysis, Particle Size Analysis, Microbial Testing); and monitors product disposition against these test results to support quality of infused products synthesized.\nDevelops and implements research and development procedures, programs, and techniques to meet organizational needs and to capitalize on potential new products.\nWorks collaboratively with product development towards innovative formulations that meet both patient and company guidelines for effectiveness, cost, and stability; must be able to take formulations from lab scale to full production.\nAbility to adapt to and implement new methods and techniques for operational and product improvement, technical development, and new product development.\nManage inventory and ensure the seed-to-sale system is properly maintained.\nMaintain clean and sanitary laboratories and work environments including but not limited to all equipment, workstations, document controls and common areas. Responsible for preventative maintenance and keeping all equipment operational.\nAssist with compliance, including the creation of batch production records, and product labels specific to the state of Colorado, and in accordance with company standards.\nStay current on scientific and associated, literature and legislation in the cannabis industry, following cannabis research, industry trends and education.\nPartner collaboratively with other department managers including but not limited to, extraction, refinement, processing, packaging, facilities, security, cultivation, quality, and compliance.\nPartner with management to develop, document, and keep current Standard Operating Procedures for production sequences and formulations.\nOther duties as assigned.\n\nCore Competencies:\n\nBachelor’s Degree in Chemistry, Formulation Chemistry, Biochemistry, Manufacturing, Food Science, Engineering, and/or similar scientific field; and/or at least 2 years’ experience in cannabis manufacturing or 5+ years managing professional laboratory environment.\nDemonstrated strategic experience in overseeing all aspects of professional production laboratory environments including managing a production team with diversity, equipment handling, production operations, processing, implementation, coordinating supplies, and maintaining equipment.\nMust be 21 years of age at time of hire.\nValid State driver’s license or State ID card.\nMust Have CO MED badge\nA minimum of 3 years supervisory and/or managerial experience leading a large diverse team of professionals.\nKnowledge and experience related to producing BHO extracts, this includes but is not limited to creating consumables, extraction techniques and routes of administration.\nWork history showing progressive responsibility, willingness to accept additional projects or challenges, 21st century industrial competences, and wisdom.\nAbility to maintain confidentiality, reliability, trustworthiness, and honesty.\nAbility to remain calm in potential periods of high stress or unusual activity.\nProficiency in mathematics is an absolute requirement for all operations.\nProficient knowledge of the chemistry related to all manufacturing operations.\nDemonstrated ability to achieve manufacturing objectives in terms of volume, product mix, cost, and quality.\nExtensive knowledge in environment, health and safety standards in manufacturing operations required.\nExtensive knowledge of extraction and chemical processing techniques.\nAbility to listen well and communicate effectively, orally and in writing with various audiences.\nKnowledge and ability to use standard production laboratory equipment, filling equipment, vacuum ovens, hot plates, etc.\nDemonstrated experience in organizational development, personnel management, budget and resource development, and strategic planning.\nProficiency with Microsoft Office Suite, Word, and Excel with a strong attention to detail.\nMust be and remain compliant with all legal or company regulations for working in the cannabis industry\nFrequent sitting and walking\nOccasionally Twist/bend/stoop/squat, kneel/crawl\nAbility to communicate orally with management and other co-workers is crucial. Regular use of the telephone and e-mail for communication may be required. Sitting or standing for extended periods is common. Hearing and vision within normal ranges is essential for normal conversations, to receive ordinary information and to prepare or inspect documents.\nGood manual dexterity for the use of office equipment and manual tools.\nSalary and Benefits:\n$50,000‐80,000 Annual salary depending on experience and qualifications.\nHealth, Dental and Vision insurance are available for all full‐time employees after 90 days. 50 percent Of Health insurance is paid by Company. (Dental and Vision is employee option).\nEmployee Discount at House of Dankness.\n1‐week Paid time off after 1 year.\nPaid sick leave.",
    "slug": "mips-manager-fbe5970c-6645-4172-8f10-313ecad2159d",
    "benefits": [
      "Dental insurance",
      "Employee discount",
      "Health insurance",
      "Paid time off",
      "Paid sick time"
    ],
    "selectedSkills": [
      "Writing skills",
      "Manufacturing",
      "Microsoft Excel",
      "Driver's License",
      "Microsoft Office",
      "Bachelor's degree",
      "21 years or older"
    ],
    "jobType": "free",
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=5&job=Y0hQYHkAjRUgVCHx3e99SiJcPsbIljsX6sJm3Oq6KJ_g6-zZrTL2DQ"
  },
  {
    "position": "Analytical Chemist, ICP-MS",
    "labName": "Decano Analytical Laboratories, LLC.",
    "location": "Los Angeles, CA",
    "age": "5 days ago",
    "type": "Full-time",
    "salaryMin": "$50,000 ",
    "salaryMax": " $75,000 a year",
    "jobDescriptionCopy": "Overview\n\n\nThe Decano Analytical Laboratories, LLC. provides a broad range of testing and analytical services to a cannabis industry. We at the forefront of the testing services industry, building an enviable reputation. The Decano Analytical Laboratories, LLC. provides a diversified line of independent analytical services to a wide range of top-tier customers. Our diverse laboratories perform routine and specialty analytical testing for compliance, safety, certification and verification purposes.\nGeneral Accountability:\nThe primary purpose of this position is to prepare, analyze and evaluate samples using ICP-MS and to report data for release to clients and regulatory bodies. Knowledge of computers and mathematics are required. Ability to work independently is preferred. Duties will include maintenance of instruments and development of new methods.\nResponsibilities\n\n\nSpecific Responsibilities:\n\n\nPrepare and analyze samples for ICP-MS;\nResponsible for meeting calibration and QA requirements;\nDocument activities and report results in a concise and accurate manner using ICP-MS software LIMS;\nCoordinate with other laboratory analysts;\nPerform routine instrument maintenance procedures;\nPeer review ICP-MS data;\nReport data and review reported results;\nOther duties as assigned.\n\nRequired Knowledge, Skills & Abilities: Possess a general knowledge of chemistry fundamentals and the ability to perform concentration and solution calculations; ability to understand terminology and principals in order to comply with analytical methods;\n\n\nPossess strong computer skills with knowledge in Excel and Microsoft Word; experience with or ability to learn industry specific software such as Agilent Masshunter and OpenLab CDS\nOrganized, detail oriented, and possess excellent problem solving capabilities; be able to work independently of supervision and work well with other analysts on the team;\nAbility to work overtime when necessary to meet the Decano Analytical Laboratories needs.\n\nJob Type: Full-time\n\n\nSalary: $50,000.00 - $75,000.00 per year\n\n\nSchedule:\n\n\n8 hour shift\n\nAbility to commute/relocate:\n\n\nLos Angeles, CA 90040: Reliably commute or planning to relocate before starting work (Preferred)\n\nEducation:\n\n\nMaster's (Preferred)\n\nWork Location: One location\n",
    "slug": "analytical-chemist-icpms-cc82fd78-f3ad-497f-ac42-77701154fc72",
    "benefits": [],
    "selectedSkills": [
      "Microsoft Excel",
      "Computer skills",
      "Microsoft Word",
      "Master's degree"
    ],
    "jobType": "free",
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=5&job=y_fFV_Qn_4qZLNan5aMM-x0fUJm5EEkEdm2f_vJlj5xVP86sIT60WQ"
  },
  {
    "position": "Client Relations Specialist",
    "labName": "Kaycha Labs",
    "location": "Denver, CO",
    "age": "22 hours ago",
    "type": "Full-time",
    "salaryMin": "$18 an hour",
    "jobDescriptionCopy": "Company Overview:\n\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\n\nJob Purpose:\n\n\nThe Client Relations Specialist will be responsible for customer relations, accounting and operations support. This position will also interface with multiple departments and customers. This role will primarily focus on lab operations support.\n\n\nEssential Duties & Responsibilities:\n\n\nAnswer phones and route calls to the appropriate party.\nGreet incoming visits and escort to appropriate areas.\nReceive, sort and distribute incoming mail.\nOrder office supplies and keep inventory of stock.\nDeliver deposit checks to accounting.\nCreate and process customer invoices.\nProcess credit card payments in Blackstone.\nCoordinate with clients on payment processing of sample orders.\nReceive all incoming work from internal and external clients and process work orders through the company Laboratory Information Management System (LIMS).\nPrepare and manage shipments with partner labs.\nSpecial projects and errands as needed, including transportation of packages to local shipping companies.\nResponsible for shipping and receiving of orders and supplies, which includes light lifting duty (packages up to 40 lbs)\nMaintain compliance with health and safety guidelines for a lab environment.\nOther duties and/or special projects as assigned.\n\nSkills, Abilities and Competencies:\n\n\nExcellent communication skills and ability to effectively work, problem solve, and communicate with multiple levels of the organization.\nAbility to work in a dynamic, fast-paced deadline environment while successfully managing multiple tasks.\nProficiency in Microsoft Office suite, including Excel, PowerPoint, and Word.\nStrong understanding of standard laboratory protocol.\nAbility to maintain an incredibly high degree of attention to detail and accuracy.\nStrong agility, engagement, and flexibility in an ever-changing environment.\nWorking knowledge of logging, organizing, and analyzing data.\n\nEducation & Experience:\n\n\nHigh School diploma or equivalent required. Higher level degree preferred.\n1+ years of experience working within a lab environment.\n1+ years of experience in sample collection and logging within a lab environment.\nProficient knowledge of MS Office Suite (Excel, Word, PowerPoint)\nQuickbooks experience a plus.\nOrganizes and handles multiple priorities simultaneously.\nCompletes work assignments within time and quality constraints\nExposure to the cannabis industry desired.\n\nOther:\n\n\nMust pass Level 2 background check.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.\n\nJob Type: Full-time\n\n\nPay: $18.00 per hour\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nEmployee discount\nFlexible spending account\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nMonday to Friday\n\nCOVID-19 considerations:\nFully vaccinated employees do not need to wear masks, unvaccinated employees required to wear a mask.\n\n\nApplication Question(s):\n\n\nWhat is your desired compensation?\nBest email and phone number to reach you at?\n\nEducation:\n\n\nHigh school or equivalent (Required)\n\nExperience:\n\n\nCustomer service: 1 year (Preferred)\n\nWork Location: One location\n",
    "slug": "client-relations-specialist-1de66c84-a77e-4662-b0f4-094360545088",
    "benefits": [
      "Dental insurance",
      "Employee discount",
      "Health insurance",
      "401(k)",
      "Flexible spending account"
    ],
    "selectedSkills": [
      "Microsoft Excel",
      "Microsoft Powerpoint",
      "Laboratory experience",
      "Communication skills",
      "Microsoft Office",
      "High school diploma or GED",
      "US work authorization",
      "Background check"
    ],
    "jobType": "free",
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=5&job=DcdMpvYtk5XJoYHAagkAT7fjh-5R8ziSkKz3vELRrxvIgmraglMqOg"
  },
  {
    "position": "Production Associate I (Operations)",
    "labName": "MedPharm Iowa",
    "location": "Des Moines, IA",
    "age": "5 days ago",
    "type": "Full-time",
    "jobDescriptionCopy": "POSITION: Production Associate I (Operations)\n\n\nNote – Pursuant to Iowa law, all potential employees must pass a background check administered by the Iowa Department of Public Safety before MedPharm Iowa may present an offer of employment. Failure to satisfactorily pass such background check will disqualify a potential employee from employment with MedPharm Iowa.\n\n\nSUMMARY:\n\n\nMedPharm Iowa’s Production Associate I (Operations) assists the MedPharm Iowa operations teams at its medical cannabis manufacturing operation. The Production Associate I (Operations) assists the operations team with various tasks following formulation of medical cannabis products through the delivery process. Aspects of the job include packaging, labeling, data entry, and delivery of products to dispensaries across the state.\n\n\nMINIMUM EDUCATION AND EXPERIENCE:\n\n\nHigh school diploma required.\nTwo (2) plus years of experience in a professional work setting.\n\nESSENTIAL FUNCTIONS:\n\n\nAssist with day-to-day operations in a large-scale medical cannabis manufacturing operation.\nAssist the operations team with completing packaging process for formulated medical cannabis products.\nAssist the operations team with labeling medical cannabis containers efficiently and accurately.\nAssist the operations team with filling customer orders, including picking orders from inventory and staging for delivery.\nAssist the operations team with various customer relations projects.\nAssist with monitoring daily inventory and performing reconciliation using the compliance software.\nDocument all work conducted in accordance with state and local law.\nAssist with ensuring testing of all cannabis products in accordance with state law.\nDeliver medical cannabis products to dispensaries and the laboratory.\nPromote a positive work environment in line with established policies and procedures.\nAssist with managing the cleanliness and organization of workspaces.\n\nOTHER FUNCTIONS:\n\n\nAssist with other manufacturing production tasks as assigned.\nComply with all company policies, including confidentiality and non-disclosure agreements.\n\nESSENTIAL SKILLS:\n\n\nStrong communication and interpersonal skills.\nExcellent analytical abilities.\nMust be reliable and maintain good attendance.\nMust be team oriented.\nStrong project management, troubleshooting, and problem-solving skills.\nAbility to effectively prioritize and execute tasks in a high-pressure environment.\nHigh attention to detail.\nAbility to work effectively under time constraints as necessary.\nProficient in English.\nValid driver’s license and clean driving record.\nExperience with Microsoft Word and other MS products as well as the ability to learn other software programs as needed.\nAbility to work weekends.\n\nPHYSICAL EFFORT NEEDED:\n\n\nMust be able to lift at least fifty (50) pounds, be on feet all day, work in hot and cold environments.\n\nTYPICAL NUMBER OF DIRECT REPORTS:\n\n\nZero (0).\n\nENVIRONMENTAL CONDITIONS:\n\n\nExposed to dust, dirt, mud, varying temperatures, varying humidity levels, varying light intensities, and some solvents.\nMust be able to walk, bend, kneel, and read and write numbers and letters.\n\nPERSONAL PROTECTIVE EQUIPMENT:\n\n\nNone.\n\nTRAVEL:\n\n\nSome travel may be required for training purposes and for staying abreast of industry developments.\n\nIn MedPharm Iowa’s culture, this position may be required to perform additional duties as needed. The above noted document is not intended to describe, in exhaustive detail, the multitude of tasks that may accompany the position, but rather to give the team member a general sense of the responsibilities and expectations. As the nature of business demands change, so too do the essential functions of the position.\n\n\nMedPharm Iowa is an at will employer. This document is not meant to be an offer, contract, or promise of future or continued employment. For more information, contact human resources.\n\n\nMedPharm Iowa is an equal opportunity employer.\n\n\nJob Type: Full-time\n\n\nPay: From $15.00 per hour\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nEmployee discount\nFlexible spending account\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nParental leave\nRetirement plan\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nHolidays\nMonday to Friday\n\nSupplemental Pay:\n\n\nBonus pay\n\nApplication Question(s):\n\n\nWhat are your pay expectations?\n\nEducation:\n\n\nHigh school or equivalent (Preferred)\n\nWork Location: One location\n",
    "slug": "production-associate-i-operations-886a17a7-5eaf-4b24-9a4d-faeb6e55d321",
    "benefits": [
      "Health savings account",
      "Dental insurance",
      "Employee discount",
      "Health insurance",
      "401(k)"
    ],
    "selectedSkills": [
      "Communication skills",
      "Project management",
      "Analysis skills",
      "Driver's License",
      "Microsoft Word",
      "High school diploma or GED",
      "Clean driving record",
      "Background check"
    ],
    "jobType": "free",
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=5&job=Y0UJpBCjuKbx2_aUuCxtVZPj_h1BE7GO-ncHC0dRNFvOyI2sDQ6uWQ"
  },
  {
    "position": "Customer Service Associate",
    "labName": "New Bloom Labs",
    "location": "Chattanooga, TN",
    "age": "1 day ago",
    "type": "Full-time",
    "salaryMin": "$15 an hour",
    "jobDescriptionCopy": "New Bloom Labs is a rapidly-growing testing laboratory company providing analytical services to the cannabis industry. We are searching for an organizational phenom and customer service expert to serve as an effective first impression and helpful source of information and troubleshooting. The ideal candidate will also provide general assistance to company management, and organize and execute general office functions. Advanced proficiency in Excel/Google Sheets is critical.\n\n\nYou will require a thorough working knowledge of common business software applications, as well as an easy ability to learn industry-specific software ecosystems. A detailed job description follows:\n\n\nReports To: Director of New Markets, CEO\n\n\nSummary\n\n\nThe Customer Service Associate is responsible for day-to-day execution of general front office functions of the company including telephone reception, managing, referring and/or closing basic customer service and sales inquiries, resolving daily customer payments, orders, and accounts, organization of office assets, general light assistance for company management, and completion of special projects.\n\n\nEssential Functions\n\n\nReasonable accommodations may be made to enable individuals with disabilities to perform essential functions.\n\n\nCustomer service\nTelephone reception and etiquette\nProblem solving\nCollaboration with colleagues as well as outside vendors and customers\nWritten and oral communication\nOffice organization\nSoftware utilization\n\nCompetencies\n\n\nExcellent proficiency in Excel/Google Sheets is critical\nCommunication proficiency\nTime management\nCollaboration skills\nPersonal effectiveness/credibility\nFlexibility\nKnowledge of common software applications\nStress management/composure\nPositive attitude\nStrong written communication skills\n\nSupervisory Responsibility\n\n\nThis position has no supervisory responsibility\n\n\nWork Environment\n\n\nThis position operates in a professional office and occasional laboratory environment.\n\n\nPhysical Demands\n\n\nThis is a largely sedentary role at a computer workstation, however, some lifting will be required. This requires the ability to lift and move moderate size and weight boxes with the available assistance of tools.\n\n\nPosition Type: Full-Time\n\n\nEducation and Experience\n\n\nDemonstrable customer service experience, required.\nGeneral knowledge of office workflows and practices, required.\nAbility to maintain attention to detail with good organizational skills is critical.\n\nOther Duties\n\n\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this position. Duties, responsibilities and activities may change at any time without notice.\n\n\nJob Type: Full-time\n\n\nPay: $15.00 per hour\n\n\nBenefits:\n\n\nPaid time off\n\nSchedule:\n\n\nDay shift\nMonday to Friday\n\nAbility to commute/relocate:\n\n\nChattanooga, TN 37416: Reliably commute or planning to relocate before starting work (Required)\n\nWork Location: One location\n",
    "slug": "customer-service-associate-d526ff3b-eaa7-4746-bf28-d9abbcffbf68",
    "benefits": ["Paid time off"],
    "selectedSkills": [
      "Communication skills",
      "Customer service",
      "Microsoft Excel",
      "Time management",
      "Organizational skills"
    ],
    "jobType": "free",
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=5&job=eeIkKRNy27e7FWD9OKenIIlh3qeO7_ZU18xUH-0foed5A3_-6Q56jA"
  },
  {
    "position": "Manufacturing Technician",
    "labName": "Mana Supply",
    "location": "St. Louis, MO",
    "age": "6 days ago",
    "type": "Part-time",
    "salaryMin": "$15 an hour",
    "jobDescriptionCopy": "The Manufacturing Technician will provide direct assistance to the manufacturing process for medical marijuana products. This person will help to produce and package products. This is a part-time position.\n\n\nDuties and Responsibilities:\n\n\nProduce medical cannabis food products Ensure that all medical marijuana food products meet state requirements.\nStoring supplies and equipment, disposal of waste according to guidelines, and keeping laboratory, storerooms and working areas immaculate.\nWashing and sterilizing laboratory glassware.\nPackage all marijuana products in their correct packaging.\nOperate packaging equipment.\nApply labels, barcodes, and testing results to product containers.\nMaintain inventory counts.\nWorks in a timely manner and strives to increase productivity.\nMaintain a culture of professionalism.\nOther duties as assigned.\n\nQualifications and Education:\n\n\nExperience in the medical marijuana industry is preferred, but not required.\nMust be able to sit or stand for extended periods of time.\nAble to move about a typical office, manufacturing and warehouse environment.\nAble to lift and move up to 50 pounds.\nHigh School Diploma or Equivalent.\nMust be at least 21 yrs of age.\n\nJob Type: Part-time\n\n\nPay: $15.00 per hour\n\n\nBenefits:\n\n\nFlexible schedule\n\nSchedule:\n\n\n8 hour shift\nDay shift\n\nAbility to commute/relocate:\n\n\nSaint Louis, MO 63134: Reliably commute or planning to relocate before starting work (Required)\n\nWork Location: One location\n",
    "slug": "manufacturing-technician-bb56707b-09db-488a-9033-d8b5df4fa367",
    "benefits": ["Flexible schedule"],
    "selectedSkills": [
      "High school diploma or GED",
      "21 years or older",
      "US work authorization"
    ],
    "jobType": "free",
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=5&job=kYIEZO-WWhtB3EjCGnjcU8K5ukugx2Ch6vgJuXbRXB35QyW-qCj70w"
  },
  {
    "position": "Courier and Accessioning Technician",
    "labName": "Rm3 Labs",
    "location": "Broomfield, CO",
    "age": "4 days ago",
    "type": "Full-time",
    "salaryMin": "$17 an hour",
    "jobDescriptionCopy": "Company Description\n\n\nSince our founding in 2009, Rm3 Labs has been a leader in providing scientific analysis for the cannabis community of Colorado. As a fully independent, analytical laboratory located in Broomfield, we bring state-of-the-art scientific expertise and technology to help our clients produce safe, pure, and effective cannabis products. We are ISO/IEC 17025 accredited and licensed and certified by the State.\n\n\nJob Summary\n\n\nWe are looking for a full-time Courier and Accessioning Technician to plan routes, pick up samples from client facilities in the Denver metro area, Fort Collins/Boulder, and/or Colorado Springs/Pueblo, accession samples in-house, and provide excellent customer service.\n\n\nThis position will require driving in a personal vehicle (58 cents per mile mileage reimbursement paid when using personal vehicle) or the company car, if available. It is estimated that a personal vehicle will need to be used for 150 - 200 miles per week. After courier routes, the rest of the workday will be spent in the lab accessioning samples into our system.\n\n\nThe schedule for this position is Mondays through Fridays from 8:30am - 5pm, unless assigned the south route, in which case the scheduled hours will be from 5:30am - 2pm.\n\n\nBenefits include three weeks of paid time off, six paid holidays, maternity/paternity leave, subsidized healthcare and dental insurance, holiday bonus based on performance, and professional development assistance.\n\n\nResponsibilities\n\n\nMaintain Rm3 Labs’ brand essence when communicating with clients and lab visitors by demonstrating professional, courteous and cooperative behavior.\nMaintain general knowledge on Rm3 Labs’ services, METRC, and current testing and sampling rules.\nComply with State, Local, OSHA, and ISO 17025 requirements.\nPlan and follow the most efficient routes for picking up samples and drive safely to client facilities to pick up samples.\nReceive samples from client facilities and accession samples into our system in-house.\nCheck samples for accuracy, tampering and/or possible adulteration and ensure all pertinent information is documented.\nLabel samples with the internal Rm3 Labs ID and test analyses required and deliver samples to the appropriate department inbox.\nOther administrative tasks, as assigned.\nReport concerns or manifest questions to the Accessioning Lead or Client Service Lead.\n\nRequirements\n\n\nMust pass an extensive background check with no felony convictions and obtain a Colorado Department of Revenue – Marijuana Enforcement Division (DOR-MED) employee license prior to or at the time of hire.\nExcellent driving record and a reliable vehicle.\nExperience in customer service, data entry, and/or similar high-volume, detailed work.\nAble to work independently and part of a team in a fast-paced environment.\nAble to interact professionally with colleagues and bring up concerns immediately when you are faced with them.\nGood written and verbal communication skills.\nDetail and accuracy oriented.\n\nThe Ideal Candidate\n\n\nEnjoys driving.\nThrives in a fast-paced, professional, and fun work environment.\nIs self-motivated and focused on continual improvement.\nHas a passion for the cannabis industry.\nCannabis industry experience and/or METRC experience is a strong plus.\nHaving a current MED employee badge is a strong plus.\nComputer skills and experience in Windows and Microsoft Office is a plus.\n\nJob Type: Full-time\n\n\nPay: $17.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid sick time\nPaid time off\nParental leave\n\nSchedule:\n\n\nDay shift\nMonday to Friday\n\nSupplemental Pay:\n\n\nPerformance bonus\n\nTrucking Driver Type:\n\n\nCompany driver\n\nTrucking Route:\n\n\nLocal\nRegional\n\nCOVID-19 considerations:\nWe require employees to wear masks.\n\n\nApplication Question(s):\n\n\nAre you a Colorado resident? Unfortunately, we can only consider Colorado residents at this time.\nAre you comfortable driving your own vehicle with a 58 cent per mile mileage reimbursement for about 150 - 200 miles per week?\nDo you already have a MED badge?\nPlease list all the times you are available for a 15-30 min phone interview over the next two weeks.\n\nLicense/Certification:\n\n\nDriver's License (Required)\n\nWork Location: One location\n",
    "slug": "courier-and-accessioning-technician-3cbed5cc-5685-4054-a02d-2eda715d086d",
    "benefits": [
      "Dental insurance",
      "Health insurance",
      "Mileage reimbursement",
      "Paid time off",
      "Professional development assistance"
    ],
    "selectedSkills": [
      "Customer service",
      "Driver's License",
      "Computer skills",
      "Communication skills",
      "Data entry",
      "Background check",
      "Reliable transportation"
    ],
    "jobType": "free",
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=5&job=-UE4QuZPPBBnlJUv3wtCiTo1J9infxOeRrOjc0LYx8fefVzObC29Tg"
  },
  {
    "position": "Sales Manager",
    "labName": "PharmLabs LLC",
    "location": "San Diego, CA",
    "age": "22 hours ago",
    "type": "Full-time",
    "salaryMin": "$40,000 ",
    "salaryMax": " $60,000 a year",
    "jobDescriptionCopy": "Since 2011, PharmLabs has been Southern California's premier ISO/IEC 17025 certified cannabis and hemp testing laboratory. We provide the hemp and cannabis community throughout California and beyond with chemical and biological analytical laboratory testing to ensure safe and compliant products.\n\n\nWe have a current opening for a self-motivated, reliable, and experienced individuals to assist us with sales and marketing efforts throughout Southern California. This is an incredible opportunity to enter into the \"Green Rush\" to work with one of the most trusted scientific laboratories in the cannabis business. This position is salary plus heavy commissions.\n\n\nTITLE: Sales Representative\n\n\nPOSITION SUMMARY:\n\n\nThe incumbent will be responsible for selling laboratory testing services such as pesticide, heavy metal, residual solvent and cannabinoid potency testing to other businesses such as cultivators, manufactures and distributors that specialize in cannabis and/or CBD/hemp industries. The incumbent will work at the laboratory in San Diego. at home and/or traveling throughout Southern California with some overnight stays required.\n\n\nESSENTIAL DUTIES AND RESPONSIBILITIES:\n\n\nGenerating leads,\nUsing CRM software Hubspot to track everything\nMeeting leads and clients face to face,\nCold calling,\nCustomer retention,\nAttending events\nIncreasing overall sales while meeting obtainable sales goals.\n\nREQUIREMENTS:\n\n\n-Valid Driver's License and Insurance\n\n\n-Must be 21+ years of age\n\n\n-Must have a clean driving record\n\n\n-Completed 2 years of college coursework\n\n\n-Strong communication skills\n\n\n-Adaptability and flexibility\n\n\n-Attention to detail\n\n\n-Strong work ethic\n\n\n-Must be able to pass a Live Scan background check prior to and periodically throughout employment\n\n\n-Must not be employed or have any ownership in any other CA cannabis industry license type\n\n\nJob Type: Full-time\n\n\nPay: $40,000.00 - $60,000.00 per year\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nHealth insurance\nMileage reimbursement\nPaid time off\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\n\nSupplemental Pay:\n\n\nBonus pay\nCommission pay\n\nEducation:\n\n\nAssociate (Preferred)\n\nExperience:\n\n\nSales Experience: 2 years (Preferred)\n\nLicense/Certification:\n\n\nDriver's License (Preferred)\n\nWork Location: One location\n",
    "slug": "sales-manager-a3945418-3777-4e2f-9f5f-e540f64de711",
    "benefits": [
      "Health insurance",
      "Mileage reimbursement",
      "401(k) matching",
      "Paid time off",
      "401(k)"
    ],
    "selectedSkills": [
      "Driver's License",
      "Sales",
      "Communication skills",
      "Associate's degree",
      "21 years or older",
      "Clean driving record",
      "Background check"
    ],
    "jobType": "free",
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=5&job=0CjFHInkIIy3E1kpqYcXFdbfa78um0VKfxOgBNjg7XJdU_yGdD8qcQ"
  },
  {
    "position": "Sales and Marketing Associate",
    "labName": "CMB Squared Inc",
    "location": "Riverside, CA",
    "age": "9 hours ago",
    "type": "Full-time",
    "jobDescriptionCopy": "The Account Manager will work with new and existing accounts to sell cannabis and hemp testing packages from R&D testing (pesticide, potency, heavy metals, etc.) to California Compliance testing to ensure products are safely tested prior to sale. The successful candidate will be eager to learn and grow Canalyte’s market share, understand the unique needs of clients in the Cannabis/CBD/Hemp industries, and work collaboratively with all divisions to meet company goals.\n\n\nResponsibilities:\n\n\nBecome the reliable point of contact and trusted partner for all of your client’s testing needs\nAct as a liaison between the lab and customer to review results and address any testing concerns\nAttend shows, conventions and networking events in the cannabis industry to provide company brand presence and establish industry relationships\nVisit and drive to client locations to collect cannabis samples back to the laboratory as well as foster client relations\nCreate quotes/invoices for new accounts\n\nQualifications\n\n\nMust be 21+ years of age\nExcellent communication skills\nExcellent customer service skills\nHigh level of organization and time management\nProven customer support and sales background of at least 3 years\nAttention to detail\nStrong work ethic & a competitive nature\nCompleted an Associate’s degree or higher\nValid Driver’s License and Insurance\nPrior experience in Cannabis industry and scientific background a plus\n\n*\n\n\nJob Type: Full-time\n\n\nPay: From $43,000.00 per year\n\n\nBenefits:\n\n\nHealth insurance\n\nSchedule:\n\n\nMonday to Friday\n\nSupplemental Pay:\n\n\nCommission pay\n\nEducation:\n\n\nAssociate (Preferred)\n\nExperience:\n\n\nSales Experience: 3 years (Preferred)\n\nWork Location: One location\n",
    "slug": "sales-and-marketing-associate-995d1468-968a-4f56-a4ba-752b44c102d6",
    "benefits": ["Health insurance"],
    "selectedSkills": [
      "Customer service",
      "Driver's License",
      "Sales",
      "Customer support",
      "Communication skills",
      "Associate's degree",
      "21 years or older"
    ],
    "jobType": "free",
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=5&job=s3kO9s1IhrKAaz8TrRHYkeEn3pFfxPvq884iw4shQidZEvT4yzrI_Q"
  }
]
