[{"position":"Environmental & Cannabis Laboratory Assessor (Compliance Specialist 3) – 2 positions, 1 permanent and 1 limited duration (24 months)","labName":"Oregon Health Authority","location":"Hillsboro, OR","age":"1 day ago","type":"Full-time","salaryMin":"$4,993 ","salaryMax":" $7,664 a month","jobDescriptionCopy":"Initial Posting Date:\n05/13/2022\n\nApplication Deadline:\n06/12/2022\n\nAgency:\nOregon Health Authority\n\nSalary Range:\n$4,993 - $7,664\n\nPosition Type:\nEmployee\n\nPosition Title:\nEnvironmental & Cannabis Laboratory Assessor (Compliance Specialist 3) – 2 positions, 1 permanent and 1 limited duration (24 months)\n\nJob Description:\nThese positions are full-time, classified positions which are represented by a union.\n\nThe Oregon Health Authority (OHA), Public Health Division (PHD), Oregon State Public Health Laboratory (OSPHL) in Hillsboro, OR is seeking two Environmental & Cannabis Laboratory Assessors, one limited duration and one permanent, to assess environmental and cannabis testing laboratories for regulatory compliance.\n\nWhat will you do?\nAs an Environmental & Cannabis Laboratory Assessor, you will perform the following duties:\n\nPerform microbiology, chemistry, and quality systems assessments of environmental and Cannabis testing laboratories to determine compliance with the TNI Standard as implemented through ORELAP, federal, state, and local rules and regulations pertaining to environmental laboratories.\n\nPerform document reviews of environmental laboratory testing methods, analyze data records and quality system documentation to determine compliance with the TNI Standard as implemented through ORELAP, federal, state, and local rules and regulations.\n\nAssign the severity of laboratory deficiencies cited and monitor corrective actions that are implemented to settle instances of non-compliance.\n\nDevelop program goals, objectives, and action plans with program staff and inter-agency partners.\n\nParticipate in the national TNI consensus standards development.\n\nFormulate ORELAP policies and procedures that reflect the TNI Standards.\n\nLaboratories that are assessed may be in or out-of-state and often require overnight travel.\n\nAct as backup to the ORELAP manager to prepare invoices and certificates, add tests/analytes to the ORELAP database, and prepare assessment reports\n\nWhat's in it for you?\nThe public health division is a team of passionate individuals working to promote health across the lifespan of individuals, families, and communities. We value and support unique perspectives using a trauma-informed approach and aim to reflect these values in our hiring practices, professional development, and workplace. We are committed to racial equity as a driving factor to improve health outcomes for all communities that experience inequities.\n\nWe offer full medical, vision and dental benefits with paid sick leave, vacation, personal leave and 10 paid holidays per year plus pension and retirement plans. If you are experienced determining compliance in a clinical laboratory, apply today!\n\nWhat are we looking for?\n\nMinimum Requirements\n\nA bachelor’s degree in chemistry or microbiology or a related natural science degree AND three years of experience in an environmental or cannabis laboratory or a related facility that included compliance testing;\n\nOR\n\nFive years of experience doing administrative research in an environmental or cannabis laboratory or a related field that included compiling and evaluating facts to recommend management action or decide compliance or eligibility with program guidelines and regulations. Three of the five years must be above the technical support level;\n\nRequested Skills\n\nPreference will be given to applicants with a minimum of a bachelor’s degree in microbiology, chemistry, or a related field, AND recent environmental or cannabis laboratory experience.\n\nExperience working in an environmental or cannabis laboratory environment.\n\nExperience evaluating laboratories and quality systems.\n\nKnowledge of the TNI Standards.\n\nExperience working with drinking water regulations, data reduction, and reporting techniques.\n\nMust have the ability to obtain certifications in two drinking water disciplines (inorganic, organic, and/or microbiology).\n\nMust successfully complete the Basic Assessor Training Course, Technical Course for Microbiology, Inorganic Chemistry, Organic Chemistry, and refresher courses.\n\nProfessional, diplomatic oral and written communication skills required.\n\nProficient use of Word, Excel, Access, Outlook, and MS Teams.\n\nOut of state travel required five to ten times per year for state laboratory assessments and training.\n\nThis recruitment announcement will be used to establish a list of qualified candidates to fill the current vacancy and may be used to fill future vacancies as they occur.\n\nHow to Apply\n\nComplete the online application\n\nComplete questionnaire\n\nAttention current State of Oregon employees: To apply for posted positions, please close this window, and log into your Workday account and apply through the career worklet.\n\nNOTE: Please ensure you’ve provided a thorough and updated application as it pertains to the position for which you are applying. Your application materials will be used to determine salary based on a pay equity assessment. For further information, please visit the Pay Equity Project homepage.\n\nQuestions/Need Help?\n\nIf you need assistance to participate in the application process, including an accommodation request under the American with Disabilities Act contact: Cyndi Phipps-Roman at cynthia.phipps-roman@state.or.us.\n\nTTY users please use the Oregon Telecommunications Relay Service: 1-800-735-2900. For technical support, please call toll free 1-855-524-5627, for customer service assistance.\n\nAdditional Information\n\nPlease monitor your Workday account to view all communication regarding your application. You must have a valid e-mail address to apply.\n\nIf you are a veteran, you may receive veteran’s preference. Click here for more information about veterans’ preference. If you checked that you are a veteran, you will be required to provide your documents later in the process.\n\nWe do not offer VISA sponsorships or transfers currently. You will be required to complete the US Department of Homeland Security's I-9 form confirming authorization to work in the United States within three days of hire.\n\nIf you are offered employment, your offer will be contingent upon the positive outcome of an abuse check, criminal records check and driving records check. The information will be shared with the Oregon Health Authority (OHA), Office of Human Resources (OHR). Any criminal or founded abuse history will be reviewed and could result in the withdrawal of the offer or termination of employment.\n\nPlease attach only the documents that are related to the position such as cover letter, resume and transcripts. Additional documents that are attached will not be reviewed.\n\nApplicant Help and Support webpage\n\nAffirmative Action, Equal Opportunity, and Pay Equity\n\nThe Oregon Health Authority is an affirmative action and equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, gender expression, national origin, age, protected veteran or disabled status, genetic information, or any other protected class under state or federal law. In addition, we do not discriminate, or screen applicants based on current or past compensation. We determine salary by reviewing your application materials to evaluate your related education, experience, and training for this position. For further information, please visit the Pay Equity Project homepage. To learn more about OHA’s mission, vision, and core values, click here.\n\nThe Oregon Health Authority is an equal opportunity, affirmative action employer committed to workforce diversity and anti-racism.","slug":"environmental-cannabis-laboratory-assessor-compliance-specialist-3-2-positions-1-permanent-and-1-limited-duration-24-months-ec5bda78-f679-40ed-8321-22eb4f7f01ae","benefits":["Dental insurance","Health insurance","Paid time off","Paid sick time","Vision insurance"],"selectedSkills":["Technical support","Microsoft Excel","Laboratory experience","Communication skills","Microsoft Access","Bachelor's degree","US work authorization"],"jobType":"free","applyURL":"https://oregon.wd5.myworkdayjobs.com/en-US/SOR_External_Career_Site/job/Hillsboro--OHA--Evergreen-Parkway/Environmental---Cannabis-Laboratory-Assessor--Compliance-Specialist-3----2-positions--1-permanent-and-1-limited-duration--24-months-_REQ-97100"},{"position":"Accreditation Officer","labName":"American Association For Laboratory Accreditation","location":"Frederick, MD","age":"3 days ago","type":"Full-time","salaryMin":"$57,000 ","salaryMax":" $77,000 a year","jobDescriptionCopy":"Description: A2LA is a non-profit, public service membership organization offering compliance and accreditation services to organizations all over the world. A2LA is dedicated to formally recognizing testing, calibration and other laboratories and related organizations for their quality and technical competency with a variety of international standards (ISO/IEC 17025, ISO 15189, etc.), federal requirements (FDA, GLP, FCC, etc.), state (cannabis, etc.), and local requirements (water testing, etc.).\nWhether it is the clean air that you breathe, the water you drink, or the vehicle you drive, A2LA helps make the world a better, safer place by working to ensure that organizations are releasing products and services that are meeting testing and quality standards. Detailed information about our services can be found on our website at https://www.a2la.org/about.\nThe RoleA2LA is seeking a motivated professional to oversee the day-to-day accreditation operation and ensure the quality of laboratories by monitoring the processes, procedures, and applicable standards. This is an exceptional opportunity to grow within a global non-profit organization as an Accreditation Officer.\nNo accreditation experience, no problem! A2LA provides extensive onsite training to ensure a candidate's success within our organization and in this position. This includes a detailed six-month mentoring program.\nAbout YouYou are a detail-oriented thinker with a strong customer orientation. You have proven excellent communication skills and have the capacity to learn technical content. You know how to manage your time effectively and can adapt to changing priorities. You are a quick learner who is dedicated to improving.*\nResponsibilities*\n\n\nServe as the A2LA contact for current accredited laboratories and laboratories seeking accreditation.\nFacilitate the accreditation process for various laboratories seeking and maintaining accreditation.\nReview and audit information submitted, including reports and corrective actions, ultimately making a recommendation to accredit or not to accredit based on information collected.\nBecome a subject matter expert for various standards, requirements, regulations, policies, and procedures.\nMaintain up to date data and information for accredited laboratories, those seeking accreditation, and stakeholders.\nRespond to inquiries via telephone and/or email.\nParticipate in the Annual A2LA Technical Forum and Annual Meeting.\nOpportunities exist for travel to testing and/or calibration laboratories on the behalf of A2LA.\nThis position does not include hands-on technical work.\n\n. Requirements: A2LA may provide exceptions to educational requirements for veterans who demonstrate the ability to perform the duties listed in this job posting.\nA successful candidate for these positions typically meets the following criteria:\n\n\nBachelor's degree in a scientific field of study (Engineering, Mathematics, Physics, Life Science, Biology, Chemistry, etc.) preferred. Other degrees may be considered.\nExcellent interpersonal and oral/written communication skills.\nAbility to work independently and remain self-motivated.\nBasic computer proficiency (Word, Excel, and Outlook).\nKnowledge of quality management systems (QMS) is preferred but not required.\nLaboratory experience preferred but not required.\n\nBenefits and Compensation\nThe salary for this position is commensurate with experience. In addition, A2LA offers a robust 403(b) retirement plan and benefits package including medical, dental, HSA, FSA (medical and dependent), life insurance, short- and long-term disability, employee assistance program (EAP), AFLAC, tuition reimbursement and other pre-taxed benefits, paid-time off, 10 paid government holidays, 1 floating holidays, training and development, career advancement opportunities and much more!\nWorking Environment & Physical Requirements\nThe physical demands and work environment described here reflect those of a person, in this position, will typically encounter.\n\n\nPhysical Demands: While performing the duties of this job, the employee is required to walk; sit for long hours, use fingers for typing; talk and hear. Specific vision abilities required by the job include close vision for reviewing documents on the computer or in hard copy state.\nWork Environment: Work is typically performed in an office setting. Hours are flexible, but they should normally encompass at least the core hours of 9:00AM to 3:00PM, total at least forty (40) hours for each work week, and suit the needs of various training clients, where appropriate.\n\nTo perform this job successfully, an individual must be able to perform the essential duties satisfactorily. The requirements listed above are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\nA2LA is an equal opportunity employer. A2LA does not discriminate in employment based upon race, color, religion, national origin, citizenship status, ancestry, age, sex (including sexual harassment), sexual orientation, marital status, physical or mental disability, military status or unfavorable discharge from military service, or any other federally protected classification.\nMilitary/Military Spouse Personnel are encouraged to apply.\n\n\nJob Type: Full-time\n","slug":"accreditation-officer-bad9f5a8-f097-45ed-8704-6689483b2f7c","benefits":["Health savings account","Dental insurance","403(b)","Health insurance","Employee assistance program"],"selectedSkills":["Quality management","Microsoft Excel","Computer skills","Microsoft Outlook","Laboratory experience","Bachelor's degree"],"jobType":"free","applyURL":"https://recruiting.paylocity.com/recruiting/jobs/Details/1088597/American-Association-For-Laboratory-Accreditation/Accreditation-Officer"},{"position":"Quality Assurance Associate - Laboratory","labName":"Montrose Environmental Group, Inc.","location":"Deer Park, TX","age":"2 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 2,000+ employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicity testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Deer Park, TX Laboratory is currently seeking a Full-Time QA Associate to join our team. The QA Associate is an entry level role, assisting in ensuring that the laboratory’s data and Quality Assurance system meets regulatory and client requirements, with the goal of producing data of known and documented quality.\n\nAs a key member of the laboratory team, this role will be responsible for a full range of activities including:\n\nPerform peer and final review of environmental testing data\nCompile final reports, narrating deviations and outliers\nCollect, review, and interpret laboratory quality control data for performance and trends (logbooks, control charts, method detection and quantitation limit studies, performance testing samples)\nOrganize and control laboratory documents, including procedures, forms, training records, and archived data\nMonitor the status of other quality assurance elements, such as support equipment calibrations\nComply with Enthalpy’s Quality Assurance and Health and Safety Plans\nOther duties as assigned\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nUndergraduate degree in Chemistry, Biology, Environmental Sciences or related sciences, or\nPrevious laboratory experience that provides the knowledge, skills, and abilities to perform the job, through a combination of education, training, & experience.\n\nPREFERRED SKILLS\n\nStrong working knowledge of MS Excel, Word, and other software used in generating documents and spreadsheets\nStrong attention to detail, with a focus on pattern recognition and consistency\nGood editorial and proofreading skills\nGood problem solving and troubleshooting abilities\nEffective written and oral communication skills\nTime management skills\nAbility to collaborate with lab team members to gain an understanding of laboratory processes, gather, interpret and consolidate data, generate documents and reports\nWorking knowledge of analytical laboratory procedures\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"quality-assurance-associate-laboratory-569dcc16-e5f5-44e0-bee7-3294d1941be9","benefits":["Disability insurance","Tuition reimbursement","401(k)","Parental leave"],"selectedSkills":["Laboratory procedures","Microsoft Excel","Laboratory experience","Communication skills","Time management","Bachelor's degree"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-TX-Deer-Park-Seaco-Ct/Quality-Assurance-Associate---Laboratory_R2072?mode=job&iis=Job+Board&iisn=Indeed.com"},{"age":"","benefits":[],"selectedSkills":[],"jobType":"free"},{"position":"Lab Testing Coordinator","labName":"Solar Cannabis Co.","location":"Somerset, MA","age":"4 days ago","type":"Full-time","salaryMin":"$30,000 ","salaryMax":" $44,000 a year","jobDescriptionCopy":"About Us\n\nSolar Cannabis Co. is committed to implementing sustainable and innovative practices to cultivate a better future in Cannabis. Our vision is to set the standard for sustainability in the Cannabis industry.\n\nOur vertically integrated facility in Somerset, MA houses our cultivation operation, product manufacturing, and recreational retail dispensary. Our Seekonk retail location opened in December 2021 and our Dartmouth retail site is expected to open in 2022!\n\nWe offer a competitive salary & benefits package and strive to develop our employees to reach their personal goals within the cannabis industry.\n\nLocations\n\nSomerset (Fully Vertical)\n\nSeekonk (Dispensary - Retail only)\n\nDartmouth (COMING SOON)\n\nThe Position:\nWe are seeking an experienced Lab Testing Coordinator to join our team. In this exciting, newly created role, you will work heavily across multiple departments to coordinate lab samples, testing schedules, and maintain tracking manifests for laboratory transports.\n\nResponsibilities:\nWork across multiple departments to coordinate lab sample production schedule\nBuild and maintain tracking manifest for labs transport\nSchedule and oversee all lab logistics to/from state-certified testing laboratories\nMaintain relationships with key contacts at state-certified testing laboratories\nAct as main point-of-contact for all lab related internal tracking systems and databases\nCoordinate and schedule lab logistics between cultivation/post-harvest teams, cannabis manufacturing teams and kitchen teams\n\nQualifications:\nMETRC experience (Required)\nExcellent written and verbal communication skills\nIntermediate knowledge of Microsoft and Google suites\nStrong organizational and mathematical skills\nMust be able to meet deadlines in a fast-paced and changing environment.\nA proactive approach to problem-solving skills\nMinimum of 21 years of age.\nPossess valid driver’s license or state ID.\nMust pass all required background checks.\nAbility to work nights, holidays and weekends.\nMust be and remain compliant with any and all legal or company regulations for working in the industry.\nOccasionally moves up to 30+ pounds of equipment/materials/product within rooms (100 pounds with assistance).\nThis job function may include being in a stationary position or moving for extended periods of time.\n\nBenefits:\nMedical Insurance\nDental Insurance\nVision Insurance\nEmployee Discount\nPaid Time Off\n401(k) plan\n\nSolar Therapeutics is an Equal Opportunity Employer committed to building a diverse workforce as it values the knowledge, diversity and performance of our employees to make us a great company. Solar Therapeutics is an Equal Opportunity Employer and all applicants will be considered without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran, or disability status. Solar Therapeutics agrees to hire individuals with Cannabis-related CORI offenses.","slug":"lab-testing-coordinator-4a8028a2-a162-4943-b2c8-e9be8f31ef11","benefits":["Dental insurance","Employee discount","Health insurance","Paid time off","401(k)"],"selectedSkills":["Manufacturing","Driver's License","Laboratory experience","Communication skills","Math","21 years or older"],"jobType":"free","applyURL":"https://secure2.entertimeonline.com/ta/SolarTherapeutics.careers?ShowJob=453136640"},{"position":"Environmental Laboratory Technician I","labName":"Montrose Environmental Group, Inc.","location":"Durham, NC","age":"6 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Durham, NC facility is currently seeking a Full-Time Technician I.\n\nAs a key member of the laboratory team, this role will be responsible for a full range of activities including:\n\nRole and Responsibilities\n\nPreparation of samples for analysis\nPreparation of reagents for lab use and/or shipment\nSample extractions\nDetermining the volume of samples\nCleaning of laboratory glassware\nMaintaining clean laboratory areas\nMaintaining organized records of sample preparation and analysis\nOverhead projects designed to improve efficiency of, or accuracy of analyses\nAssisting the Group Leaders and analysts in acquiring and inventorying consumables, chemicals, and parts for instrumentation\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Lab Director\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nHigh school diploma or general education degree (GED) required, associate's or Bachelor's degree in a scientific field preferred\nA Tech I has shown that they understand the physical and chemical principles underlying why procedures are specified the way they were for each method with which they work.\nTheir documentation, timeliness, and throughput must meet the standard of the laboratory.\n\nPreferred Skills\n\nPrior Laboratory experience required\nKnowledge general lab practices and lab safety\nAbility to work independently and in a team\nGood organizational skills and strong communication skills\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"environmental-laboratory-technician-i-94ab5115-e153-4fd8-92ff-f8be10ff8850","benefits":["401(k)","Disability insurance","Parental leave","Tuition reimbursement"],"selectedSkills":["Laboratory experience","Communication skills","Organizational skills","Bachelor's degree","High school diploma or GED","Associate's degree"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-NC-Durham-Capitola-Drive/Environmental-Laboratory-Technician-I_R2060?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Laboratory Technician I (Semi-Volatile)","labName":"Montrose Environmental Group, Inc.","location":"Richmond, VA","age":"6 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nA Laboratory Technician I is responsible for performing tasks required to meet the expectations of our clients, in addition to efficiently and profitably generating defensible data in a timely manner. The ideal candidate will have experience in working under possibly hazardous conditions (e.g. pathogens or chemicals). He/She/They will be well-trained to maintain safety conditions and will be passionate for doing work that makes things move forward\n\nAs a key member of the Richmond Laboratory team, this role will be responsible for a full range of activities including:\n\nROLES AND RESPONSIBILITIES\n\nReceives environmental samples into the laboratory according to Enthalpy’s SOPs\nPerforms data entry of sample and test information into Laboratory Information System (LIMS)\nLabel sample containers, store them in appropriate locations and/or contact the proper department to inform them of short holding time and/or rush requests.\nAssists in sample bottle preparation\nAssists in sample management/archiving and disposal\nAssists in sample pickup or field sampling, if needed\nAssists in the coordination of daily field sampling/pickup schedule, if needed\nParticipates in focus teams to improve efficiency\nComply with Enthalpy’s Quality Assurance Program\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nHigh School Diploma or GED. Associate’s degree or equivalent and relevant formal academic/vocational qualifications preferred.\nSome lab experience is preferred but not required.\n\nPREFERRED SKILLS\n\nKnowledge of general lab practices and lab safety\nAble to multi-task and communicate effectively (both oral and written)\nAble to work independently and make sound decisions\nWell organized and have an attention to detail\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air, water and soil measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you will get tons of guidance and plenty of support from talented, super-smart colleagues in tackling head-scratching professional challenges. If this scenario attracts you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"laboratory-technician-i-semivolatile-5afc29fd-cadb-402b-a209-76ff7d39a517","benefits":["401(k)","Disability insurance","Parental leave","Tuition reimbursement"],"selectedSkills":["Laboratory experience","High school diploma or GED","Associate's degree"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-VA-Richmond-Reymet-Rd/Laboratory-Technician-I--Semi-Volatile-_R2058?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Dispensary Inventory Supervisor","labName":"deep roots harvest","location":"Las Vegas, NV","age":"6 days ago","salaryMin":"$39,000 a year","jobDescriptionCopy":"Reports to:Retail Store Manager\n\nDepartment:Retail\n\nRequired Permits/Licensing/Registration: Marijuana Establishment Agent Card\n\nFLSA Status:Exempt\n\nSupervisory Responsibilities:\nDispensary Inventory Lead\n\nDispensary Hosts\n\nOverview:\nFollowing policies set forth by the Company in concert with the Retail Manager and Sales, provide support in the general operation of the company through the organization and management of Dispensary inventory to maximize operational efficiency.\n\nEssential Functions:\nSupport the operations of the Retail Department by accurate and efficient management of all merchandise and cannabis product inventories.\n\nFulfill daily obligations to the satisfaction of supervisory staff\n\nThorough communication of any obstacle which limits their capability to see individual duties through to completion\n\nRelay to superiors any conditions observed that may affect the successful completion of that day’s work.\n\nComplete or oversee everyday inventory control responsibilities including but not limited to;\n\nAssignment, generation, and application of required packaging tags\n\nIncoming internal and external product transfers (acceptance upon intake)\n\nTransfer manifest acceptance (upon verification of physical inventory received)\n\nVerification of the receipt of all required transfer specific supporting documentation for all products received including:\n\nIndependent Testing Laboratory Certificates of Analysis\n\nSoil Amendments/Disclosures\n\nAddition of saleable products to POS inventory\n\nPerformance of periodic, monthly, and quarterly inventory reconciliations\n\nAll matters related to compliance of State and Federal regulations.\n\nUtilizes internal and Department of Taxation mandated databases to ensure accuracy of incoming shipments and corresponding manifests/invoices\n\nFulfill assigned responsibilities in line with procedures set forth by all department Standard Operating Procedures and subsequent training\n\nOther duties as assigned\n\nJob Specifications:\nOperate under the guidelines provided by company policies and procedures.\n\nAbility to understand and complete all given directives in a timely manner.\n\nAbility to communicate clearly whether verbally or in writing\n\nBasic understanding of compliance software and job specific information technology\n\nAdherence to all industry standards set forth by Local, State, and Federal regulations.\n\nCapacity to work autonomously to achieve daily directives and department goals.\n\nFlexible work schedule required; to include covering a vacant shift and/or facility issues in emergency situations as needed.\n\nRepresent the company in a professional manner when communicating or interacting with all local community, state, or federal officials.\n\nObserve and maintain all safety procedures and protocols\n\nAdditional Functions:\nAbility to be flexible and work in various sectors of the department or company as needed and/or requested by their direct supervisor.\n\nAbility to listen well and communicate effectively orally and in writing with various audiences.\n\nAbility to use initiative and independent judgment appropriately.\n\nAbility to apply appropriate public relations skills in various situations and circumstances and to facilitate change as needed.\n\nThe ability to work in a fast-paced, changing and challenging environment.\n\nMust be proficient in Windows based software and point of sale applications.\n\nMust have excellent communications skills and attention to detail.\n\nAbility to interpret, understand, and comply with complex statutes, ordinances, regulations, standards, and laws.\n\nUnderstanding of applicable federal, state and local laws and regulations as they pertain to the industry, personnel law, safety regulations, local municipal codes and organizational rules, regulations, directives and standard operating procedures.\n\nAbility to establish and maintain effective working relationships with employees, management, governmental agencies, community members and the general public.\n\nAbility to use standard office equipment, computer equipment and software including word processing, database management, spreadsheet applications and electronic mail.\n\nAdditional Requirements:\nMust be a minimum of 21 years of age\n\nMust pass any and all required background checks\n\nMust be and remain compliant with any and all legal or company regulations for working in the industry\n\nMinimum Education and Experience:\nPrevious retail experience preferred\n\nPrevious inventory experience preferred\n\nEquivalent combinations of education and experience may be considered, including internal experience.\n\nWorking Conditions:\nWhile performing the duties of this job, the employee is regularly required to perform grasping, talking, hearing, seeing, standing, sitting, bending, twisting, lifting, climbing, and repetitive motions.\n\nPHYSICAL DEMANDS: Must be able to lift, carry and balance up to 40 pounds (100 pounds with assistance)\n\nMust be able to tolerate dusty, strong smelling marijuana odors, and be able to tolerate exposure to the product.","slug":"dispensary-inventory-supervisor-19216be7-b11c-49e4-8afc-fe11a510010f","benefits":[],"selectedSkills":["Writing skills","Windows","Public relations","21 years or older"],"jobType":"free","applyURL":"https://secure6.saashr.com/ta/6156038.careers?rnd=IGI&ShowJob=436619334&%40rtm=1"},{"position":"Lab Assistant","labName":"Solar Cannabis Co.","location":"Somerset, MA","age":"4 days ago","type":"Full-time","salaryMin":"$36,000 ","salaryMax":" $49,000 a year","jobDescriptionCopy":"About Us\n\nMassachusetts based Solar Therapeutics is New England’s leading producer of wellness and alternative therapies dedicated to state of the art, fully sustainable cultivation & production of pharmaceutical grade cannabis.\n\nThe company’s experienced management team, dedicated board and passionate investors are driven by a singular mission: to provide industry leading alternative therapies with a sustainable carbon-neutral energy footprint.\n\nThe Position\n\nWe are seeking individuals to join our laboratory team here at Solar Therapeutics. The ideal candidates will be detail oriented, have prior extensive experience working in a laboratory setting, and have the ability to work quickly and efficiently with their hands in a fun, fast paced, regulated environment.\n\n\nMinimum of 21 years of age.\nPossess valid driver’s license or state ID.\nMust pass all required background checks.\nMust be and remain compliant with any and all legal or company regulations for working in the industry.\nMust be able to lift, carry and balance up to 30 pounds (100 pounds with assistance). This job function may include walking or standing for extended periods of time, as well as stooping, bending over and/or crouching.\nKey Responsibilities\n\n\nAssist in production calculating requirements; assembling and weighing plant material and supplies for supercritical CO2 extraction: emptying extraction vessels\nOperate intricate equipment, wipe film distillation and rotary evaporator, in accordance with Solar Therapeutics’ Standard Operating Procedures\nMaintaining inventory records of supplies, materials and equipment, and preparing requisitions as needed.\nWork with state licensed third party testing lab to ensure QC\nMake distillate\nOversee cartridge filling\nClean and help maintain laboratory equipment\nComplete data entry into various marijuana tracking systems including METRC\nStore supplies and equipment, dispose of waste according to guidelines, and keep laboratory working areas sanitary and safe\nReport leaks and faulty equipment to Laboratory Manager\nComplete other duties and tasks as assigned by the Laboratory Manager\nQualifications\n\nBachelor’s degree preferred\nGreat interpersonal/communication skills\nDetail-oriented\nHave genuine and positive energy\nGreat work ethic, reliability, and professionalism\nExcellent listening skills\nCannabis industry experience & knowledge preferred\nExperience working in a laboratory strongly preferred\nKnowledge of METRC a plus\nBenefits\n\nMedical Insurance\nDental Insurance\nVision Insurance\nEmployee Discount\nPaid Time Off\n401(k) plan\n\nSolar Therapeutics is an Equal Opportunity Employer committed to building a diverse workforce as it values the knowledge, diversity and performance of our employees to make us a great company. Solar Therapeutics is an Equal Opportunity Employer and all applicants will be considered without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran, or disability status. Solar Therapeutics agrees to hire individuals with Cannabis-related CORI offenses.","slug":"lab-assistant-b61330b3-e55e-486c-92c1-0b7208e716d7","benefits":["Paid time off","Dental insurance","Employee discount","401(k)","Health insurance"],"selectedSkills":["Laboratory experience","Communication skills","Driver's License","Bachelor's degree","21 years or older"],"jobType":"free","applyURL":"https://secure2.entertimeonline.com/ta/SolarTherapeutics.careers?ShowJob=453136641"},{"position":"Events Coordinator","labName":"American Association For Laboratory Accreditation","location":"Frederick, MD","age":"6 days ago","type":"Full-time","salaryMin":"$45,000 ","salaryMax":" $60,000 a year","jobDescriptionCopy":"Description: A2LA is a non-profit, public service membership organization offering compliance and accreditation services to organizations all over the world. A2LA is dedicated to formally recognizing testing, calibration and other laboratories and related organizations for their quality and technical competency with a variety of international standards (ISO/IEC 17025, ISO 15189, etc.), federal requirements (FDA, GLP, FCC, etc.), state (cannabis, etc.), and local requirements (water testing, etc.).\nWhether it is the clean air that you breathe, the water you drink or the vehicle you drive, A2LA helps make the world a better, safer place by working to ensure that organizations are releasing products and services that are meeting testing and quality standards. Detailed information about our services can be found on our website at https://www.a2la.org/about.\nThe Role:\nDriven and organized professional who works with the Director of Marketing and Communications to advance A2LA’s strategic objectives through trade shows, events, and organizational marketing. This position is responsible for the coordination of trade shows and events, collaborating with internal teams and third parties to align strategy, communication, logistics, staffing, training, execution, and reporting.\nResponsibilities:\n\n\n*\nAnnual Conference*\n\n\nFacility/venue coordination, menu selection, and event layout.\nGridding meeting space and coordinating space requests from staff and affiliates.\nCreate group resume.\nReview venue BEOs.\nCommunicate with sponsors, exhibitors, facilities, and vendors on a regular basis via email, conference calls and face to face meetings.\nTravel as required for site visits and onsite execution of annual meeting.\nArrange social activities such as opening and closing receptions.\n\nTradeshow Management\n\n\nWork with Director of Marketing on Tradeshow strategic plan.\nWork with internal teams to plan pre, during, and post-show promotional activities, including email campaigns, on-site events, lead-retrieval, speaking opportunities, whitepaper submissions, etc.\nWork with marketing team on promotional tactics (external digital and print creatives).\nEnsure uniform branding, coordinating booth staff wearables and promotional items for events.\nCoordinate all show/event operations, including booth floor plan, staffing, lead collection, and other logistics.\nFacilitate a pre-show meeting to discuss expectations and logistics as well as a debrief to assess successes and lessons learned, report to stakeholders.\nUtilize digital tools and platforms to maintain regular communication on progress timelines, and deliverables for stakeholders throughout the planning/execution.\nResearch potential shows we are not currently participating in that could increase our brand awareness.\nPlanning off-site receptions for specific shows for customers and potential customers throughout the country. You may be required to attend those shows.\n\nBoard and Executive Meetings\n\n\nSourcing hotels and working with either corporate sales reps for hotel properties or local meeting and convention bureaus to find properties.\nSelecting menus and room setup.\nResearching and coordinating off-site restaurants and activities for the group.\nWorking with the hotel for all logistics and accommodations and bill reconciliation.\nOther duties as assigned.\n\n. Requirements:\n\n\n1-3 years' experience in coordinating events.\nBachelor’s degree in Event Management, Marketing, or relevant topic preferred, other degrees will be considered.\nStrong proficiency with Microsoft Office and graphic design applications (In-Design, Illustrator, Photoshop), and project management platforms (Asana).\nExperience with building and sustaining successful partnerships with vendors.\nDiligent work habits and continual attention to detail in composing, editing, and proofing materials, establishing priorities and meeting deadlines.\nDemonstrated tact and diplomacy skills with the ability to interact and communicate effectively with individuals at all levels, both internally and externally with clients and vendors.\nTeam player with the ability to collaborate effectively with others, share ideas, and assist other department members on projects as needed.\nExcellent project management skills with the ability to work independently, handle completing tasks in a fast-paced environment.\nSuperior business writing skills, excellent judgement, and professional discretion with information.\n\nJob Type: Full-time\n\n\nWork Location: One location\n","slug":"events-coordinator-d015e45a-945e-4e68-b41e-2bb84e627af9","benefits":[],"selectedSkills":["Writing skills","Adobe Photoshop","Project management","Editing","Adobe Illustrator","Bachelor's degree"],"jobType":"free","applyURL":"https://recruiting.paylocity.com/recruiting/jobs/Details/1080459/American-Association-For-Laboratory-Accreditation/Events-Coordinator"},{"position":"Director, PBL Operations","labName":"TriCore Reference Laboratories","location":"Albuquerque, NM","age":"5 days ago","type":"Full-time","salaryMin":"$84,000 ","salaryMax":" $120,000 a year","jobDescriptionCopy":"Job ID #: 12281 City, State: NM - Albuquerque\n\nFunctional Area: Health/Medical Department Name:\nPosition Type: Regular - Full Time Education Required: See Minimum Qualifications\nExperience Required: See Minimum Qualifications Relocation Provided:\n\nJob Summary\n\nPrecision Botanical Laboratories\n\nWe help New Mexico hemp and cannabis growers produce safe, high-quality products by delivering precise, accurate, and reliable laboratory testing.\n\nPrecision Botanical Laboratories provides regulation-compliant laboratory testing to ensure safety and effectiveness of medical and adult-use cannabis and hemp.\n\nJOB SUMMARY:\nResponsible for the strategic, financial, quality and scientific performance of Precision Botanical. Laboratories (PBL). The Director of Operations will plan, develop, and coordinate all activities and functions in order to achieve the objectives of the organization and to assure coordination of these functions with those of the rest of the organization. This position works closely with the Executive Management Team and scientific staff to assure regulatory compliance for the laboratory operations. Responsible for the design and/or selection and implementation of equipment, policies and procedures to facilitate processes and resolve procedural problems. Directs and coordinates activities with other areas of the organization and with internal and external customers to ensure that quality standards are met. Responsible for ensuring service quality to the satisfaction of internal and external customers.\n\nESSENTIAL FUNCTIONS:\nTogether with the Chief Scientific Officer, and Chief Operating Officer:\n\n1. Assure the selection, evaluation, validation and maintenance of appropriate test methodologies and instruments necessary to meet the objectives of the organization and clients served.\n\n2. Assure the maintenance of complete and current laboratory procedure manuals.\n\n3. Assure compliance with all relevant federal and state legal and regulatory requirements for the laboratory, including but not limited to ISO/IEC 17025.\n\n4. Oversee processes to assure coordination of quality control, quality assurance, compliance and adherence to company policies and procedures.\n\n5. Prepare and monitor an annual strategic plan for the company in support of the strategic priorities of the organization as set by the Executive Committee and the Board of Directors.\n\n6. Recommend “Best Practices” and new innovative processes to constantly improve quality and financial standards.\n\nAs a member of Senior Leadership:\n1. Ensure appropriate representation on TriQual, Organizational Compliance Committee, Vendor Business Reviews, New Business Pipeline, and Executive Projects.\n\n2. Assure the development and management of the expense budget of all areas of responsibility, establishing key performance indicators to monitor performance. Take necessary action to correct significant variances in a timely fashion to meet the financial goals of the organization.\n\n3. Ensures that appropriate progress is being made against defined strategies; proactively raises issues and recommendations for resolutions.\n\n4. Periodically review tactical implementation on operational goals and provide corrective action plans as necessary.\n\n5. Prepare and present, as requested, periodic summary reports to the Executive Management Team.\n\n6. Participate in a collaborative and professional manner.\n\nIndividual Activities and Responsibilities:\n1. Work closely with executive management, corporate strategy, finance, sales and marketing, and operations business units to develop the PBL strategy, including Operational and Business Development strategies.\n\n2. Serve as primary contact with key clients. Responsible for ensuring that all activities and test menus are consistent with the client’s expectations. Serve as a liaison between clients and the organization.\n\n3. Complete evaluations and analyses of potential clients.\n\n4. Develop the Business Pipeline including, but not limited to, pricing negotiations and contract management.\n\n5. Prepare appropriate legal documentation (in conjunction with legal team).\n\n6. Coordinate policies and procedures with all sections of the company and with other stakeholders as needed.\n\n7. Oversee the scheduling of company personnel to ensure availability of testing to meet published schedules. Evaluate demand and work to modify schedules as appropriate.\n\n8. Interview, select, and hire staff as needed.\n\n9. Evaluate staff performance, providing coaching, counseling and discipline as appropriate.\n\n10. Develop and maintain criteria for training and in-service programs for company staff so that all laboratory procedures are understood and consistently performed.\n\n11. Maintain up to date knowledge of new development in the industry and economics through continuing education and other relevant sources.\n\nOTHER RESPONSIBILITIES\n\na. Attend supervisory/management meetings.\nb. Other duties and special projects as assigned.\n\nThe above statements describe the general nature and level of work being performed by individuals assigned to this classification. This is not intended to be an exhaustive list of all responsibilities and duties required of personnel so classified.\n\nMinimum Qualifications\n\nMINIMUM EDUCATION\nBachelor's degree in Chemical, Physicial or biological science.\n\nMINIMUM EXPERIENCE:\nTwelve (12) years laboratory experience.\nEight (8) years management experience in a laboratory.\nFive (5) years of business development and customer relation experience.\n\nPREFERENCES:\nMaster's degree desired.\n\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class.","slug":"director-pbl-operations-b7c845cb-726e-4b42-99d0-27a0849b51b7","benefits":[],"selectedSkills":["Laboratory experience","Management","Business development","Bachelor's degree","Master's degree"],"jobType":"free","applyURL":"https://careers.peopleclick.com/careerscp/client_tricore/external/jobDetails.do?functionName=getJobDetail&jobPostId=27168&localeCode=en-us"},{"position":"Manager, PB Laboratories Operations","labName":"TriCore Reference Laboratories","location":"Albuquerque, NM","age":"5 days ago","type":"Full-time","salaryMin":"$74,000 ","salaryMax":" $98,000 a year","jobDescriptionCopy":"Job ID #: 12279 City, State: NM - Albuquerque\n\nFunctional Area: Health/Medical Department Name:\nPosition Type: Regular - Full Time Education Required: See Minimum Qualifications\nExperience Required: See Minimum Qualifications Relocation Provided:\n\nJob Summary\n\nPrecision Botanical Laboratories\n\nWe help New Mexico hemp and cannabis growers produce safe, high-quality products by delivering precise, accurate, and reliable laboratory testing.\n\nPrecision Botanical Laboratories provides regulation-compliant laboratory testing to ensure safety and effectiveness of medical and adult-use cannabis and hemp.\n\nResponsible for the overall direction and management of the Precision Botanical Laboratories (PBL) operations (technical performance, personnel, education, training and administrative functions); coordination of activities with other areas of the organization and with internal and external customers to ensure that financial and quality standards are met. Work closely with Director, regarding decisions on matters relating to technical performance, quality and finances.\n\nESSENTIAL FUNCTIONS:\nDEPARTMENT MANAGEMENT AND STAFF OVERSIGHT:\n1. Responsible for the overall supervision of assigned department management staff.\n\na. Ensure that appropriate application, interview and selection processes are established and followed in the division, including, but not limited to interviews with peers and supervisors/tech specialists. Personally interview final candidates and work with Human Capital Management in making final selections.\n\nb. Oversee effective completion of performance evaluations and approve compensation process. Regularly communicate with direct reports regarding their performance and counsel them as needed. Let direct reports know when they are and are not meeting job expectations. Provide guidance to direct reports on how to improve performance.\n\nc. Oversee and conduct employee coaching, counseling and disciplinary actions as needed or appropriate. Manage dismissal actions utilizing Human Capital Management for advice and seeking approval from the appropriate leadership regarding the proposed action.\n\nd. Ensure that appropriate staff recognition programs are in place.\n\ne. Ensure standardized orientation, training programs, and competency programs for new and existing employees are established, maintained, and monitored according to regulatory guidelines.\n\nf. Be available to assist staff with questions and problem solving.\n\ng. Maintain appropriate channels of communication within the division.\n\nh. Provide information to staff regarding job expectation, relevant information concerning workload, workflow, process and procedure changes and general information regarding the department and the organization as a whole.\n\ni. Listen effectively and with the purpose of understanding employee concerns, questions, ideas and opinions. Actively solicit staff input and feedback.\n\nj. Coordinate and conduct department meetings on a regular basis.\n\nEDUCATION AND TRAINING\n\n1. Ensure appropriate training programs are in place and executed for all levels of students assigned for rotations in departments.\n\n2. Oversee client training and educational programs/meetings.\n\n3. Assist with problem resolution for external clients as needed.\n\n4. Consults with clients regarding appropriate testing, test results and interpretations.\n\nFINANCIAL\n\n1. Coordinate preparation and justification of budgets. Review and submit proposed budget to Director, PBL Operations.\n\n2. Approve submitted capital requests and vendor payments/invoices prior to submission for final approval.\n\nQUALITY ASSURANCE (QA)/COMPLIANCE\n\n1. Participate in quality assurance programs to ensure that quality standards are met. Demonstrate ability to consistently improve quality standards. Evaluate the needs and expectations of the “customers” of the area annually and implement new quality programs designed to ensure that the quality of services meet or exceed customers’ expectations. Prepare QA reports as appropriate. Lead, facilitate and/or participate in Quality Management and other process improvement teams as appropriate.\n\n2. In conjunction with the Director, develop, revise and implement department goals and objectives. Ensure that all goals and objectives are appropriately aligned and prioritized with company strategic goals.\n\n3. Actively support and implement company and department procedures, policies and strategies to support the corporate vision.\n\n4. Assures regulatory and accreditation compliance by working with Quality and the Director.\n\n5. Ensure patient, employee and organizational confidentiality.\n\nWORKFLOW/EFFICIENCY\n\n1. Oversee workflow and productivity.\n\n2. Develop, revise and implement appropriate work systems within the department that are designed to meet the needs of the organization as well as the needs of internal and external customers. Identify opportunities for new or improved service to both internal and external customers and implement new or improved services as appropriate.\n\n3. Responsible for ensuring that the department operates efficiently. Look for ways to get maximum benefit from all resources. Continually assess department staffing levels and needs including scheduling strategies and full time vs. part time ratios when employees leave, examine current staffing levels and needs, and determine appropriate replacement needs. Continually assess department resources and needs. Initiate requests for additional resources as appropriate, including cost justifications. Develop and monitor standards for measuring cost effectiveness.\n\n4. Provide backup or coordinate fill in for department staff during times of unusually high workload or other special circumstances.\n\nCUSTOMER SERVICE AND COMMUNICATION\n\n1. Maintain effective communication and coordination with other departments within the organization.\n\n2. Serve as a liaison to the external communication process to keep customers informed of testing and service changes. Assures that all relevant customer needs are met. Coordinate the scheduling of tests to meet customer expectations.\n\nTECHNICAL\n\n1. Maintain an up-to-date understanding of new requirements and technology through continuing education.\n\n2. Coordinate with the Director to ensure that test menus and services are consistent with the client expectations and financial expectations.\n\nOTHER RESPONSIBILITIES:\n1. Attend all managerial meetings and other meetings or workgroups as assigned.\n\n2. Maintain working relationships with vendors.\n\n3. Participate in the development and implementation of strategic initiatives.\n\nThe above statements describe the general nature and level of work being performed by individuals assigned to this classification. This is not intended to be an exhaustive list of all responsibilities and duties required of personnel so classified.\n\nMinimum Qualifications\n\nMINIMUM EDUCATION\n\nBachelor's degree in a relevant science.\n\nMINIMUM EXPERIENCE:\nSix (6) years of experience in a clinical or analytical laboratory with at least one year of management/supervisory experience.\n\nPREFERENCES:\nMaster’s degree.\nCannabis certification.\n\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class.","slug":"manager-pb-laboratories-operations-237969f0-b670-4c39-b524-441372ada42a","benefits":[],"selectedSkills":["Clinical laboratory experience","Laboratory experience","Supervising experience","Bachelor's degree","Master's degree"],"jobType":"free","applyURL":"https://careers.peopleclick.com/careerscp/client_tricore/external/jobDetails.do?functionName=getJobDetail&jobPostId=27170&localeCode=en-us"},{"position":"Sr. Analytic Lab Technologist- PB Laboratories","labName":"TriCore Reference Laboratories","location":"Albuquerque, NM","age":"5 days ago","type":"Full-time","salaryMin":"$58,000 ","salaryMax":" $77,000 a year","jobDescriptionCopy":"Job ID #: 12280 City, State: NM - Albuquerque\n\nFunctional Area: Health/Medical Department Name:\nPosition Type: Regular - Full Time Education Required: See Minimum Qualifications\nExperience Required: See Minimum Qualifications Relocation Provided:\n\nJob Summary\n\nPrecision Botanical Laboratories\n\nWe help New Mexico hemp and cannabis growers produce safe, high-quality products by delivering precise, accurate, and reliable laboratory testing.\n\nPrecision Botanical Laboratories provides regulation-compliant laboratory testing to ensure safety and effectiveness of medical and adult-use cannabis and hemp.\n\nJOB SUMMARY:\nUnder general supervision, provides advanced skills in the performance of high complexity laboratory tests for the purpose of determining analytic purity and sterility within the scope of training and experience.\n\nESSENTIAL FUNCTIONS:\n1. Performs/results laboratory tests within scope of training and experience with a high degree of proficiency.\n\n2. Operates laboratory equipment, interfaces and instruments, performs and documents basic and advanced maintenance and complex calibration procedures. Serves as Key Operator for assigned instrument(s) as needed or directed.\n\n3. Performs routine logging for QC/QA purposes. Collects and compiles QA data as directed. Monitors QC for trends and takes corrective action as needed or directed.\n\n4. Performs all troubleshooting procedures. Identifies testing problems and recommends appropriate solutions using defined guidelines.\n\n5. Coordinates and/or assists in preparing work schedules for department as directed.\n\n6. Actively participates in preparation for regulatory inspections, taking responsibility for section and/or department as assigned.\n\n7. Researches, evaluates and develops new assay technology and/or assay improvements for assigned projects in collaboration with directors and technologists.\n\na) Research and develop assay protocols upon approval by Director.\n\nb) Plan and perform assay validation.\n\nc) Present cost analysis\n\nd) Draft SOP for departmental approval.\n\ne) Complete and submit IT System change request.\n\nf) Complete projects within expected deadlines.\n\ng) Ability to work on three or more projects simultaneously.\n\n8. Carries out laboratory projects that include feasibility studies, new product evaluation/testing, and workflow analysis.\n\n9. Participates in training new employees and students where appropriate, providing instruction and information. Tracks progress and assesses trainee competency.\n\n10. Participates in taking inventory as needed or appropriate. Orders supplies for the Department as directed.\n\n11. Identifies and reports abnormalities in results and test procedures. Troubleshoots as appropriate.\n\n12. Handles hazardous materials and wastes in accordance with safety procedures and regulations.\n\n13. Serves as a liaison with internal and external customers/employees/clients as appropriate.\n\nThe above statements describe the general nature and level of work being performed by individuals assigned to this classification. This is not intended to be an exhaustive list of all responsibilities and duties required of personnel so classified.\n\nMinimum Qualifications\n\nMINIMUM EDUCATION:\n\nMaster’s degree in a chemical, physical or biological science\nMINIMUM EXPERIENCE:\n\nFive (5) years of academic and/or work experience with complex testing techniques.\nPREFERENCES:\nCannabis Technician certification\n\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class.","slug":"sr-analytic-lab-technologist-pb-laboratories-af6d79e6-94a8-4c34-8bba-ace8c3529456","benefits":[],"selectedSkills":["Master's degree"],"jobType":"free","applyURL":"https://careers.peopleclick.com/careerscp/client_tricore/external/jobDetails.do?functionName=getJobDetail&jobPostId=27164&localeCode=en-us"},{"position":"Marketing Manager, Innovation Solutions","labName":"bioMerieux SA","location":"Chicago, IL","age":"6 days ago","jobDescriptionCopy":"A world leader in the field of in vitro diagnostics for over 55 years, bioMérieux provides diagnostic solutions which determine the source of disease and contamination to improve patient health and ensure consumer safety.\n\nIn North America we have more than 5,000 team members across 11 sites or subsidiaries, including Salt Lake City-based BioFire Diagnostics and one subsidiary in Montreal, Canada.\n\nCome and join a family-owned global company with a long-term vision, and a human-centered culture.\n\nPosition Summary:\nThe purpose of this job is to oversee the company's overall strategy for Innovation Solutions Management of the xPRO product line, including Digital Solutions (CONNECT-UP, EMAP) and Predictive Genome Services (PDIC functions). This is accomplished by managing and leading product launches and other activities as required. The Innovation Solutions Marketing Manager will establish and execute the announcement strategy into a detailed Go-To-Market (GTM) execution plan and determine budget requirements, commercial strategies that support revenue targets and growth objectives, working with the Chief Business Officer of Invisible Sentinel to align with regional and global objectives.\n\nThis position is responsible for defining GTM milestone timeline to align GTM deliverables with major checkpoints, define team structure and governance model to effectively drive launch execution, establish detailed and executive dashboard & success metrics in the area of messaging & core content, field enablement, public reveal, leads & revenue generation, and customer adoption. Also included are setting sales budgets, forecasting of future business, pipeline consistency and process enforcement. This is a critical launch management role and one that requires a deeply fundamental understanding of technical leadership in directing the efforts of cross-functional project team in the development and production release of all relevant project deliverables in compliance with the product development process and customer expectations in a dynamic, rapidly changing business landscape.\n\nContext of the Job and Major Challenges:\nThe job directly affects the short and long-term sales and strategic objectives of the company as it pertains to growing bioMérieux business interests in the U.S. and Global. The U.S. bioFOOD Industrial Market for bioMerieux, Inc. includes, but is not limited to, Nutraceutical, Dairy, Beverage, Animal Protein, Cannabis, Service Laboratory and Government Accounts. Objectives include sales, support, pricing, product mix, and market share in the positioning of reagents and various instrumentation used for microbiological testing and analysis. Areas of the business consist of environmental monitoring, quality, sterility, and organism identification, genomics, and predictive analytics.\n\nRoutine internal contacts with Sales, Marketing, Finance, Predictive Diagnostics Innovation Center R&D, Customer Service, Customer Support, Field Service, Production, and Supply Chain is required in developing and delivering these compelling 'value propositions for change' to the customer. External responsibilities will include Customer facing discussion, market assessments and support of corporate or regional initiatives with key opinion leaders or Strategic Accounts, and agency direction in the creation of materials essential for the success of the xPRO Innovation, Digital Solutions and Predictive Genome Services product ranges. A key element of the role will be developing compelling sales support materials including training, messaging, ideal customer target lists, and development of value positioning for commercial teams. The successful owner of the product ranges will be able to combine feedback from the customer, the field sales & support organizations, and the service/support teams to create the necessary outputs to maximize sales performance. The xPRO Innovation, Digital Solutions and Predictive Genome Services product ranges are an important component of FOOD segment strategies and this role operates within a matrix organization. The successful candidate will be able to manage launches, promotions, support instrument and application needs that span the complete Food market working with colleagues across the region accordingly. A complete understating of new launch, demand planning, forecast creation, supply chain, and post launch analysis processes within the U.S. and Global teams will be necessary to ensure that the xPRO, Digital and PDIC portfolio is properly positioned to meet the needs of the customer.\n\nResponsibilities:\nThis position requires ability to take initiative, work independently & with integrity, yet able to take direction, while maintaining strong influence leadership skills. Additional behavioural competencies should include adaptability, flexibility and ability to work under pressure, good time management skills and good communication all while supporting Sales in meeting or exceeding the specific product revenue targets and growth objectives. Good customer interaction skills & negotiation skills are required for sales coaching, counselling, presentations, demonstrations, and field rep evaluations that result in valid business results that creates customer loyalty and economic arguments for the customer that are stronger than competitive alternatives.\n\nDrive product launches including working with public relations team, executives, and other product management team members\nDesign, implement, and facilitate an industry marketing plan for the U.S. that will enhance bioMérieux's image and position within the marketplace as it pertains to the specific xPRO, Digital and Predictive Genome Services ranges\nCreate buy-in for the product vision both internally and with key external partners\nUse resources developed in supporting U.S. needs to empower AMERICAS marketing teams by demonstrating proactive communication across the region\nProvide support of marketing actions designed to gauge market size, opportunity value, or pipeline potentials related to the xPRO range\nDevelop product pricing and positioning strategies\nAct as a product Brand Ambassador to build awareness and understanding\nSupervise and define Market research activities related to the successful implementation of the Marketing Plans\nHelp maintain business relations with key contacts within the FOOD Industry. Serve as key contact in relationship and network building at key accounts to translate learnings from successful business relationships to further inform future marketing needs\nGain a deep understanding of customer experience, identify and fill product gaps and generate new ideas that grow market share, improve customer experience and drive growth\nAnnual budget setting in support of the product range objectives based on understanding of competitive environment, market needs, and sales pipeline to accurately drive bioMerieux production and R&D objectives\n\nStudies and Experience:\nBachelor's degree required. MBA is desirable although not required\nAt least 5+ years marketing experience highly regarded\nProven work experience in product management or as an associate product manager\n\nSkills and Qualifications:\nProven ability to develop product and marketing strategies and effectively communicate recommendations to executive management\nRelevant commercial and GTM experience, ideally in life sciences or biotechnology industry\nGood communicator with interpersonal, organizational, teamwork, and collaboration skills\nExcellent verbal and written communication skills in English. Proficiency in French or Spanish highly regarded\nAbility to multitask and work within deadlines, professionally managing competing priorities\nProfound understanding of how to develop a Marketing Plan and how to implement it\nProblem solving and teamwork abilities; ability to work within or lead a team\nExcellent integrator and negotiator, results oriented\nAbility to work with & influence people without formal authority\nExcellent presentation skills to all levels of decision makers\nExcellent communicator of \"value proposition\" to potential clients\nExcellent analytical skills and ability to develop financial proposals\nTeam development skills\nProblem solving, analysis and training skills\nSkills associated with good project management and budget control\nStrong MS Office skills and experience with web-based platforms for relationship management (Salesforce/Pardot, LinkedIn).\nDatabase experience with relevant BI tools (SAP, IBM, ORACLE, TABLEAU, etc.)\nAbility to travel, domestically and internationally as needed\nWillingness and ability to comply with bioMérieux Corporate Business Ethics & Compliance policies\nExperience working effectively with cross functional teams in a matrix organization in multinational companies\nKnowledge of the bioMerieux Industry product line is desirable\n\nAdditional Information:\nThis position requires 25% overnight travel, predominantly to Philadelphia, PA.\n\nBioMérieux Inc. and its affiliates are Equal Opportunity/Affirmative Action Employers. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, protected veteran or disabled status, or genetic information. Please be advised that the receipt of satisfactory responses to reference requests and the provision of satisfactory proof of an applicant's identity and legal authorization to work in the United States are required of all new hires. Any misrepresentation, falsification, or material omission may result in the failure to receive an offer, the retraction of an offer, or if already hired, dismissal. If you are a qualified individual with a disability, you may request a reasonable accommodation in BioMérieux's or its affiliates' application process by contacting us via telephone at (385) 770-1132, by email at recruitment@biomerieux.com, or by dialing 711 for access to Telecommunications Relay Services (TRS).","slug":"marketing-manager-innovation-solutions-4ab6efa1-f830-49a0-847d-b9f1e5acd721","benefits":[],"selectedSkills":["Product management","Sales pipeline","Leadership","Communication skills","Microsoft Office","Bachelor's degree","Master of Business Administration","Master's degree","US work authorization"],"jobType":"free","applyURL":"https://careers.biomerieux.com/jobs/9518117-marketing-manager-innovation-solutions?tm_company=13405&tm_event=view&tm_job=30442"},{"position":"Driver for Cannabis Testing Lab-Los Angeles","labName":"Cannabis Testing Lab","location":"Bakersfield, CA","age":"2 days ago","type":"Full-time | Part-time","salaryMin":"$17 ","salaryMax":" $23 an hour","jobDescriptionCopy":"Driver for Cannabis Testing Lab\nWe are a full-service cannabis testing and research lab offering state-mandated testing services to California’s cannabis distributors, cultivators, and manufacturers to ensure safety and accurate labeling of products for medical and recreational use.\n\n\nThe Field Sampling Technicians role is a key position responsible for collecting and documenting cannabis samples at client sites and bringing them to the lab. We are looking for someone with a Lab Technician spirit that loves to be in the field, at the source. Great customer service, attention to detail and reliability are a must for this important role. This position has potential for advancement.\n\n\nThis is an opportunity to come into a young company and help make it great!\n\n\nDuties and Responsibilities:\n\n\nCollect field samples of cannabis products at client sites in accordance with state regulations and company procedures\nAccurately record sample information, taking great care to accurately record batch numbers and all details required for transport manifests\nFollow detailed procedures to ensure cleanliness and avoid contamination of samples being collected. This is essentially a mobile laboratory position.\nWeigh samples with a field balance and record sample weights.\nInput data into company ordering and tracking system and double check for accuracy\nDrive to client sites and return samples to the laboratory all over Southern California\nDriving for multiple hours at a time\nProvide excellent customer service\nBuild trust and rapport with clients\nWork efficiently and effectively under time constraints\nConfirm client invoices for accuracy and send them to client\nMaintain client confidentiality\nFollow safety procedures\n\nQualifications:\n\n\nAssociates or Bachelors degree in chemistry or biology, highly preferred\n1 or more years of laboratory experience\nUnderstanding of aseptic technique\nKnowledge of the Bureau of Cannabis Control regulations\nKnowledge of METRC\nMust be at least 21 years old\nMust have valid California Drivers License and clean driving record\nExperience in a cannabis testing laboratory or cannabis industry\n100% Accuracy and attention to detail\n\nSkills to be successful:\n\n\nCustomer Service experience\nMust be organized and punctual\nStrong attention to detail\nExperience following S.O.P.s and structured protocols\nExperience working in a fast-paced environment\nExcellent written and verbal communication skills\nProficient in use of email, including Microsoft Outlook\nExperience with various software including group messenger apps and Excel\nEasy accessibility to technological devices such as laptops, printers and smart phones\n\nMedicalStandards\nAll candidates must submit to a drug test.\nBackground Investigation\nA comprehensive background investigation will be conducted upon all job offers, which will review and verify personal history including, but not limited to financial responsibility, criminal history, drug use history, driving record, and verification of application materials. Significant issues or omissions in the above-stated areas may be grounds for disqualification.\n\n\nPlease send resume and cover letter and indicate date available to start working.\n\n\nJob Types: Full-time, Part-time\n\n\nPay: $17.00 - $23.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nVision insurance\n\nSchedule:\n\n\nMonday to Friday\n\nApplication Question(s):\n\n\nAre you available to work variable hours from day to day? (for example, 8am - 5pm one day, and 12pm - 8pm another day)\n\nEducation:\n\n\nAssociate (Preferred)\n\nExperience:\n\n\nRoute driving: 1 year (Required)\n\nWork Location: On the road\n","slug":"driver-for-cannabis-testing-lablos-angeles-a75fb290-1401-4d5b-ae68-2561980a4184","benefits":["Dental insurance","Health insurance","Opportunities for advancement","Vision insurance"],"selectedSkills":["Route driving","Customer service","Driving","Microsoft Excel","Driver's License","Bachelor's degree","Associate's degree","Pass drug screening","21 years or older","Clean driving record"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=FQFX618f14GwpwoFMS50jhqLIiB-Oc5GAdMh07rFkTDI-hk2JyJuAw"},{"position":"Lab Technician","labName":"Kaycha Labs","location":"Las Vegas, NV","age":"4 days ago","type":"Full-time","salaryMin":"$30,000 ","salaryMax":" $39,000 a year","jobDescriptionCopy":"Company Overview:\n\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\n\nJob Purpose:\n\n\nThe Lab Technician is responsible for working closely with our laboratory team to develop analytical skills and related experience. This position consists of many aspects from homogenizing, weighing and extracting samples, performing quality control checks, verifying various support equipment and properly disposing of all waste.\n\n\nOpen Shifts:\n\n\nMonday - Friday\n\n\nTuesday - Saturday\n\n\nSunday - Thursday\n\n\nEssential Duties & Responsibilities:\n\n\nExecute laboratory protocol and procedures under the supervision of the Lab Director.\nRegularly display good laboratory technique to avoid cross-contamination or misidentified samples.\nPerform sample preparation procedures including homogenization, weighing and liquid extraction.\nPerform QC duties as assigned, including LCS and matrix spikes.\nPerform qualitative and quantitative tests, as assigned.\nUtilize the LIMS system to create batches, enter sample prep information and maintain physical and electronic records.\nAdhere to ISO 17025 standards as well as state regulatory requirements.\nPromote a strong customer service culture while adhering to the highest safety and industry standards.\nOther duties and/or special projects as assigned.\n\nSkills, Abilities and Competencies:\n\n\nAbility to maintain an incredibly high degree of attention to detail and accuracy.\nStrong agility, engagement, and flexibility in an ever-changing environment.\nWorking knowledge of logging, organizing, and analyzing data.\nAbility to work in a dynamic, fast-paced deadline environment while successfully managing multiple tasks.\nStrong knowledge of Microsoft Office, including Excel, PowerPoint, and Word.\nWorking knowledge of standard laboratory protocol.\nExcellent communication skills and ability to effectively work, problem solve, and communicate with multiple levels of the organization.\n\nEducation & Experience:\n\n\n0-1 year of lab experience.\nKnowledge of principles, terminology, practices, techniques commonly used in a laboratory setting preferred.\nExposure to the cannabis industry is a plus.\n\nOther:\n\n\nMust pass Level 2 background check.\nMust be at least 21 years old.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status\n\nJob Type: Full-time\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n10 hour shift\n8 hour shift\nDay shift\nMonday to Friday\nWeekend availability\n\nCOVID-19 considerations:\nFace masks required.\n\n\nApplication Question(s):\n\n\nBest email/phone number to reach you at?\nWhat is your desired compensation?\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nLaboratory experience: 1 year (Preferred)\nAnalytical chemistry: 1 year (Preferred)\n\nWork Location: One location\n","slug":"lab-technician-2cb6b7fd-d481-425e-a31d-f1267e006c9a","benefits":["Dental insurance","Health insurance","401(k)","401(k) matching","Paid time off"],"selectedSkills":["Microsoft Excel","Microsoft Powerpoint","Laboratory experience","Communication skills","Microsoft Office","Bachelor's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=2eXrstruwUmyy-9m5R8k5RDuNBDTMlvv8Hh2xdJ1nRpm0rVSGb-g6Q"},{"position":"Lab Technician for Cannabis Testing Lab (day shift)","labName":"Cannabis Testing Lab","location":"Los Angeles, CA","age":"2 days ago","type":"Full-time","salaryMin":"$17 ","salaryMax":" $19 an hour","jobDescriptionCopy":"We are a full-service cannabis testing and research lab offering state-mandated testing services to California’s cannabis distributors, cultivators, and manufacturers to ensure safety and accurate labeling of products for medical and recreational use.\n\n\nThe Lab Technician role is a key position responsible for sample accessioning, intake, and sample preparation to support cannabis testing. Attention to detail, reliability, and good fundamental understanding of chemistry laboratory operation are a must for this important role. This position has potential for advancement.\n\n\nThis is an opportunity to come into a young company and help make it great!\n\n\nDuties and Responsibilities:\n\n\nEnsure the accurate intake and verification of cannabis and cannabis product samples upon delivery to the laboratory\nPhotograph samples prior to homogenization and upload to the customer portal\nHomogenize samples prior to further sample preparation by laboratory chemists\nWeigh samples for analysis\nRecord physical measurements such as water activity, moisture content, and density\nExtract samples for testing and sample perform dilutions according to SOPs\nPrepare standard curves for lab testing\nOrganize retention samples and dispose of samples past the holding time specified in laboratory SOPs\nClean and wash glassware and other laboratory equipment\nFollow detailed procedures to ensure cleanliness and avoid cross-contamination of samples\nPerform sample digestions for heavy metal testing\nData entry\nData interpretation as needed\nWork efficiently and effectively under time constraints\nMonitor inventory of lab supplies and place orders\nFollow laboratory safety procedures\n\nQualifications:\n\n\nBachelor’s degree in scientific field or Associates degree and 2 years of hands-on lab experience\nMust be detail-oriented and organized\nAbility to multi-task\nMust be able to work in a standing position for several hours at a time.\nMust be able to perform pipetting and operate centrifuges, vortexes, analytical balances, and other common laboratory equipment.\nProficient in use of email, Microsoft Excel, and Word\nMust be at least 21 years old\nThis position may require work outside of normal business hours of 9am – 5:30pm. Weekends or a later or earlier shift may be required.\n\nPreferred Qualifications:\n\n\nExperience in a cannabis testing laboratory or cannabis industry\nKnowledge of the Bureau of Cannabis Control regulations\nExperience with HPLC, GC-MS, ICP-MS, or PCR\nUnderstanding of aseptic technique\nExperience with data entry and/or use of a LIMS\nPlease send resume and cover letter and indicate date available to start working.\n\nJob Type: Full-time or Part-time\n\n\nSalary: $17/hour - $19/hour'\n'\nWork Location:\n\n\nOne location\n\nWork Remotely\n\n\nNo\n\nJob Type: Full-time\n\n\nPay: $17.00 - $19.00 per hour\n\n\nBenefits:\n\n\nHealth insurance\nPaid time off\n\nSchedule:\n\n\nMonday to Friday\nWeekend availability\n\nEducation:\n\n\nAssociate (Preferred)\n\nExperience:\n\n\nLaboratory Experience: 1 year (Preferred)\n\nWork Location: One location\n","slug":"lab-technician-for-cannabis-testing-lab-day-shift-f02bf503-8d99-4d13-99a7-1a9dd9187946","benefits":["Health insurance","Paid time off","Opportunities for advancement"],"selectedSkills":["Gas chromatography","Microsoft Excel","High-performance liquid chromatography","Laboratory experience","Data entry","Bachelor's degree","Associate's degree","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=hYit3Cvy8xdoVrLyUvKDUuoS_2jd8pbQEiz3vCixB0mtHCpB8UmaxA"},{"position":"Hiring Event: Extraction Specialist ***Cannabis Extraction","labName":"AltMed Florida","location":"Apollo Beach, FL","age":"4 days ago","type":"Full-time","salaryMin":"$14 an hour","jobDescriptionCopy":"MÜV/Verano, the fastest-growing cannabis company in Florida, is hosting a hiring event for our Apollo Beach production and cultivation facility. Below are the details for the Extraction Specialist position as well as the Hiring Event.\n\n\nJob Summary:\n\n\nPerforms and supports the extraction operations of a cultivation and manufacturing facility by adhering to the operation, technical, and quality control policies and guidelines. Maintains excellent personal hygiene, workspace cleanliness, documentation practices and quality control measures to ensure a high-quality product in accordance with the Department of Health Office of Compassionate Use regulations and standards set by the Company policies. The payrate for this position is $14 per hour.\n\n\nEssential Duties and Responsibilities:\n\n\nPrepare equipment and raw material for extraction while adhering to timeline protocols.\nExecute extractions as well as post-processes in accordance with state and local standards.\nOperate extraction equipment such as rotary evaporators, reactors, filtration equipment, etc.\nEnsure the consistency and efficiency of product through quality control testing and procedures.\nClean and maintain extraction equipment and manufacturing facility.\nMaintain strict inventory records of all raw materials, chemicals, and equipment used.\nDisposal of lab waste in accordance with established guidelines.\nComplete the cleaning and sanitization of all production equipment, work surfaces, and tools.\nMaintain material safety data sheets for all chemicals and products.\nFollow laboratory safety protocols.\n\nJob Requirements:\n\n\nAssociate or Bachelor’s degree in a Science discipline preferred.\nAdditional education or experience working in a laboratory setting also preferred.\nUnderstanding of state and local laws.\nUnderstanding of proper and safe handling of hazardous materials.\nFamiliarity with extractions, separations, isolations, and fractionation.\nStrong computer skills.\nAbility to lift up to 50 lbs.\nAbility to manage time and balance multiple tasks simultaneously\nAbility to work well in a small team\n\nAdditional Requirements:\n\n\nMust be at least 21 years of age.\nMust be able to successfully register with the state’s cannabis commission as an agent\n\nPhysical and Mental Demands:\n\n\nWhile performing the duties of this job, the employee is frequently required to remain in a stationary position, move and/or position oneself, communicate, operate and/or prepare, place, position objects, tools, or controls. The employee must occasionally move packages weighing up to 50 lb. Specific vision abilities required by this job include close observation and the ability to adjust focus. The mental and physical requirements described here are representative of those that must be met by an individual, with or without reasonable accommodation, to successfully perform the essential functions of this position.\n\n\nWorking Environment:\n\n\nWork is performed in a warehouse environment. The employee is occasionally exposed to moving mechanical parts and risk of electrical shock. The noise level in the work environment is usually moderate. The work environment characteristics described here are representative of those an individual encounters while performing the essential functions of this position.\n\n\nEEO Statement:\n\n\nWe are proud to be an equal opportunity employer. We place priority in an environment of inclusion, diversity and social justice and are committed to securing a better, brighter way forward for our employees, our markets and our communities.\n\n\nHiring Event:\n\n\nSaturday May 21st between the hours of 10AM to 4PM\n6944 US Highway 41, Apollo Beach, FL 33572 (Google Maps Users: Please use address 6938 US 41, Apollo Beach FL 33572 and note that we are the first building)\nYou must bring a copy of your resume and RSVP by applying to this job posting\nIf selected, you must be commutable to Apollo Beach, FL\n\nJob Type: Full-time\n\n\nPay: $14.00 per hour\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n10 hour shift\n8 hour shift\nWeekend availability\n\nWork Location: One location\n","slug":"hiring-event-extraction-specialist-cannabis-extraction-9264ad25-93de-4967-9c19-d62dbfa6bfd2","benefits":["Dental insurance","Health insurance","Paid time off","401(k)","Vision insurance"],"selectedSkills":["Computer skills","Laboratory experience","Bachelor's degree","Associate's degree","21 years or older","US work authorization"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=rWldXKispn3_gqfD_ywRg-uA5TIHckFsvNfu92wFLGRKmCWxCqSysA"},{"position":"Extraction Technician","labName":"Fine Fettle Dispensary","location":"Hinsdale, MA","age":"5 days ago","type":"Full-time","salaryMin":"$35,000 ","salaryMax":" $45,000 a year","jobDescriptionCopy":"We are looking for passionate, detail oriented, hardworking individuals to assist in our medical cannabis extraction lab. Previous experience in Cannabis and Scientific background is preferred but not required as we are willing to train the right candidates. The main role of this position is working with the Extraction Manager to create high quality cannabis concentrates, cartridges, and other infused products in a highly regulated environment while always putting safety first. This job is very fast paced and physically demanding, requiring constant standing, crouching, bending, and lifting. If you have a passion for cannabis, are mechanically inclined, and are looking for a career in the rapidly growing industry this may be the role for you.\n\n\nDaily Duties and Responsibilities:\n\n\nPreparation of biomass for hydrocarbon extraction process.\n\n\nCarry out all extraction, extract processing, product formulation, cartridge filling, and manufacturing procedures including equipment set up and breakdown in an efficient manner that also complies with State Regulations.\n\n\nPerform duties in a safe manner and environment while adhering to all governmental regulations, and company policies.\n\n\nProper weighing, data recording, and batch tracking throughout the extraction process.\n\n\nInventory tracking of supplies, consumables, spare parts etc\n\n\nPackaging various types and weights of cannabis products.\n\n\nMaintain a clean and orderly workspace, cleaning and organizing the workspace on a frequent basis.\n\n\nClean, organize, and store extraction and related equipment.\n\n\nProper tracking and disposal of cannabis waste in accordance with State regulations.\n\n\nCreating and continuingly updating extraction and post processing related SOPs.\n\n\nKeeping up to date on current laws, regulations, and changes to operational procedure.\n\n\nWorking with third party Testing Labs for batch test sample analysis in compliance with CCC regulations.\n\n\nComplete data entry into marijuana tracking systems including METRC.\n\n\nOther duties as assigned.\n\n\nSkills and qualifications:\n\n\nScientific background as well as previous laboratory experience strongly preferred.\n\n\nAssociate degree preferred, with relevant college courses in biology, chemistry, or physics.\n\n\nExperience and background in the cannabis industry is a plus but not required.\n\n\nAbility to follow and adhere to strict safety and sanitation protocols.\n\n\nAbility to work independently, and collaboratively within a team environment\n\n\nThroughout extended periods must be capable of sitting, squatting, standing, kneeling, bending, or walking through the workday.\n\n\nAbility to maintain a sanitary work environment.\n\n\nComfortable working in a fast-paced environment.\n\n\nComfortable working with medical cannabis and similar products.\n\n\nAbility to follow all safety protocols including wearing all proper PPE.\n\n\nExperience in a highly regulated industry is a plus.\n\n\nExcellent communication skills with the ability to communicate with superiors and team members clearly and concisely.\n\n\nEnvironmental Factors:\n\n\nExposure to plant particulates through skin contact and inhalation including odor, that may cause allergic reactions to some.\n\n\nExposure to compounds that may be flammable, corrosive, and hazardous.\n\n\nGeneral background noise that may be loud.\n\n\nRequirements:\n\n\nMust be 21+\n\n\nAbility to pass comprehensive Background Check\n\n\nReliable transportation to the facility with a valid driver’s license\n\n\nAbility to adapt to change\n\n\nAbility to cross train with other departments as needed\n\n\nAbility to perform repetitive tasks\n\n\nAbility to lift to 50lbs alone and 100lbs with assistance\n\n\nBasic math skills\n\n\nMust be and remain compliant with any and all legal or company regulations for working in the industry\n\n\nLocation- Hinsdale, MA\n\n\nAMERICANS WITH DISABILITIES STATEMENT:\n\n\nMust be able to perform all essential functions of this position with reasonable accommodation. If you need accommodation during the application and/or hiring process please reach out to our HR representative.\n\n\nEEO Statement:\n\n\nWe are an Equal Opportunity Employer. Our goal is to be a diverse workforce that is representative, at all job levels, of the communities we serve. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, gender expression, national origin, protected veterans’ status, and will not be discriminated against on the basis of disability or or any other applicable legally protected characteristic.\n\n\nIf interested please submit a cover letter and resume.\n\n\nJob Type: Full-time\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nEmployee discount\nHealth insurance\nLife insurance\nPaid time off\nReferral program\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\nWeekend availability\n\nAbility to commute/relocate:\n\n\nHinsdale, MA 01235: Reliably commute or planning to relocate before starting work (Required)\n\nEducation:\n\n\nAssociate (Preferred)\n\nWork Location: One location\n","slug":"extraction-technician-c4fe3302-1609-4a51-85fc-50adb1b4d6f5","benefits":["Dental insurance","Employee discount","Health insurance","401(k) matching","Paid time off"],"selectedSkills":["Sanitation","Basic math","Driver's License","Laboratory experience","Communication skills","Associate's degree","21 years or older","US work authorization","Background check","Reliable transportation"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=rHm-sD4ZxOVjNMG-Occ6jiRosGRd58OAtKRgonLy9VlhRkRrVpN9wQ"},{"position":"Chemist","labName":"Canalysis Laboratories","location":"Las Vegas, NV","age":"3 days ago","type":"Full-time","salaryMin":"$18 ","salaryMax":" $20 an hour","jobDescriptionCopy":"Cannabis Testing Laboratory seeking a full-time Analytical Chemist for extraction and analysis of cannabis in various matrixes (plant, extracts, etc.).\n\n\nThe Laboratory Scientist performs routine and complex analytical tests on cannabis product to ensure product safety and protect public health in accordance with Nevada State Law. The Laboratory Scientist can perform in all sections of the instrument laboratory under the supervision of the Senior Chemist.\n\n\nRequired: Must be able to pass police background check, obtain a Nevada Marijuana Establishment Agent Card and Work Card. Must have valid Nevada State driver’s license.\n\n\nEducation Required:\n\n\nBA or BS in Chemistry, Biochemistry, Biological Science or other scientific discipline from an accredited college or university.\n\nPreferred Qualifications:\n\n\n1 year Experience in a regulated laboratory, such as Food Testing, Clinical Laboratory, Toxicology Laboratory, Environmental Testing, or equivalent\nExperience with one or more of the following: HPLC, LC-MS/MS, GC-MS/MS, ICP-MS, HS-GC-FID/MS\n\nResponsibilities:\n\n\nPerforms instrumental analysis testing in the Nevada-licensed and ISO 17025-certified laboratory, participates in quality control, quality assurance and troubleshooting activities.\nPerforms duties under general direction, carrying out work assignments in accordance with SOPs and objectives established by the Laboratory Director.\nResponsible for the proficient performance of his or her own work assignments and is expected to provide guidance to less-experienced personnel.\nHandle and process samples, analyze test results, prepare reports and maintain records of test results within regulatory requirements.\nEnter sample information and results into the laboratory information management system.\nComply with quality control policies and document QC activities including instrument and procedural calibrations and maintenance.\nMaintain confidentiality of information.\nIdentify problems that may affect data quality and, following established protocols, correct problems and/or notify Senior Chemist.\nIdentify non-conformances from acceptable performance specifications and follow established policies and procedures to implement and document corrective action.\nParticipate in ongoing validation and verification of assay performance.\nParticipate in optimizing standard operating procedures for tasks in which proficiency has been demonstrated according to regulatory guidelines.\nPerform additional duties and projects assigned by the Senior Chemist, including, but not limited to: sample processing, field sampling, sample accessioning.\nComply with all local, state, and federal laws and regulations governing cannabis laboratory operations.\nMust be able to consistently complete analyses at or exceeding annual performance or laboratory goals.\nMust be able to perform quality control testing, analyze data and prepare reports for management review within established time frames.\nMaintain knowledge and technical proficiency in specialty areas assigned within the laboratory.\nAdhere to all safety policies and procedures.\nAdhere to local, state and federal regulatory requirements by following Company policies and procedures.\nDeal with all problems and work issues honestly, maintaining the integrity of the company at all times.\nFlexible and able to work beyond assigned shift hours as dictated by work volume and approved by Supervisory staff.\nOccasional weekend hours may be required.\n\nBenefit Conditions:\n\n\nFull medical, dental, vision insurance\nWaiting period may apply\nOnly full-time employees eligible\n\nCOVID-19 Precaution(s):\n\n\nPer state and CDC guidance\n\nWork Remotely\n\n\nNo\n\nJob Type: Full-time\n\n\nPay: $18.00 - $20.00 per hour\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nFlexible schedule\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nMonday to Friday\n\nCOVID-19 considerations:\nAll reasonable precautions are taken to prevent the spread of coronavirus during the pandemic. PPE is provided when working in the lab.\n\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nGLP: 1 year (Preferred)\nLaboratory Experience: 1 year (Preferred)\n\nWork Location: One location\n","slug":"chemist-a8d8fbde-491b-4016-8505-e839dcd00296","benefits":["Dental insurance","Health insurance","Paid time off","Flexible schedule","401(k)"],"selectedSkills":["Driver's License","GLP","Laboratory experience","Bachelor of Science","Bachelor's degree","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=1VaW66S2-aiTQMGbIBvq1as7i46Ntb2MvHEIL_I-55CVBOGbz_-xaA"},{"position":"Chemistry Technician","labName":"SV Labs LLC","location":"Toledo, OH","age":"2 days ago","type":"Full-time | Contract","salaryMin":"$18 ","salaryMax":" $25 an hour","jobDescriptionCopy":"Job Summary\n\n\nSV Labs, LLC, a cannabis safety compliance facility, has a new opening for an Analytical Chemist Technician at its Toledo, OH location. The facility will provide chemistry and microbiology testing services for cannabis cultivators and processors as mandated by the state of Ohio’s Medical Marijuana Control Program (MMCP) for cannabinoid potency, residual solvents, terpenes, heavy metals, and pesticides.\n\n\nThe Chemistry Technician will be responsible for the sample preparation, analysis, and initial review of data. A technician should be able to work with little to no direct oversight once defined tasks are assigned. Technicians will assist is daily and weekly instrument maintenance. Performs at a high degree of professional excellence including but not limited to sound, independent judgment, reliability, initiation, flexibility, and interpersonal relationships and communications.\n\n\nDuties and Responsibilities\n\n\n· Primarily responsible for one specific assay/instrument at a time.\n\n\nPerforms quality control procedures according to established protocols.\nPerforms remedial actions and records all quality control failures and corrective actions according to established protocol.\nPerforms and logs instrument maintenance according to established protocols.\nPerform calibration of instruments as necessary and ensure calibration period is adequate to cover testing.\nCalculates results according to established protocol and enters results into the laboratory reporting system.\nFollows established protocols for sample prep, analysis, and quality controls.\nPrioritizes work effectively.\nProcesses requests and investigates complaints from senior staff. Reports all issues and concerns to the Laboratory Manager.\nDemonstrates troubleshooting skills.\nParticipates in method validation for new procedures and/or equipment.\nParticipates in developing/writing new standard operating procedures and revising old ones.\nMaintains a clean work area and disinfects all counter tops at end of shift, fills out cleaning log according to department protocol.\nAdheres to laboratory and facility safety practices, including but not limited to OSHA and hazardous chemicals training and monitoring.\nCooperates and effectively communicates with laboratory, facility, and other personnel.\nAnswers inquiries regarding test results, methodologies, test specificity, test sensitivity, and factors that can influence test results.\nAssists in development of new policies and procedures.\nTakes inventory and notifies appropriate personnel when stock is low.\nParticipates in Proficiency Testing.\n\nQualifications\n\n\nAn Associate's degree in Biology, Chemistry, Microbiology or other related field.\nAt least 21 years old and can pass a background check.\nAbility to read and comprehend English and comprehend and follow oral and/or written instructions.\nGood communication skills in both written and oral form.\nReasoning skills to apply principles to draw valid conclusions, interpret technical instructions, etc.\nAbility to handle high stress levels due to working conditions and possible irregular hours.\nMust be able to demonstrate the technical skills for routine testing in area of assignment within three months of hiring.\n\nPhysical Requirements\n\n\nAbility to climb stairs.\nAbility to lift 35lbs.\nVisual and auditory acuity.\nAbility to walk and bend down.\nAbility to sit or stand for extended periods of time.\nGood eye/hand coordination and dexterity.\nAbility to appropriately dress in a laboratory environment.\n\nDirect Reporting\n\n\nReports to the Laboratory Manager for the applicable department.\nDoes not supervise staff unless otherwise told.\n\nWork authorization:\nUnited States (Required), must authorize and pass background check.\n\n\nEmployment Outlook and Growth Plan\n\n\nEvery 4-6 months, the chemical analyst will be trained on a new assay/instrument.\nOnce they are fully trained and signed off, they will be able to perform client samples on that assay.\nThis new assay/instrument will become their primary duty and will be fully responsible for all maintenance, troubleshooting, sample prep, analysis, and QC checks.\nAny other assays they have been signed off on, they can be a backup analyst for.\n\nJob Types: Full-time, Contract\n\n\nPay: $18.00 - $25.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\nMonday to Friday\n\nAbility to commute/relocate:\n\n\nToledo, OH 43623: Reliably commute or planning to relocate before starting work (Preferred)\n\nEducation:\n\n\nAssociate (Preferred)\n\nWork Location: One location\n","slug":"chemistry-technician-78ce8e41-001c-4eb2-ae6f-cfc9c441f10b","benefits":["Dental insurance","Health insurance","Paid time off","Vision insurance","Life insurance"],"selectedSkills":["Communication skills","Associate's degree","21 years or older","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=yYViJ8IDA7xDQvEJsghGsdhDzII5RDTzrI5K-luEeOHCe5xHnXYIcA"},{"position":"HPLC Technician","labName":"Curaleaf","location":"Johnstown, OH","age":"5 days ago","salaryMin":"$37,000 ","salaryMax":" $49,000 a year","jobDescriptionCopy":"Curaleaf Holdings, Inc. (CSE: CURA) (OTCQX: CURLF) (\"Curaleaf\") is a leading international provider of consumer products in cannabis, with a mission to improve lives by providing clarity around cannabis and confidence around consumption. As a high-growth cannabis company known for quality, expertise, and reliability, the company and its brands, including Curaleaf and Select provide industry-leading service, product selection, and accessibility across the medical and adult-use markets. In the United States, Curaleaf currently operates in 23 states with 130 dispensaries, 25 cultivation sites, and over 30 processing sites, and employs over 5,000 team members. Curaleaf International is the leading vertically integrated cannabis company in Europe with a unique supply and distribution network throughout the European market, bringing together pioneering science and research with cutting-edge cultivation, extraction, and production. Home | Curaleaf | Cannabis with Confidence\n\nOur corporate social responsibility is Rooted In Good Diversity, Equity, Inclusion + Social Equity + Sustainability Social Responsibility | Curaleaf | Cannabis with Confidence We believe in taking corporate and social responsibility very seriously, from our educational outreach to national partnerships, state-wide initiatives and local causes. Giving back to the communities where we operate is important to us, and helps to change old attitudes by showing the positive impact of cannabis in creating jobs, changing lives, and helping local communities.\n\nWe educate. We advocate. We give.\n\nThe HPLC Lab Technician carries out day-to-day tasks including: testing, prepping, extracting, and packaging. The HPLC Lab Technician must monitor and maintain production facility in accordance with the state of Ohio and standards set by the Company.\n\nResponsibilities:\nDevelop and execute validation of analytical systems\nOperate spectrophotometer and viscosity meter for QC\nAssist in production; calculating requirements; assembling and weighing plant material and supplies for supercritical CO2 extraction: emptying of extraction vessels.\nOperating highly sophisticated extraction equipment; Processing concentrates and extracts\nCleaning and maintenance of extraction equipment and laboratory facility following current good manufacturing practices (cGMP), and standard operating procedures; complying with legal regulations; monitoring environment\nOperating, maintaining, and making adjustments and repairs to laboratory equipment such as analytical systems, pumps, microscopes, balances, rotary evaporator, centrifuges, and other laboratory equipment\nCreating dilutions, HPLC diagnostics and repair, calibration\nMaintaining inventory records of supplies, materials, and equipment, and preparing requisitions as needed\nStoring supplies and equipment, and keeping laboratory, storerooms and working areas immaculate\nWashing and sterilizing laboratory glassware\nPerforming clerical work related to laboratory activities such as word processing, record keeping, and filing\nAssist in packaging of final products as needed\nAssist in the training of other technicians\nWork with state licensed third party testing lab to ensure QC\nPerforms related duties as assigned\n\nCompliance:\nEnsure processing operation is fully compliant with state and federal regulations\nMaintain analytical and other laboratory waste with registered waste disposal company while following state regulations\nMaintaining material safety data sheets for all department chemicals and products\nAssure that operation adheres to all business and industry license requirements.\nMaintaining strict inventory records of all plant materials, chemicals and equipment used in the laboratory and documents production by completing forms, reports, logs and records\n\nJob Qualification Requirements:\nBachelor's Degree preferred/ 1-2 years' experience in a laboratory or manufacturing setting required\nQA/QC Experience with HPLC and GC analysis\nExperience with Agilent equipment using ChemStation\nMust be at least 21 years of age\nSubject to background check per state cannabis regulations\nCapacity to work independently and/or with vendors, perform troubleshooting and solve complex problems.\nThe qualified individual will possess a keen interest and knowledge of Organic and Inorganic chemistry.\n\nCuraleaf is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.","slug":"hplc-technician-e74ac9db-7e49-4c7c-ac8a-5f0572e7a30d","benefits":[],"selectedSkills":["Gas chromatography","Laboratory experience","Analysis skills","Manufacturing","QA/QC","Bachelor's degree","Background check","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=mZznnmgmxIKft8d2jkKSDkv4gCSdyR_zBtSh9q3X07vt4as6hbxRJA"},{"position":"Lab Processing Technician","labName":"Curaleaf","location":"Taneytown, MD","age":"2 days ago","salaryMin":"$35,000 ","salaryMax":" $51,000 a year","jobDescriptionCopy":"Curaleaf Holdings, Inc. (CSE: CURA) (OTCQX: CURLF) (\"Curaleaf\") is a leading international provider of consumer products in cannabis, with a mission to improve lives by providing clarity around cannabis and confidence around consumption. As a high-growth cannabis company known for quality, expertise, and reliability, the company and its brands, including Curaleaf and Select provide industry-leading service, product selection, and accessibility across the medical and adult-use markets. In the United States, Curaleaf currently operates in 23 states with 130 dispensaries, 25 cultivation sites, and over 30 processing sites, and employs over 5,000 team members. Curaleaf International is the leading vertically integrated cannabis company in Europe with a unique supply and distribution network throughout the European market, bringing together pioneering science and research with cutting-edge cultivation, extraction, and production. Home | Curaleaf | Cannabis with Confidence\n\nOur corporate social responsibility is Rooted In Good Diversity, Equity, Inclusion + Social Equity + Sustainability Social Responsibility | Curaleaf | Cannabis with Confidence We believe in taking corporate and social responsibility very seriously, from our educational outreach to national partnerships, state-wide initiatives and local causes. Giving back to the communities where we operate is important to us, and helps to change old attitudes by showing the positive impact of cannabis in creating jobs, changing lives, and helping local communities.\n\nWe educate. We advocate. We give.\n\nLab Processing Technician Job Summary:\nWe are seeking a Lab Processing Technician to support our production lab in Taneytown, MD. The Processing Tech will support our technical staff in the production, prepping and testing of medicinal cannabis products by ensuring an organized, clean, and safe work environment by performing the following functions.\n\nEssential Job Duties:\nExplores opportunities to add value to job (innovative ideas) to benefit the organization and taking ownership of the outcome.\nProactively finds other work-related tasks • Maintains safe and clean working environment by complying with procedures, rules, and regulations.\nLabels and disposes biohazard, chemical and/or green waste appropriately.\nMaintains inter- and intradepartmental work flow by fostering a spirit of cooperation (hand offs).\nMaintains laboratory supplies inventory by checking stock to determine inventory level anticipating needed supplies; placing and expediting orders for supplies; verifying receipt of supplies.\nConserves laboratory resources by using equipment and supplies as needed to accomplish job results.\nOperates and maintains laboratory equipment. •Preparation of biomass for extraction.\nSample biomass and in process goods for HPLC analysis.\nSanitizes processing glassware, extraction socks/materials, and general lab work areas\nDocuments work in notebooks, excel tracking spreadsheets, and state-required compliance tracking software\nPerforms preventative maintenance and troubleshoots problems to the full extent of ability\nActively participate in the laboratory quality plan/program (ex. investigative reports, notification of delays, etc.)\nParticipate in the training of new staff by serving as a mentor and technical resource.\n\nJob Qualification Requirements:\n\nMust be able to work flexible shift\nMust be punctual and able to follow directions\nMust have experience in food industry/prepping/mixing/baking/cleaning.\nHigh School Diploma or equivalent, Bachelor's degree preferred\nAt least one year of manufacturing and packaging experience with a focus on ensuring product safety, consumer safety and satisfaction, and high product quality.\nMust be at least 21 years of age.\nMust not have been convicted of any felony offenses pursuant to state statues.\nMust be in current role 6 months or more to transfer/apply\nMust be an outstanding team-builder and have excellent verbal/written communication skills\nMust have accountability, proactive behavior and strong attention to detail\nMust follow Good Manufacturing Practice standards\nMust be able to act safely and professionally while working in a fast-paced, high production environment\nMust be proficient with Microsoft outlook and Microsoft Office\nSafety Requirements:\n\nAct safely and professionally always\nAble to safely handle the following hazardous materials:\nArgon\nButane\nPropane\nEthanol in large volumes\nIsopropyl alcohol\nAcetone\nGlycols\nSilicone-based thermal fluids\nCritically hot material\nExtremely cold material\nJob Skills:\n\nAttention to detail.\nEffective communication skills.\nStrong work ethic.\nWillingness to learn and improve each operation.\nAbility to perform repetitive tasks for long periods of time.\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform essential functions.\n\nLanguage Skills Must be able to communicate clearly and effectively, both verbally and in writing. Must display professional telephone etiquette and be able to interact and communicate effectively with individuals at all levels of the organization. Ability to effectively present information in one on-one and small group situations to customers, clients, and other employees of the organization.\n\nMathematical Skills Ability to add, subtract, multiply, and divide in all units of measure, using whole numbers, common fractions, and decimals. Ability to compute rate, ratio, and percent and to draw and interpret bar graphs.\n\nReasoning Ability Ability to apply common sense understanding to carry our instructions furnished in written, oral, or diagram form. Ability to deal with problems involving several concrete variables in standardized situations.\n\nPhysical Demands - While performing the duties of this job, the employee is regularly required to stand; walk; use hand to finger, handle or feel; reach with hands and arms; climb or balance; stoop, kneel, crouch or crawl; and talk or hear. The employee must frequently lift and/or move up to 50 or more pounds and regularly move up to 25 pounds.\n\nWork Environment - The noise level in the work environment is above average with equipment running. The employee is frequently exposed to an environment of natural chemical fumes, herbal aromas, airborne particles, exposed to wet, humid, hot, and/or cold conditions. Employee will have moderate exposure to conditions such as dust and particles that affect the respiratory system, eyes, or the skin, depending on department job assignments. Personal Protective Equipment is provided for employees to utilize\n\nCuraleaf is an Equal Opportunity Employer\n\nCuraleaf is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.","slug":"lab-processing-technician-a9a6babc-e58a-498f-813f-2d5a9a996fc7","benefits":[],"selectedSkills":["Manufacturing","Microsoft Excel","Baking","Phone etiquette","Microsoft Outlook","Bachelor's degree","High school diploma or GED","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=IcpwYzeNR68C4Q_jziIildZ1cKlWlcl-74f_CkkGEcJvAHFROOFH7A"},{"position":"Program Director Medicinal Plant Sciences Clinical Chemistry Microbiology","labName":"Beal University","location":"Remote","age":"2 days ago","type":"Full-time","salaryMin":"$51,000 ","salaryMax":" $68,000 a year","jobDescriptionCopy":"Beal University has core values in student success and lifelong learning. For over 130 years, Beal University has served as a leader in education and workforce development in the region. We are seeking a Program Director of Medicinal Plant Sciences to oversee the Bachelors degree in Medicinal Plant Sciences and Associate degree in Cannabis Laboratory Science. Both programs are delivered fully online. Ideal candidate will have academic teaching and leadership experience with a strong background in clinical sciences.\n\n\nPosition Description:\n\n\nThe Program Director is responsible for managing the online academic team to effectively teach students and achieve successful outcomes of the program. The Program Director administers the program in compliance with all accrediting standards and regulatory guidelines.\n\n\nJob Duties: The Program Director is responsible for the following areas as it relates to his or her program(s):\n\n\n· Facilitating Class Instruction: instruct classes either on campus or online, as deemed necessary by the Academic Dean.\n\n\n· Coordinating courseware and curriculum: Coordinate with Academic Dean for all course syllabi revisions and approval and maintain historical file of approved syllabi. Recommend, and obtain approval from Academic Dean, of changes in curriculum, books and supplies and communicates approved changes to faculty, Director of Center for Teaching and Learning and Registrar department. Works, in collaboration with Director of Center for Teaching and Learning, to lead and mentor faculty in curriculum development and utilizing best practices in the online platform.\n\n\n· Manage faculty recruitment: reference verification, hiring, orientation, assignment, evaluation, training, professional development, and management of faculty.\n\n\n· Facilitate the training of faculty: in all aspects of academic operations in program area, academic policies and procedures and adherence to institutional accreditor requirements and programmatic, if applicable.\n\n\n· Learning Management System: Collaborates with the Director of Center for Teaching and Learning, to lead and mentor faculty in curriculum development and utilizing best practices in the online platform.\n\n\n· Leads their faculty in the following: annual review of existing curriculum, development of new initiatives and programs, and constant review and improvement of instruction methodologies with employer needs and accreditation standards. Manage faculty to ensure all courses are conducted with adherence to contact hours per credit requirements.\n\n\n· Chair faculty meetings: schedule biannual meetings with faculty teaching the major courses in the program for continuous curriculum review and improvements.\n\n\n· P*r*ovide mentoring of faculty: to ensure program expectations are being met, including course content, objectives, and intended student learning outcomes.\n\n\n· Faculty assessment and evaluations: Evaluate established faculty twice per year and new faculty consistently for the first three modules of employment in following the prescribed curriculum at all times to include, but not limited to, course objectives, course content, timely grading, and hands-on experiences (where applicable). Perform regularly scheduling classroom observations, annual evaluations, and annual faculty development plan for each member of the faculty. Review student surveys, each term, discuss with faculty and identify areas of continuous improvement.\n\n\n· Faculty files and professional development: Annually review the essential documentation of faculty files and continuous professional development training for all faculty and academic staff with adherence to institutional and programmatic accreditor requirements.\n\n\n· Collaborates with Registrar’s office: for the appropriate scheduling of classes, assignment of instructors and communicates to faculty.\n\n\n· Enrollment: Review program enrollment statistics with administrative team once per module. Monitor and evaluate admissions standards to recruit and enroll academically prepared students in the program consistent with the institution’s goals. Suggest items for news releases to promote visibility of the program in the community.\n\n\n· Retention: Collaborates with Student Services once per module to monitor student retention metrics based on accreditation guidelines and to ensure the appropriate benchmarks are being proactively monitored and satisfactorily achieved. Provide feedback of strategies of revisions to programs not meeting benchmarks.\n\n\n· Provide advisement to students: with regards to satisfactory academic progress, scheduling and transferring between programs as well as conflict resolution. Recommend and approve course substitutions when appropriate, discuss with students requests for changes of program.\n\n\n· Office hours: Maintain available hours to be accessible to students on a by-appointment basis.\n\n\n· Program Advisory Board: Recruit members for Program Advisory Board. Plan agenda and scheduling of Program Advisory Board meetings. Chair meetings of the Program Advisory Board. Hold at least two Program Advisory Board meetings per year.\n\n\n· Community outreach: Develop and maintain community contacts that can serve to promote the program.\n\n\n· Job Placement: Work closely with Career Services personnel in assisting students with placement opportunities and career guidance. Review placement reports each module, assist in contacting students / graduates to verify placements. Regularly report known placements (student, position, employer, etc.) to Career Services personnel.\n\n\n· Manage and participate in continuing education/professional development\\*: submit professional development plan annually and attend classes to ensure that knowledge and teaching methods are up-to-date for ongoing continuous improvement. Manage and approve faculty development plans and ensure faculty attend classes/workshops. Maintain licenses and certifications as applicable.\n\n\n· Serve on committees (e.g., curriculum development, retention, academic advisory committee, etc.) as assigned based upon expertise or campus needs.\n\n\nEducation / Requirements:\n\n\nMinimum of a Masters degree in clinical sciences, plant sciences or related field.\nMinimum of 4 years work experience in field of study.\nTeaching and leadership experience required\nExperience in cannabis laboratory testing, processing a plus.\n\nJob Type: Full-time\n\n\nEducation:\n\n\nMaster's (Required)\n\nExperience:\n\n\nonline Teaching: 2 years (Required)\n\nWork Location: Remote\n","slug":"program-director-medicinal-plant-sciences-clinical-chemistry-microbiology-c8e4fa46-4293-4d32-ab9b-4cc18512d8de","benefits":[],"selectedSkills":["Laboratory experience","Leadership","Teaching","Bachelor's degree","Associate's degree","Master's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=iBleEefNa9Dzf9PilcKi6I9TXll5V-IFYINQEckgIwXN10MVmVqrDg"},{"position":"QA Chemist","labName":"Signature Science, LLC","location":"Austin, TX","age":"1 day ago","type":"Full-time","salaryMin":"$43,000 ","salaryMax":" $61,000 a year","jobDescriptionCopy":"Position Purpose:\nTo provide analytical chemistry and quality assurance support to both internal and external projects. External projects include national and homeland security programs with a focus on CBRNe collection and analysis efforts along with Cannabis proficiency testing programs. This role will include approximately 35% laboratory work, 35% desk work, and ~30% travel.\n\nEssential Duties and Responsibilities:\nPlan and implement chemical analysis proficiency tests for methods such as GC/MS, FTIR, LC-MS/MS, HPLC-UV, and RAMAN; activities include developing of proficiency test plans, performing laboratory pilot testing, preparing and verifying proficiency test samples, and packaging samples for shipment\nPerform laboratory activities related to the preparation and verification of proficiency test samples\nLab work will include creation of standards/spiking mixes, sample creation, sample extraction/dilution, and sample analysis using techniques such as gas chromatograph mass spectrometry (GC/MS), liquid chromatography with tandem mass spectrometry (LC-MS/MS), high performance liquid chromatography - ultraviolet (HPLC-UV), and Fourier transform infrared spectroscopy (FTIR)\nMaintain laboratory equipment and laboratory records\nEvaluate proficiency test data, provide input and review of technical reports, identify data trends and other issues\nLead or assist with the validation and/or verification of new methods\nAssist client laboratories in preparing for external ISO/IEC 17025 accreditation audits and attend the audits as an advocate for the client laboratory.\nProvide feedback and help prepare on auditee corrective actions packets for submission to the accreditation body\nContribute to the development and revision of internal and external quality documents, most of which are based on the ISO/IEC 17025 or ISO/IEC 17043 standards\nProvide ISO/IEC 17025 or training on other quality topics to clients\nPerform internal audits of Signature Science systems and procedures against relevant internal or external standards, including audits of the Signature Science Proficiency Test Program and Analytical Laboratory Program against the requirements of ISO/IEC 17043 and ISO/IEC 17025, respectively\nMay regularly communicate with external laboratory staff to help resolve QA, PT, or other quality-related issues\nMay serve as a task leader on one or more projects\n\nRequired Knowledge, Skills & Abilities:\nAnalytical chemistry skills\nStrong written and verbal communication skills\nProactive, self-starter\nAbility to multitask and ensure accurate and timely submission of project deliverables\nKnowledge of GC/MS, LC-MS/MS, HPLC-UV, and/or FTIR techniques preferred\nBasic understanding of ISO/IEC 17025 and/or ISO/IEC 17043 standards preferred\nLaboratory quality assurance experience including auditing and procedure development preferred\nWillingness to obtain the American Society of Quality (ASQ) Certified Quality Auditor (CQA) certification within two years of hire date\n\nEducation/Experience:\nBachelor degree (or higher) in chemistry or related field\n2 - 7 years of experience performing analytical chemistry lab work\nExperience providing quality assurance support to analytical chemistry programs desired\nExperience performing audits desired\nExperience assessing data for trends desired\n\nCertificates and Licenses:\nCertified Quality Auditor (CQA) certification must be obtained within 2 years from date of hire.\n\nClearance:\nCandidate must be able to obtain a Secret level security clearance.\n\nSupervisory Responsibilities:\nN/A\n\nWorking Conditions/ Equipment:\nAbility to work in varying conditions to include:\nTraditional office environments with sedentary extended periods required for voluminous data analysis via office automation (combination of onsite and remote work);\nClimate controlled laboratory environments requiring extended periods of standing when performing laboratory analyses, or during audits and SOP observation;\nMobile laboratories, subject to wide ranges of temperature and humidity requiring extended periods of standing, stooping or kneeling in confined spaces;\nConference rooms, classrooms, or theaters that involve extended periods of standing for training delivery or command briefings; and\nOutdoors in various weather and lighting conditions including heat, humidity, cold, snow, bright sun, and dark night.\nExposure to various chemical and biological materials associated with an analytical lab or facility.\nAbility to wear required personal protective equipment (PPE) including gloves, coats or gowns, shoe cover, tyvek coveralls, safety glasses, respirators, and/or PAPRs.\nSubject to medical monitoring based on lab functions.\nCandidate must be willing to travel up to 50% of the time.\n\nThe above job description is not intended to be an all-inclusive list of duties and standards of the position. Incumbents will follow any other instructions, and perform any other related duties, as assigned by their supervisor.","slug":"qa-chemist-f498c6e9-18fa-4949-a0cb-c9bf95190231","benefits":[],"selectedSkills":["Gas chromatography","Analysis skills","High-performance liquid chromatography","Patient monitoring","Spectroscopy","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=2JqCZcliOfoVUe3xm4lJfD25YpR3kRmtg4Igo80uZ-ZeCCL_cadjKA"},{"position":"Marketing Manager, Innovation Solutions","labName":"bioMérieux sa","location":"Chicago, IL","age":"6 days ago","jobDescriptionCopy":"A world leader in the field of in vitro diagnostics for over 55 years, bioMérieux provides diagnostic solutions which determine the source of disease and contamination to improve patient health and ensure consumer safety.\n\nIn North America we have more than 5,000 team members across 11 sites or subsidiaries, including Salt Lake City-based BioFire Diagnostics and one subsidiary in Montreal, Canada.\n\nCome and join a family-owned global company with a long-term vision, and a human-centered culture.\n\nPosition Summary:\nThe purpose of this job is to oversee the company’s overall strategy for Innovation Solutions Management of the xPRO product line, including Digital Solutions (CONNECT-UP, EMAP) and Predictive Genome Services (PDIC functions). This is accomplished by managing and leading product launches and other activities as required. The Innovation Solutions Marketing Manager will establish and execute the announcement strategy into a detailed Go-To-Market (GTM) execution plan and determine budget requirements, commercial strategies that support revenue targets and growth objectives, working with the Chief Business Officer of Invisible Sentinel to align with regional and global objectives.\n\nThis position is responsible for defining GTM milestone timeline to align GTM deliverables with major checkpoints, define team structure and governance model to effectively drive launch execution, establish detailed and executive dashboard & success metrics in the area of messaging & core content, field enablement, public reveal, leads & revenue generation, and customer adoption. Also included are setting sales budgets, forecasting of future business, pipeline consistency and process enforcement. This is a critical launch management role and one that requires a deeply fundamental understanding of technical leadership in directing the efforts of cross-functional project team in the development and production release of all relevant project deliverables in compliance with the product development process and customer expectations in a dynamic, rapidly changing business landscape.\n\nContext of the Job and Major Challenges:\nThe job directly affects the short and long-term sales and strategic objectives of the company as it pertains to growing bioMérieux business interests in the U.S. and Global. The U.S. bioFOOD Industrial Market for bioMerieux, Inc. includes, but is not limited to, Nutraceutical, Dairy, Beverage, Animal Protein, Cannabis, Service Laboratory and Government Accounts. Objectives include sales, support, pricing, product mix, and market share in the positioning of reagents and various instrumentation used for microbiological testing and analysis. Areas of the business consist of environmental monitoring, quality, sterility, and organism identification, genomics, and predictive analytics.\n\nRoutine internal contacts with Sales, Marketing, Finance, Predictive Diagnostics Innovation Center R&D, Customer Service, Customer Support, Field Service, Production, and Supply Chain is required in developing and delivering these compelling ‘value propositions for change’ to the customer. External responsibilities will include Customer facing discussion, market assessments and support of corporate or regional initiatives with key opinion leaders or Strategic Accounts, and agency direction in the creation of materials essential for the success of the xPRO Innovation, Digital Solutions and Predictive Genome Services product ranges. A key element of the role will be developing compelling sales support materials including training, messaging, ideal customer target lists, and development of value positioning for commercial teams. The successful owner of the product ranges will be able to combine feedback from the customer, the field sales & support organizations, and the service/support teams to create the necessary outputs to maximize sales performance. The xPRO Innovation, Digital Solutions and Predictive Genome Services product ranges are an important component of FOOD segment strategies and this role operates within a matrix organization. The successful candidate will be able to manage launches, promotions, support instrument and application needs that span the complete Food market working with colleagues across the region accordingly. A complete understating of new launch, demand planning, forecast creation, supply chain, and post launch analysis processes within the U.S. and Global teams will be necessary to ensure that the xPRO, Digital and PDIC portfolio is properly positioned to meet the needs of the customer.\n\nResponsibilities:\nThis position requires ability to take initiative, work independently & with integrity, yet able to take direction, while maintaining strong influence leadership skills. Additional behavioural competencies should include adaptability, flexibility and ability to work under pressure, good time management skills and good communication all while supporting Sales in meeting or exceeding the specific product revenue targets and growth objectives. Good customer interaction skills & negotiation skills are required for sales coaching, counselling, presentations, demonstrations, and field rep evaluations that result in valid business results that creates customer loyalty and economic arguments for the customer that are stronger than competitive alternatives.\n\nDrive product launches including working with public relations team, executives, and other product management team members\nDesign, implement, and facilitate an industry marketing plan for the U.S. that will enhance bioMérieux’s image and position within the marketplace as it pertains to the specific xPRO, Digital and Predictive Genome Services ranges\nCreate buy-in for the product vision both internally and with key external partners\nUse resources developed in supporting U.S. needs to empower AMERICAS marketing teams by demonstrating proactive communication across the region\nProvide support of marketing actions designed to gauge market size, opportunity value, or pipeline potentials related to the xPRO range\nDevelop product pricing and positioning strategies\nAct as a product Brand Ambassador to build awareness and understanding\nSupervise and define Market research activities related to the successful implementation of the Marketing Plans\nHelp maintain business relations with key contacts within the FOOD Industry. Serve as key contact in relationship and network building at key accounts to translate learnings from successful business relationships to further inform future marketing needs\nGain a deep understanding of customer experience, identify and fill product gaps and generate new ideas that grow market share, improve customer experience and drive growth\nAnnual budget setting in support of the product range objectives based on understanding of competitive environment, market needs, and sales pipeline to accurately drive bioMerieux production and R&D objectives\n\nStudies and Experience:\nBachelor’s degree required. MBA is desirable although not required\nAt least 5+ years marketing experience highly regarded\nProven work experience in product management or as an associate product manager\n\nSkills and Qualifications:\nProven ability to develop product and marketing strategies and effectively communicate recommendations to executive management\nRelevant commercial and GTM experience, ideally in life sciences or biotechnology industry\nGood communicator with interpersonal, organizational, teamwork, and collaboration skills\nExcellent verbal and written communication skills in English. Proficiency in French or Spanish highly regarded\nAbility to multitask and work within deadlines, professionally managing competing priorities\nProfound understanding of how to develop a Marketing Plan and how to implement it\nProblem solving and teamwork abilities; ability to work within or lead a team\nExcellent integrator and negotiator, results oriented\nAbility to work with & influence people without formal authority\nExcellent presentation skills to all levels of decision makers\nExcellent communicator of “value proposition” to potential clients\nExcellent analytical skills and ability to develop financial proposals\nTeam development skills\nProblem solving, analysis and training skills\nSkills associated with good project management and budget control\nStrong MS Office skills and experience with web-based platforms for relationship management (Salesforce/Pardot, LinkedIn).\nDatabase experience with relevant BI tools (SAP, IBM, ORACLE, TABLEAU, etc.)\nAbility to travel, domestically and internationally as needed\nWillingness and ability to comply with bioMérieux Corporate Business Ethics & Compliance policies\nExperience working effectively with cross functional teams in a matrix organization in multinational companies\nKnowledge of the bioMerieux Industry product line is desirable\n\nAdditional Information:\nThis position requires 25% overnight travel, predominantly to Philadelphia, PA.\n\nBioMérieux Inc. and its affiliates are Equal Opportunity/Affirmative Action Employers. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, protected veteran or disabled status, or genetic information. Please be advised that the receipt of satisfactory responses to reference requests and the provision of satisfactory proof of an applicant’s identity and legal authorization to work in the United States are required of all new hires. Any misrepresentation, falsification, or material omission may result in the failure to receive an offer, the retraction of an offer, or if already hired, dismissal. If you are a qualified individual with a disability, you may request a reasonable accommodation in BioMérieux’s or its affiliates’ application process by contacting us via telephone at (385) 770-1132, by email at [email protected], or by dialing 711 for access to Telecommunications Relay Services (TRS).","slug":"marketing-manager-innovation-solutions-d812f302-a2c1-4960-905c-c14e53f6d5c5","benefits":[],"selectedSkills":["Product management","Sales pipeline","Leadership","Communication skills","Microsoft Office","Bachelor's degree","Master of Business Administration","Master's degree","US work authorization"],"jobType":"free","applyURL":"https://careers.biomerieux.com/jobs/9518117-marketing-manager-innovation-solutions"},{"position":"Manufacturing Lab Technician","labName":"THE Dispensary","location":"Green Bay, WI","age":"5 days ago","type":"Full-time","salaryMin":"$17 ","salaryMax":" $19 an hour","jobDescriptionCopy":"Manufacturing Lab Technician\nJob Summary:\nThe Manufacturing Lab Technician (Lab Tech) is responsible for performing tasks and operating equipment for the production and purification of cannabis infused products. Primary responsibilities include preparation of materials for production, general use of production equipment and recording of production data as outlined by standard operating procedures (SOP). The qualified candidate will work with the Production Manager to ensure production timelines are met.\nDuties/Responsibilities:\n\n\nMaintain a clean, sterile, safe, and organized work area including the laboratory glassware and equipment\nOperate intricate laboratory equipment in accordance with THE Dispensary SOPs\nProduce/process cannabis concentrate and extract products (tinctures, cartridges, waxes, and other products) per recipes and SOP’s while maintaining high quality standards\nEnsure consistency and efficacy of product by following SOP, standard analytical procedures, quality control testing, and detailed record keeping outlined by THE Dispensary\nEnsures that products and raw materials are identified, weighed, and warehouse correctly\nDeliver on production goals, while focused on safety and quality\nRecord and maintain detailed data in computer databases and reports\nStore supplies and equipment, dispose waste according to guidelines, and keep laboratory working areas sanitary and safe Responsible for safe handling of raw materials and identifying and/or reporting of unsafe equipment\nMaintain knowledge of processes and equipment\nAssist in packaging department as needed Employee may also be responsible for monitoring production line and collecting samples for analysis\nEnsure personal hygiene is acceptable under standards set by THE Dispensary before performing any production activities by washing hands, wearing a hair net, changing clothes, etc.\nPerforms other related duties as assigned\n\nRequired Skills/Abilities:\n\n\nExcellent verbal and written communication skills\nBasic math skills\nOrganized with attention to detail\nThorough understanding of company policies and practices\nProficient in Microsoft Office Suite or related software\nHighly motivated, self-directed, innovative, with ability to work independently or among teams with keen judgement, common sense, and resourcefulness\nPossess a high level of critical thinking\nWorks well under pressure and deadlines; ability to multitask\nStrong leadership and management skills with ability to motivate staff\n\nPhysical Requirements:\n\n\nProlonged periods of standing and/or walking\nProlonged periods sitting at a desk and working on a computer\nMust be able to lift up to 50 pounds at times\nGood hand-eye coordination\n\nAdditional Requirements:\n\n\nMust pass any and all required background checks\nMust be and remain compliant with all legal and company regulations for working in the industry\nMust be at least 21 years of age\n\nEducation and Experience:\n\n\nHigh School diploma or equivalent required\nAssociate’s or Bachelor’s degree in biology, chemistry, physics, or related field highly preferred, but less formal education with more on-the-job experience may be substituted.\nPrior production laboratory or manufacturing experience preferred\n\nCompensation and Benefits:\n\n\nFull-time employment.\nEmployee discount\nHealth/Dental/Vision Insurance after completion of probationary period\nPaid time off after 1 year of employment\n\nD8D LLC/THE Dispensary is an Equal Opportunity Employer and all applicants will be considered without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran, or disability status.\n\n\nJob Type: Full-time\n\n\nPay: $17.00 - $19.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nEmployee discount\nFlexible schedule\nHealth insurance\nVision insurance\n\nSchedule:\n\n\n10 hour shift\n8 hour shift\nDay shift\nMonday to Friday\nNight shift\nOvertime\nWeekend availability\n\nEducation:\n\n\nHigh school or equivalent (Required)\n\nExperience:\n\n\nLaboratory: 1 year (Preferred)\nproduction/manufacturing: 1 year (Preferred)\n\nWork Location: One location\n","slug":"manufacturing-lab-technician-51c610ad-e277-4dd1-8ffc-b60420a29cba","benefits":["Dental insurance","Employee discount","Health insurance","Flexible schedule","Paid time off"],"selectedSkills":["Manufacturing","Laboratory experience","Communication skills","Microsoft Office","Basic math","Bachelor's degree","High school diploma or GED","Associate's degree","21 years or older","US work authorization"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=Ctt6APSKQB2X6rvb0m2UiLem4_bi76cydkPac--MqdF38SRqqosoOQ"},{"position":"Extraction Inventory Specialist","labName":"TerrAscend","location":"Boonton, NJ","age":"1 day ago","type":"Full-time","salaryMin":"$30,000 ","salaryMax":" $42,000 a year","jobDescriptionCopy":"Organization\n\nThe TerrAscend Organization (OTCM: TRSSF) is permitted to cultivate, process, and dispense premium medical marijuana products to the medical marijuana patients in US States that have legalized medical marijuana products in a compassionate and safe manner. We are also committed to serving those states that have legalized recreational use by providing premium products. TerrAscend is creating an enduring, world-class company capable of operating under the standards of a highly regulated business looking to shape the future of marijuana-based therapies in the markets we serve.\n\nEssential Job Functions and Responsibilities:\nPerform counts and ensure all inventory is accounted for and reported according to company policy\nMaintain and track inventory data through testing process\nInvestigate and correct discrepancies in reported quantities and locations of all inventory\nAssess inventory output on a daily, weekly, or monthly basis to identify trends in productivity\nCoordinate with other department leaders to ensure proper material handling and inventory management through all processes\nEnsure inventory accuracy as product moves through the processes in the company monitoring system (Deacom)\nAudit product inventory weekly or as necessary\nPrepare reports on inventory operations and perform analysis to predict inventory challenges or systematic issues\nCoordinate transfers of material\nEnsure compliance with state mandated inventory controls, reconciliations, and audits.\nReport all data to Inventory and Testing Lead\nOther responsibilities as assigned by the state director\nProduce reliable, precise data for the completion of all required batch, equipment, quality, inventory and seed-to-sale documentation.\nContribute to continuous improvement of Terrascend process SOPs, work instructions and controlled document revisions.\nEnsure the safety of themselves and others by maintaining a safe and orderly environment.\nWork nights and weekends as needed to complete critical tasks.\n\nCompetencies and Qualifications:\nProficiency in MS Suite including Excel, Sharepoint and Teams\nStrong analytical, operational research, root cause, and problem-solving skills\nAbility to communicate clearly and effectively to a variety of audiences, strong reasoning, and organizational skills\nExceptional attention to detail\nExceptional communication skills a must\nAbility to work in an environment with frequently changing priorities\nBe able to lift 50lbs\n\nDesired Qualifications and Experience:\nHigh School diploma or GED equivalent is required.\n\nExperience working in a GMP manufacturing or laboratory environment is preferred.\n\nAdditional Requirements:\nApplicant must be at least 21 years of age\n\nMust be and remain compliant with any and all company regulations\n\nBackground Check Requirement\n\nAs a condition of employment, a complete background investigation will be conducted based on the rules of the specific State in which the employee is hired. The investigative process includes a state and federal background check. In some instances, individuals that have been convicted of certain disqualifying criminal offenses may not hold a position with TerrAscend.\n\nEEO Statement\n\nAt TerrAscend, employees and applicants are evaluated based on their qualifications, skills, and ability to perform the duties and responsibilities of the position. TerrAscend is committed to assuring equal employment opportunities to all employees and applicants. TerrAscend shall not discriminate against applicants because that person does or does not smoke, vape, aerosolize or otherwise use cannabis items.\n\nTerrAscend is an equal opportunity employer. In accordance with applicable law, we prohibit discrimination based on race, color, religion, creed, gender, pregnancy or related medical conditions, age, national origin or ancestry, physical or mental disability, genetic information, sexual orientation, to include gay, lesbian, bisexual, transgender and gender identity, or any other consideration protected by federal, state or local laws. Our commitment to equal opportunity employment applies to all persons involved in our operations and prohibits unlawful discrimination by any employee, including supervisors and coworkers.\n\nDisclaimer\n\nThis job description is not an employment agreement or contract. Management has the exclusive right to alter this job description at any time without notice. The list of job responsibilities, skills, duties, requirements, and the like is not exhaustive, rather it is illustrative of the current essential functions required for the position.\n\nThis organization participates in E-Verify.\n\nThis employer participates in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S. If E-Verify cannot confirm that you are authorized to work, this employer is required to give you written instructions and an opportunity to contact Department of Homeland Security (DHS) or Social Security Administration (SSA) so you can begin to resolve the issue before the employer can take any action against you, including terminating your employment. Employers can only use E-Verify once you have accepted a job offer and completed the Form I-9. E-Verify Works for Everyone For more information on E-Verify, or if you believe that your employer has violated its E-Verify responsibilities, please contact DHS.\n\nEsta Organización Participa en E-Verify.\n\nEste empleador participa en E-Verify y proporcionará al gobierno federal la información de su Formulario I-9 para confirmar que usted está autorizado para trabajar en los EE.UU.. Si E-Verify no puede confirmar que usted está autorizado para trabajar, este empleador está requerido a darle instrucciones por escrito y una oportunidad de contactar al Departamento de Seguridad Nacional (DHS) o a la Administración del Seguro Social (SSA) para que pueda empezar a resolver el problema antes de que el empleador pueda tomar cualquier acción en su contra, incluyendo la terminación de su empleo. Los empleadores sólo pueden utilizar E-Verify una vez que usted haya aceptado una oferta de trabajo y completado el Formulario I-9. Para más información sobre E-Verify, o si usted cree que su empleador ha violado sus responsabilidades de E-Verify, por favor contacte a DHS.","slug":"extraction-inventory-specialist-986d4092-dbcc-4ada-b451-df2b8acdee8a","benefits":[],"selectedSkills":["Analysis skills","Microsoft Excel","CGMP","SharePoint","Laboratory experience","High school diploma or GED","21 years or older","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=UQiJWwDUhoXrLG6QiF6eMtm4XResh9zQfGjRTwZRiHWBCxvWbfkosg"},{"position":"R&D Supervisor, Cultivation","labName":"Parallel","location":"Wimauma, FL","age":"3 days ago","jobDescriptionCopy":"Everyone is welcome here. Each of us is unique, and that's what makes us amazing. We believe in inclusiveness and celebrating each person's individuality, because there's power in bringing people with different points of view and life experiences together. That's why we provide equal employment opportunities (EEO). All applicants are considered regardless of race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, or sexual orientation.\n\nSo, bring yourself and your best ideas; when we feel safe and comfortable being ourselves, there's no limit to what we can achieve.\n\nIN A NUTSHELL…\n\nThe Supervisor, Cultivation R&D will be responsible for new method, product, and equipment development as well as design, analytical validation, and scale up for development and production of cannabis. As a representative of the company, you will follow established policies and procedures as required to comply with state regulations.\n\nParallel is one of the largest multi-state cannabis companies in the world, owning and operating in five markets; Florida (Surterra Wellness), Massachusetts (NETA), Pennsylvania (Goodblend), Nevada (The Apothecary Shoppe) and Texas (Goodblend). If you enjoy companies that are growing, moving fast, and constantly challenging themselves to achieve more, then Parallel is for you. We work hard, lean on each other, and are passionate about a pretty ambitious vision … pioneering a new paradigm of what well-being can be for all people, everywhere. For more information, visit www.liveparallel.com.\n\nWHAT YOU WILL BE DOING\nMethod development for increased production of cannabinoids and other cannabis-based compounds\nLead scale-up from development to production quantities, in collaboration with plant production personnel\nAssist in the development of new nutrient formulations and superior cultivation technologies.\nDevelop manufacturing instructions, scale up test/trials, and transfer processes into mainstream production.\nDesign and perform method validations for new products, methods, and equipment\nReview and establish specifications with the Cultivation leadership for novel products and processes\nProvide Cultivation and Executive leaders with investigational or summary reports on a scheduled basis\nPerform routine calibration and maintenance of equipment and daily quality control testing of analytical and /or preparative methods\nProvide cost and man-hour estimates associated with R&D project proposals\nPlan, coordinate, and oversee laboratory analyses, data transformation/analysis, site studies, health and safety studies, and investigations into market products and trends.\nDesign and implement plant production studies, product quality and stability evaluation experiments; supervise technical staff\nEXPERIENCE AND SKILLS YOU'LL BRING\nAge 21 or over (Required)\nHigh School Diploma or equivalent (Required)\nValid Government-Issued Photo ID (Required)\nPrevious supervisory work experience (Required)\n3+ years in a commercial agriculture and/or horticulture field with hands on and supervisory experience (Preferred)\nAdvanced understanding of experimental design, developing KPI's, and project management procedures (Preferred)\nUnderstanding of plant nutrients, physiology, morphology, genetics, IPM practices, biochemistry (Preferred)\nCan give and take direction well, along with strong observational, written, verbal, listening, planning, and organization skills\nCan accurately multitask several projects at high levels of complexity\nHas strong analytical and problem-solving skills, interpersonal skills, with the ability to communicate effectively with all levels of the organization on the phone, in person and via email\nYOU WILL BE SUCCESSFUL IF YOU…\nAre self-motivated; micro-managing isn't fun for anyone\nRoll your sleeves up and do the work; strategy is important, but so is getting stuff done\nCan work fast and be flexible; our industry is always changing\nPlay nice with others; we collaborate with each other a lot\nThink creatively; sometimes, the \"traditional\" solution isn't the best one\nWHAT YOU GET\nConsistent, reliable benefits; Full medical/vision/dental, 401k with a possible company match, access to company-sponsored well-being programs\nBalance and flexibility; paid time off, paid parental leave, flexible work arrangements\nFinancial opportunity; an incentive program that provides opportunity to earn cash AND equity in a fast-growing company and industry\nEmployee discount\nChance to make a difference; Employee Relief Fund, community volunteerism opportunities through Benevity\nPHYSICAL REQUIREMENTS\nThe ability to lift 50 pounds regularly\nThe ability to move safely over uneven terrain or in confined spaces\nThe ability to be able to be in constant standing/moving position\nThe ability to perform various physical activities, including lifting, standing, and squatting\nThe ability to work in extreme weather\nThe ability to have consistent attention to detail for 8 hours per day\n\nPARALLEL IS UNITED BY OUR VISION, MISSION, & VALUES\n\nOur Vision – why we exist – is to pioneer well-being and improve the quality of life for humanity through the benefits of cannabinoids.\n\nOur Mission – how we will do this – is to build a leading, global well-being company through the best talent, our values, trusted and recognized brands, science and technology-based innovation, and a relentless focus on execution and continuous improvement.\n\nOur Values – Integrity | Collaboration | Alignment | Intentionality | Accountability | Agility\n\nWe are an Equal Opportunity Employer. We embrace and encourage our employees' differences in age, color, disability, ethnicity, gender identity or expression, language, national origin, physical and mental ability, political affiliation, race, religion, sexual orientation, socioeconomic status, veteran status, and other characteristics that make our employees unique.","slug":"rd-supervisor-cultivation-2af9e4b5-86ad-4060-b9b1-05a460f3b253","benefits":["Dental insurance","Employee discount","Health insurance","401(k) matching","Paid time off"],"selectedSkills":["Horticulture","Analysis skills","Biochemistry","Experimental design","Supervising experience","High school diploma or GED","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=lLBaYqjh4OQdxzDiDzMm_BNqwn6Na67AxF6ETwxuF3A5Cf_JcMIMvw"},{"position":"MIPS Manager (FT)","labName":"House of Dankness","location":"Denver, CO","age":"3 days ago","type":"Full-time","salaryMin":"$50,000 ","salaryMax":" $80,000 a year","jobDescriptionCopy":"Position Summary:\nThe MIPS Manager leads the activities and operations required to complete the functions of the department. This role is responsible for cannabis-infused product synthesis, which includes but is not limited to formulation, emulsification, blending, unit production, and production of cannabis-infused products. The MIPS Manager will report directly to the Vice President and have a consistent impact across the organization - advancing the mission of customer service, product development, and brand growth through the execution of the company’s core values.\n\nCore Expectations:\nProvide effective leadership to employees to ensure a complete understanding of, and alignment with the Company’s vision, mission, and values to maintain a positive work environment and a high level of morale.\nResponsible for managing the daily activities of cannabis-infused product production within production laboratory facilities and operations.\nBe an effective leader who understands modern (21st century) business practices applicable to the global marketplace.\nAbility to lift 50 - 80 lbs.\nPossess a thorough and honest understanding of the cannabis moment, including a passion for cannabis science, and its application of same.\nPractice authentic and excellent interpersonal skills, with an unrehearsed ability to understand and manage human affairs.\nPositively respond to the team's questions, concerns and suggestions and takes immediate action as necessary to effectively resolve conflicts.\nDeliberately and consciously practice professionalism and righteous transformational initiatives.\nHave a thirst for continuous learning.\nVersed in planning, organizing, assigning, and coordinating the activities and resources of the department.\nRobust understanding and application of basic scientific principles as well as production laboratory operations.\nAbility to follow written instructions and maintain a laboratory notebook as well as production records and production logs.\nDevelops, maintains, and implements standard operating procedures for all cannabis-infused products and techniques developed.\nMust follow all applicable policies, procedures, and guidelines. This includes the safe and proper operation of any/all relevant machinery, instrumentation, and equipment.\nSets up, operates, and maintains production laboratory equipment, monitors experiments, makes observations, calculates mathematically and records results.\nKnowledge of manufacturing analytical testing, (which includes but is not limited to, HPLC, GC, ICP MS, UV/VIS, IR, Moisture Analysis, Particle Size Analysis, and Microbial Testing); and monitors product disposition against these test results to support quality of infused products synthesized.\nDevelops and implements research and development procedures, programs, and techniques to meet organizational needs and capitalize on potential new products.\nWorks collaboratively with product development towards innovative formulations that meet both patient and company guidelines for effectiveness, cost, and stability; must be able to take formulations from lab scale to full production.\nAbility to adapt to and implement new methods and techniques for operational and product improvement, technical development, and new product development.\nManage inventory and ensure the seed-to-sale system is properly maintained.\nMaintain clean and sanitary laboratories and work environments including but not limited to all equipment, workstations, document controls and common areas. Responsible for preventative maintenance and keeping all equipment operational.\nAssist with compliance, including the creation of batch production records, and product labels specific to the state of Colorado, and in accordance with company standards.\nStay current on scientific and associated, literature and legislation in the cannabis industry, following cannabis research, industry trends and education.\nPartner collaboratively with other department managers including but not limited to, extraction, refinement, processing, packaging, facilities, security, cultivation, quality, and compliance.\nPartner with management to develop, document, and keep current Standard Operating Procedures for production sequences and formulations.\nOther duties as assigned.\n\nCore Competencies:\nBachelor’s Degree in Chemistry, Formulation Chemistry, Biochemistry, Manufacturing, Food Science, Engineering, and/or similar scientific field; and/or at least 2 years experience in cannabis manufacturing or 5+ years managing a professional laboratory environment.\nDemonstrated strategic experience in overseeing all aspects of professional production laboratory environments including managing a production team with diversity, equipment handling, production operations, processing, implementation, coordinating supplies, and maintaining equipment.\nMust be 21 years of age at the time of hire.\nValid State driver’s license or State ID card.\nMust-Have CO MED badge\nA minimum of 3 years of supervisory and/or managerial experience leading a large diverse team of professionals.\nKnowledge and experience related to producing BHO extracts include but are not limited to creating consumables, extraction techniques and routes of administration.\nWork history showing progressive responsibility, willingness to accept additional projects or challenges, 21st-century industrial competencies, and wisdom.\nAbility to maintain confidentiality, reliability, trustworthiness, and honesty.\nAbility to remain calm in potential periods of high stress or unusual activity.\nProficiency in mathematics is an absolute requirement for all operations.\nProficient knowledge of the chemistry related to all manufacturing operations.\nDemonstrated ability to achieve manufacturing objectives in terms of volume, product mix, cost, and quality.\nExtensive knowledge of environment, health and safety standards in manufacturing operations required.\nExtensive knowledge of extraction and chemical processing techniques.\nAbility to listen well and communicate effectively, orally and in writing with various audiences.\nKnowledge and ability to use standard production laboratory equipment, filling equipment, vacuum ovens, hot plates, etc.\nDemonstrated experience in organizational development, personnel management, budget and resource development, and strategic planning.\nProficiency with Microsoft Office Suite, Word, and Excel with strong attention to detail.\nMust be and remain compliant with all legal or company regulations for working in the cannabis industry\nFrequent sitting and walking\nOccasionally Twist/bend/stoop/squat, kneel/crawl\nThe ability to communicate orally with management and other co-workers is crucial. Regular use of the telephone and e-mail for communication may be required. Sitting or standing for extended periods is common. Hearing and vision within normal ranges are essential for normal conversations, receiving ordinary information and preparing or inspecting documents.\nGood manual dexterity for the use of office equipment and manual tools.\n\nSalary and Benefits:\n$50,000‐80,000 Annual salary depending on experience and qualifications.\nHealth, Dental and Vision insurance are available for all full‐time employees after 90 days. 50 percent Of Health insurance is paid by Company. (Dental and Vision is an employee option).\nEmployee Discount at House of Dankness.\n1‐week Paid time off after 1 year.\nPaid sick leave.","slug":"mips-manager-ft-4970e1c5-7500-47d1-bb78-d0bc98195271","benefits":["Dental insurance","Employee discount","Health insurance","Paid time off","Paid sick time"],"selectedSkills":["Writing skills","Manufacturing","Microsoft Excel","Driver's License","Microsoft Office","Bachelor's degree","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=G0LEaIpv-AvZWvevtp_Idr_0pllfSRaM_dZfeP-bKshGkGGRuw0PfQ"},{"position":"Senior Director of Food Safety and Quality Assurance (FSQA)","labName":"Kiva Confections","location":"Oakland, CA","age":"2 days ago","type":"Full-time","salaryMin":"$92,000 ","salaryMax":" $130,000 a year","jobDescriptionCopy":"Kiva Confections (www.kivaconfections.com) is a world-class cannabis-infused edibles company in California, the largest cannabis market in the world. Kiva's line includes Kiva Chocolate Bars, Terra Bites, Petra Mints, Lost Farms Gummies & Chews, and Camino Gummies. Our products are crafted from premium ingredients and thoughtfully combined with California cannabis. Since our beginning in 2010, our goal has been to create confections that redefine what a cannabis confection ought to be. By applying art and science, we ensure a deliciously consistent experience.\nWe have high-reaching growth plans as the legal market and consumer adoption expand. Key growth initiatives include ambitious platform innovation, outstanding marketing, geographic expansion, strategic partnerships, and more. We are resourced for this spectacular growth and looking for great people to help take us to the next level.\n\n\n*\nJob Summary*\nThe Senior Director of FSQA is a vital partner in the daily success of Kiva Confections, ensuring the company complies with all Kiva Standards and overseeing regulators. This individual will manage and improve current FSQA programs. Most importantly the Senior Director of FSQA will be responsible for building and scaling a premier nationwide FSQA program for one of the largest cannabis edibles companies in the United States. The Senior Director of FSQA will drive Kiva manufacturing plants to GFSI level audit compliance through hiring, training, audits, and seeking outside counsel.\nThis job is for you, if...\n\n\nYou excel at building and scaling.\nYou are passionate about FSQA and the its place as a strategic partner to Manufacturing, R&D, and Sales.\nYou have extensive knowledge and experience in running an FSQA program in a food manufacturing plant\nYou lead with “Yes” but your north star is safety and quality\nYou are a wealth of compliance knowledge, coaching and mentoring those around you\nYou love managing and building teams that thrive in a fast-paced, high-growth environment\nYou are a great coach and mentor, leading with compassion and kindness, but balance that with accountability\nYou are proactive. You spot issues before they become problems and move quickly to resolve them\nYou are great communicator. You are great at getting buy-in cross departments and are results-driven\n\nAs the Kiva Director of Food Safety & Quality Assurance, you will...\n\n\nOversee the development and implementation of all food safety, food quality, internal audit, supplier approval, chemical control programs and ensure compliance to all related policies, procedures, and specifications\nDirect and manage areas of function regarding Quality Control, Quality Assurance and Sanitation ensuring adherence to all FDA-FSMA, GMP, HACCP and Code of Federal Regulations\nDevelop and implement food safety plans and critical metrics to assure compliance with regulatory requirements\nDevelop, manage, and promote continuous quality improvement activities for the companyLead efforts to assure compliance with the Food Safety Modernization Act (FSMA), GFSI, and other regulatory and environmental compliance programs\nFoster a culture of Continuous Improvement and deliberate problem solving through implementation and training of CI Tools\nCollect, analyze, and summarize data from the field, production, or internal testing to effectively make improvements to product, processes, or standards.\nEducate plant teams on collection and utilization of data as a continuous improvement tool.\nWork cooperatively with all departments (Sales, GEO, Purchasing, Manufacturing, Warehouse, Accounting, etc.) to approve and launch new products to the market.\nSupport the R&D initiatives working collaboratively with operations leadership in designing and implementing systems and processes that improve both product/process quality and operating efficiency.\nDevelop proactive relationships with Sales, Customer Service and Strategic Customers to ensure customer expectations are accurately reflected in KPIs, Specifications and key process requirements.\nOversee external audits of raw material manufacturers, packaging manufacturers, contract laboratories and other suppliers as directed.\nOversee the maintenance of regulatory databases, archives, and quality management system\nResponsible for conducting and reviewing investigations relating to customer/consumer complaints, deviations\nEnsure compliance to all federal, state and local regulatory requirements\nEnsure compliance to all state cannabis regulatory requirements for manufacturing\nProactively identify potential and emerging food safety issues and develop strategies to investigate and respond effectively\nDevelop and deliver Food Safety & Quality Management System training\nManage all out of state Kiva manufacturing program managers\n\nWhat we're looking for...\n\n\nBachelor’s Degree in Food Science, Science or a related field is required\nMinimum 5 years’ experience as a Director of FSQA in a food manufacturing facility with experience leading teams and building programs\nCannabis experience is not required, but preferred\nRelevant certifications: SQF practitioner, FSMA certified, HACCP certified\n\nWork Environment\n\n\nWork is typically based in a busy office environment and subject to frequent interruptions.\nBusiness work hours are Monday-Friday from 8:00 am to 5:00 pm, however some extended or weekend hours may be required.\n\nPhysical Requirements\n\n\nRequires intermittent standing, walking, sitting, squatting, stretching and bending throughout the workday.\nMay be required to lift and carry items weighing up to 25 lbs.\n\nKiva Confections provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.\n\n\nDISCLOSURE TO JOB APPLICANTS PURSUANT TO THE CALIFORNIA CONSUMER PRIVACY ACT (CCPA)\nAs part of your job application and the Company’s evaluation of your candidacy, the Company collects, receives, maintains, and uses the following types of Personal Information about you for the business purposes identified for each category:\n\n\nCategory: Personal Identifiers\nExamples: Name, alias, postal or mailing address, email address, telephone number, social security number, driver’s license or state identification card number, passport number\n\n\nBusiness Purpose:\n\n\nTo comply with state and federal law and regulations requiring; employers to maintain certain records;\nTo evaluate your job application and candidacy for employment;\nTo obtain and verify background check and references; and\nTo communicate with you regarding your candidacy for employment.\n\nCategory: Pre-Hire Information\nExamples: Job application, resume, background check results, job interview notes, and candidate evaluation records\nBusiness Purpose: Same as above\n\n\nCategory: Employment History\nExamples: Information regarding prior job experience, positions held, names of prior supervisors, reference information, skills and when permitted by applicable law your salary history or expectations\nBusiness Purpose: Same as above\n\n\nCategory: Education Information\nExamples: Information from resumes regarding educational history; transcripts or records of degrees, vocational certifications, licenses obtained\nBusiness Purpose: Same as above\n\n\nIf you become employed by the Company, the Company will notify you of additional categories of Personal Information that it collects, receives, and maintains for business purposes.\n\n\nJob Type: Full-time\n","slug":"senior-director-of-food-safety-and-quality-assurance-fsqa-c4989f04-0281-4920-98fb-cb7f37a41c3f","benefits":[],"selectedSkills":["Petra","Continuous integration","Manufacturing","Driver's License","Mentoring","Bachelor's degree","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=_q8QGvCuC9LHytHMciFhtWt655F9xda4C_tpHuLXe23wPt1jnQBWQA"},{"position":"Medical Doctor","labName":"CannaMD","location":"Lake Mary, FL","age":"3 days ago","type":"Part-time | Contract","jobDescriptionCopy":"CannaMD is one of the fastest growing networks of medical marijuana physicians in Florida. With statewide locations, CannaMD prides itself on providing compassionate care to Florida patients through evidence-based application of medical cannabis research.\n\n\nWe are currently looking for a personable, tech-savvy physician to oversee our Tallahassee office part time. We’ve already established a strong area presence in this market, and look forward to entrusting the right candidate with a sizable, already established patient-base preferred.\n\n\n1-2 days per week to start, can grow to 4-5 days per week if candidate prefers.\n\n\nIn accordance with state law, all CannaMD physicians must hold an active, unrestricted license as either an allopathic physician or osteopathic physician and be in compliance with all state-mandated education requirements. At this time, educational requirements include completing an annual course and exam administered by either the Florida Medical Association or Florida Osteopathic Medical Association.\n\n\nAlso in line with Senate Bill 8A, CannaMD physicians may not be employed by, or have any direct or indirect economic interest in, any medical marijuana treatment centers or marijuana testing laboratories.\n\n\nCannaMD may, at its discretion, provide industry training and/or reimbursement for state-required licensure, fees, and courses.\n\n\nVery competitive compensation arrangements available. Please inquire for more information.\n\n\nJob Types: Part-time, Contract\n\n\nPay: Up to $240,000.00 per year\n\n\nBenefits:\n\n\nEmployee discount\nFlexible schedule\n\nSchedule:\n\n\nDay shift\n\nCOVID-19 considerations:\nCannaMD follows all CDC guidelines in regards to COVID 19\n\n\nLicense/Certification:\n\n\nBC/BE (Preferred)\nMedical License (Required)\n\nWillingness to travel:\n\n\n25% (Preferred)\n\nWork Location: Multiple Locations\n","slug":"medical-doctor-d4939c84-a751-4354-aee5-c81562ce1fc1","benefits":["Employee discount","Flexible schedule"],"selectedSkills":["BC/BE","Medical License","US work authorization"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=Ukw7ufJZeYUr44O4ZrM698_G_REiV3oawvpwU2j-iERto6mhX6sc1w"},{"position":"Client Relations Specialist","labName":"Kaycha Labs","location":"Denver, CO","age":"5 days ago","type":"Full-time","salaryMin":"$18 an hour","jobDescriptionCopy":"Company Overview:\n\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\n\nJob Purpose:\n\n\nThe Client Relations Specialist will be responsible for customer relations, accounting and operations support. This position will also interface with multiple departments and customers. This role will primarily focus on lab operations support.\n\n\nEssential Duties & Responsibilities:\n\n\nAnswer phones and route calls to the appropriate party.\nGreet incoming visits and escort to appropriate areas.\nReceive, sort and distribute incoming mail.\nOrder office supplies and keep inventory of stock.\nDeliver deposit checks to accounting.\nCreate and process customer invoices.\nProcess credit card payments in Blackstone.\nCoordinate with clients on payment processing of sample orders.\nReceive all incoming work from internal and external clients and process work orders through the company Laboratory Information Management System (LIMS).\nPrepare and manage shipments with partner labs.\nSpecial projects and errands as needed, including transportation of packages to local shipping companies.\nResponsible for shipping and receiving of orders and supplies, which includes light lifting duty (packages up to 40 lbs)\nMaintain compliance with health and safety guidelines for a lab environment.\nOther duties and/or special projects as assigned.\n\nSkills, Abilities and Competencies:\n\n\nExcellent communication skills and ability to effectively work, problem solve, and communicate with multiple levels of the organization.\nAbility to work in a dynamic, fast-paced deadline environment while successfully managing multiple tasks.\nProficiency in Microsoft Office suite, including Excel, PowerPoint, and Word.\nStrong understanding of standard laboratory protocol.\nAbility to maintain an incredibly high degree of attention to detail and accuracy.\nStrong agility, engagement, and flexibility in an ever-changing environment.\nWorking knowledge of logging, organizing, and analyzing data.\n\nEducation & Experience:\n\n\nHigh School diploma or equivalent required. Higher level degree preferred.\n1+ years of experience working within a lab environment.\n1+ years of experience in sample collection and logging within a lab environment.\nProficient knowledge of MS Office Suite (Excel, Word, PowerPoint)\nQuickbooks experience a plus.\nOrganizes and handles multiple priorities simultaneously.\nCompletes work assignments within time and quality constraints\nExposure to the cannabis industry desired.\n\nOther:\n\n\nMust pass Level 2 background check.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.\n\nJob Type: Full-time\n\n\nPay: $18.00 per hour\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nEmployee discount\nFlexible spending account\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nMonday to Friday\n\nCOVID-19 considerations:\nFully vaccinated employees do not need to wear masks, unvaccinated employees required to wear a mask.\n\n\nApplication Question(s):\n\n\nWhat is your desired compensation?\nBest email and phone number to reach you at?\n\nEducation:\n\n\nHigh school or equivalent (Required)\n\nExperience:\n\n\nCustomer service: 1 year (Preferred)\n\nWork Location: One location\n","slug":"client-relations-specialist-c2ef45d5-c035-43ef-b7d5-fae202f895b3","benefits":["Dental insurance","Employee discount","Health insurance","401(k)","Flexible spending account"],"selectedSkills":["Microsoft Excel","Microsoft Powerpoint","Laboratory experience","Communication skills","Microsoft Office","High school diploma or GED","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=DcdMpvYtk5XJoYHAagkAT7fjh-5R8ziSkKz3vELRrxvIgmraglMqOg"},{"position":"Sales Manager","labName":"PharmLabs LLC","location":"San Diego, CA","age":"5 days ago","type":"Full-time","salaryMin":"$40,000 ","salaryMax":" $60,000 a year","jobDescriptionCopy":"Since 2011, PharmLabs has been Southern California's premier ISO/IEC 17025 certified cannabis and hemp testing laboratory. We provide the hemp and cannabis community throughout California and beyond with chemical and biological analytical laboratory testing to ensure safe and compliant products.\n\n\nWe have a current opening for a self-motivated, reliable, and experienced individuals to assist us with sales and marketing efforts throughout Southern California. This is an incredible opportunity to enter into the \"Green Rush\" to work with one of the most trusted scientific laboratories in the cannabis business. This position is salary plus heavy commissions.\n\n\nTITLE: Sales Representative\n\n\nPOSITION SUMMARY:\n\n\nThe incumbent will be responsible for selling laboratory testing services such as pesticide, heavy metal, residual solvent and cannabinoid potency testing to other businesses such as cultivators, manufactures and distributors that specialize in cannabis and/or CBD/hemp industries. The incumbent will work at the laboratory in San Diego. at home and/or traveling throughout Southern California with some overnight stays required.\n\n\nESSENTIAL DUTIES AND RESPONSIBILITIES:\n\n\nGenerating leads,\nUsing CRM software Hubspot to track everything\nMeeting leads and clients face to face,\nCold calling,\nCustomer retention,\nAttending events\nIncreasing overall sales while meeting obtainable sales goals.\n\nREQUIREMENTS:\n\n\n-Valid Driver's License and Insurance\n\n\n-Must be 21+ years of age\n\n\n-Must have a clean driving record\n\n\n-Completed 2 years of college coursework\n\n\n-Strong communication skills\n\n\n-Adaptability and flexibility\n\n\n-Attention to detail\n\n\n-Strong work ethic\n\n\n-Must be able to pass a Live Scan background check prior to and periodically throughout employment\n\n\n-Must not be employed or have any ownership in any other CA cannabis industry license type\n\n\nJob Type: Full-time\n\n\nPay: $40,000.00 - $60,000.00 per year\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nHealth insurance\nMileage reimbursement\nPaid time off\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\n\nSupplemental Pay:\n\n\nBonus pay\nCommission pay\n\nEducation:\n\n\nAssociate (Preferred)\n\nExperience:\n\n\nSales Experience: 2 years (Preferred)\n\nLicense/Certification:\n\n\nDriver's License (Preferred)\n\nWork Location: One location\n","slug":"sales-manager-cf11747e-627a-4295-be80-9582baac17aa","benefits":["Health insurance","Mileage reimbursement","401(k) matching","Paid time off","401(k)"],"selectedSkills":["Driver's License","Sales","Communication skills","Associate's degree","21 years or older","Clean driving record","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=0CjFHInkIIy3E1kpqYcXFdbfa78um0VKfxOgBNjg7XJdU_yGdD8qcQ"},{"position":"Sales and Marketing Associate","labName":"CMB Squared Inc","location":"Riverside, CA","age":"4 days ago","type":"Full-time","jobDescriptionCopy":"The Account Manager will work with new and existing accounts to sell cannabis and hemp testing packages from R&D testing (pesticide, potency, heavy metals, etc.) to California Compliance testing to ensure products are safely tested prior to sale. The successful candidate will be eager to learn and grow Canalyte’s market share, understand the unique needs of clients in the Cannabis/CBD/Hemp industries, and work collaboratively with all divisions to meet company goals.\n\n\nResponsibilities:\n\n\nBecome the reliable point of contact and trusted partner for all of your client’s testing needs\nAct as a liaison between the lab and customer to review results and address any testing concerns\nAttend shows, conventions and networking events in the cannabis industry to provide company brand presence and establish industry relationships\nVisit and drive to client locations to collect cannabis samples back to the laboratory as well as foster client relations\nCreate quotes/invoices for new accounts\n\nQualifications\n\n\nMust be 21+ years of age\nExcellent communication skills\nExcellent customer service skills\nHigh level of organization and time management\nProven customer support and sales background of at least 3 years\nAttention to detail\nStrong work ethic & a competitive nature\nCompleted an Associate’s degree or higher\nValid Driver’s License and Insurance\nPrior experience in Cannabis industry and scientific background a plus\n\n*\n\n\nJob Type: Full-time\n\n\nPay: From $43,000.00 per year\n\n\nBenefits:\n\n\nHealth insurance\n\nSchedule:\n\n\nMonday to Friday\n\nSupplemental Pay:\n\n\nCommission pay\n\nEducation:\n\n\nAssociate (Preferred)\n\nExperience:\n\n\nSales Experience: 3 years (Preferred)\n\nWork Location: One location\n","slug":"sales-and-marketing-associate-90c31bac-3622-4f6a-bdd6-ea0b5759fa55","benefits":["Health insurance"],"selectedSkills":["Customer service","Driver's License","Sales","Customer support","Communication skills","Associate's degree","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=s3kO9s1IhrKAaz8TrRHYkeEn3pFfxPvq884iw4shQidZEvT4yzrI_Q"}]