[{"position":"Laboratory Assistant - SVOA","labName":"Montrose Environmental Group, Inc.","location":"Orange, CA","age":"19 hours ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicity testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Orange, CA facility is currently seeking a Full-Time Laboratory Assistant to join our team.\n\nAs a key member of the laboratory team, this role will be responsible for a full range of activities including:\n\nPreparing samples for digestion or extraction as needed (includes but is not limited to: weighing soils, making composites, crushing samples, incremental sampling, product sampling, etc)\nWashing glassware\nPreparing reagents as needed\nConducting simple water quality assays\nData entry\nFacility housekeeping/maintenance\nPerform support tasks as needed\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Lab Director\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nHigh School Diploma\nBasic laboratory techniques (knowledge of PPE, use of balance, pipetting, glassware handling, etc)\nBasic Excel skills required\nMust have ability to follow directions and work in a team setting\nMust be comfortable working with strong acids and solvents\nExcellent communication skills required\nDetail oriented\n\nPREFERRED SKILLS\n\nPrior Laboratory experience preferred but not required as this is an entry level position\nKnowledge of analytical method, analytical instruments, general lab practices and lab safety\nAbility to work independently and in a team\nGood organizational skills and strong communication skills\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"laboratory-assistant-svoa-5d448754-53ff-49c1-b8e3-15bf9a8269bc","benefits":["401(k)","Disability insurance","Parental leave","Tuition reimbursement"],"selectedSkills":["Laboratory experience","Communication skills","Microsoft Excel","Organizational skills","High school diploma or GED"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-CA-Orange/Laboratory-Assistant---SVOA_R2283?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Chemist 2 - Statewide","labName":"State of Washington Liquor and Cannabis Board","location":"Washington State","age":"2 days ago","type":"Full-time","salaryMin":"$4,541 ","salaryMax":" $5,960 a month","jobDescriptionCopy":"Description\n\nWSLCB Vision\nSafe communities for Washington State.\n\nMission\nPromote public safety and trust through fair administration, education, and enforcement of liquor, tobacco cannabis and vapor laws.\n\n** The hiring authority reserves the right to offer the position at any time during the process. It is to the applicant’s advantage to submit applications as soon as possible.**\n\nWho we are:\nThe mission of the Washington State Liquor and Cannabis Board (WSLCB) is to promote public safety and trust through fair administration and enforcement of liquor, cannabis, tobacco, and vapor laws. At the WSLCB we pride ourselves on creating the \"wow\" factor in everything we do. We search for people who demonstrate a strong work ethic, excellence in customer service, partnering and teamwork, and quality performance. We strive to be a great place to work by fostering a safe, open, inclusive and healthy work environment. We want to ensure that our organization is as diverse and inclusive as our great State of Washington.\n\nWe want to create a culture that fosters excellence in customer service, open and honest communication, transparency and accountability, data driven decisions, and business initiated process improvement.\n\nYour opportunity at a glance:\nThis position acts as a liaison between WSLCB and cannabis producers and processors, and other state agencies on non-licensing, financial and enforcement issues. The position acts as a subject matter expert in certain aspects of the cannabis industry and I-502 regulatory structure, acting as a resource on understanding cannabis production and specified compliance requirements under rule, including traceability reporting, medical compliant products, quality assurance testing, package and labeling, record keeping, security requirements, allowable pesticides, soil amendments, fertilizers, other crop production aids, and destruction of waste. The position also acts as the subject matter expert for the reporting system, and conducts data analysis and forensics to assist with research, financial analysis, and enforcement.\n\nThe position will support ongoing work and partnerships with other state agencies.\n\nWSLCB provides a modern work environment and excellent benefits including:\nTraining and career development programs\nTuition reimbursement\nFlexible work schedules\nTelecommuting opportunities\nGenerous wellness program\nOnsite exercise facility\nActive and engaging diversity program\nInfant at Work program\nOrganization's commitment to your personal health and well-being.\nWork/life balance\nFree parking\nA comprehensive benefits package\n\nDuties\n\nSome of the duties you will perform are:\nSupport the development of laboratory routines and procedures for handling of high-volume testing under standards-maintenance programs; investigates erratic findings through lab results in traceability data, certificates of analysis, and on-site lab follow up if needed; coordinates between WSLCB departments regarding lab data and subsequent action needed.\nProvides counsel and advice on rule, policy and enforcement actions founded in firsthand knowledge and expertise on lab accreditation.\nMaintaining expert level knowledge of the cannabis industry and compliance requirements under rule for such things as traceability reporting, quality assurance testing, packaging and labeling, record keeping, cannabis production and processing methods, medical compliant products, security requirements, allowable pesticides, soil amendments, destruction of waste, commercial kitchens requirements, high risk products, allowable hydrocarbons and other solvents, professional grade closed looped extraction systems, and point of sale system.\nSubject matter expert on understanding cannabis processing and specified compliance requirements under rule. You will continue ongoing work with Washington Department of Agriculture (WSDA), Department of Health (DOH), and Department of Ecology (ECY) on applicable areas above.\nThe position is a subject matter expert on all traceability reporting requirements and conducts analysis for the large amount of data summited in the traceability system in support of enforcement, licensing and finance operations. The position involves writing briefs and disseminating findings in regard to regulatory and data analysis.\nRespond to questions and provide training on the use of the traceability system.\nDevelop training curriculum, educational documents, and deliver presentations to cannabis producers, processors, and retailers on the seed-to-sale system, extraction methods, and other general requirements.\nCollect, analyze, and report information for large amounts of data regarding cannabis laboratory results from the WSLCB Traceability system.\nResearch, analyze, evaluate and correlate information in order to determine source reliability, content validity and potential truthfulness, to develop leads and links; and to distinguish patterns and trends.\nCreates, manages and maintains computer databases, spreadsheets, and graphical displays using software.\nTravel, general administrative duties; other duties as assigned.\n\nQualifications\n\nREQUIRED QUALIFICATIONS:\nA Bachelor's degree with a major in chemistry.\nOR\nA Bachelor's degree with a minimum of 30 semester hours or 45 quarter hours of college level chemistry AND two (2) years of experience performing chemical analysis in an analytical laboratory which includes experience operating and performing operational calibrations on electronic analytical instruments for identification and measurement of chemical components and radiation such as gas chromatographs, infrared spectrophotometers, polariscopes, and radiation analyzers, for which standards and techniques have been recorded in chemical journals, manufacturers guides, and other chemical analytical literature, employs known methods of sample preparation for measurement of micro quantities.\nOR\nOne (1) year of experience as a Chemist 1.\nNOTE: A Master's degree will substitute for two years of the required experience provided a Bachelor's degree and the required college-level chemistry has been achieved.\n\nAdvanced skills and demonstrated experience in data analysis. Experience working with databases, including writing queries.\nAdvanced skills in Excel, including the ability to summarize and create charts and reports from data.\nProficient to Intermediate skills in Microsoft Office Suite Software usage, including word, excel, PowerPoint and use of relational databases.\n\nREQUIRED ABILITIES:\nAbility to write clear and concise brief summaries and reports for executive leaders.\nAbility to deliver exceptional customer service to internal and external customers.\nAbility to apply concepts such as fractions, percentages, ratios and proportions.\nAbility to comprehend and follow complex written or oral directions/instructions.\nAbility to define problems, collect data, establish facts and draw valid conclusions.\nAbility to handle and maintain the integrity and confidentiality of highly sensitive material and information.\nAbility to interpret a variety of instructions and deal with several abstract and concrete variables.\nAbility to work with mathematical concepts such as probability and statistical inference.\nTechniques required to produce technical reports in an appropriate format, link charts, association matrices, and other specialized reports and graphic presentations.\nAbility to analyze and interpret complex data and present results in a manner that is appropriate to your audience.\nAbility to read, understand, interpret, and explain a wide range of complex documents, policies, rules and law relating to the cannabis industry and regulatory system.\nAbility to work both independently and in a team environment.\nWillingness and ability to remain current on job specific procedures through various sources, training courses, and organizational meetings to keep abreast of current changes and event relating to the cannabis industry.\n\nSPECIAL REQUIREMENT:\nWillingness to enter cannabis production, processing, retail, and testing facilities by themselves.\n\nDESIRED QUALLIFICATIONS:\nMaster’s degree or PHD in Chemistry and direct experience with lab accreditation.\nTwo (2) or more years of experience conducting research and analyzing policies, laws, rules, or regulations or comparable combination of graduate education and experience.\nTwo (2) or more years of data analysis experience, including but not limited to: descriptive and inferential statistical analysis, modeling, data forensics, and forecasting.\nTwo (2) or more years of experience conducting research and analyzing policies, laws, rules, or regulations or comparable combination of graduate education and experience.\n\nSupplemental Information\n\nHOW TO APPLY\n\nPLEASE READ THE FOLLOWING INFORMATION CAREFULLY TO ENSURE YOU HAVE SUBMITTED THE REQUIRED MATERIALS TO BE CONSIDERED.\n\nIMPORTANT: To be considered for this position, you MUST include the following, failure to do so will result in your application being disqualified:\n\nCompleted online application.\nCurrent Resume.\nLetter of Interest describing how you meet the specific qualifications for the position.\nThree professional references to include a current or recent supervisor with email addresses and phone numbers.\nUnofficial transcript showing the 30 semester hours or 45 quarter hours of college level Chemistry.\n**A resume will not substitute for completing the \"work experience\" section of the application.\n\nThe information provided in your application and supplemental questionnaire must support your selected answers in the supplemental questions. Responses not supported in your application will disqualify you for consideration of employment from this recruitment.\n\nPrior to a new hire, a background check including criminal record history will be conducted. Information from the background check will not necessarily preclude employment but will be considered in determining the applicant's suitability and competence to perform in the position.\n\nCOVID-19 VACCINATION\nPer Governor Inslee’s Proclamation 21-14, state employees must be fully vaccinated against Covid-19. Please note medical or religious accommodation may be available, once an offer of employment is made. Special note that any offer of employment is contingent upon you providing verification of your vaccine status. No start date will be approved until you verify your status.\n\nTo further ensure public safety and in conjunction with our Governor's proclamation of stay home, stay healthy and current guidelines related to COVID-19, interviews at this time will be conducted by video or phone conference as part of our recruitment process.\n\nOther\nApplicants for employment with the Washington State Liquor and Cannabis Board should also be aware of RCW 66.08.080, which states in part: \"No employee of the board shall have any interest, directly or indirectly, in the manufacture of liquor sold under this title, or derive any profit or remuneration from the sale of liquor, other than the salary or wages payable to him in respect of his office or position, and shall receive no gratuity from any person in connection with such business.\n\nRCW 69.50.351, no member of the state liquor and cannabis board and no employee of the state liquor and cannabis board shall have any interest, directly or indirectly, in the producing, processing, or sale of cannabis, useable cannabis, or cannabis-infused products, or derive any profit or remuneration from the sale of cannabis, useable cannabis, or cannabis-infused products other than the salary or wages payable to him or her in respect of his or her office or position, and shall receive no gratuity from any person in connection with the business.\n\nThe Washington State Liquor and Cannabis Board is an equal opportunity employer and encourages applications from job seekers with diverse backgrounds. Honoring diversity, equity and inclusion means that as an agency, and as individuals, we are committed to ensuring that all employees enjoy a respectful, safe, and supportive working environment.\n\nAll qualified applicants will receive consideration for employment without discrimination based on sex, race, creed, religion, color, national origin, age, honorably discharged veteran or military status, sexual orientation including gender expression or identity, the presence of any sensory, mental, or physical disability, or the use of a trained dog guide or service animal by a person with a disability. You are welcome to include your name and gender pronouns in your application, to ensure we address you appropriately throughout the application process.\n\nFor questions about this recruitment, or to request reasonable accommodation in the application process, please email hrjobs@lcb.wa.gov or call (360) 664.1674. For TTY service, please call the Washington Relay Service at 7-1-1 or 1-800-833-6384.","slug":"chemist-2-statewide-2135f2d0-ad09-4403-ac27-cab18dc1d562","benefits":["Wellness program","Health insurance","Flexible schedule","Free parking","Tuition reimbursement"],"selectedSkills":["Relational databases","Microsoft Excel","Microsoft Powerpoint","Laboratory experience","Data analysis skills","Bachelor's degree","Doctoral degree","Master's degree","Doctor of Philosophy","Background check"],"jobType":"free","applyURL":"https://www.governmentjobs.com/careers/washington/jobs/3578497/chemist-2-statewide"},{"position":"Food and Dairy Compliance Officer","labName":"State of Utah","location":"Salt Lake County, UT","age":"6 days ago","type":"Full-time","salaryMin":"$22.61 ","salaryMax":" $35.87 an hour","jobDescriptionCopy":"Job Description\n\nJob Title: Food and Dairy Compliance Officer (2-positions)\n\nThis position may be underfilled as a EHSII or EHS I.\nJob Description:\nThis is a senior level job. An Environmental Health Scientist III inspects the largest and most complex food, dairy and industrial hemp facilities; assists in the planning, coordination, and implementation of a food, dairy and industrial hemp compliance program. Reviews state and federally regulated food, dairy and industrial hemp industry facilities and advises others on the interpretation and enforcement of laws. Performs inspections and investigations involving a high degree of independent judgment, assures the reconditioning, removal or destruction of condemned products, and prepares cases and court actions. These activities include essential food safety and public health protection responsibilities. Maintains liaison with federal and local agencies and gives talks and lectures to interested parties. May serve as the agency's subject matter expert in one or more areas of specialty, such as, meat, shellfish, dairy and industrial hemp etc. Provides support to other staff within the department.\n\n\nPursuant to Utah Code §§ 4-41-107 and 26-61a-111, this job includes duties that arise from or directly relate to the Utah Medical Cannabis Act. Duties may require conduct which is in violation of the criminal laws of the United States with respect to the manufacture, sale, or distribution of cannabis. As a condition of employment, candidates who are selected to fill this position will be required to sign an Acceptance of Duties Under the Medical Cannabis Act Acknowledgment Form.\nPrincipal Duties:\nWill be working in and around controlled substances, including cannabis production and processing. Inspecting facilities, machinery, equipment, systems, etc., to verify safety, maintenance,sanitary conditions, functions, and quality.\nEnsures compliance with applicable federal and/or state laws, regulations, and/or agency rules, standards and guidelines, etc.\nGathers, identifies, and/or stores samples of materials to be tested on site or forwarded to a laboratory for testing.\nCondemns, detains, embargoes, or stops sale of unfit equipment, machinery, structures, or food products.\nMaintains detailed inspection or investigation records, prepares reports, and attends to other related administrative requirements.\nEvaluates cases and determines need for on-going agency involvement.\nIssues or recommends issuance of orders, citations, sanctions, and/or warnings for infractions involving violations of federal and/or state laws, rules and regulations.\nCoordinates and/or acts as a liaison between agency or work unit and other agencies, work units, organizations, suppliers, etc.\nReceives, researches and responds to incoming questions or complaints; provides information, explains policy and procedures, and/or facilitates a resolution.\nDevelops educational materials and speaks to state or community groups.\nWrites or drafts correspondence, reports, documents and/or other written materials.\n\nThe Ideal Candidate:\nA current Environmental Health Scientist License, or the ability and qualification to obtain one.\nPossess extensive knowledge, experience and training of food safety, processing standards, processing equipment, HACCP, product extraction methodologies.\nPossess extensive knowledge and experience of existing federal, state and local regulations pertaining to food, dairy, dietary supplements and industrial hemp.\n\nWhy You Should Join Our Team:\nThis position will offer a unique opportunity, by incorporating food and dairy compliance, science and principles into the emerging industrial hemp sector. The Department of Agriculture provides a variety of professional growth. It is a great place to work when you are involved in the outcomes of what our public consumes. We are family friendly and offer great benefits. To see more about the benefits please click here.\n\nThe Agency:\nIf you would like to read more about working for the Department of Agriculture and Food please click here. The Agency: If you would like to read more about working for the Department of Agriculture and Food please click here.\n\nSupplemental Information\n\nAdequate visual acuity is required.\nBS Degree, or higher, in a related field of study.\nLicensure as a Registered Environmental Health Scientist\nMust be FDA and NEHA certified.\nRisks which require the use of special safety precautions and/or equipment, e.g., working around operating machines, working with contagious diseases or hazardous chemicals, etc.\nValid driver license required to drive a motor vehicle on a highway in this state per UCA53-3-202(1)(a).\nWork requires physical exertion. May require the ability to stand; walk over rough surfaces; bend, crouch, stoop, stretch, reach, lift moderately heavy items (up to 50 lbs.) in a recurring manner and/or for long periods of time.","slug":"food-and-dairy-compliance-officer-06f5a4d1-7033-4cd2-baaf-f8fc72bdc77a","benefits":[],"selectedSkills":["Driver's License","HACCP","Food safety","Bachelor of Science","Bachelor's degree"],"jobType":"free","applyURL":"https://www.governmentjobs.com/careers/utah/jobs/3623486/food-and-dairy-compliance-officer"},{"position":"Laboratory Technician I","labName":"Montrose Environmental Group, Inc.","location":"Richmond, VA","age":"7 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:Competitive compensation packages\n\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Richmond, VA facility is currently seeking a Full-Time Technician I (Toxicology).\n\nA Toxicology Laboratory Technician I is responsible for conducting aerosol exposure studies and analyzing data collected. The ideal candidate will have experience in working under possibly hazardous conditions (e.g. pathogens or chemicals). He/She will be well-trained to maintain safety conditions and will be passionate for doing work that makes things move forward.\n\nHelp conduct aerosol exposure studies for determining potential mutagenic, genotoxic and cytotoxic activity of complex mixtures or experimental test articles from various sources.\nAnalyze data collected in real time data and assess experimental progress\nFollow study protocols and methods based on published scientific articles and technical reports.\nWork with and without supervision to setup up instruments used in aerosol exposure studies and document experimental setups and results.\nOperate, maintain and troubleshoot laboratory equipment and instruments\nConduct laboratory day-to-day duties, such as preparation of laboratory materials and solutions as well as housekeeping and ordering responsibilities\nAssist in data compilation, review and interpretation.\nPrepare summary of findings and observation\nWork in a GLP compliant environment\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Lab Director\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nBS degree in the sciences, engineering, or related field with laboratory experience.\nAerosol knowledge and experience is a plus.\n\nPreferred Skills:\nDetail oriented, reliable, highly motivated, and will interact well in a team environment.\nWorking knowledge of fluid/aerosol flow and pressure.\nGood organizational skills, a high energy level, a sense of commitment to assure that obligations and quality are met\nCapable of handling multiple assignments concurrently\nWorking knowledge of basic computer skills, especially MS Office.\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"laboratory-technician-i-cf29d662-e878-4997-a6a9-f7660b37c59c","benefits":["Disability insurance","Tuition reimbursement","401(k)","Parental leave"],"selectedSkills":["Computer skills","Laboratory experience","Computer literacy","Microsoft Office","Organizational skills","Bachelor of Science","Bachelor's degree"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-VA-Richmond-East-Parham-Rd/Laboratory-Technician-I_R2257?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Environment Laboratory Group Leader - GC","labName":"Montrose Environmental Group, Inc.","location":"Durham, NC","age":"8 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Durham, NC facility is currently seeking a Full-Time Group Leader (GC).\n\nAs a key member of the laboratory team, Group Leaders equip and maintain a well-trained and informed staff to meet the expectations of our clients by efficiently and profitably generating defensible date on time. Our Group Leaders will be an analyst who is responsible for most aspects of an operating team within the lab. Additional duties are:\n\nPersonnel supervision, time management, and operational efficiency\nHiring, firing, and disciplinary actions\nConflict resolution, personnel skills development and team building\nAccurate and timely communication with internal and external clients\nProject scheduling\nAnalyze samples as needed by using various published methods\nDevelopment of analytical methods\nPreparation of data summaries for inclusion in client reports.\nSample and Standard Preparation as needed\nOccasional split shift and/or weekend duties\nInstrument calibration and maintenance\nTroubleshooting and problem solving\nWrite and assist the QAC with updating related SOPs\nMaintain adequate consumables and parts for analyses\nMaintaining organized records of sample preparation and analysis, and equipment maintenance\nCommunicate with client’s questions or concerns\nInitiate and address non-conformance issues\nOverhead projects designed to improve efficiency of, or accuracy of analyses\nComply with Enthalpy’s Quality Assurance Program and other policies\nOther duties as assigned by the Lab Supervisor or Lab Director\nEnsure staff comply with Enthalpy’s Health and Safety Plan\nOther duties and responsibilities as assigned\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nAssociates degree or higher in Chemistry, Biology, Environmental Science, or equivalent\nMinimum of 5 years’ experience required in a Laboratory setting\nInstrumentation operation experience; specifically, Gas Chromatography\nGroup Leaders must be well versed in most of the methods run within their department\nThey must understand the underlying physical or chemical principles that underpin the assays being performed\nThey must have shown the ability to organize, communicate, and facilitate priorities to staff in an effective manner\nThey must be able to handle non-routine samples and be capable of managing an effective workflow in their department (this includes managing man-hours, machine time and logistics for numerous assays)\n\nPreferred Skills\n\nEffectiveness. Positive outcomes & results of communication skills\nConflict resolution skills: Removes/Breakdown organizational communication barriers\nAssertion Skills-Problem diagnosis, assess corrective action, not blame\nAbility to handle multiple tasks simultaneously and maintain composure during\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"environment-laboratory-group-leader-gc-bdf601b4-5b1e-49aa-b611-1a835f56d3cd","benefits":["Disability insurance","Tuition reimbursement","401(k)","Parental leave"],"selectedSkills":["Gas chromatography","Conflict management","Laboratory experience","Assays","Communication skills","Associate's degree"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-NC-Durham-Capitola-Drive/Environment-Laboratory-Group-Leader---GC_R2255?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Extraction Specialist - Albion","labName":"Ataraxia","location":"Albion, IL","age":"6 days ago","salaryMin":"$16 an hour","jobDescriptionCopy":"Ataraxia is a licensed operator of cannabis cultivation and processing facility in Albion, Illinois, and we are looking to add passionate, exceptional talent to our team!\n\nWe are currently hiring for the following shifts:\n1st shift at $16 per hour and increases to $16.50 after 90 days of employment.\n\nAtaraxia offers eligibility to comprehensive benefits to all full-time employees, including heath, dental, and vision insurance. In addition, you are eligible for Paid Time Off, Paid Holidays, and more!\n\nJob Summary:\nThe Extraction Specialist is responsible for performing and supporting the extraction operations of a cultivation and manufacturing facility by adhering to the operation, technical, and quality control policies and guidelines. This individual maintains excellent personal hygiene, workspace cleanliness, documentation practices, and quality control measures to ensure a high-quality product in accordance with the Department of Agriculture and standards set by Company policies.\n\nEssential Duties and Responsibilities:\nPrepare equipment and raw material for extraction while adhering to timeline protocols.\nExecute extractions as well as post-processes in accordance with state and local standards.\nOperate extraction equipment such as rotary evaporators, reactors, filtration equipment, etc.\nEnsure the consistency and efficiency of product through quality control testing and procedures.\nClean and maintain extraction equipment and manufacturing facility.\nMaintain strict inventory records of all raw materials, chemicals, and equipment used.\nDisposal of lab waste in accordance with established guidelines.\nComplete the cleaning and sanitization of all production equipment, work surfaces, and tools.\nMaintain material safety data sheets for all chemicals and products.\nFollow laboratory safety protocols.\nPerform other duties as assigned by management.\n\nMinimum Qualifications:\nPrevious experience in a regulated field that adheres to health and safety policies and procedures required.\nMust be able to operate and maintain equipment in a safe manner.\nMust be comfortable with heights, soil and water, and tight spaces.\nMust be able to climb, squat, bend, twist, stand for at least 8 hours per day, and lift up to 50 pounds.\nMust be able to understand proper and safe handling of hazardous materials.\nMust be familiar with extractions, separations, isolations, and fractionation.\nMust be able to perform other duties as assigned.\nMust be authorized to work in the United States.\nMust be 21 years of age or older.\nMust be able to successfully register with the state's cannabis commission as an agent.\nMust be able to comply with all laws, regulations, and policies associated with the industry.\n\nPreferred Qualifications:\nAssociate or Bachelor's degree in a science discipline preferred.\nAdditional education or experience working in a laboratory setting preferred.\nBasic knowledge of plant structure preferred.\n\nPhysical and Mental Demands:\nWhile performing the duties of this job, the employee is frequently required to remain in a stationary position, move and/or position oneself, communicate, operate and/or prepare, place, position objects, tools, or controls. The employee must occasionally move packages weighing up to 50 lb. Specific vision abilities required by this job include close observation and the ability to adjust focus. The mental and physical requirements described here are representative of those that must be met by an individual, with or without reasonable accommodation, to successfully perform the essential functions of this position.\n\nWorking Environment:\nWork is performed in a warehouse environment. The employee is occasionally exposed to moving mechanical parts and risk of electrical shock. The noise level in the work environment is usually moderate. The work environment characteristics described here are representative of those an individual encounters while performing the essential functions of this position.\n\nEEO Statement:\nWe are proud to be an equal opportunity employer. We place priority in an environment of inclusion, diversity and social justice and are committed to securing a better, brighter way forward for our employees, our markets and our communities.","slug":"extraction-specialist-albion-faf39a27-bdca-4abb-9425-ca7edabba015","benefits":["Paid time off","Dental insurance","Vision insurance"],"selectedSkills":["Laboratory experience","Bachelor's degree","Associate's degree","21 years or older","US work authorization"],"jobType":"free","applyURL":"https://boards.greenhouse.io/ataraxia/jobs/5210507003?gh_src=ad639e3c3us"},{"position":"Metals - Analyst","labName":"Montrose Environmental Group, Inc.","location":"Orange, CA","age":"19 hours ago","type":"Part-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Orange, CA facility is currently seeking a Full-Time Laboratory Analyst to join our Metals Department.\n\nAs a key member of the laboratory team, this role will be responsible for a full range of activities including:\n\nDaily monitoring of sample scheduling to ensure that samples are analyzed within EPA's and methods’ holding time\nSchedule workload in order to report data within clients expected due dates\nRoutine sample preparation and analysis according to Standard Methods 846 and EPA methods\nPerforms analyst's review of data and QC\nReviews of QA/QC criteria for batch acceptance\nAdheres to Standard Operating Procedures and follow safe work practices\nParticipates in instruments' preventative maintenance and trouble shooting\nParticipates in focus teams to improve efficiency\nBe flexible in work schedule including overtime when needed\nReact to change productively and handle other essential tasks as assigned\nPerforming other duties and responsibilities as prescribed by the Company\nCompliance with Enthalpy's Quality Assurance Program and other policies\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nBachelor's degree in Chemistry, Biology, Environmental Science, or related field\nMinimum 1-2 years of lab experience preferred\nKnowledge of analytical method, analytical instruments, general lab practices and lab safety\nExperience in ICP, ICPMS or IC is a plus\n\nPreferred Skills\n\nAn Analyst I will be able to perform much of their work independently, but needs direction from a Group Leader or more senior analyst to execute most effectively.\nKnowledge of analytical method, analytical instruments, general lab practices and lab safety\nMust be flexible in work schedule (including Saturday) and able to work overtime\nWell organized and have an attention to detail\nAble to multi-task\nAbility to work independently and make sound decisions\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"metals-analyst-ebbe8167-04f5-4d50-a31d-6bf8bad4a381","benefits":["401(k)","Disability insurance","Parental leave","Tuition reimbursement"],"selectedSkills":["Laboratory experience","Bachelor's degree"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-CA-Orange/Metals---Analyst_R2284?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Code Compliance Inspector I/II","labName":"City of Oxnard","location":"Oxnard, CA","age":"6 days ago","type":"Full-time","salaryMin":"$25.72 ","salaryMax":" $38.29 an hour","jobDescriptionCopy":"***This position is open until filled. The first review of applicants will be July 18,2022.***\n\nThe City of Oxnard's Community Development Department is seeking a Code Compliance Inspector I/II with strong technical and customer service skills to be part of the Community Development team. This individual must be comfortable applying technical knowledge while following proper inspection techniques. The ideal candidate will have the ability to inspect and identify code and ordinance violations and determine the most effective method of alleviating violations, and must be able to effectively communicate verbally and in writing. This person is able to investigate and resolve problems diplomatically and calmly, while thriving in a fast-paced environment.\n\nThe ideal candidate will be detail-oriented and able to work with accuracy and careful attention to detail. This position will be responsible for providing code enforcement relating to public health, nuisance abatement, code enforcement activities and related municipal enforcement activities.\n\nUnder direct supervision, Code Compliance Inspector I/II performs the full array of duties assigned to classes in the Code Compliance Inspector series including the investigation of potential violations of state and local public health and safety, and nuisance ordinances, codes and regulations and the enforcement, through mitigation and issuance of citations, of pertinent codes and ordinances; demonstrates a full understanding of all applicable policies, procedures and work methods associated with assigned duties; performs related duties as required.\n\nDISTINGUISHING CHARACTERISTICS:\nThe Code Compliance Inspector I is the entry-level position in the Code Compliance Inspector series. Initially under closer supervision, this class is responsible for the more routine and standardized investigations, inspections and enforcement activities. This classification is distinguished from the next higher classification of Code Compliance Inspector II by the performance of the more routine tasks.\n\nThe Code Compliance Inspector II is the journey level class in the Code Compliance Inspector series responsible for performing the full range of investigations, inspections, and code enforcement of a variety of City ordinances relating to abandoned vehicles, business tax certificates, zoning requirements, nuisances, weed abatement, short term rentals, cannabis, etc. All positions assigned to this class require the ability to work independently, exercising judgment and initiative.\n\nSUPERVISION RECEIVED/EXERCISED:\nGeneral supervision may be provided by higher-level code compliance personnel. Incumbents of this class do not routinely exercise supervision.\n\nWORK SCHEDULE: The normal work week is Monday-Thursday, 8:00am - 6:00pm, and alternating Fridays, 8:00am - 5:00pm. The schedule also includes a monthly rotation of Saturday shifts. This position may be required to be available to work additional hours as needed to respond to workload needs. This position is eligible for overtime pay.\n\nEssential Functions\n\n(include but are not limited to the following)\n\nInvestigates complaints of violations of ordinances, and/or codes relating to full range of investigations, inspections, and enforcement of a variety of City ordinances relating to abandoned vehicles, business tax certificates, zoning requirements, nuisances, weed abatement, short term rentals, cannabis, etc.\nDemonstrates a full understanding of applicable policies, procedures and work methods associated with assigned duties.\nIdentifies abandon, illegally stored or inoperable vehicles and issues abatement citations; issues notice of violation and abatement.\nEnforces temporary use permit, business license (or business tax certificate) and related permit ordinances; inspects pertinent location for violations.\nPrepares, presents and defends infraction citations in court.\nPrepares, presents and defends administrative citations in hearings.\nInvestigates instances of construction without required permits and illegal garage conversions, illegal subletting, violations of conditions of approval, illegal changes in use of property, illegal home occupancy and similar zoning violations.\nAssists in the weed abatement program including periodically inspecting property, issuing abatement notices, and overseeing abatements.\nCommunicates effectively with customers and the general public, verbally and in writing, with excellent customer service skills.\nPrepares a variety of reports, memos, and correspondence; documents and maintains records of code enforcement activities; prepares and executes inspection and abatement warrants.\nMonitors, reviews and issues mooring permits in the inland waterway; inspects and enforces applicable codes pertaining to the inland waterways.\nResponds to questions and concerns from the general public; provides information as is appropriate and resolves complaints.\n\nMinimum Qualifications\n\nThe following are minimal qualifications necessary for entry into the classification:\n\nEducation:\nGraduation from an accredited college with an Associate's degree with major course work in engineering, business or public administration, or a closely related field..\n\nSubstitution:\nAdditional related work experience may be substituted for the Associate's degree on a year for year basis.\nSixty (60) semester units or the equivalent of college level coursework in engineering, business, or public administration may be substituted for the Associate's degree with 30 semester units or the equivalent being comparable to one (1) year of work experience.\n\nExperience:\nCode Compliance Inspector I: One (1) year of recent, paid work experience in general code enforcement and/or building inspection involving significant public contact. Recent related municipal experience is desirable.\n\nCode Compliance Inspector II: Two (2) years of recent, paid work experience in general code enforcement and/or building inspection involving significant public contact at a level comparable to City of Oxnard's classification Code Compliance Inspector I.\n\nLicense, Certification and Other Requirements:\nPossession of, or ability to obtain and maintain, a valid class C California driver's license.\nMust be able to speak and understand English to effectively communicate with fellow employees, customers, and vendors.\nPossession of, or ability to obtain within one (1) year and maintain, a valid PC 832 – Arrest, Search and Seizure course certificate.\nCode Compliance Inspector I: Possession of, or ability to obtain within one (1) year and maintain, a valid Basic Level module certificate issued by the California Association of Code Enforcement Officers (CACEO).\nCode Compliance Inspector II: Possession of, or ability to obtain within one (1) year and maintain, a valid Intermediate Level module certificate issued by the California Association of Code Enforcement Officers (CACEO).\n\nGeneral Information\n\nFor questions, please contact Ashley Costello at ashley.costello@oxnard.org or (805) 200-5445.\n\nThe selected candidate must pass a thorough background investigation.\n\nUNION MEMBERSHIP: Positions in this classification are represented by International Union of Operating Engineers (IUOE).\n\nAPPLICATION PROCESS:\nSubmit NEOGOV/Government Jobs online application.\nComplete and submit responses to the supplemental questions, if required.\nUpload resume, cover letter, proof of degree (transcript), or other requested documents\nYour application may be rejected as incomplete if you do not include the relevant information in the online application and include the information only on the resume. Applications and/or Supplemental Questionnaires that state \"see my resume\" or \"see my personnel file\" are considered incomplete and will not be accepted. Cover letters and/or optional resumes are not accepted in lieu of a completed application.\n\nThe list of qualified candidates established from this recruitment may be used to fill other full-time, part-time, regular, and temporary assignments. There are currently two (2) full-time vacancies in the Community Development Department.\n\nNOTE:\nFor most positions, the City of Oxnard relies on office automation (Microsoft Office) and web-based enabled tools (Google Workplace); therefore candidates must be proficient and comfortable with computer use to perform functions associated with ongoing work.\nRegular and reliable attendance, effective communication skills, and the development of effective working relationships are requirements of all positions.\nCity staff may be required to play an active role in the event of an emergency, which may include changes in responsibilities and working hours.\nEmployees are required to participate in the City's direct deposit plan and are paid on a bi-weekly basis.\nThis position requires a 12-month probationary period.\nPursuant to California Government Code Section 3100, all public employees are required to serve as disaster service workers subject to such disaster service activities as may be assigned to them.\nEQUAL OPPORTUNITY: The City of Oxnard is an Equal Opportunity Employer and welcomes applications from all qualified applicants. We do not discriminate on the basis of race, color, religion, sex, national origin, age, marital status, medical condition, disability, or sexual orientation.\n\nREASONABLE ACCOMMODATION: The City of Oxnard makes reasonable accommodation for the disabled. If you believe you require special arrangements to participate in the testing process, you must inform the Human Resources Department in writing no later than the filing date. Applicants who request such accommodation must document their request with an explanation of the type and extent of accommodation required.\n\nLEGAL REQUIREMENT: On the first day of employment, new employees must provide proof of citizenship or documentation of legal right to work in the United States in compliance with the Immigration Reform and Control Act of 1986, as amended. The City participates in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S. If E-Verify cannot confirm that you are authorized to work, this employer is required to give you written instructions and an opportunity to contact Department of Homeland Security (DHS) or Social Security Administration (SSA) so you can begin to resolve the issue before the employer can take any action against you, including terminating your employment. Employers can only use E-Verify once you have accepted a job offer and completed the Form I-9. For more information on E-Verify, please contact DHS. 888-897-7781 dhs.gov/e-verify\n\nNOTE: The provisions of this bulletin do not constitute an expressed or implied contract. Any provision contained in this bulletin may be modified or revoked without notice.\nRetirement Contributions: New members (as defined by PEPRA), 2% @ 62; \"Classic\" members 2% @ 55. The employee will be required to pay a portion of their annual earnings toward their retirement. The City of Oxnard does not participate in social security. Vacation Time: Full time employees accrue vacation time at a rate of 4.08 - 7.77 hours per pay period based on years of service.Sick Time:Full time employees accrue sick time at a rate of 3.70 hours per pay period.Bilingual Pay: A regular full time employee may receive bilingual pay at the rate of $50.00-$125.00 bi-weekly depending on the level the employee is required to provide bilingual services as determined by the City Manager or designee.Educational Incentive:For positions that do not require a Bachelor's Degree, the City offers an educational incentive award of 2.5% for employees that complete 30 work-related college semester units above the minimum education requirements for the position.Health and Dental: The City contributes $1,543.00 per month toward medical insurance premiums and an additional $66.80 per month for dental insurance premiums. For those employees who waive the medical the City will contribute $1,243.00 per month. Any unused dental premium monies are paid to the employee.Life Insurance: City employees receive Basic Life Coverage and have the option to purchase additional insurance.Deferred Compensation: The City contributes 1% to a deferred compensation program. Tuition Reimbursement: Full-time employees receive reimbursement of educational expenses including the costs of tuition, registration fees, laboratory fees, and books at a rate of 50% for work related coursework up to a maximum of $500 per fiscal year.Holidays: The City observes 12 holidays per year\nSalary\n$25.72 - $38.29 Hourly\nLocation\nCA 93030, CA\nJob Type\nFull Time\nDepartment\nCommunity Development\nJob Number\n13232/13233-CD-2207-AC\nClosing\nContinuous","slug":"code-compliance-inspector-iii-ed3713b6-08a4-48c7-baef-23f07e217d9e","benefits":["Dental insurance","Health insurance","Tuition reimbursement","Paid time off","Life insurance"],"selectedSkills":["Communication skills","Microsoft Office","Writing skills","Customer service","Driver's License","Bachelor's degree","Associate's degree","US work authorization"],"jobType":"free","applyURL":"https://www.governmentjobs.com/careers/cityofoxnard/jobs/3622684/code-compliance-inspector-i-ii"},{"position":"Chemist 2 - Statewide","labName":"State of Washington","location":"Olympia, WA","age":"2 days ago","type":"Full-time","jobDescriptionCopy":"JOB\nWSLCB VisionSafe communities for Washington State.MissionPromote public safety and trust through fair administration, education, and enforcement of liquor, tobacco cannabis and vapor laws.** The hiring authority reserves the right to offer the position at any time during the process. It is to the applicant’s advantage to submit applications as soon as possible.** Who we are: The mission of the Washington State Liquor and Cannabis Board (WSLCB) is to promote public safety and trust through fair administration and enforcement of liquor, cannabis, tobacco, and vapor laws. At the WSLCB we pride ourselves on creating the \"wow\" factor in everything we do. We search for people who demonstrate a strong work ethic, excellence in customer service, partnering and teamwork, and quality performance. We strive to be a great place to work by fostering a safe, open, inclusive and healthy work environment. We want to ensure that our organization is as diverse and inclusive as our great State of Washington. We want to create a culture that fosters excellence in customer service, open and honest communication, transparency and accountability, data driven decisions, and business initiated process improvement.Your opportunity at a glance: This position acts as a liaison between WSLCB and cannabis producers and processors, and other state agencies on non-licensing, financial and enforcement issues. The position acts as a subject matter expert in certain aspects of the cannabis industry and I-502 regulatory structure, acting as a resource on understanding cannabis production and specified compliance requirements under rule, including traceability reporting, medical compliant products, quality assurance testing, package and labeling, record keeping, security requirements, allowable pesticides, soil amendments, fertilizers, other crop production aids, and destruction of waste. The position also acts as the subject matter expert for the reporting system, and conducts data analysis and forensics to assist with research, financial analysis, and enforcement.The position will support ongoing work and partnerships with other state agencies. WSLCB provides a modern work environment and excellent benefits including: Training and career development programs Tuition reimbursement Flexible work schedules Telecommuting opportunities Generous wellness program Onsite exercise facility Active and engaging diversity program Infant at Work program Organization's commitment to your personal health and well-being. Work/life balance Free parking A comprehensive benefits package\n\nEXAMPLE OF DUTIES\nSome of the duties you will perform are: Support the development of laboratory routines and procedures for handling of high-volume testing under standards-maintenance programs; investigates erratic findings through lab results in traceability data, certificates of analysis, and on-site lab follow up if needed; coordinates between WSLCB departments regarding lab data and subsequent action needed. Provides counsel and advice on rule, policy and enforcement actions founded in firsthand knowledge and expertise on lab accreditation. Maintaining expert level knowledge of the cannabis industry and compliance requirements under rule for such things as traceability reporting, quality assurance testing, packaging and labeling, record keeping, cannabis production and processing methods, medical compliant products, security requirements, allowable pesticides, soil amendments, destruction of waste, commercial kitchens requirements, high risk products, allowable hydrocarbons and other solvents, professional grade closed looped extraction systems, and point of sale system.Subject matter expert on understanding cannabis processing and specified compliance requirements under rule. You will continue ongoing work with Washington Department of Agriculture (WSDA), Department of Health (DOH), and Department of Ecology (ECY) on applicable areas above.The position is a subject matter expert on all traceability reporting requirements and conducts analysis for the large amount of data summited in the traceability system in support of enforcement, licensing and finance operations. The position involves writing briefs and disseminating findings in regard to regulatory and data analysis.Respond to questions and provide training on the use of the traceability system. Develop training curriculum, educational documents, and deliver presentations to cannabis producers, processors, and retailers on the seed-to-sale system, extraction methods, and other general requirements. Collect, analyze, and report information for large amounts of data regarding cannabis laboratory results from the WSLCB Traceability system.Research, analyze, evaluate and correlate information in order to determine source reliability, content validity and potential truthfulness, to develop leads and links; and to distinguish patterns and trends.Creates, manages and maintains computer databases, spreadsheets, and graphical displays using software. Travel, general administrative duties; other duties as assigned.\n\nMINIMUM QUALIFICATIONS\nREQUIRED QUALIFICATIONS: A Bachelor's degree with a major in chemistry.ORA Bachelor's degree with a minimum of 30 semester hours or 45 quarter hours of college level chemistry AND two (2) years of experience performing chemical analysis in an analytical laboratory which includes experience operating and performing operational calibrations on electronic analytical instruments for identification and measurement of chemical components and radiation such as gas chromatographs, infrared spectrophotometers, polariscopes, and radiation analyzers, for which standards and techniques have been recorded in chemical journals, manufacturers guides, and other chemical analytical literature, employs known methods of sample preparation for measurement of micro quantities.OROne (1) year of experience as a Chemist 1.NOTE: A Master's degree will substitute for two years of the required experience provided a Bachelor's degree and the required college-level chemistry has been achieved.Advanced skills and demonstrated experience in data analysis. Experience working with databases, including writing queries.Advanced skills in Excel, including the ability to summarize and create charts and reports from data.Proficient to Intermediate skills in Microsoft Office Suite Software usage, including word, excel, PowerPoint and use of relational databases.REQUIRED ABILITIES: Ability to write clear and concise brief summaries and reports for executive leaders. Ability to deliver exceptional customer service to internal and external customers.Ability to apply concepts such as fractions, percentages, ratios and proportions.Ability to comprehend and follow complex written or oral directions/instructions.Ability to define problems, collect data, establish facts and draw valid conclusions.Ability to handle and maintain the integrity and confidentiality of highly sensitive material and information.Ability to interpret a variety of instructions and deal with several abstract and concrete variables.Ability to work with mathematical concepts such as probability and statistical inference. Techniques required to produce technical reports in an appropriate format, link charts, association matrices, and other specialized reports and graphic presentations.Ability to analyze and interpret complex data and present results in a manner that is appropriate to your audience.Ability to read, understand, interpret, and explain a wide range of complex documents, policies, rules and law relating to the cannabis industry and regulatory system.Ability to work both independently and in a team environment.Willingness and ability to remain current on job specific procedures through various sources, training courses, and organizational meetings to keep abreast of current changes and event relating to the cannabis industry.SPECIAL REQUIREMENT: Willingness to enter cannabis production, processing, retail, and testing facilities by themselves. DESIRED QUALLIFICATIONS: Master’s degree or PHD in Chemistry and direct experience with lab accreditation. Two (2) or more years of experience conducting research and analyzing policies, laws, rules, or regulations or comparable combination of graduate education and experience.Two (2) or more years of data analysis experience, including but not limited to: descriptive and inferential statistical analysis, modeling, data forensics, and forecasting. Two (2) or more years of experience conducting research and analyzing policies, laws, rules, or regulations or comparable combination of graduate education and experience.\n\nSUPPLEMENTAL INFORMATION\nHOW TO APPLYPLEASE READ THE FOLLOWING INFORMATION CAREFULLY TO ENSURE YOU HAVE SUBMITTED THE REQUIRED MATERIALS TO BE CONSIDERED.IMPORTANT: To be considered for this position, you MUST include the following, failure to do so will result in your application being disqualified: Completed online application.Current Resume.Letter of Interest describing how you meet the specific qualifications for the position.Three professional references to include a current or recent supervisor with email addresses and phone numbers.Unofficial transcript showing the 30 semester hours or 45 quarter hours of college level Chemistry.**A resume will not substitute for completing the \"work experience\" section of the application.The information provided in your application and supplemental questionnaire must support your selected answers in the supplemental questions. Responses not supported in your application will disqualify you for consideration of employment from this recruitment.Prior to a new hire, a background check including criminal record history will be conducted. Information from the background check will not necessarily preclude employment but will be considered in determining the applicant's suitability and competence to perform in the position.COVID-19 VACCINATIONPer Governor Inslee’s Proclamation 21-14, state employees must be fully vaccinated against Covid-19. Please note medical or religious accommodation may be available, once an offer of employment is made. Special note that any offer of employment is contingent upon you providing verification of your vaccine status. No start date will be approved until you verify your status. To further ensure public safety and in conjunction with our Governor's proclamation of stay home, stay healthy and current guidelines related to COVID-19, interviews at this time will be conducted by video or phone conference as part of our recruitment process.OtherApplicants for employment with the Washington State Liquor and Cannabis Board should also be aware of RCW 66.08.080, which states in part: \"No employee of the board shall have any interest, directly or indirectly, in the manufacture of liquor sold under this title, or derive any profit or remuneration from the sale of liquor, other than the salary or wages payable to him in respect of his office or position, and shall receive no gratuity from any person in connection with such business.RCW 69.50.351, no member of the state liquor and cannabis board and no employee of the state liquor and cannabis board shall have any interest, directly or indirectly, in the producing, processing, or sale of cannabis, useable cannabis, or cannabis-infused products, or derive any profit or remuneration from the sale of cannabis, useable cannabis, or cannabis-infused products other than the salary or wages payable to him or her in respect of his or her office or position, and shall receive no gratuity from any person in connection with the business.The Washington State Liquor and Cannabis Board is an equal opportunity employer and encourages applications from job seekers with diverse backgrounds. Honoring diversity, equity and inclusion means that as an agency, and as individuals, we are committed to ensuring that all employees enjoy a respectful, safe, and supportive working environment. All qualified applicants will receive consideration for employment without discrimination based on sex, race, creed, religion, color, national origin, age, honorably discharged veteran or military status, sexual orientation including gender expression or identity, the presence of any sensory, mental, or physical disability, or the use of a trained dog guide or service animal by a person with a disability. You are welcome to include your name and gender pronouns in your application, to ensure we address you appropriately throughout the application process.For questions about this recruitment, or to request reasonable accommodation in the application process, please email hrjobs@lcb.wa.gov or call (360) 664.1674. For TTY service, please call the Washington Relay Service at 7-1-1 or 1-800-833-6384.","slug":"chemist-2-statewide-124a8ad3-b8aa-4065-a596-f11c2b086af2","benefits":["Wellness program","Flexible schedule","Free parking","Tuition reimbursement"],"selectedSkills":["Relational databases","Microsoft Excel","Microsoft Powerpoint","Laboratory experience","Data analysis skills","Bachelor's degree","Doctoral degree","Master's degree","Doctor of Philosophy","Background check"],"jobType":"free","applyURL":"https://www.governmentjobs.com/jobs/3578497/chemist-2-statewide?utm_source=Indeed&utm_medium=organic&utm_campaign=Indeed"},{"position":"TELESALES EXECUTIVE for DEA Licensed Cannabis and Hemp Testing Laboratory","labName":"PharmLabs LLC","location":"San Diego, CA","age":"1 day ago","type":"Part-time","salaryMin":"$19 ","salaryMax":" $22 an hour","jobDescriptionCopy":"Founded in 2011, PharmLabs has become the world's premier ISO/IEC 17025 certified, DEA licensed, CA DCC licensed, USDA & CDFA licensed cannabis and hemp testing laboratory. We provide the hemp, cannabis and new exotic cannabinoid industries across the world with chemical and biological analytical laboratory testing services to ensure the highest of quality, safe and compliant products.\n\n\nWe have current openings for self-motivated, reliable, and experienced individual to assist us with GENERATING NEW SALES. 80% of the time this is a cold-calling situation, in which the incumbent is making first contact via phone with the potential buyer through a verified leads list. The incumbent must manage leads lists, field questions from prospective buyers and collect order data to close sales. The incumbent must be able to handle rejection and hang-ups from leads. This is an incredible opportunity to enter into the world fastest growing industries and to work with one of the most trusted scientific laboratories in the business.\n\n\nPreferred but not required is a candidate that has the following skills/background:\n\n\n1) Extensive experience cold-calling\n\n\n2) Able to follow a script/sales plan\n\n\n3) Able to follow directions\n\n\n4) Any experience with the hemp and cannabis industry\n\n\n5) Any experience in cannabinoid extractions and synthesis of new compounds such as D8, HHC, THC-O, THC-P.\n\n\n6) Any knowledge of chemical and/or biological science\n\n\n7) Any knowledge of chromatography (GC, LC, ICP, Mass Spectrometry)\n\n\nPOSITION SUMMARY:\n\n\nThe incumbent will be responsible for selling laboratory testing services such as pesticide, heavy metal, residual solvent and cannabinoid potency testing to other businesses such as extractors, cultivators, manufactures and distributors that specialize in cannabis and/or CBD/hemp industries. The incumbent will work at the laboratory and/or home.\n\n\nESSENTIAL DUTIES AND RESPONSIBILITIES:\n\n\nCold calling\nLearning the lab services\nLearning the benefits, values and differentiators of our services in our industry\nGenerating new leads\nUsing CRM software Hubspot to track all activity\nIncreasing overall sales while meeting obtainable sales goals.\n\nREQUIREMENTS:\n\n\n-Must be 21+ years of age\n\n\n-Strong communication skills\n\n\n-Adaptability and flexibility\n\n\n-Attention to detail\n\n\n-Strong work ethic\n\n\nJob Type: Part-time\n\n\nPay: $19.00 - $22.00 per hour\n\n\nBenefits:\n\n\nPaid time off\n\nSchedule:\n\n\nDay shift\nMonday to Friday\nNo nights\nNo weekends\n\nSupplemental Pay:\n\n\nBonus pay\nCommission pay","slug":"telesales-executive-for-dea-licensed-cannabis-and-hemp-testing-laboratory-40f1168e-7430-4ce8-83bd-03aa66b6a0de","benefits":["Paid time off"],"selectedSkills":["Gas chromatography","Communication skills","Cold calling","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&job=2EZgfhPu-V5X8LrYS1l-5dzD_LuNKYVxGQI2jp8jWh-MS1ObE59DiA"},{"position":"Microbiologist","labName":"Kaycha Labs","location":"Davie, FL","age":"5 days ago","type":"Full-time","salaryMin":"$38,000 ","salaryMax":" $53,000 a year","jobDescriptionCopy":"Job description:\n\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\n\nJob Purpose:\n\n\nThe Microbiologist will be responsible for performing, documenting, record checking, and troubleshooting qualitative and quantitative assays on samples using techniques that vary from the use of standard laboratory equipment to highly modern and automated instrumentation.\n\n\nEssential Duties & Responsibilities:\n\n\nAnalyze samples consisting of a variety of matrices and cross trained on various laboratory technologies including, but not limited to, bacterial and fungal plating and PCR.\nTrain incoming analysts and technicians on methodology.\nResponsible for troubleshooting instrumentation to ensure data integrity\nPrepare samples for analysis while displaying good laboratory technique to avoid cross contamination or misidentified samples.\nAccurately prepare quality control samples.\nInterpret and evaluate data in terms of accuracy, precision, trends, and quality control requirements.\nProvide scientific interpretation of results to supervisor, management, or customers as requested.\nMaintain a sterile work environment and undergo cleaning procedures as necessary, to ensure ongoing proper workflow. Report contamination issues to supervisor.\nPrioritize samples and provide guidance and support to the sample prep team for assigned analysis.\nPerform method validations, or verifications with minimal supervision as needed.\nTrack inventory of supplies and reagents to ensure no interruption of work-flow\nOversee root cause analysis for quality assurance.\nAssist in SOP edits as needed for assigned testing analysis and alert management when there is a change in procedure\nMay be able to perform method development to respond to changing client needs or regulations\nResearch new technologies and methodologies to improve laboratory processes and techniques and make recommendations to supervisors.\nOther duties and special projects as assigned.\n\nSkills, Abilities and Competencies:\n\n\nStrong understanding of standard laboratory protocol.\nMaintain high productivity, keen attention to detail, and consistent multi-tasking while yielding a low testing error rate.\nStrong agility, engagement, and flexibility in an ever-changing environment.\nDiligent commitment to logging, organizing, and analyzing data.\nExcellent communication skills and ability to effectively work, problem solve, and communicate with multiple levels of the organization.\nPromote a strong customer service culture while adhering to the highest safety and industry standards, including those that are outlined by the state regulatory body.\n\nEducation & Experience:\n\n\nMinimum BS/BA in Biology, Chemistry, Physics, Engineering or Environmental Sciences required.\nKnowledge of principles, terminology, practices, techniques, and instrumentation commonly used in a laboratory setting required.\nAt least 2 years of microbiology experience is preferred.\nFood science and/or environmental experience is a plus.\nExposure to the cannabis industry is a plus.\n\nOther:\n\n\nMust pass the required background check.\nMust be at least 21 years old.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision, 401k plan with company match and PTO.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.\n\nThe above is intended to describe the general content of and requirements for the performance of this job. It is not to be construed as an exhaustive statement of duties, responsibilities, or physical requirements.\n\n\nJob Type: Full-time\n\n\nCOVID-19 considerations:\nMask mandate for all employees and visitors.\n\n\nWork Remotely\n\n\nNo\n\nJob Type: Full-time\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nFlexible schedule\nFlexible spending account\nHealth insurance\nLife insurance\nPaid time off\nReferral program\nVision insurance\n\nSchedule:\n\n\n10 hour shift\n8 hour shift\nDay shift\nMonday to Friday\nNight shift\nWeekend availability\n\nApplication Question(s):\n\n\nWhat is your desired compensation?\nBest phone number and email to reach you at?\n\nEducation:\n\n\nBachelor's (Preferred)\n\nExperience:\n\n\nMicrobiology: 1 year (Preferred)\n\nWork Location: One location\n","slug":"microbiologist-29340192-80e7-4d09-a7cf-e32dcc6eb4ed","benefits":["Dental insurance","Health insurance","Flexible schedule","Referral program","401(k)"],"selectedSkills":["Communication skills","Microbiology","Root cause analysis","Bachelor of Science","Bachelor's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=x8KZL309-H567ZjRow_99m2o-493SlwgJMbzMKEvPHo2serAyakH1g"},{"position":"Laboratory Manager","labName":"Nova Analytic Labs","location":"Portland, ME","age":"3 days ago","salaryMin":"$85,000 a year","jobDescriptionCopy":"The statements below reflect the general responsibilities and requirements for the position, but may not describe all the work requirements inherent in the job. It is the responsibility of the employee to comply with Good Laboratory Practices, ISO/IEC 17025 and other state mandated certifications.\n\nNova Analytic Labs is seeking a highly motivated and qualified scientist to join our cannabis testing laboratory startup, located in Portland, ME.\n\nThe testing Nova Analytic Labs will perform is critical to the health and safety of recreational and medicinal cannabis and hemp products. Nova Analytic Labs will provide the highest quality and safety in testing to the community by combining advanced technology and innovative scientific methods.\n\nWe are particularly interested in individuals with well-rounded capabilities and an eager appetite to grow and build a successful enterprise. The ideal candidate will possess sound scientific knowledge, management skills, and an eye for continuous improvement. Flexibility and dedication are a must.\n\nThe Lab Manager supervises and coordinates activities and workers engaged in tasks associated with all aspects of the laboratory. Also works in the laboratory to assist in requisitioning, sample prep, data analysis, reporting and customer service.\n\nDuties and Responsibilities\nResponsible for providing day to day supervision over all aspects of the laboratory\n\nManages all lab and administrative staff\n\nAccessible to testing personnel at all times\n\nProvides orientation, training and performance feedback for staff\n\nSets standards, policies and guidelines to meet certification standards and efficient management of laboratory\n\nEnsures resolution of errors before results are released to clients or quickly thereafter\n\nEnsures staff, equipment and records are always in compliance with SOPs\n\nPerforms supervisory duties such as but not limited to interviewing, hiring, training, intervention, discipline and termination of staff\n\nContinuously seeks out new and better ideas, driving best practices\n\nEnsure samples are received, extracted and resulted in a manner that is compliant with SOPs\n\nPerforms any duties delegated by the Lab Director and/or Management\n\nResponsible for maintaining client relations\n\nEnsure turnaround time for samples is always 48 hours\n\nEnsures results are accurate and workflow is properly followed\n\nRequirements\nCannabis laboratory management experience\nBachelor of Science in a science related degree (Masters or PhD preferred)\n\n5+ years of combined experience in a high complexity laboratory, environmental laboratory, cannabis laboratory or food testing laboratory and at least two years in management role\n\nExperience with LC/MS, GC/MS and ICP/MS\n\nBenefits\nMedical\n\nDental\n\nVision\n\nPTO\n\n4 year science degree","slug":"laboratory-manager-9a842dff-97d1-4549-be3b-e50159200dc6","benefits":["Dental insurance","Health insurance","Paid time off","Vision insurance"],"selectedSkills":["Gas chromatography","Laboratory experience","Continuous improvement","Laboratory management","Management","Doctoral degree","Bachelor of Science","Bachelor's degree","Master's degree","Doctor of Philosophy"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=tpTrfKmAgjTreCdhfAFuxsJNhA2VvUIyufsDOEMM6fAlFZuwmNGPTg"},{"position":"Analytical Chemist","labName":"Apollo Labs","location":"Scottsdale, AZ","age":"22 hours ago","type":"Full-time","salaryMin":"$45,000 ","salaryMax":" $55,000 a year","jobDescriptionCopy":"Please only apply if you meet the education requirements as we will not respond to any candidates who do not meet the criteria.\n\n\nThis position is for the role of Analytical Chemist at Apollo Labs, the fastest-growing cannabis safety- and potency-analysis laboratory in Arizona.\n\n\nAt Apollo, we are looking for individuals with experience in highly regulated industries with a strong focus on quality, cleanliness, and professionalism. We prioritize data quality and integrity – curious, eager, and ethical chemists are crucial to achieving those goals. Above all, we want to do good science that will build respect and trust for the cannabis industry. Priority is given to individuals with a pharmaceutical-industry, semiconductor-industry, or cGMP-regulated background. Cannabis industry experience is not required.\n\n\nInstrumentation experience and role for analytical chemists is as follows:\n\n\nFirst priority will be given to individuals with experience in Agilent ICP/MS, Agilent GC-MS and MS/MS, Agilent LC-MS/MS (LC triple quadrupole, LC-QTOF, or equivalent) and Agilent UHPLC-diode array\nChemists will take an active role in troubleshooting and preventive maintenance on these systems\nParticipate in a wide variety of analyses, to include: analysis of 55+ different pesticides in a variety of challenging matrices, 28+ residual solvents, 12+ cannabinoids, ultra-trace mycotoxins, heavy metals testing, and testing for a variety of microbial contaminants by traditional plate counting and qPCR\nCarefully document all steps of customer sample processing, and provide assistance to other chemists when requested\nFully review analytical data and perform regular deep-dives into data to assess instrument health.\nTake an active role in method improvement and method development\n\nAdditional job requirements:\n\n\nIdentifies opportunities for improvement; works with Department Head to implement new and improved methods and processes\n\n· Chemists will work with their respective Managers to ensure lab efficiencies for prioritization, workflow, and sample preparation, as well as the loading and running of instruments\n\n\nAssists with the upkeep and improvement of the quality management system to include Standard Operating Procedures (SOP’s) and the employee training programs\nPrepares calibrations and verifies quality controls for laboratory instruments and methods; uses data to recognize and/or correct possible processing or instrument errors. Chemists may be asked to assist in sample preparation and operation of a variety of instrumentation platforms and methods\nAcquires and analyzes data used to perform and report analytical laboratory testing of cannabis products\nImports data into LIMS system and into a Seed-to-Sale tracking system; provides for the documentation and tracking of analytical standards, certificates of analysis for chemicals and disposable tools, and daily logging of performance checks for laboratory balances, refrigerators/freezers, incubators, and any other ISO-regulated equipment\nPrepares reports related to cannabinoid potency, terpene potency, residual solvents, heavy metals, pesticides, microbiologic organisms, moisture content and mycotoxins\nSubmits data reports and Certificates of Analysis for Department Head approval \nProvides guidance and support for all duties commonly assigned to Field Samplers and Lab Technicians\nAssist in inkate and accessioning of samples\nMay also be called upon to perform the same or similar duties at other laboratory facilities, and for other job-related duties as assigned\n\nTraining is provided for all methods, and chemists are given the opportunity to cross train onto any platform and participate in R&D work. Eagerness to learn, a positive attitude, and self-motivation are highly valued attributes. New graduates are invited to apply if they are able to demonstrate knowledge and experience on LC/MS or GC/MS instrument platforms.\n\n\nJob Types: Full-time\n\n\nPay: Up to $55,000 per year\n\n\nBenefits:\n\n\nDental and Vision\nHealth insurance\nPaid time off\n\nSchedule:\n\n\n8 hour shift, 5 work days per week\n2nd shift\n\nApplication Question(s):\n\n\nWork Location: Scottsdale, AZ\n\n\nJob Type: Full-time\n\n\nPay: $45,000.00 - $55,000.00 per year\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nEvening shift\nMonday to Friday\nWeekend availability\n\nWork Location: One location\n","slug":"analytical-chemist-5600665a-a79b-4a22-a57b-b542bd1d2465","benefits":["Dental insurance","Health insurance","Paid time off","401(k)","Vision insurance"],"selectedSkills":["Gas chromatography"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=QV2Q0mzblrjg2KOE0Dktf6C7snOpT3oSmBxyZ4i1bNR_X2UZRQGjKw"},{"position":"Traveling Production Technician","labName":"Vertosa","location":"Berkeley, CA","age":"1 day ago","type":"Full-time","salaryMin":"$51,000 ","salaryMax":" $66,000 a year","jobDescriptionCopy":"Vertosa creates industry-leading active ingredients for infused product makers. Our patent-pending formulations are carefully designed for the specific needs of each of our customers. Our pre-suspended aqueous solutions empower our partners to create incredibly homogeneous and stable products while maximizing bioavailability, clarity, and taste. Our team believes that natural ingredients and science can work in concert to create better alternatives for recreational and medical applications Our knowledge and experience, best-in-class products, white-glove service, and relentless drive for excellence offers our customers the quality, consistency, and reliability they seek in a product. We are looking for a professional who has a growth mindset and is looking to join a growing team!\n\n\nJob Brief\n\n\nOur food-grade manufacturing facilities in the United States and Canada need a full-time Traveling Production Technician to operate under the supervision of our Lab Manager and Director of Manufacturing. The successful candidate will spend a significant portion of their time traveling to our partner’s remote manufacturing facilities and will be responsible for producing our core menu products, testing ingredients and finished products to ensure correct composition, and identifying any health or quality control issues that need to be corrected. He or she will also participate in the R&D aspects of the job, including sample preparation, product testing, and new process trials. We’re looking for a professional with experience in detail oriented production and or laboratory work using complex equipment and strict adherence to SOPs.\n\n\nResponsibilities\n\n\nPerform basic chemical research, which includes designing and testing different formulations in the lab as well as on-site when necessary\nPerform quality control tests on ingredients, completed products and product samples\nPrepare samples prior to shipping them to customers\nAnalyze retrieved data and prepare reports for laboratory management\nFollow all company policies and procedures to ensure product integrity and quality control\nAssist with testing and calibrating lab equipment in preparation for specific tasks\nRecognize and report any food safety issues\n\nRequirements\n\n\nThis position requires frequent travel to our remote manufacturing facilities located throughout the continental US and Canada, sometimes on short notice, as business conditions demand. Traveling up to 3 weeks at a time to continental US and Canada is expected (candidate will be remote roughly 50-60% of the time). You must maintain a valid passport and maintain eligibility to travel on domestic flights as well as to Canada. Must maintain a valid driver's license and be eligible to drive and rent cars as needed.\nBachelor’s degree required, preferred in general chemistry or chemical engineering.\n5+ years’ general laboratory experience required, experience in food manufacturing is preferred.\nUnderstand the principle of Design Of Experiment (DOE) and be able to execute experiments based on plan.\nUnderstand basic analytical chemistry terms and be able to use basic chemistry analytical tools.\nBe able to present data in a clear fashion.\nCan follow instructions and perform stepwise chemistry experiments, prefer to have scale-up production experience ( >300g batch).\nCapable of prioritizing tasks to meet goals and ensure product quality.\nWilling to meet on-call obligations as needed.\nMust be detail oriented and have the ability to communicate effectively.\nMust possess excellent problem solving and logical thinking skills.\nMust be a passionate champion for cannabis. Vertosa does not require cannabis consumption for any employees.\n\nJob Type: Full-time\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nEmployee assistance program\nFlexible spending account\nHealth insurance\nPaid time off\nParental leave\n\nEducation:\n\n\nBachelor's (Preferred)\n\nExperience:\n\n\ngeneral laboratory: 3 years (Required)\n\nWillingness to travel:\n\n\n50% (Required)\n\nWork Location: Multiple Locations\n","slug":"traveling-production-technician-2c471bfb-5897-4165-bb98-4bb23c3dbc63","benefits":["Dental insurance","Health insurance","Employee assistance program","Paid time off","401(k)"],"selectedSkills":["Manufacturing","Driver's License","Laboratory experience","Bachelor's degree","US work authorization","Passport"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=kAD4X8YzVCfJ-lFRBxaa6htoQT96txSFDA-K-XoiehD1hn3FQCOFdQ"},{"position":"Senior Laboratory Technician","labName":"Local Roots","location":"Framingham, MA","age":"2 hours ago","type":"Full-time","salaryMin":"$50,000 ","salaryMax":" $60,000 a year","jobDescriptionCopy":"ABOUT THE COMPANY:\n\n\nLocal Roots is a Massachusetts-based cannabis company created by cannabis advocates and experienced, craft cannabis professionals. At Local Roots, we strive to provide top-quality cannabis products using sustainable, earth-friendly methods with your happiness and wellness in mind.\n\n\nJOB SUMMARY:\n\n\nThe Senior Laboratory Technician will be responsible for assisting in product processing and formulation as it relates to CO2 Extraction and Ice Water Hashing. Tasks are assigned by the Laboratory Director to monitor and maintain the organization, cleanliness and efficiency of production areas. This position is responsible for assisting with lab production, which includes but is not limited to distillation, extraction, winterization, production of cannabis infused products, compliance requirements, sample preparation for testing, finished product packaging and workplace safety.\n\n\nFamiliarity with basic scientific principles and laboratory experience. Must be able to follow written SOPs and maintain a laboratory notebook.\nMust follow all applicable policies, procedures and guidelines. This includes the safe and proper operation of any/all applicable machinery, instrumentation, and equipment.\nOperate laboratory instruments, make observations, calculate and record results.\nWork as part of a team to meet production schedules.\nFollow SOPs to meet Good Laboratory Practices and Good Manufacturing Practices compliance.\nMaintain stock of disposables needed for extraction, post-extraction processing, and packaging.\nWork directly with Laboratory Director to refine or author new SOPs as new processes and new products are being developed.\nUnderstand and meet monthly and quarterly production goals.\nManage and delegate tasks to the Junior Laboratory technicians.\n\nREQUIRED SKILLS:\n\n\nGood communication skills, verbal and written, with co-workers and management.\nPractice good housekeeping habits throughout the facility with focus and personal contributions towards a clean and organized assigned work area at the end of the assigned shift.\nCapable of working with hazardous chemicals and is able to identify and report unsafe equipment, conditions and practices so that they may be corrected prior to an incident.\nFlexibility and the ability to shift work schedules according to production needs.\nMust pass any and all required pre-employment screenings.\nMust be and remain compliant with all legal or company regulations for working in the industry.\nMust be a minimum of 21 years of age.\nMust be approved to receive an Agent badge.\nWhile performing the duties of this job, the employee is regularly required to perform grasping, talking, hearing, seeing and repetitive motions.\nPhysical demands – May be required to stand and/or walk for extended periods of time. Must be able to lift, carry and balance up to 50 pounds (200 pounds with assistance)\n\nDESIRED SKILLS:\n\n\nAssociate or 4-year degree preferred, with relevant college courses in biology, chemistry, or physics .\nPrior Laboratory experience.\nPrior Cannabis Lab / Manufacturing experience\n\nBENEFITS:\n\n\nLife Insurance, Vision, Dental, sick time, and vacation time\n\n\nEQUAL OPPORTUNITY EMPLOYER:\n\n\nLocal Roots is an equal opportunity employer and we welcome applications from all backgrounds regardless of race, color, religion, sex, ancestry, age, marital status, sexual orientation, gender identity, disability or any other classification protected by law.\n\n\nJob Type: Full-time\n\n\nPay: $50,000.00 - $60,000.00 per year\n\n\nBenefits:\n\n\nDental insurance\nEmployee assistance program\nEmployee discount\nHealth insurance\nLife insurance\nPaid time off\nParental leave\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\n\nAbility to commute/relocate:\n\n\nFramingham, MA 01702: Reliably commute or planning to relocate before starting work (Required)\n\nWork Location: One location\n","slug":"senior-laboratory-technician-3b3f6187-7424-47c8-a061-5c5f43768bc3","benefits":["Dental insurance","Employee discount","Health insurance","Employee assistance program","Paid time off"],"selectedSkills":["Manufacturing","Laboratory experience","Communication skills","Bachelor's degree","Associate's degree","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=tlbgDnj9z6zAQauP4xsCJbyqVwRdxO6Vmuu6BRjNfhe9cYoGeYqiWw"},{"position":"Scientist","labName":"ChRi Laboratories, Inc","location":"Saint Paul, MN","age":"1 day ago","type":"Full-time","salaryMin":"$65,000 ","salaryMax":" $77,000 a year","jobDescriptionCopy":"Analytical Chemist Job Description for a GMP Laboratory\n\n\nWe are expanding and seeking a qualified team member to join our labs. You will be working with existing scientists, and/or possibly new business opportunities. This is your chance to join a company in an industry that is experiencing growth to include cannabinoid analysis soon.\n\n\nThe candidate for this role should be well-versed in a broad range of analytical testing techniques such as, ICP/MS, GC/MS and LC-MS/MS.\n\n\nDuties will include.\n\n\nMethod Development, Validation, and Compendia Method Qualification.\nAnalysis of samples using ICP/MS, GC/MS/FID with headspace sampling, and HPLC/GPC.\nMay develop and validate methods for cannabis contaminant tests: solvents and pesticides\nMay develop and validate methods for THC potency tests by HPLC\nFTIR-ATR, FTIR-KBR, UV-VIS, and other Compendia Tests.\nBenchtop enzymatic digestion and detection assays.\nSample preparation, sample handling, GMP documentation and reporting.\nAssist Lab Scientists in optimization of chemical assays and general workflow improvements\nTroubleshooting instrumentation\nTechnical and Content Data Review of processed GMP data packages.\n\nPreferred Experience and Qualifications:\n\n\nWorking in Pharmaceutical/Biopharmaceuticals, GMP, or ISO accredited environment\nFamiliarity with Cannabis and Cannabis products is preferred but not required.\nStrong report writing and GMP technical data review skills.\nGood communication and interpersonal skills\nPositive attitude\nNecessary experience to operate some or all instruments.\n\nWork Location:\n\n\nOne location\nHours are between 8:00 am and 5:00 pm M-F\nQualifications:\n\nMinimum of bachelor’s degree in Chemistry, Biochemistry, or closely related field.\n\n\n3+ years of experience as a Chemist, Biochemist, or Scientist in a regulated pharmaceutical field (USP).\nGood understanding of FDA Chemistry, Manufacturing and Controls.\nSkills:\nPossess excellent communication skills for liaising with internal departments.\nAbility to coordinate multiple tasks in a fast-paced environment.\nAbility to work independently and under minimal supervision.\nDemonstrate understanding of good analytical techniques.\nExpertise in data interpretation and identification tests.\nAbility to handle fine glassware, sampling devices and perform data entry.\n\nJob Type: Full-time\n\n\nPay: $65,000.00 - $77,000.00 per year\n\n\nBenefits:\n\n\nHealth insurance\nPaid time off\n\nSchedule:\n\n\n8 hour shift\n\nAbility to commute/relocate:\n\n\nSaint Paul, MN 55114: Reliably commute or planning to relocate before starting work (Preferred)\n\nEducation:\n\n\nBachelor's (Preferred)\n\nExperience:\n\n\nCGMP: 2 years (Preferred)\n\nWork Location: One location\n","slug":"scientist-c5aac999-3b5b-42bd-b737-4328a0c32b60","benefits":["Health insurance","Paid time off"],"selectedSkills":["CGMP","FDA regulations","Communication skills","Report writing","Bachelor's degree","US work authorization"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=53oOjqebgWTUE3t6AFw0-e-9LKWePppm52RtP2b-DxF9aXXl7kz3RA"},{"position":"General Manager - Testing Lab","labName":"RDP Development","location":"Las Vegas, NV","age":"4 hours ago","type":"Full-time","salaryMin":"$90,000 ","salaryMax":" $115,000 a year","jobDescriptionCopy":"Rapidly growing cannabis testing laboratory located in Nevada is looking to hire a full time general manager to oversee the laboratory operations and employees. Laboratory General Manager will develop safe and effective cannabis-based products by supervising production and implementing standard operating procedures (SOPs). The successful candidate will be able to oversee testing formulated products, generate quality assurance/quality control (QA/QC) reports, oversee general laboratory day to day operations, and assist with marketing, networking, and bringing in new clients to use our testing services.\n\n\nQualifications:\n\n\nBachelor’s degree required (preferred degree in business management, chemistry, engineering, or biology/microbiology)\nPrior sales and management experience of at least 3 year required\nMust be highly organized, have a team player mentality, and be able to multi task\nMust be able to intelligently communicate to lab employees as well as upper management on a daily basis\nPrior laboratory experience a plus but not required\nExperience with analytical testing (HPLC) and microbiology including working in aseptic conditions is a plus\n\nResponsibilities:\n\n\nAdhere to protocols and laboratory SOPs\nOversee and help assist with sales\nProblem-solving skills and troubleshooting of products and equipment\nManage laboratory operations and ensure safety of employees\n\nJob Type: Full-time\n\n\nPay: $90,000.00 - $115,000.00 per year\n\n\nBenefits:\n\n\nHealth insurance\n\nSchedule:\n\n\nMonday to Friday\n\nExperience:\n\n\nmanagement: 5 years (Preferred)\nLaboratory: 4 years (Preferred)\nSOP: 4 years (Preferred)\n\nWork Location: One location\n","slug":"general-manager-testing-lab-aece578a-a4b8-4368-acd2-a37954d2d1ba","benefits":["Health insurance"],"selectedSkills":["Laboratory experience","Management","Sales","High-performance liquid chromatography","Bachelor's degree","US work authorization"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=Tks8wb0doa2pBet8DUIyRhE3QV1vVAamI_C98w28NXUR1FxIA4bhlA"},{"position":"Laboratory Manager","labName":"US Cannalytics","location":"Bethlehem, PA","age":"1 day ago","type":"Full-time","salaryMin":"$60,000 ","salaryMax":" $90,000 a year","jobDescriptionCopy":"Laboratory Manager:\n\n\nUS Cannalytics is a multi-state testing lab with additional locations in MD, NJ, and FL. We are in search of an experienced lab manager that seeks a challenging position leading an independent testing laboratory serving the medical-use cannabis industry in Pennsylvania.\n\n\nThe laboratory manager, working with the laboratory director, will be responsible for all aspects of lab operations. Ensuring the timely delivery of high quality results and unparalleled customer service.\n\n\nOther responsibilities include, but are not limited to:\n\n\nExecuting method optimization\nMaintaining ISO 17025 accreditation\nMaintaining analytical equipment (i.e. HPLC, GC-MSMS, LCMSMS, ICP-MS, qPCR analytical balances, autoclave, centrifuge, biological safety cabinets, fume hoods, etc.)\nSample preparation, sample analysis, and data review\nInventory management\nData entry\nReview of data\nGeneration of Certificate of Analysis\nEnsuring compliance with laboratory policies and procedures, state regulations, and ISO-17025 quality management system\nManaging staff (i.e. assigning duties, creating schedule, performing employee reviews)\n\nMinimum Qualifications:\n\n\nA bachelor’s degree in a biological science and a minimum of 4 years post-degree laboratory experience related to testing of medicinal or pharmaceutical products or other experience as approved by the Department or\nA master’s level degree in a chemical or biological science and a minimum of 2 years post-degree laboratory experience related to testing of medicinal or pharmaceutical products or other experience as approved by the Department or\nA doctorate of science or an equivalent degree in chemistry, biology, or a sub-discipline of chemistry or biology.\nAppropriate experience with HPLC-PDA/UV, HPLC-MS/MS, GC-MS, and/or ICP-MS\n3 years of Managerial experience\nFlexibility to take on new assignments and see them through to completion\n3-years experience using Microsoft Excel\nHighly organized\nMeticulous attention to detail\nAbility to effectively multitask\n\nPreferred Qualifications:\n\n\nExperience with Agilent HPLC, GC, and ICP-MS instrumentation and software\nExperience with AB Sciex HPLC-MS/MS and Analyst/MultiQuant instrumentation and software\nKnowledge of chemical properties/profiles of cannabis and cannabis-specific dosage forms\nExperience working in a regulated system, specifically an ISO 17025 quality management system\n\nCompensation:\n\n\nCompensation will be based on experience and skillset, and structured with incentives for meeting outlined goals.\n\n\nJob Type: Full-time\n\n\nJob Type: Full-time\n\n\nPay: $60,000.00 - $90,000.00 per year\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\nDay shift\nNight shift\nOn call\nWeekend availability\n\nSupplemental Pay:\n\n\nBonus pay\n\nApplication Question(s):\n\n\nHow many years of post-grad GCMS experience do you have?\nHow many years of post-grad ICPMS experience do you have?\nHow many years of post-grad LCMSMS experience do you have?\nHow many years of supervisory experience do you have?\n\nEducation:\n\n\nBachelor's (Preferred)\n\nWork Location: One location\n","slug":"laboratory-manager-afa3133a-deca-4467-951d-00aa3e741f17","benefits":["Dental insurance","Health insurance","Paid time off","Vision insurance"],"selectedSkills":["Gas chromatography","Microsoft Excel","High-performance liquid chromatography","Laboratory experience","Leadership","Doctoral degree","Bachelor's degree","Master's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=IIyiKzYkOEM_uw186jNMfVdD5rQN5P-qvm3t2zRyiEIFGr89eegcQw"},{"position":"Lab Director","labName":"H2 Talent","location":"Portland, ME","age":"18 hours ago","type":"Full-time","jobDescriptionCopy":"Lab Director\n\n\nWe are looking for a scientist to join our cannabis testing laboratory located in Portland, ME. The Lab Manager will be responsible for supervising and coordinating day to day activities. They ensure team engagement is associated with all aspects of the laboratory. The ideal candidate will be flexible, determined, driven, team and detail oriented.\n\n\nResponsibilities:\n\n\nEfficiently manage all lab, administrative staff, and client relations\nProvides orientation, training and performance feedback for staff\nSet standards, policies and guidelines to meet certification standards\nEnsure resolution of errors before results are released to clients or quickly thereafter\nEnsure staff, equipment and records are always in compliance with SOPs\nPerform supervisory duties such as but not limited to interviewing, hiring, training, intervention, discipline and termination of staff\nEnsure samples are received, extracted and resulted in a manner that is compliant with SOPs\n\nRequirements\n\n\nBachelor of Science in a science related degree (Masters or PhD preferred)\n5+ years of combined experience in a high complexity laboratory, environmental laboratory, cannabis laboratory or food testing laboratory\n2+ years of experience in a management role\nExperience with LC/MS, GC/MS and ICP/MS\nExpertise in Good Laboratory Practices, ISO/IEC 17025 and other state mandated certifications.\n\nJob Type: Full-time\n\n\nPay: From $90,000.00 per year\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n10 hour shift\n\nSupplemental Pay:\n\n\nBonus pay\n\nAbility to commute/relocate:\n\n\nPortland, ME 04103: Reliably commute or planning to relocate before starting work (Required)\n\nExperience:\n\n\nLaboratory management: 1 year (Required)\nCannabis: 3 years (Preferred)\n\nWork Location: One location\n","slug":"lab-director-e9f439bd-7ed8-4f41-90c1-13a2c891b99d","benefits":["Dental insurance","Health insurance","Paid time off","Vision insurance"],"selectedSkills":["Gas chromatography","Laboratory experience","Laboratory management","Management","Doctoral degree","Bachelor of Science","Bachelor's degree","Master's degree","Doctor of Philosophy"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=zKSOvntqJ42VtfwuB_Q2HhjVZCJ26i4004ucJqbr0eleR1MApS-cEQ"},{"position":"Microbiology Team Lead","labName":"R.I. Analytical Laboratories, Inc.","location":"Warwick, RI","age":"5 hours ago","type":"Full-time","salaryMin":"$18 ","salaryMax":" $25 an hour","jobDescriptionCopy":"R.I. Analytical Laboratories, Inc.\n\n\nJob Description\n\n\nJob Title:\n\n\nMicrobiology Team Lead\n\n\nPosition:\n\n\nMicrobiologist\n\n\nDepartment:\n\n\nMicrobiology\n\n\nSupervisor:\n\n\nLaboratory Director\n\n\nPosition Summary:\n\n\nRI Analytical Laboratories, Inc. is a leading environmental, products & materials, and cannabis testing laboratory that has been serving the southern New England area for over 45 years. RI Analytical is seeking a highly motivated individual to lead our Microbiology Team in Warwick, RI as a full-time microbiologist. The schedule for this position is typically 9am - 5:45pm, Monday - Friday. Occasional weekend and overtime hours are required.\n\n\nIn this role you will primarily be performing microbiological analysis on environmental samples. In addition to this, you will be responsible for daily, weekly, monthly, and annual laboratory maintenance and QA/QC requirements. Qualified individuals should have knowledge and understanding of commonly used laboratory concepts, practices, and procedures and should be able to work independently after the completion of all necessary training. The ability to multitask is a must for this role.\n\n\nAs a microbiologist, your essential functions will be to:\n\n\nFollow procedures as outlined by Standard Operating Procedures (SOP) for analytical testing.\nComplete an Initial Demonstration of Capabilities (IDC) prior to independently performing analytical testing on samples and then annual Continuing Demonstration of Capabilities (CDC).\nAdheres to the R.I. Analytical Chemical Hygiene Plan, Code of Ethics, and other policies defined by each laboratory’s Quality Manual and Employee Handbook.\nCommunicates any issues in a timely manner to the Laboratory Director.\nMaintains and promotes clean, organized, and functional work areas.\nOther duties as required or assigned by laboratory management.\n\nQualifications:\n\n\nEducation Minimum Bachelors degree in Microbiology, Biology, Chemistry, or closely related science with at least 8 credits in Microbiology courses.\n\n\nExperience At least two (2) years of laboratory experience is preferred.\n\n\nRI Analytical is an equal opportunity employer.\n\n\nJob Type: Full-time\n\n\nPay: $18.00 - $25.00 per hour\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nFlexible schedule\nHealth insurance\nLife insurance\nPaid time off\nParental leave\nRelocation assistance\nRetirement plan\nTuition reimbursement\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nOvertime\nWeekend availability\n\nAbility to commute/relocate:\n\n\nWarwick, RI 02888: Reliably commute or planning to relocate before starting work (Required)\n\nWork Location: One location\n","slug":"microbiology-team-lead-b527cbe2-e702-4839-a39f-b7366efb98cb","benefits":["Health insurance","401(k) matching","Tuition reimbursement","Paid time off","Flexible schedule"],"selectedSkills":["Laboratory experience","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=mOrgujPbHJ_aN48cwP_8wz4rXOx9DL0QZP7it_H3bNk-Cl9Te7xwVw"},{"position":"Director of Extraction and Formulation","labName":"Red Queen Extracts","location":"Chickasha, OK","age":"4 days ago","type":"Full-time","salaryMin":"$85,000 ","salaryMax":" $100,000 a year","jobDescriptionCopy":"Director of Extraction and Formulation at Red Queen Extracts\n\n\nLocation\n\n\nChickasha, OK\n\nJob Type\n\n\nFull-time\n\nCompensation Information\n\n\nFirm Fixed Price Contract (1099 basis) for 12 – 18 months or scheduled on contract deliverables.\nCompensation criteria negotiable and commensurate with experience and skill set.\nBeginning offer $85,000 for each contract year.\n\nFull Job Description\n\n\nAbout Red Queen Extracts\n\n\nWe are looking for colleagues who share our values of excellence, drive and sincerity. Our purpose is to craft premium, unique and innovative products for our clients with an emphasis on quality and consistency. Our mission is to live meaningful lives and help others do the same.\n\n\nAbout This Role\n\n\nWe are seeking a professional Director of Extraction and Formulation in a highly impactful role to lead the vision, strategy and execution of extract product development for the company’s entry into the\nOklahoma medical cannabis market.\n\n\nThe Director will facilitate and supervise the initial establishment of commercial extraction production processes and product offerings while collaborating with Executive team on all executive decisions pertaining to the product planning and future product development strategies of the company.\n\n\nThe Director will maintain responsibilities for outlining and identifying key product progressions within the market as well as procurement and processing strategies to ensure that the product resources are aligned with the company’s production needs.\n\n\nKey Aspects of this Position Include:\n\n\nFixed contract period of 6 to 18 months of engagement (negotiable).\nDeveloping and formulating a range of extract products intended to be market leaders within the Oklahoma medical cannabis market.\nCompensation for the creation, training and guidance of production points and all other\n\nIntellectual Properties that will remain with the company upon the completion of the contracted\n\n\nservices – Executive team will maintain sole executive team of all IP and SKUs developed specifically for the company.\n\n\nLead time would be for initial trial batches expected by October or November of 2022 (Q4).\nThe company will be utilizing the Luna IO hydrocarbon Extractor for primary extraction.\nExperience with hydrocarbon extraction preferred but not required.\n\nDirector of Extraction and Formulation\n\n\nThe Director of Extraction and Formulation will facilitate and supervise the process of commercial extraction production for the company. The Director is responsible for gathering critical data to evaluate each process and present weekly productivity reports to Executive team. The Director will be required to maintain compliance with state guidelines and manage operations in accordance with company standards to meet production goals. This position is responsible for the development of product formulas and Standard Operating Procedures for production and operation of equipment (SOPs) and for integrating the proprietary processing techniques they develop to maintain a competitive advantage amongst cannabis processors around the country.\n\n\nThe ideal candidate will have experience in process chemistry design, process related research and development, laboratory equipment troubleshooting, analytical chemistry, laboratory design, with a robust understanding of terpene and cannabinoid properties and behavior, influence, preservation techniques and separation chemistry. Similar experience in other highly regulated industries will also be considered.\n\n\nProduction Responsibilities\n\n\nCollaborating with executive team in developing product offerings.\nDevelop new proprietary formulas and SOPs so new formulas can be reproduced consistently and efficiently\nTrain and educate executive team on new product and SOP development.\nOversee daily laboratory activities for extraction and processing of cannabis products.\nProvide expert recommendations on specific cannabis product formulations to meet the needs of patients and strategic approaches set forth by Executive team.\nEnsuring that the cannabis product resources meet the company’s short and long-term needs.\nOutline the goals for product research and development.\nCreate timelines for the product development and deployment of all products offered.\nPurchasing and inspecting raw materials and input to fulfill company's inventory needs.\nManaging product budgets and time frames.\nStaying informed of industry trends and developments.\nEnsuring all practices adhere to regulatory requirements.\nAssess the product inventory requirements and coordinate with Executive team to ensure an adequate supply of cannabis is available to meet all facets of the company’s strategic approach.\nProvide weekly, monthly, annual reporting on production of medical cannabis products, projections and compliance.\nManage vendor relationships and remain current for the maintenance of equipment to ensure quality of equipment conditions.\nCoordinate with state-approved laboratories to provide samples for regular testing of plant material and extracted product and ensure all results are documented in compliance with state regulations including in the state seed-to-sale tracking system, METRC.\nEnsure that sanitation, safety and security protocols are strictly enforced throughout the facility in accordance with the company’s Standard Operating Procedures and state regulations.\nForecast and source in conjunction with Executive team to ensure that products are produced in accordance with demand.\nManage extraction and processing facility personnel, ensuring all Standard Operating\n\nProcedures are strictly adhered to.\n\n\nEnsure all extraction and processing personnel are fully trained on the company’s procedures and policies and reinforced or updated as needed.\nDesign statistically grounded studies to optimize each individual piece of equipment and process to meet efficiency, efficacy and quality targets set forth by Executive team.\nFollow and ensure strict safety procedures and safety checks.\nDetail extraction parameters, interpret extraction data and adjust parameters as necessary.\nMaintain rigorous operational logs detailing extraction parameters, results, equipment and laboratory maintenance and cleaning tasks among other responsibilities to ensure that required tasks are being efficiently performed with properly recorded results.\nCreate, implement and maintain a cleaning schedule, ensuring that equipment, tools and workspaces maintain a high level of cleanliness.\nStaying current with emerging technical developments within the industry, particularly time management and reliability enhancements.\nProperly use standard office equipment, computer equipment and software including word processing, spreadsheet applications and electronic mail.\nOther related tasks as necessary.\n\nThe Director will also be one of the most important members of the management team and will be primarily responsible for overseeing compliance within a company’s daily operations and ensuring all policies and procedures are in full compliance with all state laws and regulations and regulatory requirements set forth by the Oklahoma Medical Marijuana Authority (OMMA).\n\n\nThe Director will communicate directly with Executive team regarding important issues and potential/cited violations. In order to maintain the utmost safety and compliance in the laboratory, the candidate should demonstrate previous managerial experience and be able to understand and work within the strict confines of the rules and regulations set forth by OMMA and other local authorities.\n\n\nCompliance Responsibilities\n\n\nDefining the necessary level of knowledge on existing and emerging regulatory compliance requirements across the company.\nMaintain and supervise all aspects of METRC data entry and inventory control.\nDeveloping the annual compliance work plan that reflects the company's unique characteristics.\nPeriodically revising the compliance practices considering regulatory changes.\nGuiding in a productive, professional way, the compliance of facility staff.\nOverseeing and monitoring the implementation of compliance strategies.\nProviding guidance, advice and/or training and educational programs, to improve employee’s understanding of related laws and regulatory requirements.\nProviding strategic direction to the management team on compliance requirements.\nPreparing and presenting clear and concise compliance reports.\nInteracting with regulators on compliance issues.\nCoordinating efforts related to audits, reviews and examinations.\nDeveloping policies and programs that encourage managers and employees to report suspected theft or diversion and other improprieties, without fear of retaliation.\nCoordinating internal compliance review and monitoring activities, including periodic reviews of departments.\nIndependently investigating and acting on matters related to compliance.\nMonitoring external review processes.\n\nProfessional Skills\n\n\nAbility to work in fast-paced, results oriented, demanding environment, balancing competing priorities.\nStrong attention to detail, with a keen eye for excellence to ensure the continued integrity of the brand.\nOriented to continuous improvement/quality control in driving excellence.\nGrowth and change leader; earns trust, gets involved and \"rolls up the sleeves\" to get meaningful and sustainable results for all key constituents - a true leader with exceptional ability to manage people.\nProactive, yet disciplined; creative and entrepreneurial - identifies opportunities and takes initiative.\nCollaboration building, alliance building, non-bureaucratic.\n\nEducation and Experience\n\n\nBachelor’s degree or equivalent experience.\n5+ years of related extraction/processing/manufacturing industry experience.\nAbility to excel in executing operational strategy.\nDemonstrated track record of success leading teams and implementing scorecards/dashboards or analytics that drive measurable impact in an extraction/processing/manufacturing setting.\n\nAdditional Considerations\n\n\nCannabis Industry Experience\nProfessional Lab Experience\nBackground in Chemistry and/or Food Production\nProficiencies in Software Management\nProficient IT Skills\n\nProfessional and Leadership Qualities\n\n\nAttention to Detail\nAccountability\nAdhere to Best Practices\nCustomer and Patient Focused\nTeam Leader\n\nRed Queen Extracts is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.\n\n\nJob Type: Full-time\n\n\nPay: $85,000.00 - $100,000.00 per year\n\n\nSchedule:\n\n\n8 hour shift\n\nAbility to commute/relocate:\n\n\nChickasha, OK 73018: Reliably commute or planning to relocate before starting work (Required)\n\nWork Location: One location\n","slug":"director-of-extraction-and-formulation-6ccec08e-97cb-4166-98e1-2f72412b6b48","benefits":[],"selectedSkills":["Laboratory experience","Manufacturing","Food production","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=x_mVoudS7iXARSzxUWFyx7kxCe0_FD6oGtRvVkLkeHK_s3c0EX2Jgw"},{"position":"Product Development Scientist","labName":"Vertosa","location":"Berkeley, CA","age":"8 days ago","type":"Full-time","salaryMin":"$77,000 ","salaryMax":" $110,000 a year","jobDescriptionCopy":"Vertosa creates custom industry-leading active ingredients for infused product makers. Our patented and patent pending formulations are carefully designed for the specific needs of each of our customers. Our pre-suspended aqueous solutions and powders empower our partners to create incredibly homogeneous and stable products while maximizing bioavailability, clarity, and taste.\n\n\nOur team believes in the power of natural ingredients and science working in concert to create better alternatives to recreational consumer products and medicine. Our knowledge and experience, best-in-class products, white-glove service, and relentless drive for excellence offers our customers the quality, consistency, and reliability they seek in a product.\n\n\nJob Brief\n\n\nWith the support and guidance of a manager, you will organize and execute new food and beverage formulation projects for our customers using Vertosa’s ingredients. You may plan and conduct pilot plant or factory trials. This person will support the customer with development activities (e.g. formulation, product shelf-life testing, designing for quality, etc.) You will not be working alone in the corner of a laboratory, but interacting very actively with people from functions such as innovation, sales, R&D, and our customers. This person will report directly to the Director of Product Development.\n\n\nResponsibilities\n\n\nLead projects from our clients through the Customer Innovation pipeline This involves working on teams and independently with the guidance of a manager.\nFrom design to implementation, you and the product development team will be the technical experts in new product development from simple line extensions to new formulations.\nIdentifying problems proactively and creating and implementing solutions independently.\nApplying fundamental technical understanding to interpret and analyze data to reach clear conclusions.\nBuild a close collaboration with the sales and R&D teams\nGive presentations to customers and other departments within the company as needed.\nPutting the customer at the heart of development activities and guiding their decision making.\n\nRequirements\n\n\nMaster’s degree in Chemistry/Cosmetic/Food Science or related discipline.\n7+ years related new product development experience in the food industry including familiarity working from concept to commercialization and experience working directly with manufacturers.\nApplication Development experience in the food industry.\n>1 year in a client-facing role\nGeneral knowledge of food manufacturing technologies, ingredients, and ability to operate lab level equipment.\nPassionate about science, creativity, innovation and continuous improvement mindset\nAbility to learn quickly and work in close collaboration with cross-functional and geographically distributed teams in a fast-paced environment.\nComputer skills: Microsoft office suite\nMust be a passionate champion for cannabis. Vertosa does not require cannabis consumption for any employees.\n\nJob Type: Full-time\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nEmployee assistance program\nFlexible schedule\nFlexible spending account\nHealth insurance\nPaid time off\nParental leave\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\n\nAbility to commute/relocate:\n\n\nBerkeley, CA 94710: Reliably commute or planning to relocate before starting work (Required)\n\nWork Location: One location\n","slug":"product-development-scientist-69cb5a32-c9e8-4db0-b693-32aa263d25d6","benefits":["Dental insurance","Health insurance","Employee assistance program","Paid time off","Flexible schedule"],"selectedSkills":["Application development","Product development","Food industry","Microsoft Office","Master's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=Nu_aeQwPdX7XU0R9JNEwthHM577XlSixMRTX6WPZhLC9LbaIitLkNw"},{"position":"Analytical Chemist","labName":"Kaycha Labs","location":"Knoxville, TN","age":"7 days ago","type":"Full-time","salaryMin":"$41,000 ","salaryMax":" $58,000 a year","jobDescriptionCopy":"Job description\n\n\nCompany Overview:\n\n\nKaycha Group, LLC is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\n\nJob Purpose:\n\n\nThe Lab Analyst, Level I will be responsible for performing, documenting, record checking, and basic troubleshooting of qualitative and quantitative assays on samples using techniques that vary from the use of standard laboratory equipment to highly modern and automated instrumentation.\n\n\nEssential Duties & Responsibilities:\n\n\nAnalyze samples consisting of a variety of matrices using traditional laboratory technologies including, but not limited to, HPLC, GC/MS, LCMS/MS, and ICP/MS.\nPrepare samples for analysis while displaying good laboratory technique to avoid cross-contamination or misidentified samples.\nAccurately prepare calibration curves and quality control samples.\nInterpret and evaluate data in terms of accuracy, precision, trends, and quality control requirements.\nMaintain laboratory equipment by cleaning, and otherwise ensuring ongoing proper working order. Report equipment issues to supervisor\nCollaborate with the laboratory team to meet reporting deadlines.\nAble to perform method validations, or verifications as needed.\nManage inventory supplies and alert supervisor in advance when materials must be ordered\nMay participate in root cause analysis for quality assurance.\nAssist with training incoming analysts and technicians on methodology.\nParticipate in the development or updating of departmental SOP’s.\nOther duties and special projects as assigned.\n\nEducation & Experience:\n\n\nMinimum BS/BA in Chemistry, Biology, Physics, Engineering or Environmental Sciences required or based on state requirements.\nKnowledge of principles, terminology, practices, techniques, and instrumentation commonly used in a laboratory setting required.\nAt least 1 year of laboratory experience.\nDemonstrated proficiency in at least one analytical instrument preferred.\nFood science and/or environmental experience is a plus.\nExposure to the cannabis industry is a plus.\n\nSkills, Abilities and Competencies:\n\n\nBasic understanding of standard laboratory protocol.\nMaintain high productivity, keen attention to detail, and consistent multi-tasking while yielding a low testing error rate.\nStrong agility, engagement, and flexibility in an ever-changing environment.\nDiligent commitment to logging, organizing, and analyzing data.\nExcellent communication skills and ability to effectively work, problem solve, and communicate with multiple levels of the organization.\nPromote a strong customer service culture while adhering to the highest safety and industry standards, including those that are outlined by the state regulatory body.\n\nOther:\n\n\nMust pass the required background check.\nMust be at least 21 years old.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.\n\nEssential Functions:\n\n\nThe physical demands described here are representative of those that an employee must meet to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nWhile performing the duties of this job the employee is frequently required to stand, handle or feel, to speak, and to hear. The employee is occasionally required to walk, sit, reach with hands and arms, bend, kneel, crouch, or crawl. The employee must frequently lift and/or move up to thirty-five (35) pounds.\n\n\nSpecific vision abilities required for this job include close (proximity) vision, depth perception, and the ability to adjust focus.\n\n\nWork Environment:\n\n\nThe work environment described here is representative of that which an employee may encounter while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nThe standard analytical laboratory environment is one in which potential health hazards do exist. Administrative, operations, technical, and professional staff are expected to safely operate in accordance with applicable and appropriate health and safety policies and procedures, as prescribed by the applicable Kaycha manuals and policies and/or federal, state, or local standards.\n\n\nLaboratory staff can be expected to work in areas where hazards associated are with, but not limited to, airborne pathogens. Biological materials, hazardous substances, and radioactive material exist and are handled. Appropriate training is provided regarding these hazards and staff are expected to adhere to all health and safety policies at all times, whether they are in writing or verbalized by a supervisor.\n\n\nThe above is intended to describe the general content of and requirements for the performance of this job. It is not to be construed as an exhaustive statement of duties, responsibilities, or physical requirements. Nothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions\n\n\nJob Type: Full-time\n\n\nJob Type: Full-time\n\n\nSchedule:\n\n\n8 hour shift\n\nApplication Question(s):\n\n\nWhat is your desired compensation range?\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nLCMS/MS: 1 year (Required)\n\nWork Location: One location\n","slug":"analytical-chemist-10d2e3ae-b504-476b-9f33-675b67d119d8","benefits":["Dental insurance","Health insurance","Vision insurance"],"selectedSkills":["Laboratory experience","Communication skills","Root cause analysis","Bachelor of Science","Bachelor's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=0AZQOzfycgQg1Kr7eS3Qr1FLyl6IIV-vBW8HhIm3QuzksSjY8e58Vw"},{"position":"Lab Director","labName":"Kaycha Labs","location":"Las Vegas, NV","age":"7 days ago","type":"Full-time","salaryMin":"$45,000 ","salaryMax":" $60,000 a year","jobDescriptionCopy":"Company Overview:\n\n\nKaycha Group, LLC is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\n\nJob Purpose:\nThe Lab Director is responsible for the planning and operational performance of the assigned laboratory. This role oversees the day-to-day operations and ensures compliance standards for quality and safety. The Lab Director is accountable for knowing and following all Company policies and standards, leads by example, and lives our values while supporting our rapid organizational growth.\n\n\nEssential Duties & Responsibilities:\n\n\nLead‌ ‌the‌ ‌team‌ ‌with‌ ‌dynamic‌ ‌leadership‌ ‌that‌ ‌promotes‌ ‌an‌ ‌environment‌ ‌of‌ ‌support,‌ ‌development,‌ ‌engagement,‌ ‌and‌ ‌high‌ ‌productivity.‌ ‌This‌ ‌includes,‌ ‌but‌ ‌is‌ ‌not‌ ‌limited‌ ‌to,‌ ‌hiring,‌ ‌coaching,‌ ‌performance‌ ‌management,‌ ‌ensuring‌ ‌productivity,‌ ‌disciplinary‌ ‌action,‌ ‌cross-training,‌ ‌rewards‌ ‌and‌ ‌recognition,‌ ‌and‌ ‌succession‌ ‌planning.‌ ‌\nEnsure‌ ‌the‌ ‌financial‌ ‌health‌ ‌of‌ ‌the‌ ‌laboratory.‌ ‌This‌ ‌includes‌ ‌managing‌ ‌expenses‌ ‌related‌ ‌to‌ ‌all‌ ‌operational‌ ‌activities,‌ ‌such‌ ‌as‌ ‌equipment,‌ ‌labor,‌ ‌and‌ ‌supplies and monitoring laboratory performance by measuring, monitoring, and managing to company KPI targets‌.‌ ‌\nManage‌ ‌‌lab ‌operations, ‌‌including‌ ‌production,‌ ‌process‌ ‌evaluation,‌ ‌and‌ ‌monitoring.‌\nEnsure‌ ‌compliance‌ ‌with‌ ‌laboratory‌ ‌policies‌ ‌and‌ ‌procedures,‌ ‌state‌ ‌regulations,‌ ‌and‌ ‌ISO-17025‌ ‌quality‌ ‌management‌ ‌system‌.\nDrive‌ ‌a‌ ‌strong‌ ‌customer‌ ‌service‌ ‌culture‌ ‌while‌ ‌adhering‌ ‌to‌ ‌the‌ ‌highest‌ ‌ethical‌ ‌and‌ ‌safety‌ ‌standards.‌ ‌\nMaintain‌ ‌analytical‌ ‌equipment‌ ‌(i.e.‌ ‌HPLC,‌ ‌GC-MSMS,‌ ‌LCMSMS,‌ ‌ICP-MS,‌ ‌qPCR‌ ‌analytical‌ ‌balances,‌ ‌autoclave,‌ ‌centrifuge,‌ ‌biological‌ ‌safety‌ ‌cabinets,‌ ‌fume‌ ‌hoods,‌ ‌etc.)‌.\nMonitor‌ ‌and‌ ‌manage‌ ‌facilities.‌‌\nPartner‌ ‌with‌ ‌the‌ ‌Quality‌ Assurance Team‌ ‌to‌ ‌assure‌ ‌method‌ ‌and‌ ‌SOP‌ ‌compliance.‌\nEvaluate‌ ‌both‌ ‌OOS‌ ‌and‌ ‌CAPA‌ ‌reports‌ ‌with‌ ‌the‌ ‌Senior‌ ‌Executive‌ ‌Team‌ ‌and‌ ‌Quality‌ ‌department.‌ ‌\n‌‌Build‌ ‌strong‌ ‌internal,‌ ‌external,‌ ‌and‌ ‌cross-functional‌ ‌relationships.‌\nDrive‌ ‌a‌ ‌continuous‌ ‌improvement‌ ‌culture.‌ ‌\nOther‌ ‌duties‌ ‌and‌ ‌special‌ ‌projects‌ ‌as‌ ‌assigned.‌ ‌\n\nSkills, Abilities and Competencies:\n\n\nStrong‌ ‌understanding‌ ‌of‌ ‌standard‌ ‌laboratory‌ ‌protocol and experience working with cannabis laboratory ‌analytical‌ ‌equipment‌ ‌(i.e.‌ ‌HPLC,‌ ‌GC-MSMS,‌ ‌LCMSMS,‌ ‌ICP-MS)\nTrack‌ ‌record‌ ‌in‌ ‌accelerating the performance of laboratory groups.\nExcellent‌ ‌communication‌ ‌skills‌ ‌and‌ ‌ability‌ ‌to‌ ‌effectively‌ ‌work,‌ ‌influence,‌ ‌problem‌ ‌solve,‌ ‌and‌ ‌communicate‌ ‌with‌ ‌all‌ ‌levels‌ ‌of‌ ‌the‌ ‌organization.\nExceptional analytical skills with effective judgment and decision-making capabilities.\nAbility to execute on an operating plan and ensure business priorities are met.\nAbility‌ ‌to‌ ‌multi-task and work‌ ‌in‌ ‌a‌ ‌dynamic,‌ ‌fast-paced‌ ‌deadline‌ ‌environment‌ and maintain composure during challenging and/or complex situations\nAbility‌ ‌to‌ ‌maintain‌ ‌high‌ ‌degree‌ ‌of‌ ‌attention‌ ‌to‌ ‌detail‌ ‌and‌ ‌accuracy.‌ ‌\nStrong‌ ‌knowledge‌ ‌of‌ ‌Microsoft‌ ‌Office,‌ ‌including‌ ‌Excel,‌ ‌PowerPoint,‌ ‌and‌ ‌Word.‌\nTravel‌ ‌when requested,‌ ‌including‌ ‌overnight‌ ‌travel.‌\n\nEducation & Experience:\n\n\nMinimum‌ ‌BS/BA‌ ‌in‌ ‌Chemistry,‌ ‌Biology,‌ ‌Physics,‌ ‌Engineering‌ ‌or‌ ‌Environmental‌ ‌Sciences required.‌ ‌Advanced‌ ‌degree‌ ‌preferred.‌ ‌\n8+‌ ‌years‌ ‌of‌ ‌relevant‌ ‌laboratory‌ ‌operations‌ ‌and‌ ‌leadership‌ ‌experience.‌\nAdvanced‌ ‌knowledge‌ ‌of‌ ‌principles,‌ ‌terminology,‌ ‌practices,‌ ‌techniques,‌ ‌and‌ instrumentation‌ ‌commonly‌ ‌used‌ ‌in‌ ‌a‌ ‌laboratory‌ ‌setting‌ ‌required.‌ ‌\nExposure‌ ‌to‌ ‌the‌ ‌cannabis‌ ‌industry‌ ‌desired.‌\n\nOther:\n\n\nMust pass Level 2 background check.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.\n\nEssential Functions:\n\n\nThe physical demands described here are representative of those that an employee must meet to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nWhile performing the duties of this job the employee is frequently required to stand, handle or feel, to speak, and to hear. The employee is occasionally required to walk, sit, reach with hands and arms, bend, kneel, crouch, or crawl. The employee must frequently lift and/or move up to thirty-five (35) pounds.\n\n\nSpecific vision abilities required for this job include close (proximity) vision, depth perception, and the ability to adjust focus.\n\n\nWork Environment:\n\n\nThe work environment described here is representative of that which an employee may encounter while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nThe standard analytical laboratory environment is one in which potential health hazards do exist. Administrative, operations, technical, and professional staff are expected to safely operate in accordance with applicable and appropriate health and safety policies and procedures, as prescribed by the applicable Kaycha manuals and policies and/or federal, state, or local standards.\n\n\nLaboratory staff can be expected to work in areas where hazards associated are with, but not limited to, airborne pathogens. Biological materials, hazardous substances, and radioactive material exist and are handled. Appropriate training is provided regarding these hazards and staff are expected to adhere to all health and safety policies at all times, whether they are in writing or verbalized by a supervisor.\n\n\nThe above is intended to describe the general content of and requirements for the performance of this job. It is not to be construed as an exhaustive statement of duties, responsibilities, or physical requirements. Nothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions\n\n\nJob Type: Full-time\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nEmployee discount\nFlexible spending account\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nReferral program\nRetirement plan\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nMonday to Friday\nWeekend availability\n\nApplication Question(s):\n\n\nWhat is your desired compensation range?\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nLab Director: 3 years (Required)\nCannabis/Hemp testing: 1 year (Preferred)\n\nWork Location: One location\n","slug":"lab-director-e7cbcc99-e67a-4a4a-a827-3c47fc865d1f","benefits":["Health savings account","Dental insurance","Employee discount","Health insurance","Referral program"],"selectedSkills":["Microsoft Excel","Microsoft Powerpoint","Laboratory experience","Communication skills","Analysis skills","Bachelor of Science","Bachelor's degree","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=od-Bp3D2-YnWpyoNGsJMywoV4j74RkKATLMpisRIikD_3aJ1SBDyDg"},{"position":"Analytical Chemist","labName":"Eastern Analytical Labs","location":"Middletown, MD","age":"1 day ago","type":"Full-time","salaryMin":"$75,000 ","salaryMax":" $85,000 a year","jobDescriptionCopy":"Required Education and Experience:\n\n\nMinimum Education: Must have earned a Master of Science degree from an accredited academic institution in a natural science (such as chemistry, physics, or biology) or a subspecialty of a natural science (such as organic chemistry, biochemistry, or molecular biology).\nMust have 2+ years of relevant work experience.\nMust have ISO 17025 regulatory experience.\nMust have experience with ICP-MS, GC-MS, LC-MS, and HPLC\nKnowledge in cannabis testing regulations is preferred.\nExperience working with Shimadzu testing equipment is preferred.\n\nCore Job Duties\n\n\nPerform cannabis extractions and related processes.\nRun testing procedures on HPLC, LC-MS, GC-MS and ICPMS\nAttend appropriate training with external vendors.\nPerform preparation and cleaning of equipment and workspace.\nSupport instrument monitoring, maintenance, calibration, and cleaning.\nMaintaining and operating lab equipment safely while following good manufacturing practice standards.\nDrafting of instrument out-of-specification reports.\nAbility to safely handle hazardous materials including: Acids, bases, butane, propane, ethanol, pentane, isopropyl alcohol, critically hot material, cryogenic cold material etc.\nReview and implement employee training plan.\nTrain other instrument and assay operators.\nDevelop and validate new assays and procedures.\nDraft and review SOP’s and data reports.\nDraft and review new documents and changes to existing documents within the quality system.\nCreate and review assay validation packets.\nMaintain strict inventory records of all materials, chemicals and equipment used in the laboratory, anticipating needed supplies and ordering same.\nCreate and properly use batch traceability records.\nReviewing batch records for batch/lot release and review of certificate of analysis.\nMaintain daily temperature recordings and traceability documents.\nReviewing data to determine pass/fail criteria and measurement uncertainty.\nTrack and review data to identify trends.\nSupporting compliance with all State, Federal, and local laws.\nSupporting the review and implementation of new MMCC requirements.\nSupporting the commitment to impartiality and operations integrity.\nReporting risks or infringements of impartiality and/or operations integrity to Management.\nSupporting Quality System annual review.\nSupporting internal and external audits of the laboratory.\nEnsuring safety and company policies are adhered to consistently and effectively and are communicated clearly to staff.\nMaintain excellent professional relationships with vendors and outside colleagues.\nDeveloping Certificates of Analysis for clients.\nInteract with clients regarding Certificates of Analysis and testing methods.\nPromote the mission, vision, and values of the company to all team members at all times.\nBe punctual, professional, and exhibit a positive attitude.\nAttend and add value to team meetings.\nEngage in honest, innovative, problem-solving dialogue.\n\nJob Type: Full-time\n\n\nPay: $75,000.00 - $85,000.00 per year\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nEmployee discount\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nRetirement plan\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\n\nEducation:\n\n\nMaster's (Required)\n\nExperience:\n\n\nrelevant work: 2 years (Required)\n\nWork Location: One location\n","slug":"analytical-chemist-9f5dcc72-2d6e-4077-91a6-84ecf6253d4e","benefits":["Health savings account","Dental insurance","Employee discount","Health insurance","Employee assistance program"],"selectedSkills":["Gas chromatography","Master of Science","Master's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=oLZNB8Ao5nfskRZfmvAI114Vvn-uLGeNbb27xTDjP3i35WTi6DXE1A"},{"position":"Cannabis Extraction Technician","labName":"Kaycha Labs","location":"Monrovia, CA","age":"7 days ago","type":"Full-time","salaryMin":"$34,000 ","salaryMax":" $50,000 a year","jobDescriptionCopy":"Company Overview:\n\n\nKaycha Group, LLC is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\n\nJob Summary:\n\n\nThe Lab Technician, Level I, is responsible for working closely with our laboratory team to develop analytical skills and related experience. This position consists of many aspects from homogenizing, weighing and extracting samples, performing quality control checks, verifying various support equipment and properly disposing of all waste.\n\n\nEssential Duties & Responsibilities:\n\n\nExecute laboratory protocol and procedures under the supervision of the Lab Director.\nRegularly display good laboratory technique to avoid cross-contamination or misidentified samples.\nPerform sample preparation procedures including homogenization, weighing and liquid extraction.\nPerform QC duties as assigned, including LCS and matrix spikes.\nPerform qualitative and quantitative tests, as assigned.\nUtilize the LIMS system to create batches, enter sample prep information and maintain physical and electronic records.\nAdhere to ISO 17025 standards as well as state regulatory requirements.\nPromote a strong customer service culture while adhering to the highest safety and industry standards.\nOther duties and/or special projects as assigned.\n\nKnowledge, Skills and Abilities:\n\n\nAbility to maintain an incredibly high degree of attention to detail and accuracy.\nStrong agility, engagement, and flexibility in an ever-changing environment.\nWorking knowledge of logging, organizing, and analyzing data.\nAbility to work in a dynamic, fast-paced deadline environment while successfully managing multiple tasks.\nStrong knowledge of Microsoft Office, including Excel, PowerPoint, and Word.\nWorking knowledge of standard laboratory protocol.\nExcellent communication skills and ability to effectively work, problem solve, and communicate with multiple levels of the organization.\n\nEducation & Experience:\n\n\nMinimum of Bachelor’s degree in chemistry, biochemistry or related field based on state requirements.\n0-1 year of lab experience.\nKnowledge of principles, terminology, practices, techniques commonly used in a laboratory setting preferred.\nExposure to the cannabis industry is a plus.\n\nOther:\n\n\nMust pass Level 2 background check.\nMust be at least 21 years old.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off\n\nEssential Functions:\n\n\nThe physical demands described here are representative of those that an employee must meet to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nWhile performing the duties of this job the employee is frequently required to stand, handle or feel, to speak, and to hear. The employee is occasionally required to walk, sit, reach with hands and arms, bend, kneel, crouch, or crawl. The employee must frequently lift and/or move up to thirty-five (35) pounds.\n\n\nSpecific vision abilities required for this job include close (proximity) vision, depth perception, and the ability to adjust focus.\n\n\nWork Environment:\n\n\nThe work environment described here is representative of that which an employee may encounter while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nThe standard analytical laboratory environment is one in which potential health hazards do exist. Administrative, operations, technical, and professional staff are expected to safely operate in accordance with applicable and appropriate health and safety policies and procedures, as prescribed by the applicable Kaycha manuals and policies and/or federal, state, or local standards.\n\n\nLaboratory staff can be expected to work in areas where hazards associated are with, but not limited to, airborne pathogens. Biological materials, hazardous substances, and radioactive material exist and are handled. Appropriate training is provided regarding these hazards and staff are expected to adhere to all health and safety policies at all times, whether they are in writing or verbalized by a supervisor.\n\n\nThe above is intended to describe the general content of and requirements for the performance of this job. It is not to be construed as an exhaustive statement of duties, responsibilities, or physical requirements. Nothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status\n\n\nJob Type: Full-time\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nHealth insurance\nPaid time off\nReferral program\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nWeekend availability\n\nApplication Question(s):\n\n\nDo you have a chemistry degree?\nWhat is your desired compensation?\n\nEducation:\n\n\nBachelor's (Preferred)\n\nWork Location: One location\n","slug":"cannabis-extraction-technician-4a94ae74-ce12-457d-bcee-65c3c86f2c63","benefits":["Dental insurance","Health insurance","Employee assistance program","401(k) matching","Paid time off"],"selectedSkills":["Analysis skills","Microsoft Excel","Microsoft Powerpoint","Laboratory experience","Communication skills","Bachelor's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=Bzikr0zaSB_PByDomRB5twIwjZJGWknHtAiNJ_BovV_20zKNhyJwyw"},{"position":"Lab Analyst","labName":"Kaycha Labs","location":"Las Vegas, NV","age":"7 days ago","type":"Full-time","salaryMin":"$34,000 ","salaryMax":" $47,000 a year","jobDescriptionCopy":"Company Overview:\n\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\n\nJob Purpose:\n\n\nThe Lab Analyst, GCMS is responsible for performing, documenting, record checking, and troubleshooting qualitative and quantitative assays on samples using techniques that vary from the use of standard laboratory equipment to highly modern and automated instrumentation.\n\n\nEssential Duties & Responsibilities:\n\n\nAnalyze samples consisting of a variety of matrices using traditional laboratory technologies including, but not limited to, HPLC, GC/MS, LC/MS, and ICP/MS\nPrepare samples for analysis while displaying good laboratory technique to avoid cross-contamination or misidentified samples.\nAccurately prepare calibration curves and quality control samples\nInterpret and evaluate data in terms of accuracy, precision, trends, and quality control requirements\nMaintain laboratory equipment by cleaning, replacing parts, and otherwise ensuring ongoing proper working order. Report equipment issues to supervisor\nCollaborate with the laboratory team to meet reporting deadlines.\nPerform method validations, or verifications as needed\nManage inventory supplies and alert supervisor in advance when materials must be ordered\nParticipate in laboratory investigations, and corrective actions as requested or assigned.\nTrain incoming analysts and technicians on methodology\nManage SOP for assigned testing analysis and alert management when there is a change in procedure\nMaintain high productivity, keen attention to detail, and consistent multi-tasking while yielding a low testing error rate.\nPromote a strong customer service culture while adhering to the highest safety and industry standards, including those that are outlined by the state regulatory body.\nResearch new technologies and methodologies to improve laboratory processes and techniques\nOther duties and special projects as assigned.\n\nSkills, Abilities and Competencies:\n\n\nAbility to demonstrate a high degree of attention to detail and accuracy.\nStrong agility, engagement, and flexibility in an ever-changing environment.\nAbility to troubleshoot instrumentation\nDiligent commitment to logging, organizing, and analyzing data.\nAbility to work in a dynamic, fast-paced deadline environment while successfully managing multiple tasks.\nStrong knowledge of Microsoft Office, including Excel, PowerPoint, and Word.\nStrong understanding of standard laboratory protocol.\nExcellent communication skills and ability to effectively work, problem solve, and communicate with multiple levels of the organization.\nAbility to work in a dynamic, fast-paced deadline environment while successfully managing multiple tasks.\nDemonstrated proficiency in at least one high complexity technology\n\nEducation & Experience:\n\n\nMinimum BS/BA in Chemistry, Biology, Physics, Engineering or Environmental Sciences required.\nKnowledge of principles, terminology, practices, techniques, and instrumentation commonly used in a laboratory setting required.\nAt least 2 years of post-college laboratory experience.\nInstrument experience required.\nFood science and/or environmental experience is a plus.\nExposure to the cannabis industry is a plus.\n\nOther:\n\n\nMust pass required background check.\nMust be at least 21 years old.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\n\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.\n\n\nThe above is intended to describe the general content of and requirements for the performance of this job. It is not to be construed as an exhaustive statement of duties, responsibilities, or physical requirements. Nothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions\n\n\nJob Type: Full-time\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nReferral program\nVision insurance\n\nSchedule:\n\n\n10 hour shift\n8 hour shift\nDay shift\nMonday to Friday\nNight shift\nWeekend availability\n\nApplication Question(s):\n\n\nWhat is your desired compensation?\n\nEducation:\n\n\nBachelor's (Preferred)\n\nExperience:\n\n\nLCMS: 1 year (Preferred)\nGCMS: 1 year (Preferred)\n\nWork Location: One location\n","slug":"lab-analyst-bd76b8bd-6122-4d38-89ed-5c1bfc07441b","benefits":["Dental insurance","Health insurance","Referral program","401(k)","401(k) matching"],"selectedSkills":["Microsoft Excel","Microsoft Powerpoint","Laboratory experience","Communication skills","Microsoft Office","Bachelor of Science","Bachelor's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=2vTdcZt3sOmu7p9Ryb2aT0URRSuX-mbB8SZy-ykq-wG82WdlWFanQA"},{"position":"Scientist I","labName":"Cannabis Testing Lab","location":"Sacramento, CA","age":"1 day ago","type":"Full-time","salaryMin":"$25 an hour","jobDescriptionCopy":"About us\n\n\nThe Nation's first licensed and accredited cannabis laboratory (ISO 17025 Accredited). Dependable & Precise Cannabis And Hemp Analytical Testing Lab. Pioneers in cannabis and hemp science. Providing Oregon and California licensed compliance testing and CBD Hemp analysis.\n\n\nThe Scientist 1 is a key collaborative member. This position will be responsible for running, troubleshooting and analyzing samples with a GC, GCMS, LCMSMS, HPLC, and/or ICP system utilizing standardized and in-house lab methodology; writing and reviewing standard operating procedures (SOP’s); and performing basic and complex laboratory operations including sampling, chromatographic and material assays. This position will also assist with method development as required.\n\n\nESSENTIAL DUTIES/KEY RESPONSIBILITIES:\n- Responsible for the setup, running and troubleshooting of GC (GCMS, GCMSMS etc.), LCMSMS and ICP systems.\n- Responsible for maintaining validated ISO 17025 standards of performance for analytical chemical testing.\n- Responsible for daily sample preparation and data analysis to ensure laboratory runs smoothly and meets required turnaround times.\n- Responsible for ensuring compliance with internal Standard Operating Procedures (SOPs) and quality systems.\n- Responsible for Developing procedures for documenting results from data collected.\n- Responsible for ensuring test equipment is clean, maintained and in good working order.\n- Responsible for ensuring high quality standard are met through performing calibrations, quality checks and proficiency programs.\n- Responsible for maintaining inventory tracking as required.\n\n\nQUALIFICATIONS:\n- Bachelor’s degree in biological, chemical, agricultural, environmental, or related sciences from an accredited college or university.\n- Min. 2 years analytical laboratory experience with hands on experience with instrument maintenance and troubleshooting.\n- Experience with data analysis and Laboratory Information Management Systems (LIMS).\n- Experience with the following instrumentation: HPLC, GCMS, LC-MS/MS, GC-MS/MS, ICP\n- Experience with method development and method optimization.\n- Experience importing, validating, and exporting electronic data in a variety of formats.\n- Experience monitoring consumable inventory and ordering supplies.\n- Experience with working under ISO 17025 Standard.\n- Ability to stand for long periods.\n- Ability to lift 40-60lbs.\n- Ability to pass a background check.\n- Proficiency with Microsoft Word, Excel and Outlook.\n\n\nEDUCATION:\nBachelor’s degree in biological, chemical, agricultural, environmental, or related sciences from an accredited college or university.\n\n\nEXPERIENCE:\nAnalytical laboratory: 2 years (Required)\n\n\nJOB TYPE: Full-time, Non-exempt.\n\n\nBENEFITS:\nDental insurance.\nHealth insurance.\nPaid time off.\nVision insurance.\n\n\nSCHEDULE:\nMonday - Friday or Tuesday - Saturday\nAdditional evening and weekend work as needed.\n\n\nWORK LOCATION:\nSacramento.\n\n\nJob Type: Full-time\n\n\nPay: $25.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\n\nAbility to commute/relocate:\n\n\nSacramento, CA 95815: Reliably commute or willing to relocate with an employer-provided relocation package (Required)\n\nWork Location: One location\n","slug":"scientist-i-77d6e101-1a26-403e-8177-6cf3003eae20","benefits":["Dental insurance","Health insurance","Paid time off","Vision insurance"],"selectedSkills":["Microsoft Excel","High-performance liquid chromatography","Microsoft Outlook","Laboratory experience","Data analysis skills","Bachelor's degree","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=7RFP-3hjMduU-yM4qJ6VBD2NjZU8onAzrb9j3AEnJDqtZdJ1feX9vQ"},{"position":"Ethanol Extraction Technician","labName":"Choice Labs, LLC","location":"Jackson, MI","age":"6 days ago","type":"Full-time","jobDescriptionCopy":"Choice Labs, LLC is a rapidly growing medical and recreational cannabis processing center specializing in top-quality cannabis extracts with a solid focus on manufacturing a broad range of high-quality products within our brand and across multiple brand lines. Because of this growth, we are searching for new talent to be part of our hard-working and highly motivated team.\n\n\nEssential Duties:\n\n\n- Perform all duties accurately and in a safe manner by adhering to all governmental regulations and established company procedures\n- Prepare equipment and products for extraction\n- Carry out ethanol extraction, extract processing, product formulation, filling and manufacturing procedures\n- Ensures the consistency and efficiency of products through quality control testing and procedures\n- Maintain strict inventory records of all materials, chemicals and equipment\n- Store supplies and equipment and waste disposal according to established guidelines\n- Complete routine preventative maintenance, cleaning, and troubleshooting on instruments and equipment\n- Responsible for various laboratory support activities, including but not limited to sample inventory, record-keeping, proper sample disposal, and cleaning\n- Ensures timely and accurate reporting and responses to compliance-related issues and assists with implementation of corrective action plans related to such issues\n- Cross train in other departments as necessary\n\n\nRequirements:\n\n\n- Must be age 21 or older\n- BS or higher in chemistry or related discipline from an accredited college or university or bachelor’s degree in an unrelated field from an accredited college or university with two (2) or more years of relevant cannabis laboratory experience\n- Experience with separations science is highly preferred\n- Ability to lift up to 50lbs\n- Excellent verbal and written communication skills\n- Excellent organizational skills\n- Basic computer skills\n- Able to multi-task and work in a fast paced, changing and challenging environment\n- Must be able to work independently and as part of a team\n\n\nJob Type: Full-time\n\n\nPay: From $20.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n12 hour shift\n\nAbility to commute/relocate:\n\n\nJackson, MI 49202: Reliably commute or planning to relocate before starting work (Required)\n\nWork Location: One location\n","slug":"ethanol-extraction-technician-50f8daf9-d8dc-4194-ae05-623f8e44e88f","benefits":["Dental insurance","Health insurance","Paid time off","Vision insurance","Life insurance"],"selectedSkills":["Computer skills","Laboratory experience","Communication skills","Computer literacy","Organizational skills","Bachelor of Science","Bachelor's degree","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=9-hOVwoG0y3ohQ4CXlc_wEvGgzwcxeOXSND17XOP-b4LT9e4_Cm6wQ"},{"position":"Software Developer","labName":"Agricor Labs","location":"Remote","age":"22 hours ago","type":"Full-time","jobDescriptionCopy":"Agricor and our sister hemp testing lab, Botanacor, have joined forces with SC Laboratories, Inc. based in Santa Cruz, CA, to provide cannabis and hemp brands with access to the most comprehensive, industry-forward testing solutions in North America.\n\n\nThe combination brings together three of the longest standing and most respected cannabis and hemp testing organizations in the U.S. and forms the foundation of a national testing network. The combination will bring value to both the hemp and cannabis industries, ranging from access to a broader range of testing resources, improved data delivery, innovative science, instrument redundancy and increased testing capacity, and improved operations to accelerate turnaround times.\n\n\nWe are seeking a full time Software Developer to join the team. We are based in Santa Cruz, CA, but this position would work remotely.\n\n\nPosition Summary\n\n\nThe Software Developer will assist in the development, implementation, and management of technology-based business solutions to improve both internal and client workflow. This position will be responsible for coding, testing, and implementing configuration changes and assisting in the design of software applications to meet both functional and technical requirements of the operations. The ideal candidate is energetic and excited by the idea of working in a company that is passionate about its mission. We have a truly exceptional team, and we are ready for another exceptional person to join us!\n\n\nSpecific Duties/Responsibilities:\n\n\nManage and coordinate activities to conduct credit investigations and collect customer Code, test and troubleshoot programs utilizing the appropriate hardware, database,\n\nand programming technology\n\n\nLearn and maintain existing software programs; make approved changes by\n\ndeveloping detailed programming logic and coding changes\n\n\nAnalyze performance of programs and take action to correct deficiencies based on\n\nconsultation with users\n\n\nWrite and maintain documentation for software projects\nDevelop and implement test plans for new projects, and maintenance of existing projects\nMaintain confidentiality with regard to the information processed, stored or accessed\nDocument programming problems and resolutions for future reference\nAdapt to evolving technologies and processes\nPerform other tasks and additional projects as assigned\n\nSkills and Abilities:\n\n\nBasic Python and PHP programming using MVC and object-oriented design\nKnowledge of databases and operating systems\nFront-end development with HTML, CSS, and JavaScript\nAble to work independently, proactively and adapt appropriately to changing priorities while at\n\ntimes needing to multitask\n\n\nAble to grasp technical issues quickly and use resources and knowledge to find solutions\nAbility to read, comprehend and explain documents in English. Ability to communicate effectively, verbally and in writing, in English\nAbility to meet physical demands of position, including sitting or standing at a desk for long periods of time and extensive computer work / keyboarding\n\nQualifications:\n\n\nMust be at least 21 years of age\nHigh School Diploma (General Educational Development or High School Equivalency exam passed); 2 years of college or University education preferred\n3-5 years of previous programming experience required\nStrong attention to detail with excellent written and verbal communication skills\nMust be a team player and committed to help achieve the company goals\nMust be able to work schedule of PST hours\n\nSC Laboratories provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state, or local laws.\n\n\nThis policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.\n\n\nJob Type: Full-time\n\n\nPay: From $75,000.00 per year\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\n\nWork Location: Remote\n","slug":"software-developer-e6d30332-966d-499b-ade6-1a51ae215c58","benefits":["Dental insurance","Health insurance","401(k)","Paid time off","Vision insurance"],"selectedSkills":["CSS","Communication skills","Python","MVC","Writing skills","High school diploma or GED","21 years or older","US work authorization"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=_6OYJCV8iyjOYfSU-CCzlX8BEsJe2Pe3KekEe5Ue6QQxeyEd3NynkQ"},{"position":"Extraction Chemist","labName":"Kaycha Labs","location":"Davie, FL","age":"2 days ago","type":"Full-time","jobDescriptionCopy":"Company Overview:\n\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\n\nJob Purpose:\n\n\nThe Lab Technician, Level I is responsible for working closely with our laboratory team to develop analytical skills and related experience. This position consists of many aspects from homogenizing, weighing and extracting samples, performing quality control checks, verifying various support equipment and properly disposing of all waste.\n\n\nEssential Duties & Responsibilities:\n\n\nExecute laboratory protocol and procedures under the supervision of the Lab Director.\nRegularly display good laboratory technique to avoid cross-contamination or misidentified samples.\nPerform sample preparation procedures including homogenization, weighing and liquid extraction.\nPerform QC duties as assigned, including LCS and matrix spikes.\nPerform qualitative and quantitative tests, as assigned.\nUtilize the LIMS system to create batches, enter sample prep information and maintain physical and electronic records.\nAdhere to ISO 17025 standards as well as state regulatory requirements.\nPromote a strong customer service culture while adhering to the highest safety and industry standards.\nOther duties and/or special projects as assigned.\n\nSkills, Abilities and Competencies:\n\n\nAbility to maintain an incredibly high degree of attention to detail and accuracy.\nStrong agility, engagement, and flexibility in an ever-changing environment.\nWorking knowledge of logging, organizing, and analyzing data.\nAbility to work in a dynamic, fast-paced deadline environment while successfully managing multiple tasks.\nStrong knowledge of Microsoft Office, including Excel, PowerPoint, and Word.\nWorking knowledge of standard laboratory protocol.\nExcellent communication skills and ability to effectively work, problem solve, and communicate with multiple levels of the organization.\n\nEducation & Experience:\n\n\nMinimum of Bachelor’s degree in chemistry, biochemistry or related field based on state requirements.\n0-1 year of lab experience.\nKnowledge of principles, terminology, practices, techniques commonly used in a laboratory setting preferred.\nExposure to the cannabis industry is a plus.\n\nOther:\n\n\nMust pass Level 2 background check.\nMust be at least 21 years old.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status\n\nJob Type: Full-time\n\n\nPay: From $18.00 per hour\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nFlexible spending account\nHealth insurance\nLife insurance\nPaid time off\nReferral program\nRetirement plan\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nMonday to Friday\nWeekend availability\n\nCOVID-19 considerations:\nFace masks required for unvaccinated.\n\n\nApplication Question(s):\n\n\nWhat is your desired compensation?\nWhat is the best phone number and email to reach you at?\nDo you have a Chemistry degree?\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nLaboratory Experience: 1 year (Preferred)\n\nWork Location: One location\n","slug":"extraction-chemist-1e9a16f0-ff18-40c6-98fd-c23ad326d270","benefits":["Dental insurance","Health insurance","Referral program","401(k)","Flexible spending account"],"selectedSkills":["Microsoft Excel","Microsoft Powerpoint","Laboratory experience","Communication skills","Microsoft Office","Bachelor's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=ltgURM5MTBtb1_oK7k44sdj__kLp5-zGYtes67CEwY1P_zRlAYBcfQ"},{"position":"Lab Technician - Cannabis Industry","labName":"Oklahoma","location":"Oklahoma City, OK","age":"6 days ago","type":"Full-time","salaryMin":"$33,000 ","salaryMax":" $47,000 a year","jobDescriptionCopy":"Job Title: Lab Technician\n\nReports To: Processing Manager\n\nDepartment: Processing\n\nFLSA Status: Non-Exempt\n\nSupervisory Responsibility: NA\n\nPosition Summary:\nThe Lab Tech will execute a variety of laboratory and manufacturing tasks under the direction and supervision of our Lab Director. The Lab Technician will be responsible for assisting in product processing and formulation. The Lab Technician completes tasks assigned by the Lab Manager to operate lab equipment, monitor and maintain cleanliness and efficiency, and drives quality control while always being compliant. This individual must be able to multitask, work quickly and efficiently, and be adaptable to changing priorities and tasks as needed.\n\nFurthermore, the successful candidate will be expected to interact with managers and supervisors to set manufacturing schedules and ensure proper execution of workflow tasks by other employees. We have a very fast- paced environment as we continue to grow and expand. The individual must be motivated, trustworthy, and able to operate both independently and within a team environment.\n\nEssential Functions:\nOperate laboratory, extraction, and manufacturing equipment\nFollow all company policies and procedures to ensure product integrity and quality control\nAssist with testing and calibrating lab equipment in preparation for specific tasks\nPerform quality control tests on ingredients, completed products, and product samples\nWork closely with logistics team to deliver the highest quality products, on-time, accurately, and compliantly\nMaintain accurate inventory of all products\nProvide feedback to Lab Director and fellow team members in support of our continuous improvement operating priority\nRecognize and report any issues, large or small\nPerform all tasks as directed by the Lab Director\n\nManufacturing\n\nResponsible for the preparation and execution of Cure s extraction and processing of product in accordance with the company s Standard Operating Procedures\nEnsures consistency and efficacy of product through close attention to detail\nPerform lab bench work and product filtrations\nAssist in packaging department as needed\nCreate distilled, high purity concentrate medical marijuana for use in a variety of products including vape, edibles, topicals, and tinctures\nExecute the preparation and production of extracted products\nExecute proper labeling and storage of extracted products\nComplete all orders for extracted products in an efficient and timely manner, meeting all necessary deadlines\nCoordinate equipment maintenance, purchases, and repairs with the Lab Director as needed\nExecute and enforce compliance of all local and state regulations\nFollow weekly schedules to ensure there is proper coverage based on the business needs\n\nFacility Cleaning\n\nPerform all assigned duties required to ensure a clean and safe production facility\nEnsure personal hygiene is acceptable under standards set by Cure before performing any production activities by washing hands, wearing a hair net, changing clothes\nComplete the sanitation of all production equipment and tools including workspace, lab equipment, containers, and appliances.\nMonitor, clean, and maintain all equipment and operate all equipment safely in its intended manner\nEnsure compliance at all times with all sanitation regulations and safety standards in the production of all products\nPerform duties as needed outlined in the daily, weekly, and monthly cleaning schedules\n\nRequirements\n\nPast experience in a highly regulated field producing pharmaceutical or nutraceutical products preferred\nEffective time-management skills and ability to multi-task\nAbility to work in a fast-paced, changing and challenging environment\nProficiency in windows-based software and Metrc experience a plus\n\nCompetencies:\nTechnically focused\nIntegrity and trust\nAttention to detail\nApproachability\nCommunication skills\n\nWorking Conditions:\nWhile performing the duties of this job, the employee is regularly required to perform grasping, talking, hearing, seeing and other repetitive motions.\n\nThe employee is frequently is required to stand for long periods of time, use hands for detailed work.\n\nSpecific vision abilities required by this job include close vision, distance vision, peripheral vision, depth perception and ability to adjust focus. This position requires the ability to occasionally lift products and supplies, up to 75 pounds (or more with assistance). Strong odors and varying room temperatures will occur on a daily basis. This position setting is in a general Lab setting.\n\nPosition Type/Expected Hours of Work\n\nThis is a full-time position, and hours of work and days will vary due to business needs. Some holidays and overtime maybe required.\n\nTravel\n\nNone.\n\nEEO\n\nOur organization does not discriminate against our employees or applicants because of race, color, religion, sex, pregnancy, national origin, ancestry, age, marital status, sexual orientation, veteran status, physical or mental disability, medical condition, or any other status or classification protected by applicable federal, state, and/or local laws. Equal employment opportunity will be extended to all persons in all aspects of the employer-associate relationships, including recruitment, hiring, advancement, compensation, benefits, training, promotion, transfer, discipline, layoff, recall and termination. Every reasonable accommodation will be made for qualified disabled employees/applicants.\n\nOther Duties\n\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.\n\nBy signing this job description, I acknowledge that I am able to perform the scope of duties listed with or without reasonable accommodation.","slug":"lab-technician-cannabis-industry-9c49bea1-a681-47b8-a625-ed518035334a","benefits":[],"selectedSkills":["Communication skills","Windows","Time management"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=Fpvq1DtP_Iwn8hww0VzJQclhZV-hhWVcMZZh00GTYQtELtwGIh2VpA"},{"position":"QC Chemist","labName":"US Cannalytics","location":"Bethlehem, PA","age":"1 day ago","type":"Full-time","salaryMin":"$20 ","salaryMax":" $27 an hour","jobDescriptionCopy":"US Cannalytics Pennsylvania is a rapidly-growing ISO 17025-accredited and PA State Certified laboratory in search of a motivated chemist to join our team as a QC chemist. We provide analytical and microbiological testing services to state-licensed medical cannabis cultivators and processors.\n\n\nQC CHEMIST RESPONSIBILITIES:\n\n\nThe QC chemist is responsible and accountable for the testing, quality control, and tracking of medical cannabis material. Ensures the safe, accurate, and timely testing of cannabis products.\n\n\nQC CHEMIST QUALIFICATIONS, must:\n\n\nHave a valid driver’s license\nBe at least 21 years old\nUndergo a background check\nCompleted Bachelor's Degree in a scientific field and have two years work experience in a professional medical/clinical/scientific laboratory\n\nESSENTIAL DUTIES\n\n\nFollow policies and procedures for the daily operations and fully comply with state medical marijuana regulations\nUse of aseptic technique to handle, prepare, and analyze samples\nExpertise in sample preparation and testing methods using analytical instrumentation (HPLC, LC-MS/MS, ICP-MS, GCMS)\nResponsible for inventory of supplies and cannabis tracking and destruction\nResponsible for accurate weighing and recording all product weights\nWorks in a timely manner and strives to improve quality and maintain accuracy\nPerforms all other tasks and duties as assigned, which may include cannabis sampling, transport, and sample preparation\n\nJob Type: Full-time\n\n\nJob Type: Full-time\n\n\nPay: $20.00 - $27.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nFlexible schedule\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nNight shift\nWeekend availability\n\nSupplemental Pay:\n\n\nBonus pay\n\nAbility to commute/relocate:\n\n\nBethlehem, PA 18017: Reliably commute or planning to relocate before starting work (Preferred)\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nGC-MS: 1 year (Preferred)\nLC-MS: 1 year (Preferred)\nICP-MS: 1 year (Preferred)\nHPLC: 1 year (Preferred)\n\nWork Location: One location\n","slug":"qc-chemist-acf53491-42c2-4fc6-8617-fbdf60a4754f","benefits":["Dental insurance","Health insurance","Paid time off","Flexible schedule","Vision insurance"],"selectedSkills":["Gas chromatography","Driver's License","Clinical laboratory experience","Bachelor's degree","Master's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=pvHALdhVPp-d3jGIWD5aGi8N45DhbtsB6uWq6Jd6NDKMandrbRnfow"},{"position":"Laboratory Sampler","labName":"ACS Laboratory","location":"Midway, FL","age":"2 days ago","type":"Full-time","salaryMin":"$23,000 ","salaryMax":" $31,000 a year","jobDescriptionCopy":"Job Title\n\n\nLaboratory Sampler\n\n\nReports to\n\n\nTransit Coordinator\n\n\n\\*Please note: this job description and title is not designed to cover or contain a comprehensive list of activities, duties, or responsibilities that are required of the employee for this job. Duties, responsibilities, activities and titles may change at any time with or without notice.\n\n\nJob purpose\n\n\nA Sampler establishes the chain of custody of products sampled between the customer and the laboratory, to ensure the sampling takes place using appropriate methods, clean tools, and protective wear.\n\n\nShift available\n\n\n7:00 am-3:30 pm Monday-Friday\n\n\nDuties and responsibilities\n\n\nEnsure the area is as clean and free from contaminants and filth as possible and sanitize tools;\nObtain both primary and duplicate samples from each batch;\nAssign a unique sample identifier to each sample and sample increment;\nFollow chain-of-custody protocols to ensure that sample integrity is such that it may be maintained from point of collection to receipt of samples at the laboratory;\nWear proper personal equipment items during the entire sampling process;\nProperly store and handle samples;\nProperly record in the Sample Field Log;\nSample Unpackaged Harvest Batches and Medical Cannabis Goods;\nComplete the Sampler Training Requirements;\nPackage samples in tamper-proof packaging;\nTransport tamper-proof packaging to the Laboratory;\nRandomly select samples for testing using the appropriate procedures;\nEnter order with required sample information into the laboratory's LIMs system;\nResponsible for developing positive customer relationships;\nPerform other duties as requested.\n\nQualifications\n\n\nMust be over 21 years old.\nMust demonstrate the following attributes:\nHonest and trustworthy\nRespectful\nPossess cultural awareness and sensitivity\nExceptional attendance & punctuality\nDemonstrated understanding required prior to active sampling.\nMust have excellent customer relationship management skills.\nMust be able to pass a Level 2 background screening.\nMust be able to pass drug/alcohol screening.\nCMTL (Certified Marijuana Testing Laboratory) Employees must not work for an MMTC (Medical Marijuana Treatment Center) , regardless of whether compensation is received; nor shall CMTL (Certified Marijuana Testing Laboratory) Employees receive any form of compensation or benefits of any kind from an MMTC while employed by a CMTL (Certified Marijuana Testing Laboratory) .\nCMTL (Certified Marijuana Testing Laboratory) Employees must have, at a minimum, a high school diploma from a state-approved and accredited public or private school, or its equivalent.\nMust be trained by the CMTL (Certified Marijuana Testing Laboratory) on the minimum requirements for sampling and the Standard Operating Procedures for sampling and security.\nProof of an acceptable driving record and a valid driver's license are required.\nExcellent written and oral communication skills.\nExcellent time management skills with ability to multi-task, effectively manage changing priorities and remain calm under pressure.\nAbility to demonstrate teamwork and collaborate effectively on projects and tasks with supervisor and co-workers.\nDemonstrate responsibility, accountability, and dependability toward assigned tasks and duties.\nAbility to demonstrate professional, positive attitude toward assigned tasks, projects and colleagues.\nAccredited laboratory environment requires strict adherence to safety, regulatory and Quality Assurance protocols.\nStrong attention to details.\n\nPhysical requirements\n\n\nPosition requires the ability to drive for long periods of time.\n\n\nJob Type: Full-time\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\nOvertime\nWeekend availability\n\nCOVID-19 considerations:\nMasks are required.\n\n\nEducation:\n\n\nHigh school or equivalent (Required)\n\nWork Location: On the road\n","slug":"laboratory-sampler-a9d77804-835b-4264-8263-7c064d313582","benefits":["Dental insurance","Health insurance","Paid time off","401(k)","Vision insurance"],"selectedSkills":["Driver's License","Communication skills","Time management","High school diploma or GED","21 years or older","Clean driving record"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=_dTtePZzQG6nkv8FM8cWpD0jCQPrpTl1uSb08uR5I3QYnGCDgTxl2g"},{"position":"Lab Technician","labName":"Kaycha Labs","location":"Knoxville, TN","age":"7 days ago","type":"Full-time","salaryMin":"$27,000 ","salaryMax":" $38,000 a year","jobDescriptionCopy":"Company Overview:\n\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\n\nJob Purpose:\n\n\nThe Lab Technician, Level I is responsible for working closely with our laboratory team to develop analytical skills and related experience. This position consists of many aspects from homogenizing, weighing and extracting samples, performing quality control checks, verifying various support equipment and properly disposing of all waste.\n\n\nEssential Duties & Responsibilities:\n\n\nExecute laboratory protocol and procedures under the supervision of the Lab Director.\nRegularly display good laboratory technique to avoid cross-contamination or misidentified samples.\nPerform sample preparation procedures including homogenization, weighing and liquid extraction.\nPerform QC duties as assigned, including LCS and matrix spikes.\nPerform qualitative and quantitative tests, as assigned.\nUtilize the LIMS system to create batches, enter sample prep information and maintain physical and electronic records.\nAdhere to ISO 17025 standards as well as state regulatory requirements.\nPromote a strong customer service culture while adhering to the highest safety and industry standards.\nOther duties and/or special projects as assigned.\n\nSkills, Abilities and Competencies:\n\n\nAbility to maintain an incredibly high degree of attention to detail and accuracy.\nStrong agility, engagement, and flexibility in an ever-changing environment.\nWorking knowledge of logging, organizing, and analyzing data.\nAbility to work in a dynamic, fast-paced deadline environment while successfully managing multiple tasks.\nStrong knowledge of Microsoft Office, including Excel, PowerPoint, and Word.\nWorking knowledge of standard laboratory protocol.\nExcellent communication skills and ability to effectively work, problem solve, and communicate with multiple levels of the organization.\n\nEducation & Experience:\n\n\nMinimum of Bachelor’s degree in chemistry, biochemistry or related field based on state requirements.\n0-1 year of lab experience.\nKnowledge of principles, terminology, practices, techniques commonly used in a laboratory setting preferred.\nExposure to the cannabis industry is a plus.\n\nOther:\n\n\nMust pass Level 2 background check.\nMust be at least 21 years old.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status\n\nJob Type: Full-time\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nFlexible spending account\nHealth insurance\nLife insurance\nPaid time off\nReferral program\nRetirement plan\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nMonday to Friday\nWeekend availability\n\nCOVID-19 considerations:\nFace masks required.\n\n\nApplication Question(s):\n\n\nWhat is your desired compensation?\nWhat is the best phone number and email to reach you at?\nDo you have a Chemistry degree?\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nLaboratory Experience: 1 year (Preferred)\n\nWork Location: One location\n","slug":"lab-technician-4a60d02e-d9c9-43af-8a5d-41164af74b96","benefits":["Dental insurance","Health insurance","Referral program","401(k)","Flexible spending account"],"selectedSkills":["Microsoft Excel","Microsoft Powerpoint","Laboratory experience","Communication skills","Microsoft Office","Bachelor's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=IIfdnOa6GiPYLqzJ9TM2LXmSUnV9XEHhX0BQ2WCn_3oPIAnLeG_LfQ"},{"position":"Sample Technician","labName":"North Coast Testing Laboratories","location":"Adrian, MI","age":"1 day ago","type":"Full-time","salaryMin":"$40,000 ","salaryMax":" $45,000 a year","jobDescriptionCopy":"North Coast Testing Laboratories of Michigan (NCTLM) is a licensed safety compliance facility serving Michigan’s regulated marijuana market. NCTLM analyzes a growing volume of cannabis flower and cannabis products for licensed producers in the state. Our team is looking for a Sample Technician to work in a high-throughput laboratory environment.\n\n\nAs a Sample Tech, to many of our clients you will be the face of NCTLM. The ideal candidate must possess extraordinary customer service skills and understand what that means. This position will require daily travel with a company vehicle to licensed facilities all over the state of Michigan to collect samples with our aseptic technique and bring them back to our team in the lab for analysis. This is typically done Monday through Friday on a normal business schedule, but flexibility is important as the schedule varies from day to day.\n\n\nResponsibilities & Duties:\n\n\nFollow all internal laboratory SOPs and Cannabis Regulatory Agency (CRA) regulations\nWork in a fast-paced production laboratory with high sample volume\nWork with inventory tracking software (METRC)\nWork cooperatively in a team environment\nDaily routine includes sample collection and transportation, and laboratory support duties\n\nJob Requirements:\n\n\nProficiency with electronic applications including MS Word, MS Excel, etc.\nExcellent attention to detail\nPassion for science and/or the cannabis industry\nExperience working with METRC is preferred, but not required\nAbility to communicate effectively\nValid drivers license\nAbility to drive for long stretches at a time (3+ hours)\nDexterity in hands and fingers to operate computer and sampling equipment\nImmaculate Customer service skills\nFlexibility in scheduling from day to day\n\nJob Type: Full-time\n\n\nPay: $40,000.00 - $45,000.00 per year\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\n\nSupplemental Pay:\n\n\nBonus pay\n\nWork Location: On the road\n","slug":"sample-technician-132f98ec-fac7-40f9-856f-c939279670d5","benefits":["Dental insurance","Health insurance","Paid time off","401(k)","Vision insurance"],"selectedSkills":["Customer service","Microsoft Excel","Driver's License","Microsoft Word"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=xUCe8hv2YluilFRyzqfG5bwDIctjzICZRIolo2b3DhONYsaUXjmzgQ"},{"position":"Lab Processing Technician","labName":"Curaleaf","location":"Avondale, CO","age":"7 days ago","type":"Full-time","salaryMin":"$17.00 ","salaryMax":" $20.25 an hour","jobDescriptionCopy":"The Processing Lab Technician will support lab professionals and inventory department in the Cannabis Industry. Their primary duties include setting up lab equipment, analyzing and cataloging samples and performing general clerical duties. The individual will work together to ensure that all cannabis, from seeds to finished products, is tagged, logged, tracked, and recorded in Metrc in accordance with Standards and Regulations governing the legal Colorado MED (Marijuana Enforcement Division). The Inventory team is responsible for ensuring operations at all Curaleaf, Inc. licensed facilities by identifying needs, delegating internally, and taking initiative as needed to maintain Metrc compliance. Lab Techs assist Inventory & Metrc teams as necessary in developing and implementing the strategies, processes and procedures needed to maintain Metrc compliance and testing, without causing a negative impact to the timeliness of cannabis production operations.\n\n\nEssential Duties and Responsibilities\n\n\n· Implement SOPs on Lab and Metrc operations for compliance with Metrc requirements\n\n\n· Prepare, classify, and label samples for testing using various laboratory equipment.\n\n\n· Conduct laboratory tests, analyze results, and document your findings.\n\n\n· Maintain all required laboratory records, providing documentation of all activities, results, and reports to management.\n\n\n· Report all waste per batch to state.\n\n\n· Report any mistakes to proper authorities and make notes to back up resolution reached.\n\n\n· Ensure use of correct CSV files and timely and accurate data reporting\n\n\n· Responsible for executing tagging, labeling, weighing, and counting functions\n\n\n· Assist in plant harvest and report weights per harvested batch to the State of Colorado.\n\n\n· Assist in processing plants making sure batches come down in the way they were harvested, and ensure barrels are labeled correctly and put with incorrect batches.\n\n\n· Send, receive, and reject transfers and inventory, including outgoing inventory and assist in getting samples for testing.\n\n\n· Assist as necessary with inventory cycle counts for all licenses and license types, including any necessary investigations.\n\n\n· Update/maintain/audit inventory for designated barn as product comes in, goes out or changes.\n\n\n· If the product is RF’d, assist in the process and ensure the product does not spoil in bags after use.\n\n\n· Disposing of waste and storing lab equipment after use.\n\n\n· Cleanup workspaces on a consistent basis keeping the barns neat and tidy daily.\n\n\n· Clean and sterilize equipment and work area.\n\n\n· Cross train during down time, assist in field, transplants, clone care, GH maintenance, etc.\n\n\n· Undertake basic administrative tasks such as filing and data entry.\n\n\n· Additional duties as assigned by supervisor.\n\n\nSkill, Experience & Education\n\n\n· Knowledge of Colorado MED Regulations.\n\n\n· Familiar with Industry best practices.\n\n\n· Previous cannabis experience preferred\n\n\n· Coursework or a degree in the Sciences preferred\n\n\n· Proficiency with computers, especially Microsoft Excel or Google Sheets.\n\n\n· A critical thinker with strong attention to detail.\n\n\n· Excellent verbal and written communication skills.\n\n\n· Outstanding analytical abilities.\n\n\n· Ability to work independently or with a team.\n\n\n· Able to stay focused when working on multiple tasks at a time\n\n\n· Able to perform at a rate consistent with production standards.\n\n\n· Must have a valid driver’s license and dependable transportation.Able to drive to other locations.\n\n\n· Demonstrate ability to consistently meet productivity and performance requirements.\n\n\n· Demonstrate professional and respectful demeanor towards others.\n\n\n· Problem solving and decision-making skills\n\n\n· Attention to quality, compliance, and safety.\n\n\n· Able to see, hear, and communicate basic operational and safety instructions.\n\n\nPhysical Requirements\n\n\n· Frequent sitting, standing, and walking, which may be required for extended periods of time and may involve climbing stairs and walking up inclines and on uneven terrain.\n\n\n· Able to walk on uneven surfaces, kneel, bend, reach, rotate, and stoop on an intermittent to regular basis daily.\n\n\n· Able to climb and work on a ladder or mechanical lift as necessary for prolonged time.\n\n\n· Able to lift and move up to 50 pounds consistently.\n\n\n· Able to perform manual dexterity sufficient to reach/handle items, work with fingers.\n\n\n· Willingness and ability to wear gloves, mask, eye protection, head protection, ear protection, sun protection, pest determent protection on a consistent basis.\n\n\nWork Environment\n\n\n· Work in a fast-paced production setting\n\n\n· Working in a barn, greenhouse and field with a wide temperature and humidity range.\n\n\n· Work in muddy or wet conditions during harvest season.\n\n\nAdditional Requirements\n\n\n· Current Colorado MED Occupational Badge is required. Employees are responsible for keeping badge current and renewal.\n\n\n· Consistent on-time attendance for all scheduled shifts.\n\n\n· Prepared for full 40-hour week working scheduled shifts or weeks over 40 hours during peak times, including longer days and weekends with little advance notice to complete daily and weekly objectives.\n\n\nThe incumbent must be able to perform this job safely, without endangering the health or safety of themselves or others. Reasonable accommodation may be made to enable individuals with disabilities to perform the essential functions.\n\n\nJob Type: Full-time\n\n\nPay: $17.00 - $20.25 per hour\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nEmployee discount\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\n\nAbility to commute/relocate:\n\n\nAvondale, CO 81022: Reliably commute or planning to relocate before starting work (Required)\n\nApplication Question(s):\n\n\nWhat is your desired hourly compensation rate in this position?\n\nEducation:\n\n\nHigh school or equivalent (Required)\n\nExperience:\n\n\nLaboratory: 1 year (Required)\n\nWork Location: One location\n","slug":"lab-processing-technician-394ce1b8-8a31-44c5-b473-617925c65262","benefits":["Dental insurance","Employee discount","Health insurance","401(k) matching","Paid time off"],"selectedSkills":["Analysis skills","Microsoft Excel","Driver's License","Laboratory experience","Communication skills","High school diploma or GED","US work authorization","Reliable transportation"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=nkSJBot5bBMUo5pOZr2QV6-N4CJloqOlVizNLGvjg_Ta_cRWVSkiew"},{"position":"Field Technician","labName":"LabPlex","location":"Long Beach, CA","age":"1 day ago","type":"Full-time","salaryMin":"$16 ","salaryMax":" $20 an hour","jobDescriptionCopy":"Who We Are:\n\n\nLabPlex, Inc. is a new Cannabis Testing Lab located in Long Beach, CA. Our leading testing approach provides in-depth data to help our clientele introduce cleaner and safer products into the California marketplace. LabPlex not only offers state of the art testing for cannabis distributors, manufacturers, cultivators, and micro-businesses, we also act as an educational liaison of industry standards for our clients.\n\n\nPosition Summary:\n\n\nThis is for a full-time position for a Cannabis Field Sampling Technician. The Field Sampling Technician role is a key position responsible for collecting and documenting cannabis samples at client sites and bringing them to the lab. Great customer service, attention to detail, and reliability are a must for this important role. This position has potential for advancement.\n\n\nWhat You Will Do:\n\n\nCollect field samples of cannabis products at client sites in accordance with state regulations and company procedures\nAccurately record sample information, taking great care to accurately record batch numbers and all details required for transport manifests\nFollow detailed procedures to ensure cleanliness and avoid contamination of samples being collected. This is essentially a mobile laboratory position.\nWeigh samples with a field balance and record sample weights.\nInput data into company ordering and tracking system and double-check for accuracy\nDrive to client sites and return samples to the laboratory all over Southern California\nMaintain Company owned vehicle that is used for sample collections\nDriving for multiple hours at a time\nProvide excellent customer service\nProvide excellent customer service\nBuild trust and rapport with clients\nWork efficiently and effectively under time constraints\nMaintain client confidentiality\nFollow safety procedures\n\nQualifications:\n\n\nAccuracy and attention to detail\nMust be organized\nMust be punctual\nCustomer Service experience\nExperience working in a fast-paced environment\nExcellent written and verbal communication skills\nProficient in the use of email, including Microsoft Outlook\nMust have valid California Drivers License and clean driving record Preferred\nUnderstanding of aseptic technique\nExperience in a cannabis testing laboratory or cannabis industry Knowledge of the Bureau of Cannabis Control regulations\nKnowledge of METRC\nExperience with various software including group messenger apps and Excel\n\nEducation:\n\n\nAssociates or Bachelors degree in chemistry or biology highly preferred 1 or more years of laboratory experience\n\nWork Location:\n\n\nOn the road\n\nNote to Applicants:\n\n\nThis business supports equal opportunity in the cannabis industry by participating in the City of Long Beach Cannabis Social Equity Program. The Cannabis Social Equity Program requires businesses to hire low income individuals from communities most impacted by the historical criminalization of cannabis. The City of Long Beach is currently accepting applications to verify individuals as Social Equity Employee candidates. Individuals who qualify may be eligible for special consideration in the hiring process for this business. To find out if you qualify for the Cannabis Social Equity Program, please visit www.LBCannabisJobs.com\n\n\nWork Remotely\n\n\nNo\n\nJob Type: Full-time\n\n\nPay: $16.00 - $20.00 per hour\n\n\nBenefits:\n\n\nFlexible schedule\nHealth insurance\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nOn call\n\nSupplemental Pay:\n\n\nBonus pay\n\nWork Location: On the road\n","slug":"field-technician-552ad456-7c23-407e-a7f8-8f4f95051cbb","benefits":["Health insurance","Opportunities for advancement","Flexible schedule","Vision insurance"],"selectedSkills":["Customer service","Microsoft Excel","Driver's License","Microsoft Outlook","Laboratory experience","Bachelor's degree","Associate's degree","Clean driving record"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=fSdK9w0tjB4_vh-M5yBFnSVOrRZoYK62fgOTIA-Jf_wMrZYt7rMFIg"},{"position":"Lab Technician","labName":"US Cannalytics","location":"Bethlehem, PA","age":"1 day ago","type":"Full-time","salaryMin":"$15 ","salaryMax":" $19 an hour","jobDescriptionCopy":"The laboratory technician is responsible and accountable for the testing, quality control, and tracking of cannabis material. The laboratory technician will ensure the safe, accurate, and timely testing of cannabis products.\n\n\nQUALIFICATIONS, must:\n\n\nHave a valid driver’s license\nBe at least 21 years old\nHave High School Diploma\n(Preferred) Lab Experience or Science Education\nPass Background Check\n\nESSENTIAL DUTIES\n\n\nFollow policies and procedures for the daily operations and fully comply with state medical marijuana regulations\nPrepare samples for mandated state testing\nResponsible for inventory of supplies and cannabis tracking and destruction\nResponsible for accurate weighing and recording all product weights\nWorks in a timely manner and strives to improve quality and maintain accuracy\nPerforms all other tasks and duties as assigned, which include cannabis sampling and transport\n\nThis position may require daily traveling/driving and attention to detail.\n\n\nJob Type: Full-time\n\n\nWork Location:\n\n\nOne location\n\nWork Remotely\n\n\nNo\n\nJob Type: Full-time\n\n\nPay: $15.00 - $19.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nFlexible schedule\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\nMonday to Friday\nWeekend availability\n\nSupplemental Pay:\n\n\nBonus pay\n\nEducation:\n\n\nHigh school or equivalent (Required)\n\nExperience:\n\n\nLab: 1 year (Preferred)\n\nWork Location: One location\n","slug":"lab-technician-fef48d45-5c6f-47e4-a3a4-559e897bf4e9","benefits":["Dental insurance","Health insurance","Paid time off","Flexible schedule","Vision insurance"],"selectedSkills":["Driver's License","Laboratory experience","High school diploma or GED","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=s16D-RlVM0zte6MtPkRslC6IAc7NCDoMXEDEkGxNsS3PqWjhIqo2yQ"},{"position":"Field Technician","labName":"Viridis North LLC","location":"Bay City, MI","age":"8 days ago","type":"Full-time","salaryMin":"$17.00 ","salaryMax":" $21.50 an hour","jobDescriptionCopy":"LOCATION: Bay City, MI\n\n\nREPORTS TO: Field Technician Supervisor\n\n\nThe mission of Viridis North is to ensure health and safety within the cannabis industry by testing cannabis products for potency and purity, and to report results of this testing to consumers, manufacturers and regulatory agencies. As a growing company, we are looking for a full-time Field Technician with cannabis industry experience or experience in random sampling protocols, sample intake, sample tracking and sample storage.\n\n\nESSENTIAL DUTIES AND RESPONSIBILITIES:\n\n\nSample collection, receipt, accessioning and storage.\nFamiliarity/compliance with the chain-of-custody process.\nFamiliarity/compliance with personal protective equipment and its use for safety and in the prevention of cross-contamination of collected samples.\nAssisting scientific staff with ensuring test results are reported through the laboratory information management system to clients, government agencies and other involved or mandated parties.\nAssisting with maintenance of laboratory records and documentation.\nAssisting clients, government agencies and other involved or mandated parties with requests related to laboratory testing or results.\nAssisting with meeting accreditation requirements.\nAssisting with research or inquiries as requested.\nOther duties as assigned.\n\nEDUCATION AND EXPERIENCE REQUIRED:\n\n\nMinimum of high school diploma or relative Military experience.\nOne years’ experience in an analytical or academic laboratory setting and/or two years' experience in cannabis industry.\nFamiliarity with data entry and throughput.\n\nCOMPENSATION AND BENEFITS PACKAGE:\n\n\nSalary negotiable and commensurate with experience and education (range $17.00 - $21.50/hour). This position is eligible for a matching 401K program and health care benefits.\n\n\nApplicant screening will include a background check. This position requires compliance with random drug testing and on-going random drug testing.\n\n\nApplicants must be at least 21-years-old to be eligible for employment within Michigan's Cannabis industry.'\n'\nWork Location:\n\n\nOne location\n\nWork Remotely\n\n\nNo\n\nJob Type: Full-time\n\n\nPay: $17.00 - $21.50 per hour\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nOvertime\nWeekend availability\n\nCOVID-19 considerations:\nCompany provided PPE\n\n\nEducation:\n\n\nHigh school or equivalent (Required)\n\nWillingness to travel:\n\n\n75% (Required)\n\nWork Location: One location\n","slug":"field-technician-54ff6cb7-ec0a-473e-9c75-26189751fd2a","benefits":["Dental insurance","Health insurance","401(k) matching","Paid time off","401(k)"],"selectedSkills":["Military","Laboratory experience","Data entry","High school diploma or GED","21 years or older","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=5&job=d3y_UyV7VSFNavujY9JT-zJnJt6UmpIoPoi7z722e5RQlN9JkMB_dA"},{"position":"Cannabis Post Processing Technician - Extraction","labName":"Grow Op Farms","location":"Spokane Valley, WA","age":"7 days ago","type":"Full-time","salaryMin":"$32,000 ","salaryMax":" $43,000 a year","jobDescriptionCopy":"Grow Op Farms, the leading I-502 producer by volume of top-shelf cannabis in the state of Washington, is hiring a Post Processing Technician for their Spokane Valley Location. This is a Full-Time position in a high-volume, fast paced, production driven environment.\nThe ideal candidate is organized, good with direction and follow through, will have excellent verbal and written communication as well as the ability to multi-task to stay on track. Full-Time schedules consist of 40 hours per week with the opportunity for overtime to meet business needs. Affordable benefits offered within 90 days: medical, dental, vision, accident, and life.\n\nFor consideration, please submit a resume and cover letter in addition to your completed online application. A resume does not replace application work history.*\nJob Summary\nThis position is responsible for assisting with the clerical and administrative duties of the Post Process. This position is expected to help facilitate meeting organizational standards and target goals for department. Supports and adheres to company's Standards of Conduct & Discipline.\nJob Duties/Responsibilities\nTo perform this job successfully, an individual must be able to satisfactorily perform each of the essential duties/responsibilities listed below. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential duties/responsibilities of this job.\n\n\nPerforms the Post Processing steps to SOP to get products ready for packaging. Different product types require vastly different operational procedures and steps.\nPerforms testing procedures and submission of weekly testing; prepares samples for testing.\nEnsures accurate product conversions through state approved tracking software and splits lots when there are multiple product types from a single lot number.\nCommunicates with management to properly prioritize post processing activity.\nMonitors product, checks work orders to ensure purchased, split, or toll processing is tracked properly.\nDisposes of waste and maintains waste and designated area according to Standard Operating Procedures.\nManipulates and refines crude extract per SOP.\nAssists in post processing activities and the setup, breakdown, and regular operation of the extraction room(s) as needed.\nMaintains a clean and organized lab area and work space; performs continuous safety checks on machines and equipment which includes tools; notifies the Post Processing Lead of maintenance needs.\nUnderstands laboratory equipment and processes required to make all product types and manipulate crude hydrocarbon wax into many diverse product types.\nEmphasizes safety in all laboratory activities and responsible for employee safety and adherence to safety measures, process, and procedures.\nReceives and communicates instructions, job assignments and updates verbally and non-verbally from Laboratory Director, Leads, fellow technicians, instructive lists, SOP, email, and other department electronic communication.\nPerforms continuous safety checks on equipment and notifies management of maintenance needs.\nLogs material information in a designated tracker.\nEnsures material condition is maintained.\nResponsible for maintaining and cleaning equipment at regular intervals.\nAssists with Research & Development projects as assigned. Performs all other duties/responsibilities as necessary or assigned.\nJob Qualifications\nTo perform this job successfully, an individual must meet the minimum qualifications listed below. These qualifications are representative of the knowledge, skill and/or ability required to perform this job.\n\n\nMust be 21 years old or older\nEducation/Experience: to perform this job successfully, an individual must have:\n\n\nHigh School Diploma or GED.\nCannabis extractions concepts and market knowledge is preferred.\nPhysical Abilities: to perform this job successfully, an individual must be able to:\n\n\nRegularly sit or stand for long periods of time doing repetitive tasks with hands, pull/push, carry up to 25 pounds, and grasp.\nFrequently walk, reach, and taste, or smell.\nOccasionally climb, stoop/crouch, crawl, carry up to 50 pounds, talk, or hear.\nClearly see 20+ feet, with or without corrective lenses and differentiate between colors (no color blindness)\nMental & Other Skills/Abilities: to perform this job successfully, an individual must have:\n\n\nAdaptability: ability to adapt to changes, delays or unexpected events in the work environment; ability to manage competing demands and prioritize tasks; ability to change approach or method to best fit the situation.\nAnalytical Ability: ability to maintain focus for extended periods of time.\nComputer/Technical Ability: working knowledge of Word Processing software, Spreadsheet software and labeling machines.\nDependability: ability to follow instructions, both in written and verbal format; ability to respond to management direction; ability to complete tasks on time or notify the appropriate person with an alternate plan when necessary.\nInterpersonal Skills: ability to maintain satisfactory relationships with others, excellent customer service skills and a good overall understanding of appropriate human relations.\nJudgment: ability to make prudent and timely decisions; ability to exhibit sound and accurate judgment; ability to explain reasoning for decisions.\nLanguage Ability: ability to read and comprehend simple instructions, short correspondence, and memos. Ability to write simple correspondence; ability to effectively present information in one-on-one and small group situations to customers, clients, and other employees of the organization.\nMathematical Ability: ability to add, subtract, multiply, and divide in all units of measure, using whole numbers, common fractions, and decimals.\nMotor Coordination: the ability to coordinate eyes, hands, fingers, and feet accurately and handle precise movements.\nProblem Solving Ability: ability to identify and/or prevent problems before they occur; ability to formulate alternative solutions to problems when necessary; ability to transfer learning from past experiences to new experiences of similar nature.\nQuality Management: ability to complete duties, on time and with absolute precision, at least 95% of the time; ability to edit the accuracy and thoroughness of one's work as well as the work of others; ability to constructively apply feedback to improve performance; ability to generate ideas to improve and promote quality in work.\nReasoning Ability: ability to apply common sense understanding to carry out detailed but uninvolved written or oral instructions; ability to deal with problems involving a few concrete variables in standardized situations.\nWorkplace Environmental Conditions\nWhile performing the essential duties/responsibilities of this job, the employee will be:\n\n\nNoise Conditions: exposed during a shift to constant or intermittent moderate to loud noise levels.\nInjury Exposure: occasionally exposed to workplace hazards or to potential injuries.\nAtmospheric Exposures: exposed to dusts, fumes, vapors, or mists that could affect the occupational health of the employee.\nToxic Chemicals: may be exposed to some toxic or caustic chemicals.","slug":"cannabis-post-processing-technician-extraction-915efa6e-0180-45ac-983b-755e08792c91","benefits":["Dental insurance","Health insurance","Vision insurance"],"selectedSkills":["Word processing","Analysis skills","Customer service","Communication skills","High school diploma or GED","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=5&job=jhznyEYdH7lR6_iqhVldh4K1JXX7K9K7UafGwMTXOnNiSzLEK_NL_Q"},{"position":"Procurement Associate","labName":"Kaycha Labs","location":"Fort Lauderdale, FL","age":"7 days ago","type":"Full-time","salaryMin":"$40,000 ","salaryMax":" $45,000 a year","jobDescriptionCopy":"Company Overview:\n\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\nJob Purpose:\n\n\nThe Procurement Associate is responsible for supporting the purchasing department with a variety of clerical tasks. Responsibilities include, but are not limited to purchasing lab equipment and supplies, coordinating with suppliers and ensuring goods arrive on time and suppliers are paid.\n\n\nEssential Duties & Responsibilities:\n\n\nReceive weekly lab equipment order requests from each lab and coordinate with lab staff.\nResponsible for ordering supplies (consumables, chemicals, break room supplies, parts, furniture, etc.)\nSet up new labs with basic lab services (waste pick up, gas delivery, water services, uniforms, lab coat service, etc.)\nSet up accounts with new vendors, complete/execute paperwork for credit terms with accounting assistance.\nEnsure vendors have accurate/updated billing email contacts based on shipping location.\nCommunicate with vendors about product availability, lead time, order status, changes, cancellations, accuracy of pricing, etc.\nOutsource products as necessary.\nResponsible for issuing purchase orders for supplies and equipment through Quickbooks.\nExecute payment when immediate payment is required for processing.\nTrack order status through shipment, delivery and fulfillment daily, provide labs with delivery/tracking updates and add links to applicable spreadsheets.\nPlace orders for misc. admin/break room needs as requested by each location (toilet paper, coffee, pens, paper, computer supplies, etc.)\nProvide accounting dept. With final invoices and receipts for orders placed.\nCross reference and invoices to ensure accuracy of goods delivered.\nServe as the primary point of contact for lab staff on order inquiries.\nPerform daily buying duties as needed for urgent needs.\nContact suppliers for expedited delivery as needed.\nResponsible for designing and executing orders for company merchandise (T-shirts, Lanyards, Pens, etc.)\nOther duties and/or projects as assigned.\n\nEducation & Experience:\n\n\nHS Diploma or GED required.\n1+ year of purchasing and inventory experience preferred.\nFamiliarity with Quickbooks or Sage X3.\nFamiliarity with inventory management and advanced supply chain management concepts.\nProven experience of purchasing techniques, contracting, and negotiation procedures preferred. .\nProven experience in vendor management process including vendor relationships preferred.\nProficiency in Microsoft Office and with business application software, purchasing, and resource planning systems.\n\nSkills, Abilities and Competencies:\n\n\nExcellent communication, interpersonal, and negotiation skills.\nStrong analytical thinking and problem-solving skills.\nAbility to prioritize and manage multiple priorities/deadlines and shift priorities as necessary. Uses time effectively.\nMust have strong problem solving, organizational and analytical skills.\nAbility to effectively present information and respond to questions from suppliers, customers, management and inter-department staff.\nCapable of working with internal staff from other departments in a proactive and constructive manner.\nAbility to provide efficient, timely, reliable and courteous service to customers.\nAbility to quickly adapt to a rapidly changing work environment.\nTeam player with strong organizational skills.\n\nOther:\n\n\nMust pass Level 2 background check.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.f.\n\nEssential Functions:\n\n\nThe physical demands described here are representative of those that an employee must meet to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nWhile performing the duties of this job the employee is frequently required to stand, handle or feel, to speak, and to hear. The employee is occasionally required to walk, sit, reach with hands and arms, bend, kneel, crouch, or crawl. The employee must frequently lift and/or move up to thirty-five (35) pounds.\n\n\nSpecific vision abilities required for this job include close (proximity) vision, depth perception, and the ability to adjust focus.\n\n\nWork Environment:\n\n\nThe work environment described here is representative of that which an employee may encounter while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nThe standard analytical laboratory environment is one in which potential health hazards do exist. Administrative, operations, technical, and professional staff are expected to safely operate in accordance with applicable and appropriate health and safety policies and procedures, as prescribed by the applicable Kaycha manuals and policies and/or federal, state, or local standards.\n\n\nLaboratory staff can be expected to work in areas where hazards associated are with, but not limited to, airborne pathogens. Biological materials, hazardous substances, and radioactive material exist and are handled. Appropriate training is provided regarding these hazards and staff are expected to adhere to all health and safety policies at all times, whether they are in writing or verbalized by a supervisor.\n\n\nThe above is intended to describe the general content of and requirements for the performance of this job. It is not to be construed as an exhaustive statement of duties, responsibilities, or physical requirements. Nothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions\n\n\nJob Type: Full-time\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nEmployee discount\nFlexible spending account\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nReferral program\nRetirement plan\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nMonday to Friday\n\nApplication Question(s):\n\n\nBest email and phone number to reach you at?\nDoes our compensation range ($40K - $45K) align with your salary expectations?\n\nEducation:\n\n\nHigh school or equivalent (Preferred)\n\nExperience:\n\n\nProcurement: 2 years (Preferred)\n\nWork Location: One location\n","slug":"procurement-associate-c470a0d3-5cc0-4484-b04a-07bd5c2dec6e","benefits":["Health savings account","Dental insurance","Employee discount","Health insurance","Referral program"],"selectedSkills":["Sage","Supply chain management","Vendor management","Procurement","Communication skills","High school diploma or GED","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=5&job=oSL5x2vwnjh-QPob2HAfk8bqo8nsZJht56sV6irjItZ6NEatLcgHAA"},{"position":"Inside Sales Representative","labName":"Medicinal Genomics Corp.","location":"Beverly, MA","age":"5 days ago","type":"Full-time","salaryMin":"$55,000 ","salaryMax":" $70,000 a year","jobDescriptionCopy":"Bring DNA Technology Expertise to Cannabis\n\n\nMedicinal Genomics is helping growers and researchers identify contamination and desirable traits, leading to healthier and more productive crops. Cannabis genomics will help drive sustainable productivity and offer solutions to ensure safe, consistent and effective breeding of cannabis. MGC was the first company to sequence the cannabis genome; our unique knowledge of cannabis and microbial genetics has enabled us to develop solutions that are revolutionary steps forward in addressing the primary unmet needs of medicinal cannabis cultivators and quality control laboratories. This is an exciting opportunity to join an early-stage company in a rapidly growing market. We are looking for an Inside Sales Representative.\n\n\nInside Sales Representative\n\n\nFind, develop, and grow new business accounts including growing existing revenue streams, supporting Field Sales Representatives, and assisting with administrative tasks.\n\n\nDuties and Responsibilities\n\n\nBe a proactive, contributing member of the sales team, help target and close deals.\nEngage with potential new customers through cold calls, emails and leads in Hubspot.\nProvide excellent customer service by following through with prompt solutions to all customer inquiries.\nEffectively work and communicate with the sales team, marketing and other departments.\nRigorously document communications and keep up to date the customer relationship management.\nSourcing new sales opportunities through inbound lead follow-up and outbound phone cold calls and emails.\nGenerate new leads for sales reps with growers, cannabis testing labs and large industrial cultivators.\nProactively research new state licenses /Regulations and other potential grows / opportunities.\nDevelop and propose bi-annual business plans for the territory, focusing on quarterly and annual sales objectives in accordance with overall Sales and Marketing plans.\nLocate new potential customers via prospecting, cold calling and setting up appointments with key decision makers.\nQualifying leads from digital campaigns, conferences, references, trade shows, etc.\nRouting qualified opportunities to the appropriate sales executives for further development and closure.\nMaintain and expand your database of prospects within your assigned territory.\nTracking weekly, monthly, and quarterly performance and sales metrics.\nFollow up on new leads and referrals generated through marketing activities.\nAttend conferences, trade shows and seminars as required.\nProvide exceptional customer service and technical support.\n\nJob Type: Full-time\n\n\nPay: $55,000.00 - $70,000.00 per year\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nFlexible spending account\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\nMonday to Friday\n\nSupplemental Pay:\n\n\nCommission pay\n\nAbility to commute/relocate:\n\n\nBeverly, MA 01915: Reliably commute or planning to relocate before starting work (Preferred)\n\nWork Location: One location\n","slug":"inside-sales-representative-0d9a1ba0-9b78-49ca-a72c-682e2005ab80","benefits":["Paid time off","Dental insurance","401(k)","Health insurance","Vision insurance"],"selectedSkills":["Genetics"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=5&job=dO5g4rLNPeZbnIyYDv4aoAq-fHx_Te4BzK7BvGbyl--YONL3ZUxvPA"},{"position":"Experienced Sales Representative and Account Manager","labName":"Pinnacle Testing and Specialty Laboratory","location":"Akron, OH","age":"2 days ago","type":"Full-time","salaryMin":"$45,000 ","salaryMax":" $55,000 a year","jobDescriptionCopy":"Pinnacle Laboratories\n\n\nFull Job Description\n\n\nWe are a full-service cannabis testing lab offering state-mandated testing services to Ohio’s cannabis cultivators, processors and manufacturers to ensure safety and accurate labeling of products for medical use.\n\n\nPinnacle Laboratory is looking for an experienced Sales and Customer Relationship person to grow the laboratory testing capabilities through networking, collaborations, introductions, contacts, relationships, etc. Candidate will work with new and existing accounts to sell testing packages (pesticide, potency, heavy metals, etc) for Ohio testing to ensure products are safely tested prior to sale to dispensaries.\n\n\nWhat we are looking for:\n\n\nWe are looking for self-starters and leaders who are willing to work with us on the ground up in this new industry to explore uncharted territories in the science analytical field. We are looking for contributors and team players willing to break into the forefront with us in this once in a lifetime opportunity and new industry.\nThe ideal candidate has knowledge of the cannabis industry (CBD and hemp experience is also highly valued), and will be considered successful through measurement and results being gauged by “signed client deals”.\nProactive proven methods that return results.\n\nRequired Knowledge and Skills\n\n\nPersuasive selling, problem-solving; planning/organizing; proficiency in MS office; financial acumen; excellent written and verbal communication; excellent negotiator; exhibits independence, and resiliency\nSuccessful track record in driving results, motivating teams, and cross-functional partnership\nExperience building pricing structures that maximize profitability\nAbility to successfully navigate complex and changing business environments\nDemonstrated ability to persuade and influence others (strong negotiation skills)\nAbility to communicate effectively across all levels of the organization (internal and external)\nSelf-motivated, resourceful, independent, and efficient\nProven ability to achieve success in a start-up environment\nAbility to comprehend basic financial reports and Profit & Loss Statements\n\nRequirements:\n\n\nA four-year degree with a focus in Business or Marketing is preferred\nCannabis industry experience in a licensed operation/facility is strongly preferred\n3+ years of sales experience\nMust be 21+ years of age\nMust have clean driving record\nExcellent written and verbal communications and negotiations skills\nProficient in Microsoft Office, specifically Word, Excel, Outlook, PowerPoint, and SharePoint\nMust pass any and all required background checks\nMust be and remain compliant with any and all legal or company regulations for working in the industry\n\nGeneral Duties\n\n\nMake initial contact with clients through calls, emails and visits to client sites.\nUnderstand current and prospective clients’ needs, explain the laboratory’s services, and suggest solutions to meet their needs.\nAttend networking events to meet prospective clients.\nMaintain all communication records with clients and prospects and provide updates to management.\nManage accounts by providing customer service including maintaining timely and professional communication with clients and addressing customer complaints.\nTravel to client sites to pick up samples may be required.\nAdhere to laboratory’s policies and state cannabis regulations regarding testing.\nStay up to date on laboratory offerings, relevant regulations and company policies, industry trends.\nListen actively to client feedback and pain points, suggest solutions, and provide feedback to internal company management.\n\nJob Type: Full-time\n\n\nPay: $45,000.00 - $55,000.00 per year\n\n\nBenefits:\n\n\n401(k) matching\nDental insurance\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nMonday to Friday\nNo nights\nNo weekends\n\nExperience:\n\n\nSales: 3 years (Required)\n\nWillingness to travel:\n\n\n50% (Required)\n\nWork Location: One location\n","slug":"experienced-sales-representative-and-account-manager-11a95571-43b2-43f3-9611-824d5957e8eb","benefits":["Health savings account","Dental insurance","Health insurance","401(k)","401(k) matching"],"selectedSkills":["Microsoft Excel","Sales","Microsoft Powerpoint","Communication skills","Microsoft Office","Bachelor's degree","Clean driving record","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=5&job=SSebyhMK8zTFqm2o2aH6KF2NBTy_hwJVf5E7VsAWrw5EIlnsi-LqCQ"},{"position":"Account Support Specialist","labName":"Green Leaf Lab","location":"San Francisco Bay Area, CA","age":"5 hours ago","type":"Full-time","salaryMin":"$20 an hour","jobDescriptionCopy":"THE COMPANY: Green Leaf Lab is the nation's first licensed and accredited cannabis analytical laboratory. We are a full-service, production oriented, cannabis and hemp laboratory using cutting-edge technology to characterize the chemical, physical, biological, and microbial properties of a wide range of samples submitted for regulatory compliance and operational purposes. We are team oriented and focused on excellent service. We are looking for a Account Support Specialist to join our team.\n\n\nJOB SUMMARY: The Account Support Specialist is responsible for working with the Sales Team to sample products and/or hemp. The position requires a keen attention to detail, exceptional time management skills, an ability to communicate with team members and clients, along with a positive enthusiastic attitude. The position requires a substantial amount of driving.\n\n\nESSENTIAL DUTIES/KEY RESPONSIBILITIES:\n\n\nHave a thorough knowledge of Green Leaf Lab services\nSampling cannabis and hemp products for analytical testing \nAbility to correctly fill out all required sampling documentation with accuracy and attention to detail \nFollow stringent state and laboratory guidelines and methods when sampling \nCollect payments from clients \nExpedite the resolution of client requests, problems, and complaints \nMonitor competition by gathering current marketplace information \nLearn, understand, and follow policies and regulations \nAbility to multi-task and effectively manage time \nManage client scheduling needs \nAbility to communicate with team members\nTrack all activities daily in company CRM \nAbility to drive and drop off samples at Sacramento laboratory after sampling\nAbility to follow SOPs and company policies and guidelines\nPerform courier duties when required\nDriving \n\nQUALIFICATIONS:\n\n\nStrong knowledge of a wide variety of cannabis products preferred \nAbility to understand and follow Sampling SOP’s \nAccuracy and attention to detail \nEnthusiastic, energetic, can-do attitude \nProficient in social media, specifically Instagram \nCRM experience \nProficient with Microsoft Office (Excel, Word) \nSelf-Confidence and Professionalism \nHigh integrity and ethics \nAbility to express oneself via oral and written communications with clarity and professionalism.  \nProficient communicator and listener \nComfort working in high pressure fast paced environment \nAbility to be flexible and respond to changes in priorities \nExcellent relationship building skills \nMust be 21 years of age \nClean Driving Record \nValid State driver's license \nWillingness to submit to Background check \nAbility to work nights, weekends and long shifts \nFlexibility in work hours \nMust have DOT Medical Card (CA only) \nMust be able to perform night driving \nMust be able to drive for long periods of time \nAble to sit for long periods of time \nAble to stand for long periods of time\nAble to lift up to 50 pounds \n\nEDUCATION:\n\n\n2-year college degree or 1-year practical experience  \n\nJOB TYPE: Full-time, Non-Exempt.\n\n\nBENEFITS:\n\n\n· Dental insurance.\n\n\n· Health insurance.\n\n\n· Paid time off.\n\n\n· Vision insurance.\n\n\nSCHEDULE:\n\n\n· Monday-Friday.\n\n\n· Additional evening and weekend work as needed.\n\n\nWORK LOCATION:\n\n\n· Bay Area and surrounding areas\n\n\nCOMPENSATION: $20/HR\n\n\nJob Type: Full-time\n\n\nPay: $20.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\n\nEducation:\n\n\nBachelor's (Preferred)\n\nWork Location: On the road\n","slug":"account-support-specialist-e5310b9b-02ee-45c3-bf17-0d98e101d881","benefits":["Dental insurance","Health insurance","Paid time off","Vision insurance"],"selectedSkills":["Social media management","Microsoft Excel","Driver's License","CRM software","Time management","Bachelor's degree","Associate's degree","21 years or older","Clean driving record","DOT physical examination","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=5&job=0O-C-eZRTiSB8d6CTESujTSy42dkssJb8qE4VCkTZbAwU-uijL3jhw"},{"position":"Quality Assurance Technician","labName":"Liberty Health Sciences","location":"Gainesville, FL","age":"7 days ago","type":"Full-time","salaryMin":"$29,000 ","salaryMax":" $38,000 a year","jobDescriptionCopy":"DFMMJ Investments, LLC, d/b/a Liberty Health Sciences Florida, Ltd. is a Medical Marijuana Treatment Center that has been granted a license by the Florida Department of Health to cultivate, process, transport, and dispense low-THC cannabis, medical cannabis, and cannabis delivery devices pursuant to Florida Statutes.\n\nJOB SUMMARY:\nThe QA/QC Technician will work under direction of the Quality Manager to develop, implement, manage, and continually improve the Liberty Heath Sciences quality and product safety programs.\n\nCORE RESPONSIBILITIES:\nInspects in-process and/or finished products for conformance to quality assurance standards\nAssist in monthly GMP/Sanitation/Security inspections and follow up on corrective actions\nPerform Pre-operational checks including sanitation swabbing\nPerform quality checks on incoming materials\nSampling of raw materials\nAssist with document control and change management as necessary\nAssist in investigating consumer complaints by determining root cause, implementing corrective actions and preventive measures, responding to complaints in the required time-frame, and analyzing complaint trends.\nInitiate and conduct Corrective Action Preventive Action (CAPA) investigations.\nMaintain records for GMP training, including QPs, SOPs etc.\nEnsure all employees are trained on the procedures for their departments\nFollow all Good Manufacturing Practices as outlined in the QA Manual\nPerform other duties as needed and requested by the Quality Manager such as batch record and COA reviews as needed.\nRequirements\n\nDESIRED SKILLS & EXPERIENCE:\nMust be able to work independently and as a team\nQuality related experience in food, horticulture, pharmaceutical or other related field preferred\nBasic computer skills (Microsoft Word, Outlook, etc.)\nMust be over 21 years or older\nMust be able to pass a Level II Background Check\nWork authorization United States (Required)\n\nPhysical Demands\n\nMust be able to stand for extended periods of time, and safely lift up to 25lbs\nMust be able to wear required Personal Protective Equipment (PPE) for extended periods of time (i.e. gloves, lab coat, hair net)\nAppropriate grooming for work environment (no jewelry, hair must be tied back, no hair outside of PPE)\n\nPosition Type/Expected Hours of Work\n\nThis is a full-time position, open availability 40 hours.\n\nRequired Education and Experience\n\nLaboratory, Analytical Testing\n\nHigh School Diploma\n\nScience Degree Preferred\n\nBenefits\n\nMedical benefits, dental and vision on the first of the month after 60 days of employment.\n\nLiberty Health Sciences, LLC, provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability, genetics or veteran status. In addition to federal law requirements, Liberty Health Sciences, LLC complies with applicable state and local laws governing non-discrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.\n\nLiberty health Sciences, LLC expressly prohibits any form of workplace harassment based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, or veteran status. Improper interference with the ability of Liberty Health Sciences, LLC’s employees to perform their job duties may result in discipline up to and including discharge.","slug":"quality-assurance-technician-5567fdfc-23a3-4594-8d5a-bbbb121819bf","benefits":["Health insurance","Vision insurance"],"selectedSkills":["Microsoft Outlook","Horticulture","Computer literacy","Computer skills","Microsoft Word","High school diploma or GED","Background check","21 years or older","US work authorization"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=5&job=pRyAb8VvKr0gq4lODm6C34o37Gt1z9cvkkTFLDnkrm4NhAIRfoQJsQ"},{"position":"Sample Intake","labName":"Kaycha Labs","location":"Natick, MA","age":"5 days ago","type":"Full-time","salaryMin":"$29,000 ","salaryMax":" $38,000 a year","jobDescriptionCopy":"Company Overview:\n\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\n\nEssential Duties & Responsibilities:\n\n\nResponsible for the processing of customer samples for laboratory testing, following sample intake standard operating procedures and chain of custody guidelines.\nLog samples into laboratory information management systems (LIMS) and METRC to track sample traceability.\nPhotograph samples following aseptic guidelines using Logitech Webcam software.\nWork collaboratively with laboratory staff and management on the prioritization of samples to meet customer needs\nAssist customers with sample submission requirements following Massachusetts state regulations.\nIdentify sample intake issues and bring issues to the attention of management for quick resolution.\nAssist in ordering supplies for the laboratory.\nAssist in the disposition of samples using LIMS and METRC following Massachusetts state regulations.\nAnswer phones, while communicating clearly and professionally.\nCustomer facing responsibilities include nurturing relationships with existing and new customers.\nMust be comfortable working in a fast paced environment.\n\nSkills, Abilities and Competencies:\n\n\nExcellent communication skills and ability to effectively work, problem solve, and communicate with multiple levels of the organization.\nAbility to work in a dynamic, fast-paced deadline environment .\nAbility to maintain a high degree of attention to detail and accuracy.\nStrong agility, engagement, and flexibility in an ever-changing environment.\nWorking knowledge of logging data.\nProficiency working with Laboratory Internal Management and Customer Relations Management Systems.\n\nEducation & Experience:\n\n\nHigh school diploma or equivalent required.\nStrong understanding of standard laboratory protocol a plus.\nKnowledge of principles, terminology, practices and techniques is a plus.\nFood science and/pr environmental experience is a plus.\nExposure to the cannabis industry is a plus.\n\nOther:\n\n\nMust pass Level 2 background check.\nMust be at least 21 years old.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.\n\nThe above is intended to describe the general content of and requirements for the performance of this job. It is not to be construed as an exhaustive statement of duties, responsibilities, or physical requirements. Nothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions\n\n\nJob Type: Full-time\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nEmployee discount\nFlexible spending account\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nReferral program\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\n\nApplication Question(s):\n\n\nWhat is your desired compensation?\nBest email and phone number to reach you at?\n\nEducation:\n\n\nHigh school or equivalent (Preferred)\n\nExperience:\n\n\nCustomer service: 1 year (Preferred)\nData entry: 1 year (Preferred)\n\nWork Location: One location\n","slug":"sample-intake-742bbefa-fbfb-4a65-b8b0-ac270579d96b","benefits":["Health savings account","Dental insurance","Employee discount","Health insurance","Employee assistance program"],"selectedSkills":["Customer service","Communication skills","Data entry","High school diploma or GED","21 years or older","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=5&job=ZmlTDBBADr4hVRTrvVkCf2bDVZI4ROyjOkH9_krJFkxEcpdLzoHozw"},{"position":"Client Relations Specialist","labName":"Kaycha Labs","location":"Denver, CO","age":"7 days ago","type":"Full-time","salaryMin":"$18 an hour","jobDescriptionCopy":"Company Overview:\n\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\n\nJob Purpose:\n\n\nThe Client Relations Specialist will be responsible for customer relations, accounting and operations support. This position will also interface with multiple departments and customers. This role will primarily focus on lab operations support.\n\n\nEssential Duties & Responsibilities:\n\n\nAnswer phones and route calls to the appropriate party.\nGreet incoming visits and escort to appropriate areas.\nReceive, sort and distribute incoming mail.\nOrder office supplies and keep inventory of stock.\nDeliver deposit checks to accounting.\nCreate and process customer invoices.\nProcess credit card payments in Blackstone.\nCoordinate with clients on payment processing of sample orders.\nReceive all incoming work from internal and external clients and process work orders through the company Laboratory Information Management System (LIMS).\nPrepare and manage shipments with partner labs.\nSpecial projects and errands as needed, including transportation of packages to local shipping companies.\nResponsible for shipping and receiving of orders and supplies, which includes light lifting duty (packages up to 40 lbs)\nMaintain compliance with health and safety guidelines for a lab environment.\nOther duties and/or special projects as assigned.\n\nSkills, Abilities and Competencies:\n\n\nExcellent communication skills and ability to effectively work, problem solve, and communicate with multiple levels of the organization.\nAbility to work in a dynamic, fast-paced deadline environment while successfully managing multiple tasks.\nProficiency in Microsoft Office suite, including Excel, PowerPoint, and Word.\nStrong understanding of standard laboratory protocol.\nAbility to maintain an incredibly high degree of attention to detail and accuracy.\nStrong agility, engagement, and flexibility in an ever-changing environment.\nWorking knowledge of logging, organizing, and analyzing data.\n\nEducation & Experience:\n\n\nHigh School diploma or equivalent required. Higher level degree preferred.\n1+ years of experience working within a lab environment.\n1+ years of experience in sample collection and logging within a lab environment.\nProficient knowledge of MS Office Suite (Excel, Word, PowerPoint)\nQuickbooks experience a plus.\nOrganizes and handles multiple priorities simultaneously.\nCompletes work assignments within time and quality constraints\nExposure to the cannabis industry desired.\n\nOther:\n\n\nMust pass Level 2 background check.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.\n\nJob Type: Full-time\n\n\nPay: $18.00 per hour\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nEmployee discount\nFlexible spending account\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nMonday to Friday\n\nCOVID-19 considerations:\nFully vaccinated employees do not need to wear masks, unvaccinated employees required to wear a mask.\n\n\nApplication Question(s):\n\n\nWhat is your desired compensation?\nBest email and phone number to reach you at?\n\nEducation:\n\n\nHigh school or equivalent (Required)\n\nExperience:\n\n\nCustomer service: 1 year (Preferred)\n\nWork Location: One location\n","slug":"client-relations-specialist-0a9c9628-149c-4abf-a8bd-c4f391b751fc","benefits":["Dental insurance","Employee discount","Health insurance","401(k)","Flexible spending account"],"selectedSkills":["Microsoft Excel","Microsoft Powerpoint","Laboratory experience","Communication skills","Microsoft Office","High school diploma or GED","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=5&job=t7HCEN5tdq2hfsLU05I5kYB4CQ3VB7gx1z7zJGkay_fSeBbVSk2k0g"},{"position":"Front Desk Receptionist","labName":"rhino labs","location":"Norman, OK","age":"6 days ago","type":"Full-time","jobDescriptionCopy":"Job Description:\n\n\nThis position is for the role of General Laboratory Assistant at a locally-owned marijuana testing laboratory based in Norman Ok.\n\n\nTasks required for this position will include various administrative duties (front-desk, research, writing, and customer service), as well as light laboratory tasks (inventory, sample intake, sample preparation, data entry, and report writing).\n\n\nThis is a perfect job for a recent or soon-to-be science graduate with interest in developing skills in analytical chemistry, microbiology, molecular diagnostics, and/or laboratory operations. The right candidate will also be highly organized and detail-oriented, motivated to grow, quick to learn, personable and customer-oriented, and work well in a team. There is opportunity to grow in this position; qualified candidates will have the potential to train and move up as the business expands.\n\n\nMust have excellent customer service skills – including in-person, by phone, and by email. Ideal candidate is someone who has a science degree and is interested in growing a career in laboratory sciences. Writing, research, and graphic design skills are also valued.\n\n\nAs we are a small but growing team, our General Laboratory Assistant must be willing to wear multiple hats - versatility and flexibility are highly valued at our startup!\n\n\nIn your cover letter, please describe your experience working in laboratories and/or in teams, as well as why you are applying to this position. If you bring any startup experience or customer service experience, please mention this as well.\n\n\nKey Responsibilities:\n\n\nGeneral laboratory tasks: research, writing, inventory management, record maintenance and documentation, assistance with sample intake, preparation, and processing as needed\nAssist with analytical chemistry and/or molecular diagnostic laboratory tasks as needed\nCustomer service: answer phone calls, take messages, and coordinate customer communications\nVendor communications and coordination; scheduling, data entry, and record-keeping\nVisitor operations: monitoring, checking in, issuing badges, and monitoring logbook\nAssistant with customer-facing content creation as needed, including research and writing\nMaintain safe and clean administration area in compliance with company policies and procedures, including relevant rules and regulations\nContribute to team effort by completing additional tasks as needed\n\nSkills / Qualifications:\n\n\nBachelor’s in biology, chemistry, or related science (Preferred)\n2+ years of experience working or volunteering in laboratory or other regulated environment (Preferred)\nOrganized and able to effectively prioritize tasks and multitask efficiently as needed\nComputer skills (Microsoft Office and/or equivalent) and office skills (printers, scanners, etc.)\nWilling to learn about and understand federal and state regulations for the cannabis industry, including safety and privacy considerations\nAccording to state regulations, must be 21 years or older, able to pass a background check, and obtain required state registration.\n\nJob Type: Full-time\n\n\nPay: From $15.00 per hour\n\n\nSchedule:\n\n\n8 hour shift\n\nEducation:\n\n\nHigh school or equivalent (Preferred)\n\nExperience:\n\n\nCustomer service: 1 year (Preferred)\n\nWork Location: One location\n","slug":"front-desk-receptionist-5fd5e009-7b4f-4706-9e49-b2d422732ea9","benefits":[],"selectedSkills":["Writing skills","Customer service","Research","Graphic design","Office experience","Bachelor's degree","High school diploma or GED","21 years or older","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=5&job=szhcxuBFhkYpdIo-Sga3J1FZi232Nrsp9rBTbFi-cvWu-jH7jmtDMg"},{"position":"Accounting Clerk","labName":"Kaycha Labs","location":"Fort Lauderdale, FL","age":"7 days ago","type":"Full-time","jobDescriptionCopy":"Company Overview:\n\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\n\nEssential Duties & Responsibilities:\n\n\nEnter A/P invoices\nMatch supporting documentation to Credit Card transactions\nFiling\nMail payments\nOther duties as assigned to support Accounting Manager\n\nEducation & Experience:\n\n\nBachelor’s degree in accounting, finance or general business administration preferred.\nSage X3 Experience (2-3 years, preferred)\n\nSkills, Abilities and Competencies:\n\n\nExcellent verbal and written communication skills.\nTeam-oriented individual with strong attention to detail\nSolid organization skills, such as multitasking and effective time-management\nMulti-tasker who can prioritize tasks to achieve time-sensitive deadlines\n\nOther:\n\n\nMust pass Level 2 background check.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.f.\n\nEssential Functions:\n\n\nThe physical demands described here are representative of those that an employee must meet to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nWhile performing the duties of this job the employee is frequently required to stand, handle or feel, to speak, and to hear. The employee is occasionally required to walk, sit, reach with hands and arms, bend, kneel, crouch, or crawl. The employee must frequently lift and/or move up to thirty-five (35) pounds.\n\n\nSpecific vision abilities required for this job include close (proximity) vision, depth perception, and the ability to adjust focus.\n\n\nWork Environment:\n\n\nThe work environment described here is representative of that which an employee may encounter while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nThe standard analytical laboratory environment is one in which potential health hazards do exist. Administrative, operations, technical, and professional staff are expected to safely operate in accordance with applicable and appropriate health and safety policies and procedures, as prescribed by the applicable Kaycha manuals and policies and/or federal, state, or local standards.\n\n\nLaboratory staff can be expected to work in areas where hazards associated are with, but not limited to, airborne pathogens. Biological materials, hazardous substances, and radioactive material exist and are handled. Appropriate training is provided regarding these hazards and staff are expected to adhere to all health and safety policies at all times, whether they are in writing or verbalized by a supervisor.\n\n\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.\n\n\nThe above is intended to describe the general content of and requirements for the performance of this job. It is not to be construed as an exhaustive statement of duties, responsibilities, or physical requirements. Nothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions\n\n\nJob Type: Full-time\n\n\nPay: From $18.00 per hour\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nDisability insurance\nEmployee assistance program\nFlexible spending account\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nPhysical Setting:\n\n\nOffice\n\nSchedule:\n\n\n8 hour shift\nDay shift\nMonday to Friday\nOvertime\n\nApplication Question(s):\n\n\nBest email and phone number to reach you at?\nDesired compensation?\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nSage X3: 2 years (Preferred)\nAccounts payable: 2 years (Preferred)\n\nWork Location: One location\n","slug":"accounting-clerk-9596012c-6129-41f7-bf64-a9f697fe9f19","benefits":["Dental insurance","Health insurance","401(k)","Flexible spending account","Employee assistance program"],"selectedSkills":["Sage","Accounts payable","Communication skills","Time management","Bachelor's degree","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=6&job=rx6EgPx4kO4cMNhivrBAb_TNWlv3KRvn6jXyiy3yubJL24rNbfGc4w"},{"position":"Production Associate - Oil Department","labName":"Choice Labs, LLC","location":"Jackson, MI","age":"21 hours ago","type":"Full-time","salaryMin":"$14 ","salaryMax":" $15 an hour","jobDescriptionCopy":"Choice Labs, LLC is a rapidly expanding Michigan Center based medical and recreational cannabis processor. The Oil Technician will be responsible for safely and effectively extracting oil consistent with company requirements.\n\n\nEssential Duties:\n\n\n- Prepare the equipment and products for production departments\n- Mix oil and terpenes using established policies and procedures\n- Prep doses for edible production\n- Ensure consistency and efficiency of products through quality control testing and procedures\n- Maintain strict inventory records of all materials, chemicals and equipment\n- Perform all duties accurately and in a safe manner by adhering to all governmental regulations and established company procedures\n- Store supplies and equipment and waste disposal according to established guidelines\n- Complete routine preventative maintenance, cleaning, and troubleshooting on instruments and equipment\n- Responsible for various laboratory support activities, including but not limited to sample inventory, record-keeping, proper sample disposal, and cleaning\n- Ensures timely and accurate reporting and responses to compliance-related issues and assists with implementation of corrective action plans related to such issues\n- Cross train in other departments as necessary\n\n\nRequirements:\n\n\n- Must be age 21 or older\n- Must be ServSafe certified or eligible to become certified within 30 days of hire\n- Must have at least 1 year mixing, pouring and/or blending product experience\n- Some college in science related disciplines\n- Ability to lift up to 50lbs\n- Excellent verbal and written communication skills\n- Excellent organizational skills\n- Basic computer skills\n- Able to multi-task and work in a fast paced, changing and challenging environment\n- Must be able to work independently and as part of a team\n\n\nJob Type: Full-time\n\n\nPay: $14.00 - $15.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\n\nAbility to commute/relocate:\n\n\nJackson, MI 49202: Reliably commute or planning to relocate before starting work (Required)\n\nWork Location: One location\n","slug":"production-associate-oil-department-686dd19a-4ac4-4aaf-987c-f06029227b68","benefits":["Dental insurance","Health insurance","Paid time off","Vision insurance","Life insurance"],"selectedSkills":["Computer skills","Communication skills","Computer literacy","ServSafe","Organizational skills","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=6&job=OikqTZ99nUbl7iwiAYFe1dkTGwAjHSVYurxjuo02AcKAYqu1ShgBhQ"}]