[
  {
    "position": "Data Entry Specialist - Laboratory",
    "labName": "Montrose Environmental Group, Inc. - 2.9",
    "location": "El Dorado Hills, CA",
    "age": "",
    "type": "Full-time",
    "jobDescriptionCopy": "ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicity testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur El Dorado Hills, CA facility is currently seeking a Full-Time Data Entry Specialist to join our team.\n\nAs a key member of the laboratory team, this role will be responsible for a full range of activities including:\n\nAssisting with data reporting through comparison of multiple data sets\nReviewing each data point for accuracy\nUploading data into Vista’s Laboratory Information Management System (LIMS)\nUtilizing LIMS to create sample reports\nWorking collaboratively with team members to ensure sample data meets all requirements\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nBachelor's degree or equivalent and relevant formal academic / vocational qualification\n\nPREFERRED SKILLS\n\nDetail oriented\nGood knowledge of word processing, spreadsheets, table and graph generation and use of applicable computer software\nEffective written and oral communication skills\nGood time management and organizational skills\nGood editorial and proofreading skills\nGood problem solving and troubleshooting abilities\nAbility to function both independently and in a team environment\nAbility to follow all standard operating procedures\nPrior laboratory experience preferred but not required\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.",
    "slug": "data-entry-specialist---laboratory",
    "selectedSkills": [
      "Disability insurance",
      "Tuition reimbursement",
      "401(k)",
      "Parental leave",
      "Word processing",
      "Laboratory experience",
      "Communication skills",
      "Time management",
      "Organizational skills",
      "Bachelor's degree"
    ],
    "sourceUrl": "https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-CA-El-Dorado-Hills/Data-Entry-Specialist----Laboratory_R1847?mode=job&iis=Job+Board&iisn=Indeed.com"
  },
  {
    "position": "Laboratory Manager",
    "labName": "INSA - 2.9",
    "location": "Auburndale, FL",
    "age": "",
    "type": "Full-time",
    "salaryMin": "Estimated: $52,000 - $72,000 a year",
    "jobDescriptionCopy": "Job Title: Laboratory Manager\nDepartment: Laboratory\nSupervisor: Director of Operations\nHome Location: Auburndale, FL\nFLSA Classification: Exempt\n\nPosition Summary:\nThe Laboratory Manager is responsible for managing the daily operations of the Laboratory department, including ensuring process efficiency, that necessary supplies are stocked, and that talent is allocated appropriately to suit production needs. This person is responsible for meeting production goals by supporting Associates in a high-volume production facility. Furthermore, the Laboratory Manager can identify areas for Continuous Process Improvement and can effectively present action plans to senior leadership.\nEssential Functions:\n\nEnsures Associates are meeting daily, weekly, and monthly production goals to meet consumer demand; maintains virtual and physical inventory of product\nManages daily operations of department, including assigning tasks and stations, ensuring process efficiency, that necessary supplies are stocked, and that talent is allocated appropriately to suit production needs\nManages Associates by monitoring attendance, performance, and adherence to company policies and procedures; conducting annual performance evaluations; providing coaching and support; and providing corrective action as needed\nOversees sampling of production batches to be sent for testing and entering results\nCompletes periodic departmental audits as needed; complies with related recordkeeping requirements including movement logs, production logs, and waste logs\nResponsible for maintenance of equipment and machines including ordering parts when needed\nCreates and modifies Standard Operating Procedures according to state regulations and production needs\nCoordinates with other department managers on a routine basis\nMaintains or obtains industry credentials as needed\nTraining: process, people, & equipment\nSafety: ensuring safe work area, update, enforce, train on laboratory safety plan\nCreation of new products: quality control, industry standards, testing\n\nQualifications:\n\nBachelor’s degree in the natural sciences (biology, chemistry, plant science, etc.) required\nKnowledge of lab safety procedures and protocol\n3-5 years of experience as a department manager in a laboratory or production-based environment required\nProficient in Windows 10 operating system, Microsoft Office suite of products, Google Apps for Work and knowledge of MJ Freeway platform\nExperience in Lean/Six Sigma work environment a plus\nMust feel comfortable working with hydrocarbons or other volatile compounds or substances in a controlled environment, with PPE provided, to extract cannabinoids for product manufacturing\nWilling and able to work a flexible schedule with some weekend work and occasional travel\nStrong people management skills required\nAbility to communicate ideas and resolutions in a clear, concise, friendly manner\nStrong written and verbal communication skills\nMechanical aptitude and/or comfortable troubleshooting machines and equipment\nDemonstrated ability to effectively multi-task and manage time both independently as well as within a team environment\nContinuous Process Improvement mindset\nMust be at least 18 years of age\nMust have a reliable personal vehicle\nMust be able to pass a background check in accordance with state regulations\n\nPhysical Requirements:\n\nAbility to sit, stand, and walk as needed\nAbility to bend at the waist, kneel, crouch to access equipment\nAbility to lift and carry up to 50lbs\nClose visual acuity needed for viewing screens and fine print\n\nWorkplace Environment\n\nConsistent moderate background noise level due to HVAC and machinery\nExposure to cannabis odor\nExposure to skin contact with plants, to which some individuals may be allergic\n\nJob Type: Full-time",
    "slug": "laboratory-manager",
    "selectedSkills": [
      "Safety equipment provided",
      "Laboratory procedures",
      "Windows",
      "Mechanical knowledge",
      "Laboratory experience",
      "Communication skills",
      "Bachelor's degree",
      "18 years or older",
      "Background check"
    ],
    "sourceUrl": "https://insa-inc.checkwritersrecruit.com/job/372373/laboratory-manager?s=in"
  },
  {
    "position": "Laboratory Technician - SVOA extraction",
    "labName": "Montrose Environmental Group, Inc. - 2.9",
    "location": "Orange, CA",
    "age": "",
    "type": "Full-time",
    "jobDescriptionCopy": "ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicity testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Orange, CA facility is currently seeking a Full-Time Laboratory Technician to join our team.\n\nAs a key member of the laboratory team, this role will be responsible for a full range of activities including:\n\nPreparation of samples for analysis\nPreparation of reagents for lab use and/or shipment\nSample extractions\nDetermining the volume of samples\nCleaning of laboratory glassware\nMaintaining clean laboratory areas\nMaintaining organized records of sample preparation and analysis\nCourier supplies to and/or samples from client sites\nOverhead projects designed to improve efficiency of, or accuracy of analyses\nAssisting the Group Leaders and analysts in acquiring and inventorying consumables, chemicals, and parts for instrumentation\nDispose of laboratory waste in a safe manner following prescribed procedures\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Lab Director\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nHigh School diploma or equivalent required\n\nPREFERRED SKILLS\n\nPrior Laboratory experience preferred but not required as this is an entry level position\nKnowledge of analytical method, analytical instruments, general lab practices and lab safety\nAbility to work independently and in a team\nGood organizational skills and strong communication skills\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.",
    "slug": "laboratory-technician---svoa-extraction",
    "selectedSkills": [
      "401(k)",
      "Disability insurance",
      "Parental leave",
      "Tuition reimbursement",
      "Laboratory experience",
      "Communication skills",
      "Organizational skills",
      "High school diploma or GED"
    ],
    "sourceUrl": "https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-CA-Orange/Laboratory-Technician---SVOA-extraction_R1855?mode=job&iis=Job+Board&iisn=Indeed.com"
  },
  {
    "position": "Smithers Cannabis Testing Services Division - Associate Microbiologist",
    "labName": "Smithers Cannabis Testing Services Division -",
    "location": "Chicago, IL",
    "age": "",
    "type": "Full-time",
    "salaryMin": "Estimated: $44,000 - $58,000 a year",
    "jobDescriptionCopy": "Job Summary\n\nThe individual will be responsible for maintenance of microbiology equipment, primarily automated instrumentation as well as other standard and non-standard microbiological instrumentation. The Microbiologist will conduct, troubleshoot and oversee microbiological analysis of cannabis flower, concentrates and infused products as required by state cannabis regulatory body regulations within an ISO 17025 accredited laboratory. The Microbiologist will be responsible for coordinating scheduling with the Laboratory Manager, conducting sample analysis, identifying areas where efficiencies can be implemented into laboratory process workflows, and supporting sales meetings as requested by laboratory management. As time allows, the Microbiologist will also be cross-trained to conduct sample preparation and extraction for subsequent chemical analyses.\n\nThe Microbiologist will be responsible for training and oversight of employees working in the microbiology area.\n\nPast job experience or training gained obtaining a master’s degree appropriate to microbiology are preferred. The Microbiologist is expected to have developed an ability to optimize the laboratory workflows to maximize throughput and efficiency while maintaining a high level of quality. Additionally, the individual must be able to represent Smithers to clients both over the phone and in person and transmit a professional image.\n\nA. Job Duties\n\nEssential Functions:\n1. Conduct sample analysis in accordance with validated methods and SOPs\n\n2. Ensure timely reporting of results to meet deadlines.\n\n3. Ensure results meet all quality requirements.\n\n4. Analyze microbiology data, and where necessary, troubleshoot unexpected results.\n\n5. Subject matter expert for microbiological analysis.\n\n6. Record and organize data in the Laboratory Information Management System (LIMS) and/or laboratory notebooks\n\n7. Train and oversee employees working in the microbiology function.\n\n8. Maintenance and upkeep of instrumentation.\n\n9. Ensure state regulatory compliance of tests. Advise Smithers on changes to regulatory requirements for microbiological testing of cannabis and cannabis products.\n\n10. Ensure ISO 17025 compliance of relevant studies and processes.\n\n11. Additional duties as assigned, including cross-training to conduct chemical analyses\n\nGood technical writing skills in microbiology [written and oral comprehension, written and oral expression]. Ability to integrate observations (visual and written, discrimina¬tion) into evaluation process. College math [mathematical reasoning, memorizing]. Ability to work at a fast pace without compromising accuracy or completeness, prioritize work assignments and handle stress [high productivity].\n\nPhysical Functions\n\nSitting - 30%\n\nStanding - 70%\n\nWalking - 30%\n\nWriting - 50%\n\nVisual - 100%\n\nB. Chemical Safety\n\n1. Must be able to comprehend the potential hazards of the chemicals in use and adhere to the proper safety techniques as dictated by the Safety Manual and/or Management.\n\nC. Laboratory Safety\n\n1. Must be able to wear gloves, lab coat, eye protection, sleeves, hearing protection, pesticide suit, plastic booties, dust masks, a respirator, and a face mask.\n\n2. Must be able to understand and follow laboratory safety standards.\n\nJob Specifications\n\nB.S. degree in microbiology or related field required, Master’s degree in microbiology or related field preferred, 2-3 years of relevant laboratory experience. Previous experience in a cannabis testing lab is a plus. Proficiency in documentation and procedures required by ISO 17025 preferred.\n\nNext Position Level – Senior Microbiologist\n\nEducation\nRequired\nBachelors or better in Microbiology",
    "slug": "smithers-cannabis-testing-services-division---associate-microbiologist",
    "selectedSkills": [
      "Laboratory experience",
      "Technical writing",
      "Microbiology",
      "Bachelor of Science",
      "Bachelor's degree",
      "Master's degree"
    ],
    "sourceUrl": "https://recruiting.ultipro.com/SMI1007SMGR/JobBoard/dde2327c-90a5-4557-a8b1-951901232c23/OpportunityDetail?opportunityId=5dbeb50a-05a0-48bb-91ca-3b8357122304&postingId=8525d850-f482-48b2-8d55-ee124e1da16e"
  },
  {
    "position": "Quality Control/ Quality Assurance Manager",
    "labName": "Demetrix -",
    "location": "Raleigh, NC",
    "age": "",
    "type": "Full-time",
    "salaryMin": "Estimated: $75,000 - $95,000 a year",
    "jobDescriptionCopy": "Quality Control Description\nThe Quality Control is responsible for developing, implementing, and managing quality control (QC) systems designed to ensure the continuous production of high-quality products that are consistent with established standards, customer specifications, and production goals. Managers and leads a team of QC personnel responsible for incoming raw materials through finished goods release, as well as the timely generation of batch production records (BPRs).\n\nAs a long-term opportunity - When a Quality Control Laboratory is established in Raleigh this individual would lead the team\nQuality Assurance Description\nQuality Assurance is responsible for guaranteeing the quality of products and services. The work involves careful inspections and the enforcement of quality standards. Other essential duties and responsibilities in quality assurance include ensuring compliance with all good manufacturing procedures, working with key personnel in the facility on quality assurance issues, responsible for ensuring compliance of all regulatory requirements, product quality, micro testing, formula integrity, allergen control program, HACCP, GMP program, hold and release program, and self-inspection program.\n\nYour Impact:\nBe responsible for establishing and implementing the necessary programs of facilities personnel including the GMP, HACCP, Allergen, and training programs ensuring they have the required competencies to carry out the functions affecting product legality, safety, and quality.\nConduct audits of vendor/CMO facilities and product ingredients.\nAssist in setting quality standards and ensure that CMO production is maintained at such standards\nOversee that FDA, EU, and ISO standard requirements are documented to maintain compliance.\nEnsuring that all quality policies and procedures meet national and international standards, devising, improving, and reviewing new specifications and procedures for products or processes, and training staff to use them.\nBe responsible for the ingredient specification program, supplier vendor program, regulatory 3rd party audit program, labeling program, pre/post inspection program, verification, and validation program retain sample program and code date adherence program.\nTechnical experience with HPLC, Gas Chromatograph, and other laboratory equipment. Competences to oversee, perform and sustain analytical method transfers to our various CMOs and 3rd party analytical laboratories as required.\nInspecting the final output, comparing it to the requirements, and approving or rejecting the final products.\n\nYour Experience:\nBachelor’s or master’s degree (preferred) in Chemistry Science, Food Technology, Nutrition, or related field. 8 years’ experience in Quality Assurance/Quality Control in the food or dietary supplement industry. 3 years’ management/supervisory experience.\nProficiency with quality systems and techniques such as statistical process control (SPC), process validation, Corrective and Corrective Actions (CAPAs).\nStrong communication, leadership, process development, training, organization, and prioritization skills.\nStrong attention to detail, observation, organizational, and leadership skills.\nIn-depth knowledge of quality control procedures, equipment, and industry standards.\nStrong knowledge of mathematics, data analysis, and statistical methods. Good technical and IT skills.\nExcellent communication and listening skills.\nLiaising closely with other managers and departments in Demetrix and CMOs.\n\nWe’ve got you covered:\nOur employees are the most important part of what makes our company what it is and we want to provide our team with the best benefits we can. Demetrix offers a variety of benefits to help support our employees and their families outside of work, including:\nHealth Benefits\nRetirement\nFlexible Vacation\nFood on campus\nEAP Resources\nHeadspace App\nCommuter Benefit\nEducation Allowance Benefit\nVoluntary Benefits including Pet Insurance\n\nSome other points:\nWe welcome applicants of any and all backgrounds with demonstrated abilities in the skills needed to meet our mission. We are always on the lookout for new talent who embrace change and are willing to push the boundaries of what’s possible in life.\nDemetrix is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.\nEmployment with Demetrix is at will. This means your employment is for an indefinite period of time and it is subject to termination by you or Demetrix, with or without cause, with or without notice, and at any time.\nThe job posting highlights the most critical responsibilities and requirements of the job. It’s not all-inclusive.\n\nSome more about Demetrix:\nNature is a rich source of ingredients. Inconsistent quality and supply, along with inaccessibility of rare substances, mean it’s not always an ideal source to meet the world’s needs.\n\nDemetrix helps customers across the globe produce more for less.\n\nBiotechnology can help by enabling access to more rare and powerful products. With less environmental impact and less cost than traditional methods. Which can lead to more happy, healthy lives.\n\nDemetrix gives you:\nExpensive and hard-to-find ingredients at your fingertips, sustainably and affordably\nHigh ingredient purity without residual chemicals or pesticides\nAffordable access that is quickly scalable as your business grows\nProduct consistency and a reliable, global supply\nA sustainable solution with a small environmental footprint\n\nCurrently, we’re building a product pipeline of cannabinoids, the active compounds in the cannabis plant. Humans have been relying on cannabinoids for health and medicinal purposes for centuries.\nAlthough there are more than 113 unique cannabinoids, very few have been studied. That’s because they are present in such low quantities in the plant. We can produce even the rarest cannabinoids at high purity and volumes. What this will do is enable research for health benefits and, ultimately, provide affordable access to the compounds.",
    "slug": "quality-control/-quality-assurance-manager",
    "selectedSkills": [
      "Commuter assistance",
      "Health insurance",
      "Employee assistance program",
      "Pet insurance",
      "QA/QC",
      "High-performance liquid chromatography",
      "Quality systems",
      "Quality assurance",
      "Leadership",
      "Bachelor's degree",
      "Master's degree"
    ],
    "sourceUrl": "https://jobs.lever.co/demetrixbio/18cbb376-e8d4-4d97-bfa7-5de26df89b07"
  },
  {
    "position": "Laboratory Technician I - Metals",
    "labName": "Montrose Environmental Group, Inc. - 2.9",
    "location": "Richmond, VA",
    "age": "",
    "type": "Full-time",
    "jobDescriptionCopy": "ABOUT YOU\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Richmond, VA laboratory is looking for a Laboratory Technician who will be responsible for performing tasks required to meet the expectations of our clients, in addition to efficiently and profitably generating defensible data in a timely manner. These tasks will be performed under the direction of a Group Leader.\n\nResponsibilities Include:\nPreparation of tobacco, cigar(ette), eliquid, or aerosol samples for analysis\nPreparation of reagents for lab use and/or shipment\nCleaning of laboratory glassware\nMaintaining clean laboratory areas\nMaintaining organized records of sample preparation and analysis\nAssisting the Group Leaders and analysts in acquiring and inventorying consumables, chemicals, and parts for instrumentation\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Technical Director\nComfortable working with chemicals and glassware\nAbility to remain flexible and handle changing priorities\nPosition requires attention to detail, ability to handle multiple tasks simultaneously, and a desire to worth both as part of a team and independently\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Lab Director\n\nNECESSARY QUALIFICATIONS\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nAssociates or Bachelor's degree in Chemistry, Biology, Environmental Science, or related field preferred\n\nPreferred Skills:\nPrior Laboratory experience preferred but not required as this is an entry level position\nKnowledge of analytical method, analytical instruments, general lab practices and lab safety\nAbility to work independently and in a team\nGood organizational skills and strong communication skills\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nThis position requires employee to be fully vaccinated for COVID-19, unless the employee receives a reasonable accommodation for a valid medical, religious, spiritual exemption. The Company will review requests for a reasonable accommodation for any such exemptions on a case-by-case basis. You are considered \"fully vaccinated\" at more than two (2) weeks after receiving the second dose in a 2-dose series or more than two (2) weeks after receiving a single dose vaccine.\n\nMAKE THE MOVE\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.",
    "slug": "laboratory-technician-i---metals",
    "selectedSkills": [
      "Disability insurance",
      "Tuition reimbursement",
      "401(k)",
      "Parental leave",
      "Laboratory experience",
      "Communication skills",
      "Organizational skills",
      "Bachelor's degree",
      "Associate's degree"
    ],
    "sourceUrl": "https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-VA-Richmond-East-Parham-Rd/Laboratory-Technician-I---Metals_R1842?mode=job&iis=Job+Board&iisn=Indeed.com"
  },
  {
    "position": "Processing Lab Manager",
    "labName": "Sozo Health Inc -",
    "location": "Warren, MI",
    "age": "",
    "type": "Full-time",
    "salaryMin": "Estimated: $41,000 - $58,000 a year",
    "jobDescriptionCopy": "Location: Warren, Michigan\nRole: Processing/Lab Manager\n\nA successful company needs passionate employees. Sozo offers competitive compensation, paid time off, employer-subsidized health plans, and opportunities for advancement.\n\nCompany Overview:\nSozo Health, Inc. (“Sozo”) is a vertically integrated cannabis company based in Warren, Michigan. Sozo’s operations include all stages from cultivation to sale, both in the medical and adult use markets. Sozo prides itself on producing the consistently highest-quality cannabis, while embracing socially and environmentally responsible practices. In 2022, Sozo expects to expand operations beyond Michigan. Since its formation in 2018, Sozo has supported charitable priorities of education, food security, shelter, and racial justice.\n\nJob Summary:\nThe Processing/Lab Manager facilitates and supervises the process of concentrate production. The Processing/Lab Manager will manage a small production team, setting a culture of continuous improvement, to achieve production goals set by the Company. The Manager is also responsible for gathering critical data to evaluate each process and present weekly productivity reports to Executives. This position is responsible for the development of standard operating procedures for each machine and station and integrating proprietary processing techniques to maintain a competitive advantage amongst cannabis processors. The role will operate under the direction of the Chief Operating Officer.\n\nJob Responsibilities:\n\nPlan, direct, and organize day-to-day operations to optimize production outputs and meet companywide production and revenue expectations\nEnsure the team has all resources needed to complete the tasks for the week/month/quarter\nImplement, monitor, and perform calibration of all lab equipment by establishing and ensuring consistent standards of use. Perform preventative maintenance of all equipment as required to ensure the lab is always fully operational\nCreate, maintain, and update SOPs as they relate to laboratory operations, documenting planned deviations or non-conformities when required\nCreate accurate cost of goods analysis, production estimates, projected process/cycle times, financial models, budgetary requirements/commitments, staffing/personnel requirements/needs, etc.\nAccurately track daily production and usage of raw materials utilized in the final finished product\nReviewing and making calculated decisions based on laboratory results\nOversee third party testing through selected partners.\nReview and develop current and future extraction operations to improve efficiency and productivity\nDirect and monitor all products are labeled and inputted into METRC as well as internal platforms\nEnsure all finished products meet compliance and regulatory requirements as well as internally set quality expectations.\nProperly train all staff\nJob Requirements:\n\n1+ years’ experience managing teams in a lab setting\n2+ years’ experience in cannabis extraction (hydrocarbon, ethanol or solventless)\nExperience with data entry and data management\nMaintain a high level of integrity, motivation and urgency to complete tasks\nStrong written and oral communication skills, organizational, innovative problem-solving, attention to detail, and time management\nFamiliarity with local, state, and federal laws and regulations pertinent to the operation\nMust be and remain compliant with all legal or company regulations for working in the cannabis industry\nAbility to use standard office equipment, Microsoft Office applications, computer software, and an in-depth understanding of the METRC tracking system\nMinimum of 21 years of age\nPossess valid driver’s license or state ID\nMust pass all background checks\nSozo is an equal opportunity employer. We do not discriminate on the basis of race, color, religion, marital status, age, national origin, ancestry, physical or mental disability, medical condition, pregnancy, genetic information, gender, sexual orientation, gender identity or expression, veteran status, or any other status protected under federal, state or local law.\n\nSozo is committed to modeling diversity and inclusion for the entire cannabis industry and to maintaining an inclusive environment that provides for equitable treatment for all.",
    "slug": "processing-lab-manager",
    "selectedSkills": [
      "Paid time off",
      "Opportunities for advancement",
      "Health insurance",
      "Laboratory experience",
      "Communication skills",
      "Data management",
      "Driver's License",
      "Data entry",
      "21 years or older"
    ],
    "sourceUrl": "https://secure2.entertimeonline.com/ta/SozoCo.careers?ShowJob=436384587"
  },
  {
    "position": "Analyst I - VOA",
    "labName": "Montrose Environmental Group, Inc. - 2.9",
    "location": "Orange, CA",
    "age": "",
    "type": "Full-time",
    "jobDescriptionCopy": "ABOUT YOU\n\nAre you passionate about and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Orange, CA Laboratory is currently seeking at Analyst I to join our VOA department products. Analysts perform chemical measurements and other tasks to meet the expectations of our clients by efficiently and profitably generating defensible data on time.\n\nAs a key member of the Volatiles team, this role will be responsible for a full range of activities including:\n\nAnalysts perform chemical measurements and other tasks to meet the expectations of our clients by efficiently and profitably generating defensible data on time.\nGC/MS quantitative sample analysis.\nInstrument calibration, validation, and method development\nInstrument maintenance and troubleshooting\nPreparation of data summaries for inclusion in client reports.\nSample and standard preparation\nMaintain consumables and parts for instruments\nOverhead projects designed to improve efficiency of, or accuracy of analyses\nCommunicating relevant updates to applicable people in a timely manner\nPerforming other duties and responsibilities as prescribed by the Company\nCompliance with Enthalpy’s Quality Assurance Program and other policies\nCompliance with Company’s Health and Safety Plan\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nBachelor's degree or higher in Chemistry, Biology, Environmental Science, or related field.\nMinimum of 2 years’ experience operating and troubleshooting GC/MS instrumentation preferred\n\nPREFERRED SKILLS\n\nKnowledge of analytical methods, analytical instruments, general lab practices and lab safety\nWell organized and have an attention to detail\nGood organization and communication skills\nAble to work in a fast-paced environment\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.",
    "slug": "analyst-i---voa",
    "selectedSkills": [
      "401(k)",
      "Disability insurance",
      "Parental leave",
      "Tuition reimbursement",
      "Gas chromatography",
      "Communication skills",
      "Bachelor's degree",
      "Master's degree"
    ],
    "sourceUrl": "https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-CA-Orange/Analyst-I---VOA_R1825?mode=job&iis=Job+Board&iisn=Indeed.com"
  },
  {
    "position": "Operations Manager - Laboratory",
    "labName": "Montrose Environmental Group, Inc. - 2.9",
    "location": "El Dorado Hills, CA",
    "age": "",
    "type": "Full-time",
    "jobDescriptionCopy": "ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur El Dorado Hills, CA facility is currently seeking a Full-Time Operation Manager to join our team.\n\nAs a key member of the laboratory team, this role will be responsible for a full range of activities including:\n\nThe Operations Manager is responsible for the day-to-day operations of the laboratory, ensuring the timely delivery of analytical data reports to clients and the QA department.\nThe Operations Manager works closely with the Laboratory Director and Technical Director to troubleshoot and solve both technical and procedural issues to ensure efficient processing of client samples through the laboratory.\nCoordinate work scheduling and laboratory resource allocation\nSupervise and manage adherence to project, SOP/method, and turnaround requirements\nAssess production capacity and provide solutions for scheduling, technical, and quality issues\nProvide mentorship to staff and ensure they are developing necessary skills and abilities for the work today and in the future\nAssist in personnel supervision, time management, and operational efficiency, as well as conflict resolution, personnel skills development and team building\nAccurate and timely communication with internal and external clients and occasionally review and sign client reports as needed\nMay assist in development of analytical methods\nCommunicate with client’s questions or concerns\nInitiate and address non-conformance issues\nOverhead projects designed to improve efficiency and/or accuracy of analyses\nComply with Enthalpy’s Quality Assurance Program and other policies\nMonitor costs and usage of lab consumables to make informed decisions for purchasing\nEnsure staff comply with Enthalpy’s Health and Safety Plan\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nBachelor's Degree in a physical science or equivalent\nMinimum of 4 years laboratory experience\nMust have familiarity with environmental sample analysis, chromatography, and mass spectrometry\nMust have the ability to manage people effectively\n\nPreferred Skills\n\nEffectiveness-Positive outcomes & results of communication skills\nConflict resolution skills: Removes/Breakdown organizational communication barriers\nAssertion Skills-Problem diagnosis, assess corrective action\nAbility to handle multiple tasks simultaneously and maintain composure during stressful times\nComplete documentation and attention to detail\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.",
    "slug": "operations-manager---laboratory",
    "selectedSkills": [
      "401(k)",
      "Disability insurance",
      "Parental leave",
      "Tuition reimbursement",
      "Laboratory experience",
      "Communication skills",
      "Conflict management",
      "Safety plans",
      "Bachelor's degree"
    ],
    "sourceUrl": "https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-CA-El-Dorado-Hills/Operations-Manager---Laboratory_R1844?mode=job&iis=Job+Board&iisn=Indeed.com"
  },
  {
    "position": "Animal Research Technician",
    "labName": "Johns Hopkins University - 4.0",
    "location": "Baltimore, MD",
    "age": "",
    "type": "Full-time",
    "salaryMin": "$15 - $20 an hour",
    "jobDescriptionCopy": "We are seeking an Animal Research Technician who will assist with experimental protocols in a laboratory focused on behavioral pharmacology and neuroscience research into cannabis, cannabinoids, opioids, alcohol, and nicotine in the Division of Behavioral Biology (faculty supervisors: Elise Weerts, PhD and Cassie Moore, PhD) in the Department of Psychiatry and Behavioral Sciences. The Animal Research Technician will contribute to scientific research projects. There is opportunity for interested individuals for participation in writing and co-authorship of research papers.\n\nSpecific Duties & Responsibilities:\nParticipate as a member of collaborative team in study design and development\nIndependently carry out daily experimental protocols with rodents, including running behavioral sessions, recording data, and maintaining behavioral equipment (checking, and as necessary, troubleshooting and making repairs/arranging for repairs to be made)\nAssist with preparation and administration of experimental drug solutions to laboratory animals\nData entry and management\nMaintaining drug accountability records\nProviding daily care for laboratory animals\nLaboratory maintenance according to USDA and AALAC guidelines\nOrdering supplies as needed\nPerforms miscellaneous related duties as assigned by the PI\n\nMinimum Qualifications (Mandatory):\nBachelor's Degree in a related field such as Biology, Chemistry, Neuroscience.\nAdditional related experience may substitute for required education, to the extent permitted by the JHU equivalency formula.*\n\n\nJHU Equivalency Formula: 30 undergraduate degree credits (semester hours) or 18 graduate degree credits may substitute for one year of experience. Additional related experience may substitute for the required education on the same basis. For jobs where equivalency is permitted, up to two years of non-related college course work may be applied towards the total minimum education/experience required for the respective job.\n** Applicants who do not meet the posted requirements but are completing their final academic semester/quarter will be considered eligible for employment and may be asked to provide additional information confirming their academic completion date.\n\nPreferred Qualifications:\n1- year work experience in veterinary or animal research environment.\nExperience with handling laboratory animals, drug injections, behavioral experiments, and aseptic surgery.\n\nSpecial Knowledge, Skills & Abilities:\nMicrosoft Office (word, excel).\nExcellent organization skills, conscientious in following directions, attentive to details.\nMust be reliable in attendance, able to work well with others.\nMust be available to work limited hours on some weekends and holidays.\n\nPhysical Requirements:\nAble to sit in a normal seated position for extended periods.\nAble to reach by extending hand(s) or arm(s) in any direction.\nFinger dexterity required, able to manipulate objects with fingers rather than entire hand(s) or arm(s), e.g., use of computer keyboard.\nCommunication skills using the spoken word.\nAbility to see within normal parameters.\nAbility to hear within normal range.\nAbility to lift weights up to 30 lbs.\n\nClassified Title: Animal Research Technician\nRole/Level/Range: ACRO40/E/02/CC\nStarting Salary Range: $15.00 - $20.00/hr (commensurate with experience)\nEmployee group: Full Time\nSchedule: M-F 8:30 am - 5:00pm\nExempt Status: Non-Exempt\nLocation: Johns Hopkins Bayview\nDepartment name: SOM Psy Bay Behavioral Biology\nPersonnel area: School of Medicine\n\nThe successful candidate(s) for this position will be subject to a pre-employment background check.\n\nIf you are interested in applying for employment with The Johns Hopkins University and require special assistance or accommodation during any part of the pre-employment process, please contact the HR Business Services Office at jhurecruitment@jhu.edu . For TTY users, call via Maryland Relay or dial 711.\n\nJohns Hopkins has mandated COVID-19 and influenza vaccines, as applicable. Exceptions to the COVID and flu vaccine requirements may be provided to individuals for religious beliefs or medical reasons. Requests for an exception must be submitted to the JHU vaccination registry. For additional information, applicants for SOM positions should visit https://www.hopkinsmedicine.org/coronavirus/covid-19-vaccine/ and all other JHU applicants should visit https://covidinfo.jhu.edu/health-safety/covid-vaccination-information/ .\n\nThe following additional provisions may apply, depending on campus. Your recruiter will advise accordingly.\n\nThe pre-employment physical for positions in clinical areas, laboratories, working with research subjects, or involving community contact requires documentation of immune status against Rubella (German measles), Rubeola (Measles), Mumps, Varicella (chickenpox), Hepatitis B and documentation of having received the Tdap (Tetanus, diphtheria, pertussis) vaccination. This may include documentation of having two (2) MMR vaccines; two (2) Varicella vaccines; or antibody status to these diseases from laboratory testing. Blood tests for immunities to these diseases are ordinarily included in the pre-employment physical exam except for those employees who provide results of blood tests or immunization documentation from their own health care providers. Any vaccinations required for these diseases will be given at no cost in our Occupational Health office.\n\nEqual Opportunity Employer\nNote: Job Postings are updated daily and remain online until filled.\n\nEEO is the Law\n\nLearn more:\nhttps://www.eeoc.gov/sites/default/files/migrated_files/employers/poster_screen_reader_optimized.pdf",
    "slug": "animal-research-technician",
    "selectedSkills": [
      "Veterinary experience",
      "Research",
      "Microsoft Excel",
      "Computer skills",
      "Animal handling",
      "Doctoral degree",
      "Bachelor's degree",
      "Background check"
    ],
    "sourceUrl": "https://apptrkr.com/get_redirect.php?id=2955278"
  },
  {
    "position": "Technician I - GCMS",
    "labName": "Montrose Environmental Group, Inc. - 2.9",
    "location": "Durham, NC",
    "age": "",
    "type": "Full-time",
    "jobDescriptionCopy": "ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Durham, NC facility is currently seeking a Full-Time Laboratory Technician I in GCMS.\n\nA Laboratory Technician I is responsible for performing tasks required to meet the expectations of our clients, in addition to efficiently and profitably generating defensible data in a timely manner. The ideal candidate will have experience in working under possibly hazardous conditions (e.g. chemicals).\n\nRole and Responsibilities\n\nCleaning of sampling equipment\nPreparation of sampling equipment for prep orders\nPreparation of samples for analysis\nWeighing samples for analysis\nAssisting with loading canisters and samples for analysis\nMaintaining clean laboratory areas\nMaintaining organized records of equipment cleaning and sample prep\nOverhead projects designed to improve efficiency of, or accuracy of analyses\nAssisting the Group Leaders and analysts in acquiring and inventorying consumables and parts for instrumentation\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Lab Director\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nHigh school diploma or general education degree (GED) required, associate's or Bachelor's degree in a scientific field preferred\nA Tech I has shown that they understand the physical and chemical principles underlying why procedures are specified the way they were for each method with which they work.\nTheir documentation, timeliness, and throughput must meet the standard of the laboratory.\n\nPreferred Skills\n\nPrior Laboratory experience required\nKnowledge general lab practices and lab safety\nAbility to work independently and in a team\nGood organizational skills and strong communication skills\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.",
    "slug": "technician-i---gcms",
    "selectedSkills": [
      "401(k)",
      "Disability insurance",
      "Parental leave",
      "Tuition reimbursement",
      "Laboratory experience",
      "Communication skills",
      "Organizational skills",
      "Bachelor's degree",
      "High school diploma or GED",
      "Associate's degree"
    ],
    "sourceUrl": "https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-NC-Durham-Capitola-Drive/Technician-I---GCMS_R1857?mode=job&iis=Job+Board&iisn=Indeed.com"
  },
  {
    "position": "HVAC Tech II",
    "labName": "Default Company -",
    "location": "Franklin, MA",
    "age": "",
    "type": "Full-time",
    "salaryMin": "Estimated: $76,000 - $100,000 a year",
    "jobDescriptionCopy": "IN A NUTSHELL…\nThe Facilities HVAC Tech 2 provides support to the facilities operation during the initial set up phase and ongoing operation thereafter. They provide guidance to ensure the Facilities department is operating best in class.\nThis role is with NETA, one of the renowned retail brands under the Parallel umbrella. Parallel is one of the largest multi-state cannabis companies in the world, owning and operating in five markets; Florida (Surterra Wellness), Massachusetts (NETA), Pennsylvania (Goodblend), Nevada (The Apothecary Shoppe) and Texas (Goodblend). If you enjoy companies that are growing, moving fast, and constantly challenging themselves to achieve more, then Parallel is for you. We work hard, lean on each other, and are passionate about a pretty ambitious vision … pioneering a new paradigm of what well-being can be for all people, everywhere. For more information, visit www.liveparallel.com.\nWHAT YOU WILL BE DOING\nRepair and maintain Industrial HVAC, plumbing and mechanical equipment in accordance with diagrams, sketches, operating manuals, manufacturers' specifications or supervisor s instructions, using hand and power tools, precision measuring or testing devices. Responsible for complete maintenance of area of assignment.\nRead blueprints; understand and read computerized HVAC, Electrical, plumbing system and building layouts.\nObserve and adjust a wide variety of equipment, machines and devices in operation to assure proper operation, including pumps, refrigerant recovery, engines, motors, compressors and laboratory equipment.\nDismantle machines and devices for servicing, repair, or replacement of parts.\nObserve Parallel Policies & Procedures for daily operations and fully complies with state medical marijuana regulations at all times\nPerform preventative maintenance and maintains a scheduled maintenance program to ensure proper facilities upkeep, including all mechanical, electrical and plumbing infrastructure and equipment\nEffectively using CMMS tracking systems to report receipt of maintenance needs and/or other issues\nRespond to facility related failures or emergencies promptly and prioritizes work orders, while maintaining preventative tasks in accordance with facility needs\nPerform routine maintenance tasks, preventative systems and repairs\nComplete all required documentation for utility and facility management, follows up and evaluates effectiveness of all implemented actions to ensure that problem has been resolved effectively\nEnsure safe work practices are implemented and consistently followed by department staff\nWork with other departments in addressing and rectifying potentially unsafe work conditions or practices\nEnsure compliance with applicable building codes, fire and emergency codes, regulatory and other required regulations\nResponsive and professional in all response and interactions regarding service requests and facility needs\nAble to work carefully and efficiently in a fast-paced environment\nWork in coordination with the Supervisor and Manager to help upgrade all systems and streamline as needed to function in the most efficient and effective manner.\nAfter hours on call availability\nPerform other job duties and tasks as assigned\nEXPERIENCE AND SKILLS YOU’LL BRING\nTechnical school graduate or equivalent industrial operations experience (Required)\nHVAC Certification and Refrigeration Recycle Recovery license (Required)\nDemonstrate competency in performing routine maintenance tasks, preventative systems and repairs\nAbility to read blueprints; ability to understand and read computerized HVAC, Electrical, plumbing system and building layouts.\nMin 7 years of progressively responsible work-related experience and any combination of education and training which provides the required knowledge, skills and abilities to perform the essential functions of the job, combined with demonstrated professional growth and achievement\nAge 21 or over (Required)\nHigh School Diploma or equivalent (Required)\nValid Government-Issued Photo ID (Required)\nYOU WILL BE SUCCESSFUL IF YOU…\nAre self-motivated; micro-managing isn’t fun for anyone\nRoll your sleeves up and do the work; strategy is important, but so is getting stuff done\nCan work fast and be flexible; our industry is always changing\nPlay nice with others; we collaborate with each other a lot\nThink creatively; sometimes, the “traditional” solution isn’t the best one\nWHAT YOU GET\nConsistent, reliable benefits; Full medical/vision/dental, 401k with a possible company match, access to company-sponsored well-being programs\nBalance and flexibility; paid time off, paid parental leave, flexible work arrangements\nFinancial opportunity; an incentive program that provides opportunity to earn cash AND equity in a fast-growing company and industry\nEmployee discount\nChance to make a difference; Employee Relief Fund, community volunteerism opportunities through Benevity\nPHYSICAL REQUIREMENTS\nThe person in this position frequently communicates with other employees/customers. Must be able to communicate accurate information in these situations\nMust be able to travel up to 5%-10% of the time\nMust be able to move around the production facilities up to 30% of the time\nMust be able to work in an environment which is noisy and with temperature fluctuations from 60 degrees to 90 degrees\nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time\nConstantly operates a computer and other office productivity machinery",
    "slug": "hvac-tech-ii",
    "selectedSkills": [
      "Dental insurance",
      "Employee discount",
      "Health insurance",
      "401(k) matching",
      "Paid time off",
      "Precision measuring instruments",
      "CMMS",
      "EPA Refrigeration Certification",
      "HVAC Certification",
      "HVAC",
      "High school diploma or GED",
      "21 years or older"
    ],
    "sourceUrl": "https://x.careersincannabis.com/job/2526?utm_source=indeed&utm_medium=dashboard&utm_campaign=promote"
  },
  {
    "position": "Laboratory Technician",
    "labName": "COLUMBIA LABORATORIES, INC -",
    "location": "Portland, OR",
    "age": "",
    "type": "Full-time",
    "salaryMin": "$16 - $18 an hour",
    "jobDescriptionCopy": "Columbia Laboratories is looking for a Laboratory Technician to join our growing team. We are a long standing, accredited food safety, cannabis/hemp, and water testing laboratory in Portland, OR. Columbia Labs is a proud member of the Tentamus Group, a global team of laboratories focused on human wellness.\n\nPrimary Responsibilities:\n\nPerform sample preparation for ICP, IC, Flow Analyzer, and water distillation.\nWork with the supervisor to determine priority of samples, including;\nStandard preparation\nSample extraction\nInstrument setup\nData entry\nProperly handle and dispose of laboratory hazardous waste.\nSeek opportunities to reduce routine laboratory costs by increased efficiency (higher throughput, decreased cost of supplies).\nExecute projects as assigned to meet changing laboratory needs and requirements.\nShared responsibility for general laboratory organization and cleanliness.\nCommunication of relevant work details to Lab Supervisor and coworkers.\nOther duties as assigned.\n\nBasic Qualifications:\n\nStrong computer, scientific, and organizational skills\nExcellent communication (oral & written) and attention to detail\nAbility to work independently and as part of a team, self-motivation, adaptability, and a positive attitude\nAbility to learn new techniques, perform multiple tasks simultaneously, keep accurate records, follow instructions, and comply with company policies\nAble to stand for long periods of time and regularly lift 20 pounds.\n\nEducation and Experience:\n\nHigh School Graduate or GED with preference for candidates with experience working in a production laboratory.\nGood knowledge of Environmental laboratory terminology, wet chemistry, bench work, equipment, materials, and the techniques/procedures commonly used in a production laboratory.\nKnowledge of LIMS, Microsoft Word, Excel, and Outlook.\nFamiliarity with EPA methodologies, regulations, and environmental data compliance.\nAuthorization to work in the United States indefinitely without restriction or sponsorship.\nPosition is full-time with overtime as needed. Day Shift Monday-Friday.\n\nWho we are:\n\nTentamus Group is a global product and safety firm with a core presence in Europe, Israel, China, Japan, and North America. Tentamus evaluates and consults on products involving the human body with strong focus on food, nutraceuticals, and cosmetics. Tentamus is represented in over 80 locations worldwide with more than 3,500 highly trained staff members.\n\nwww.tentamus.com\n\nwww.columbialaboratories.com\n\nhttps://www.linkedin.com/company/tentamus-group/\n\nJob Type: Full-time\n\nPay: $16.00 - $18.00 per hour\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nFlexible schedule\nFlexible spending account\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\nDay shift\nOvertime\n\nEducation:\n\nHigh school or equivalent (Required)\n\nExperience:\n\nLaboratory Experience: 1 year (Preferred)\n\nWork Location: One location",
    "slug": "laboratory-technician",
    "selectedSkills": [
      "Health savings account",
      "Dental insurance",
      "Health insurance",
      "401(k) matching",
      "Paid time off",
      "Microsoft Excel",
      "Microsoft Outlook",
      "Laboratory information management systems",
      "Laboratory experience",
      "Organizational skills",
      "High school diploma or GED",
      "US work authorization"
    ],
    "sourceUrl": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=7&pn=2&job=sHfH49-wtABpq8MDcYDQNUY5o6QnYonok0iFqh9WPZrv8j8AbqxMrg"
  },
  {
    "position": "Laboratory Technician (PA)",
    "labName": "Steep Hill Pennsylvania -",
    "location": "Harrisburg, PA",
    "age": "",
    "type": "Full-time | Part-time",
    "jobDescriptionCopy": "APPLICANTS MUST currently live within a 45-minute commute of business location. OUT OF AREA candidates and/or those requiring a relocation will NOT be considered.\n\nPOSITION SUMMARY: This is a technical position responsible for the collection and testing of samples of various chemical compounds and biological specimens. Daily work involves the routine and repetitive use of various types of machinery, lab equipment and programs to perform tests, record data or findings and present information.\n\nESSENTIAL FUNCTIONS:\n\nPrepares and weighs product samples; performs repetitive/routine testing activities to include accessioning and pipetting\nDocuments results pertaining to strength, stability, purity, chemical content, and other characteristics\nAssembles data and other pertinent information into groups, charts, graphs, reports, and the like for others to evaluate\nHelps to set up laboratory equipment and instrumentation required for testing activities under the supervision of team analysts\nUtilizes problem-solving skills to help to determine when an apparatus may need to be recalibrated or requires servicing\nRestocks inventory supplies used in various testing activities; provides for the weekly cleaning of glassware\nRecords and verifies log entries for various pieces of equipment/apparatus including balances, incubator, refrigerator/freezer, etc.\nComplies with all established safety, health, and environmental rules and regulations designed to ensure a safe work environment\nExpected to perform other job-related duties as assigned\n\nPOSITION REQUIREMENTS:\n\nGeneral Knowledge/Abilities\n\nAbility to fluently speak and read the English language along with understanding and following both written and verbal direction\nAbility to function independently, have personal integrity, flexibility and the ability to work effectively with fellow employees\nAnalytical and numerical skills: ability to perform mathematical calculations in different units of measurement\nAbility to use concepts such as fractions, percentages, and ratios; demonstrated abilities in troubleshooting and problem-solving\nBasic knowledge of modern office practices and use of Microsoft Office Suite for Word and Excel\nExperience in driving tasks and meeting deadlines; accountable for the completion of assigned goals and objectives\nAbility to build relationships to strengthen partnerships with a focus on customer service\nAbility to perform physically demanding work such as moving and lifting equipment, standing for long periods of time, etc.\n\nEducation, Licenses/Certifications\n\nBachelor’s degree in Chemistry or a related field from an accredited college or university\nPrior experience in the Cannabis Industry and/or applicable laboratory experience may be substituted in place of degree\n\nPreferred Experience\n\n1-2 years in experience in service based/customer-facing position\n2 years academic experience in an analytical laboratory setting\n\nSUPERVISORY RESPONSIBILITIES: None\n\nJob Types: Full-time, Part-time\n\nPay: From $18.00 per hour\n\nBenefits:\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\nDay shift\nHolidays\nNight shift\nWeekend availability\n\nCOVID-19 considerations:\nVaccination against COVID-19 is required for ALL employees.\n\nEducation:\n\nBachelor's (Preferred)\n\nExperience:\n\nLaboratory: 2 years (Preferred)\n\nWork Location: One location",
    "slug": "laboratory-technician-(pa)",
    "selectedSkills": [
      "Dental insurance",
      "Health insurance",
      "Paid time off",
      "401(k)",
      "Vision insurance",
      "Analysis skills",
      "Microsoft Excel",
      "Laboratory experience",
      "Microsoft Office",
      "Microsoft Word",
      "Bachelor's degree",
      "US work authorization"
    ],
    "sourceUrl": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=7&pn=2&job=De73uNKakcbQaA0fqS-8GtsFZNj4tlJlJyMQYGfTywb6ihN-6QQKHA"
  },
  {
    "position": "ICP-MS Laboratory Chemist - Cannabis Testing",
    "labName": "Hunter Care Health -",
    "location": "Oklahoma City, OK",
    "age": "",
    "type": "Full-time",
    "salaryMin": "Estimated: $43,000 - $60,000 a year",
    "jobDescriptionCopy": "Job Title: ICP-MS Laboratory Chemist\n\nJob Type: Full Time\n\nResponsibilities:\nThe ICP-MS Laboratory Chemist will be responsible for processing and analyzing samples to provide information on compounds or quantities of metals present in samples using a variety of analytical instrumentation. Should be a subject matter expert on analysis of metals using ICP-MS.\n\nEssential Job Duties Include:\n\nSubject matter expert on analysis of heavy metals using ICP-MS, including microwave digestion procedures and routine instrument maintenance.\nFamiliarity with HPLC, GC-MS, LC-MS/MS is preferred.\nResponsible for sample preparation, instrument operation, instrument troubleshooting, and data analysis.\nPrepare and analyse samples from cannabis products to meet the rules and regulations governing medical marijuana testing in the State of Oklahoma.\nPrepare chemical solutions for use in processing samples following standardised formulas or experimental procedures.\nDocument quality control and scheduled maintenance activities.\nDemonstrates basic knowledge of laboratory quality control and assurance procedures in compliance with ISO regulations.\nResponsible for testing, calibrating, and performing quality control tests on lab equipment.\nPromotes a positive & safe work environment through understanding of safety (OSHA) regulations, practices, and procedures.\nFollows all company policies and laboratory procedures to ensure product integrity and quality control.\nWorks with laboratory information management system (LIMS).\nReports directly to the laboratory manager.\nWilling to meet on-call obligations as needed.\nKnowledge, Skills and Abilities:\n\nExperience with ICP-MS\nBachelors of Science in analytical chemistry or chemistry related science.\nIndustrial chemistry lab experience using a variety of analytical techniques and instrumentation. GLP experience preferred.\nExcellent communication skills (listening, verbal, and written) and driven with strong organizational and teamwork skills.\nSpecial Requirements:\n\nValid Driver’s License\nMust be able to legally work in the United States.\nPhysical Requirement:\n\nAble to lift/carry up to 25 pounds.\nAbility to bend at the waist, squat.\nAbility to work with hands, see, and hear.\nConditions of Employment:\n\nContingent upon a favorable background check.\nContingent on passing a pre-employment drug screen.\nMust maintain a valid driver’s license.\nThe above primary duties, responsibilities, and position requirements are not all inclusive.",
    "slug": "icp-ms-laboratory-chemist---cannabis-testing",
    "selectedSkills": [
      "Driver's License",
      "GLP",
      "High-performance liquid chromatography",
      "OSHA",
      "Laboratory experience",
      "Bachelor of Science",
      "Bachelor's degree",
      "Pass drug screening",
      "US work authorization",
      "Background check"
    ],
    "sourceUrl": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=7&pn=2&job=JKP5nplHvzBzGtZwCqDolxhoUjGKceyANhmMkZC4ko8Elv6y9-L94A"
  },
  {
    "position": "Laboratory Technician (NJ)",
    "labName": "Green Analytics New Jersey -",
    "location": "Trenton, NJ",
    "age": "",
    "type": "Full-time",
    "salaryMin": "$16 - $18 an hour",
    "jobDescriptionCopy": "APPLICANTS MUST currently live within a reasonable commute of business location. OUT OF AREA candidates and/or those requiring a relocation will NOT be considered.\n\nPOSITION SUMMARY: This is a technical position responsible for the collection and testing of samples of various chemical compounds and biological specimens. Daily work involves the routine and repetitive use of various types of machinery, lab equipment and programs to perform tests, record data or findings and present information.\n\nESSENTIAL FUNCTIONS:\n\nPrepares and weighs product samples; performs repetitive/routine testing activities to include accessioning and pipetting\nDocuments results pertaining to strength, stability, purity, chemical content, and other characteristics\nAssembles data and other pertinent information into groups, charts, graphs, reports, and the like for others to evaluate\nHelps to set up laboratory equipment and instrumentation required for testing activities under the supervision of team analysts\nUtilizes problem-solving skills to help to determine when an apparatus may need to be recalibrated or requires servicing\nRestocks inventory supplies used in various testing activities; provides for the weekly cleaning of glassware\nRecords and verifies log entries for various pieces of equipment/apparatus including balances, incubator, refrigerator/freezer, etc.\nComplies with all established safety, health, and environmental rules and regulations designed to ensure a safe work environment\nExpected to perform other job-related duties as assigned\n\nPOSITION REQUIREMENTS:\n\nGeneral Knowledge/Abilities\n\nAbility to fluently speak and read the English language along with understanding and following both written and verbal direction\nAbility to function independently, have personal integrity, flexibility and the ability to work effectively with fellow employees\nAnalytical and numerical skills: ability to perform mathematical calculations in different units of measurement\nAbility to use concepts such as fractions, percentages, and ratios; demonstrated abilities in troubleshooting and problem-solving\nBasic knowledge of modern office practices and use of Microsoft Office Suite for Word and Excel\nExperience in driving tasks and meeting deadlines; accountable for the completion of assigned goals and objectives\nAbility to build relationships to strengthen partnerships with a focus on customer service\nAbility to perform physically demanding work such as moving and lifting equipment, standing for long periods of time, etc.\n\nEducation, Licenses/Certifications\n\nBachelor’s degree in Chemistry or a related field from an accredited college or university\nPrior experience in the Cannabis Industry and/or applicable laboratory experience may be substituted in place of degree\n\nPreferred Experience\n\n1-2 years in experience in service based/customer-facing position\n2 years academic experience in an analytical laboratory setting\n\nSUPERVISORY RESPONSIBILITIES: None\n\nJob Type: Full-time\n\nPay: $16.00 - $18.00 per hour\n\nBenefits:\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\nDay shift\nHolidays\nNight shift\n\nCOVID-19 considerations:\nVaccination against COVID-19 is required for ALL employees.\n\nEducation:\n\nBachelor's (Preferred)\n\nExperience:\n\nLaboratory Experience: 2 years (Preferred)\n\nWork Location: One location",
    "slug": "laboratory-technician-(nj)",
    "selectedSkills": [
      "Dental insurance",
      "Health insurance",
      "Paid time off",
      "401(k)",
      "Vision insurance",
      "Analysis skills",
      "Microsoft Excel",
      "Laboratory experience",
      "Microsoft Office",
      "Microsoft Word",
      "Bachelor's degree",
      "US work authorization"
    ],
    "sourceUrl": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=7&pn=2&job=cfpv1SjLAz5Pi0SYAXIT_dMJ21nZyIkMJB_6pRWkrQjiGPar5BIISQ"
  },
  {
    "position": "Cannabis Extraction Chemist",
    "labName": "Kaycha Labs - 3.4",
    "location": "Gainesville, FL",
    "age": "",
    "type": "Full-time",
    "salaryMin": "Estimated: $34,000 - $45,000 a year",
    "jobDescriptionCopy": "Company Overview:\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\nJob Purpose:\n\nThe Lab Technician, Level I is responsible for working closely with our laboratory team to develop analytical skills and related experience. This position consists of many aspects from homogenizing, weighing and extracting samples, performing quality control checks, verifying various support equipment and properly disposing of all waste.\n\nOpen Shifts:\n\nMonday - Friday\n\nTuesday - Saturday\n\nSunday - Thursday\n\nEssential Duties & Responsibilities:\n\nExecute laboratory protocol and procedures under the supervision of the Lab Director.\nRegularly display good laboratory technique to avoid cross-contamination or misidentified samples.\nPerform sample preparation procedures including homogenization, weighing and liquid extraction.\nPerform QC duties as assigned, including LCS and matrix spikes.\nPerform qualitative and quantitative tests, as assigned.\nUtilize the LIMS system to create batches, enter sample prep information and maintain physical and electronic records.\nAdhere to ISO 17025 standards as well as state regulatory requirements.\nPromote a strong customer service culture while adhering to the highest safety and industry standards.\nOther duties and/or special projects as assigned.\n\nSkills, Abilities and Competencies:\n\nAbility to maintain an incredibly high degree of attention to detail and accuracy.\nStrong agility, engagement, and flexibility in an ever-changing environment.\nWorking knowledge of logging, organizing, and analyzing data.\nAbility to work in a dynamic, fast-paced deadline environment while successfully managing multiple tasks.\nStrong knowledge of Microsoft Office, including Excel, PowerPoint, and Word.\nWorking knowledge of standard laboratory protocol.\nExcellent communication skills and ability to effectively work, problem solve, and communicate with multiple levels of the organization.\n\nEducation & Experience:\n\nMinimum of Bachelor’s degree in chemistry, biochemistry or related field based on state requirements.\n0-1 year of lab experience.\nKnowledge of principles, terminology, practices, techniques commonly used in a laboratory setting preferred.\nExposure to the cannabis industry is a plus.\n\nOther:\n\nMust pass Level 2 background check.\nMust be at least 21 years old.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status\n\nJob Type: Full-time\n\nPay: From $16.00 per year\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\nDay shift\nMonday to Friday\nWeekend availability\n\nCOVID-19 considerations:\nFace masks required if unvaccinated.\n\nApplication Question(s):\n\nBest email/phone number to reach you at?\n\nEducation:\n\nBachelor's (Required)\n\nExperience:\n\nLaboratory experience: 1 year (Preferred)\nAnalytical chemistry: 1 year (Preferred)\n\nWork Location: One location",
    "slug": "cannabis-extraction-chemist",
    "selectedSkills": [
      "Dental insurance",
      "Health insurance",
      "401(k)",
      "401(k) matching",
      "Paid time off",
      "Microsoft Excel",
      "Microsoft Powerpoint",
      "Laboratory experience",
      "Communication skills",
      "Microsoft Office",
      "Bachelor's degree",
      "21 years or older",
      "Background check"
    ],
    "sourceUrl": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=7&pn=2&job=r5w4JBqafzHpF9Qal_sjpVa4S-a9HLMwOqgvf_8mDW8kBwrTMo-Sgg"
  },
  {
    "position": "Analytical Chemist",
    "labName": "Adept Life Sciences - 4.0",
    "location": "Chandler, AZ",
    "age": "",
    "type": "Full-time",
    "jobDescriptionCopy": "We are excited to hire an Analytical Chemist to our growing team!\n\nWho are we:\n\nAdept Life Sciences is a leading contract manufacturer servicing the dietary supplement & personal care industries. We manufacturer solid dose (tablet, capsule), powder, liquid, and personal care products.\n\nWe recently build a state-of-the-art, ISO accredited, independent, third-party laboratory to perform testing of raw materials, finished goods, and soon to be cannabis. We are looking to add to our lab team with the addition of a Laboratory Chemist.\n\nCustomers are our focus butso are you! We have a fast-paced culture where we encourage the team to work hard and play hard. We have built our facilities with only best in class equipment and quality measures, but we also built it for YOU. We care and want you to love where you work. For this reason, we put great thought into the design, lighting, and amenities to support a positive, comfortable, and healthy work environment.\n\nEmployee Life. We built a beautiful lunch area with pocket doors that open to a patio where you will find the team soaking up some natural Vitamin D, eating healthy snacks we provide, or playing corn-hole with colleagues. Need a little caffeine boost? Head over to our open kitchen space where we have cold brew on tap and a multi-variety soda machine.\n\nWellness & Health is our business. Perhaps you might enjoy squeezing in workout during lunch with your free membership at Life Time™, the luxury athletic retreat with locations throughout Phoenix.\n\nOur Ideal Candidate:\n\n· A Positive Attitude\n\n· Meticulous Attention to Detail\n\n· Good Time Management Skills\n\n· Punctual and Dependable\n\n· Organized and Process Oriented\n\n· Excellent analytical and critical thinker\n\n· Communicates well, spoken and written.\n\n· Can work independently or with a team\n\n· Ability to multi-task and change priorities quickly\n\n· Enjoys a fast past environment\n\nExperience/Education Must Have List:\n\n· Bachelor’s Degree in Chemistry, Biology, or Science required\n\n· Good technology and computer skills\n\n· Excellent math, reading and writing skills\n\n· Familiar with cGMP\n\n· Familiar with ISO/IEC 17025:2005 (preferred)\n\n· Experience working with FTIR, UPLC, UPTLC, GCMS, IPCMS\n\n· Understands and follows laboratory safety and procedures\n\n· Laboratory Experience (1yr preferred, >3yr is a win)\n\n· Microbiology Experience (1yr preferred)\n\nJob duties to include but not limited to:\n\n· Prepare and conduct analytical tests for microbiology and chemical analysis.\n\n· Responsible for operating HPLC, UPLC, LC-MS/MS, GC-MS, and ICP-MS and other instruments following standard operating procedures.\n\n· Perform microbiological analysis using petrifilm\n\n· Compile, document, review, interpreting, and authorization of testing results.\n\n· Assist and/or design new Lab SOPs and keep current any changes to existing SOP’s\n\n· Assist and/or train lab personnel\n\n· Perform OOS investigations and report findings\n\n· Perform routine maintenance and troubleshooting of analytical instruments.\n\n· Supervise and perform environmental monitoring and water testing\n\n· Analyze and report data to include department KPI’s\n\n· Maintain lab inventory supplies\n\n· Assigned special project analysis and implementation with growth in equipment or department.\n\nJob Type: Full-time\n\nPay: From $50,000.00 per year\n\nBenefits:\n\nDental insurance\nHealth insurance\nPaid time off\n\nSchedule:\n\n8 hour shift\nMonday to Friday\n\nApplication Question(s):\n\nWhat is your salary expectation for this position?\n\nEducation:\n\nBachelor's (Required)\n\nExperience:\n\nAnalytical Chemists: 1 year (Preferred)\n\nWork Location: One location",
    "slug": "analytical-chemist",
    "selectedSkills": [
      "Dental insurance",
      "Health insurance",
      "Paid time off",
      "Writing skills",
      "Computer skills",
      "Laboratory experience",
      "Microbiology",
      "Math",
      "Bachelor's degree"
    ],
    "sourceUrl": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=7&pn=3&job=wuGgkDjZE-0Tz1TH8Qqvxwq0kljDxRnnCzOldC7yyMdAVuzCeHiB5Q"
  },
  { "age": "", "selectedSkills": [] },
  {
    "position": "Microbiology Technician (Evening Shift)",
    "labName": "Cannabis Testing Lab -",
    "location": "Sylmar, CA",
    "age": "",
    "type": "Full-time",
    "jobDescriptionCopy": "We are a full-service cannabis testing lab offering state-mandated testing services to California’s cannabis distributors, cultivators, and manufacturers to ensure safety and accurate labeling of products for medical and recreational use.\n\nThe Microbiology Technician is a key position responsible for the testing of the laboratory samples requiring microbial pathogen screening.\n\nThis is an opportunity to come into a young company and help make it great!\n\nShift hours: 2:00pm-10:30pm Monday-Friday\n\nDuties and Responsibilities:\n\nPerform sample preparation and analysis of cannabis and cannabis products for the detection of Salmonella, Shiga toxin-producing coli (STEC), and Aspergillus species using qPCR.\nPerform DNA and RNA extractions.\nPerform plating techniques for the detection of viable yeast and mold.\nExecute method validation in accordance with ISO 17025 requirements.\nReview raw and QA/QC data ensuring it meets established criteria and upload final results into the LIMS using GLP.\nSubmit non-conforming work to the Corrective Action/Preventative Action workflow.\nWork with the Lab Director to prepare and review SOPs and other controlled documentation.\nTake inventory of supplies and create orders for supplies needed.\nWork with a team of scientists in a fast-paced environment to design and implement analytical strategies.\nPrepare technical reports.\nPerform other duties as needed.\n\nAdditional Duties May Include:\n\nAssist with the sample accessioning, homogenization, and data entry as needed.\nCross-training on separate analytical methods (HPLC, GC-MS, LC-MS/MS, ICP-MS)\nTraining other scientific staff.\n\nQualifications:\n\nBachelors in relevant field(preferred) or demonstrated technical proficiency with PCR and plating assays.\nExperience in a regulated environment (ISO 17025, GLP, or GMP)\nHigh-level understanding and adherence to sterile/aseptic technique\nAccuracy and attention to detail\nExcellent written and verbal communication skills\n\nPreferred Qualifications:\n\nExperience in a cannabis or environmental testing lab\nExperience with DNA-based pathogen screening and detection\nExperience with LIMS and ELN documentation\nExperience with METRC\n\nPlease send resume and cover letter and indicate date available to start working.\n\nJob Type: Full-time\n\nJob Type: Full-time\n\nPay: From $20.00 per hour\n\nBenefits:\n\nDental insurance\nHealth insurance\nPaid time off\nProfessional development assistance\nVision insurance\n\nSchedule:\n\n8 hour shift\nMonday to Friday\nWeekend availability\n\nEducation:\n\nBachelor's (Preferred)\n\nExperience:\n\nMicrobiology: 1 year (Preferred)\nLaboratory Experience: 1 year (Preferred)\n\nWork Location: One location",
    "slug": "microbiology-technician-(evening-shift)",
    "selectedSkills": [
      "Dental insurance",
      "Health insurance",
      "Paid time off",
      "Professional development assistance",
      "Vision insurance",
      "Laboratory information management systems",
      "Laboratory experience",
      "Assays",
      "Communication skills",
      "Microbiology",
      "Bachelor's degree"
    ],
    "sourceUrl": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=7&pn=3&job=kD9z5TZY0lVyUO4_YaMZRBj0HIEXvA7tkpKg0G8TWhdFipxlt5Egog"
  },
  {
    "position": "ICP-MS Chemistry Analyst",
    "labName": "Rm3 Labs - 3.0",
    "location": "Broomfield, CO",
    "age": "",
    "type": "Full-time",
    "salaryMin": "$19 - $23 an hour",
    "jobDescriptionCopy": "Company Description\n\nSince our founding in 2009, Rm3 Labs has been a leader in providing scientific analysis for the cannabis community of Colorado. As a fully independent, analytical laboratory located in Broomfield, we bring state-of-the-art scientific expertise and technology to help our clients produce safe, pure, and effective cannabis products. We are ISO/IEC 17025 accredited and licensed and certified by the State.\n\nJob Summary\n\nWe are looking for a full-time Chemistry Analyst with ICP-MS experience, ICP-OES experience, and/or sample preparation experience for elemental impurities testing to perform chemical tests, analyze and record test results. This position involves analyzing cannabis flower, concentrates, and infused products for pesticide and elemental impurities contamination.\n\nThis position requires being in the lab Mondays through Fridays from 7am – 3:30pm. During training (approximately first 1-2 months), the schedule will be Mondays through Fridays from 9am - 5:30pm.\n\nBenefits include three weeks of paid time off, paid holidays, maternity/paternity leave, subsidized healthcare and dental insurance, holiday bonus based on performance, and professional development assistance.\n\nNOTE: The State of Colorado requires analysts to have a four-year degree in chemistry, biochemistry or related field and one year of full-time experience in a testing laboratory. Candidates will need a Marijuana Enforcement Division (MED) employee license. Only current Colorado residents that have a four-year degree in a natural science and one year of full-time experience in a testing laboratory will be considered.\n\nResponsibilities\n\nComply with State, Local, OSHA, and ISO/IEC 17025 requirements.\nFollow laboratory SOPs to prepare and test analytical samples using traditional laboratory technologies such as ICP-MS and LC-MS.\nAccurately interpret and record data in an organized, legible, and consistent manner.\nIdentify and document departures from the quality system and/or test procedures.\nVerify lab equipment before use to ensure they are within acceptable limits.\nTroubleshoot, clean and maintain laboratory equipment and supplies.\nPrepare and review test reports for clients within prescribed reporting deadlines.\nPrepare lab reagents and working standards and verify them before use.\nPerform general laboratory tasks such as inventory and consumables ordering, sample archival and disposal, cleaning and similar lab duties.\nPerform special projects, as assigned.\nReport concerns to the Lead Chemist.\n\nRequirements\n\nBS/BA in chemistry, biochemistry, or related field and at least one year of experience in a testing lab is required by State regulation, no exceptions.\nICP-MS experience, ICP-OES experience, and/or sample preparation experience for elemental impurities testing required.\nMust pass an extensive background check with no felony convictions and obtain a Colorado Department of Revenue – MED employee license prior to or at the time of hire.\nAble to work independently and part of a team in a fast-paced environment.\nAble to interact professionally with colleagues and bring up concerns immediately when you are faced with them.\nGreat written and verbal communication skills.\nExcellent laboratory troubleshooting skills.\nDetail and accuracy oriented.\nComputer skills and experience in Windows and Microsoft Office, particularly Excel.\n\nThe Ideal Candidate\n\nThrives in a fast-paced, professional, and fun work environment.\nIs self-motivated, curious, and focused on continual improvement.\nHas a passion for cannabis or the cannabis industry.\nExperience with HPLC, LC-MS, GC, and/or GC-MS, instrumentation is a strong plus.\nExperience in high-throughput, ISO/IEC 17025 accredited, and or FDA/EPA/USDA labs is a strong plus.\n\nJob Type: Full-time\n\nPay: $19.00 - $23.00 per hour\n\nBenefits:\n\nDental insurance\nHealth insurance\nPaid time off\nParental leave\nProfessional development assistance\n\nSchedule:\n\n8 hour shift\nMonday to Friday\n\nSupplemental Pay:\n\nBonus pay\n\nCOVID-19 considerations:\nAll employees and visitors must wear a mask.\n\nApplication Question(s):\n\nAre you a Colorado resident? We are only considering Colorado residents at this time.\nHow many months/years of experience in sample preparation for elemental impurities testing do you have?\nHow many months/years of ICP-MS or ICP-OES experience do you have?\nPlease list all the times you are available in the next two weeks for a 15-30 minute phone interview.\n\nEducation:\n\nBachelor's (Required)\n\nExperience:\n\nfull-time lab testing outside of college: 1 year (Required)\n\nWork Location: One location",
    "slug": "icp-ms-chemistry-analyst",
    "selectedSkills": [
      "Dental insurance",
      "Health insurance",
      "Paid time off",
      "Professional development assistance",
      "Parental leave",
      "Microsoft Excel",
      "Windows",
      "Computer skills",
      "High-performance liquid chromatography",
      "Laboratory experience",
      "Bachelor of Science",
      "Bachelor's degree",
      "Background check"
    ],
    "sourceUrl": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=7&pn=3&job=jZ0VHlsYWNyEzUAIIQvslR-HFhfw8CNQBAQ0B6PWI3YMc1ZOb2CQyQ"
  },
  {
    "position": "Chemistry Laboratory Technician",
    "labName": "Rm3 Labs - 3.0",
    "location": "Broomfield, CO",
    "age": "",
    "type": "Full-time",
    "salaryMin": "$18 - $19 an hour",
    "jobDescriptionCopy": "Company Description\n\nSince our founding in 2009, Rm3 Labs has been a leader in providing scientific analysis for the cannabis community of Colorado. As a fully independent, analytical laboratory located in Broomfield, we bring state-of-the-art scientific expertise and technology to help our clients produce safe, pure, and effective cannabis products. We are ISO/IEC 17025 accredited and licensed and certified by the State.\n\nJob Summary\n\nWe are looking for full-time Chemistry Laboratory Technicians to prepare samples for chemical analysis in one or more of our chemistry departments, assist with sample extractions and dilutions, and assist with other general laboratory tasks and projects.\n\nThe schedule for this position is Mondays through Fridays from 10am – 6:30pm. During training (approximately first 1-2 months), the schedule will be Mondays through Fridays from 9am - 5:30pm. The schedule for this position is unlikely to change, so candidates must be comfortable with this schedule.\n\nBenefits include three weeks of paid time off, paid holidays, maternity/paternity leave, subsidized healthcare and dental insurance, holiday bonus based on performance, and professional development assistance.\n\nResponsibilities\n\nComply with State, Local, OSHA, and ISO 17025 requirements.\nFollow laboratory SOPs to weigh and prepare analytical samples for testing using balances, pipettes, fume hoods, vortexers, centrifuges, etc.\nAccurately record data in an organized, legible, and consistent manner.\nIdentify and document departures from the quality system and/or test procedures.\nVerify lab equipment before use to ensure they are within acceptable limits.\nPrepare lab reagents, working standards, and/or media and verify them before use.\nPerform general laboratory tasks such as inventory, sample archival and disposal, cleaning, and similar lab duties.\nAdhere to strict reporting deadlines.\nPerform special projects, as assigned.\nReport concerns to the Lead Chemist.\n\nRequirements\n\nMust be comfortable with the mentioned schedule.\nMust be a Colorado resident and at least 21 years old, no exceptions.\nMust have at least an Associate's Degree in Science, no exceptions.\nMust pass an extensive background check with no felony convictions and obtain a Colorado Department of Revenue – MED employee license prior to or at the time of hire.\nAble to work independently and part of a team in a fast-paced environment.\nAble to interact professionally with colleagues and bring up concerns immediately when you are faced with them.\nGreat written and verbal communication skills.\nExcellent laboratory troubleshooting skills.\nDetail and accuracy oriented.\nComputer skills and experience in Windows and Microsoft Office, particularly Excel.\n\nThe Ideal Candidate\n\nHas little experience working in a laboratory (this is an entry level position).\nIs comfortable performing repetitive tasks.\nThrives in a fast-paced environment and adapts well to change.\nHas experience handling large sample loads or would be able to easily adapt to large sample loads.\nHas a passion for cannabis or the cannabis industry.\n\nJob Type: Full-time\n\nPay: $18.00 - $19.00 per hour\n\nBenefits:\n\nDental insurance\nHealth insurance\nPaid time off\nParental leave\nProfessional development assistance\n\nSchedule:\n\n8 hour shift\nWeekend availability\n\nSupplemental Pay:\n\nBonus pay\n\nCOVID-19 considerations:\nAll employees and visitors must wear a mask.\n\nApplication Question(s):\n\nAre you a Colorado resident? We are only considering Colorado residents at this time.\nDo you already have a Marijuana Enforcement Division (MED) badge?\nPlease list all the times you are available in the next two weeks for a 15-30 minute phone interview.\n\nEducation:\n\nAssociate (Required)\n\nWork Location: One location",
    "slug": "chemistry-laboratory-technician",
    "selectedSkills": [
      "Dental insurance",
      "Health insurance",
      "Paid time off",
      "Professional development assistance",
      "Parental leave",
      "Microsoft Excel",
      "Windows",
      "Computer skills",
      "Laboratory experience",
      "Communication skills",
      "Associate's degree",
      "21 years or older",
      "Background check"
    ],
    "sourceUrl": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=7&pn=3&job=pdhMQ8EtFw-LxueK0YHOLikPBHvCSemRLQmIAAlEqW5veqMAIc56Tg"
  },
  {
    "position": "Infused Product Manager",
    "labName": "Jushi - 2.1",
    "location": "Scranton, PA",
    "age": "",
    "type": "Full-time",
    "salaryMin": "Estimated: $56,000 - $73,000 a year",
    "jobDescriptionCopy": "GET TO KNOW JUSHI\n\nWe identify, evaluate, and acquire U.S.-based cannabis within each state to vertically integrate, produce, and distribute medical grade cannabis formulations in the United States offering patients and customers premium, high-grade cannabis and related products.\n\nWHO IS PAMS?\n\nPennsylvania Medical Solutions, LLC is focused on integrating standard medical, scientific, and operational practices into the medical cannabis industry, improving the quality, safety and affordability of cannabis-based medicines for our patients in Pennsylvania.\n\nTHE OPPORTUNITY\n\nThe Infused Product Manager at PAMS leads the activities and operations required to complete the functions of the department. This role is responsible for cannabis infused products synthesis, which includes but is not limited to formulation, emulsification, blending, unit production, and production of cannabis-infused products. The Infused Product Manager will report directly to the Director of Manufacturing at PAMS and have a consistent impact across the organization - advancing the mission of customer service, product development, and brand growth through the execution of Jushi’s core values.\n\nGENERAL JOB DUTIES\n\nProvide effective leadership to employees to ensure a complete understanding of, and alignment to the Company’s vision, mission, and values to maintain a positive work environment and a high level of morale.\nResponsible for managing the daily activities of cannabis infused products production within production laboratory facilities and operations.\nBe an effective leader who understands modern (21st century) business practices applicable to the global marketplace.\nPossess a thorough and honest understanding of the cannabis moment, including passion for cannabis science, and application of same.\nPractice authentic and excellent interpersonal skills, with an unrehearsed ability to understand and manage human affairs.\nPositively respond to the team's questions, concerns and suggestions and takes immediate action as necessary to effectively resolve conflicts.\nDeliberately and consciously practice professionalism, and righteous transformational initiatives.\nHave a thirst for continuous learning.\nVersed in planning, organizing, assigning, and coordinating the activities and resources of the department.\nRobust understanding and application of basic scientific principles as well as production laboratory operations.\nAbility to follow written instruction and maintain a laboratory notebook as well as production records and production logs.\nDevelops, maintains, and implements standard operating procedures for all cannabis infused products and techniques developed.\nMust follow all applicable policies, procedures, and guidelines. This includes the safe and proper operation of any/all relevant machinery, instrumentation, and equipment.\nSets up, operates, and maintains production laboratory equipment, monitors experiments, makes observations, calculates mathematically and records results.\nKnowledge of manufacturing analytical testing, (which includes but is not limited to, HPLC, GC, ICP MS, UV/VIS, IR, Moisture Analysis, Particle Size Analysis, Microbial Testing); and monitors product disposition against these test results to support quality of infused products synthesized.\nDevelops and implements research and development procedures, programs, and techniques to meet organizational needs and to capitalize on potential new products.\nWorks collaboratively with product development towards innovative formulations that meet both patient and company guidelines for effectiveness, cost, and stability; must be able to take formulations from lab scale to full production.\nAbility to adapt to and implement new methods and techniques for operational and product improvement, technical development, and new product development.\nManage inventory and ensure the seed-to-sale system is properly maintained.\nMaintain clean and sanitary laboratories and work environments including but not limited to all equipment, work-stations, document controls and common areas.Responsible for preventative maintenance and keeping all equipment operational.\nAssist with compliance, including the creation of batch production records, and product labels specific to the state of Pennsylvania, and in accordance with company standards.\nStay current on scientific and associated, literature and legislation in the cannabis industry, following cannabis research, industry trends and education.\nPartner collaboratively with other department managers including but not limited to, extraction, refinement, processing, packaging, facilities, security, cultivation, quality and compliance.\nPartner with management to develop, document, and keep current Standard Operating Procedures for production sequences and formulations.\nOther duties as assigned.\n\nEDUCATION & EXPERIENCE\n\nBachelor’s Degree in Chemistry, Formulation Chemistry, Biochemistry, Manufacturing, Food Science, Engineering, and/or similar scientific field; and/or at least 2 years’ experience in cannabis manufacturing or 5+ years managing professional laboratory environment.\nDemonstrated strategic experience in overseeing all aspects of professional production laboratory environments including managing a production team with diversity, equipment handling, production operations, processing, implementation, coordinating supplies, and maintaining equipment.\nMust be 21 years of age at time of hire.\nValid State driver’s license or State ID card.\nA minimum of 3 years supervisory and/or managerial experience leading a large diverse team of professionals.\nKnowledge and experience related to producing CPG or medical marijuana products this includes but is not limited to: creating consumables, extraction techniques and routes of administration.\nWork history showing progressive responsibility, willingness to accept additional projects or challenges, 21st century industrial competences, and wisdom.\nAbility to maintain confidentiality; reliability, trustworthiness and honesty.\nAbility to remain calm in potential periods of high stress or unusual activity.\nProficiency in mathematics is an absolute requirement for all operations.\nProficient knowledge of the chemistry related to all manufacturing operations.\nDemonstrated ability to achieve manufacturing objectives in terms of volume, product mix, cost, and quality.\nExtensive knowledge in environment, health and safety standards in manufacturing operations required.\nExtensive knowledge of extraction and chemical processing techniques.\nAbility to listen well and communicate effectively, orally and in writing with various audiences.\nKnowledge and ability to use standard production laboratory equipment; filling equipment, vacuum ovens, hot plates, etc.\nDemonstrated experience in organizational development, personnel management, budget and resource development, and strategic planning.\nProficiency with Microsoft Office Suite, Word, and Excel with a strong attention to detail.\nMust be and remain compliant with all legal or company regulations for working in the cannabis industry\n\nPHYSICAL REQUIREMENTS\n\nFrequent sitting and walking\nOccasionally Twist/bend/stoop/squat, kneel/crawl\nAbility to communicate orally with management and other co-workers is crucial. Regular use of the telephone and e-mail for communication may be required. Sitting or standing for extended periods is common. Hearing and vision within normal ranges is essential for normal conversations, to receive ordinary information and to prepare or inspect documents.\nSome heavy lifting may be required. Exertion of up to 50 lbs. of force occasionally may be required.\nGood manual dexterity for the use of office equipment and manual tools.\n\nWORK ENVIRONMENT\n\nThe job is performed indoors and outdoors. Must be able to work in hot, humid environments for extended periods of time with exposure to dust, allergens, and water. Appropriate PPE will be provided. Activities include extended periods of sitting, standing, kneeling, stooping and bending. Twisting in tight areas may also be required at times.\n\nOTHER DUTIES\n\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities, and activities may change at any time with or without notice\n\nPennsylvania Medical Solutions, LLC is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, sex, sexual orientation, gender identity or expression, religion, national origin or ancestry, age, disability, marital status, pregnancy, protected veteran status, protected genetic information, political affiliation, or any other characteristics protected by local laws, regulations, or ordinances.\n\nWe offer benefit packages that may include: Medical, Dental, Vision, Life, Short and Long Term Disability, Flexible Spending Accounts, Paid Time Off, Paid Holidays, and 401(k)\n\n6n9trdwHyL",
    "slug": "infused-product-manager",
    "selectedSkills": [
      "Dental insurance",
      "Health insurance",
      "Disability insurance",
      "Paid time off",
      "401(k)",
      "Writing skills",
      "Manufacturing",
      "Microsoft Excel",
      "Driver's License",
      "Heavy lifting",
      "Bachelor's degree",
      "21 years or older"
    ],
    "sourceUrl": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=7&pn=3&job=yYkRInQ4hBpqWLZhg36CgplGnzpGfCgUwpfIrmkBYZwV2JZ54jKwTw"
  },
  {
    "position": "A/P Clerk",
    "labName": "Kaycha Labs - 3.4",
    "location": "Fort Lauderdale, FL",
    "age": "",
    "type": "Full-time",
    "jobDescriptionCopy": "Company Overview:\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\nEssential Duties & Responsibilities:\n\nEnter A/P invoices\nMatch supporting documentation to Credit Card transactions\nFiling\nMail payments\nOther duties as assigned to support Accounting Manager\n\nEducation & Experience:\n\nBachelor’s degree in accounting, finance or general business administration preferred.\nSage X3 Experience (2-3 years)\n\nSkills, Abilities and Competencies:\n\nExcellent verbal and written communication skills.\nTeam-oriented individual with strong attention to detail\nSolid organization skills, such as multitasking and effective time-management\nMulti-tasker who can prioritize tasks to achieve time-sensitive deadlines\n\nOther:\n\nMust pass Level 2 background check.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.f.\n\nEssential Functions:\n\nThe physical demands described here are representative of those that an employee must meet to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nWhile performing the duties of this job the employee is frequently required to stand, handle or feel, to speak, and to hear. The employee is occasionally required to walk, sit, reach with hands and arms, bend, kneel, crouch, or crawl. The employee must frequently lift and/or move up to thirty-five (35) pounds.\n\nSpecific vision abilities required for this job include close (proximity) vision, depth perception, and the ability to adjust focus.\n\nWork Environment:\n\nThe work environment described here is representative of that which an employee may encounter while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nThe standard analytical laboratory environment is one in which potential health hazards do exist. Administrative, operations, technical, and professional staff are expected to safely operate in accordance with applicable and appropriate health and safety policies and procedures, as prescribed by the applicable Kaycha manuals and policies and/or federal, state, or local standards.\n\nLaboratory staff can be expected to work in areas where hazards associated are with, but not limited to, airborne pathogens. Biological materials, hazardous substances, and radioactive material exist and are handled. Appropriate training is provided regarding these hazards and staff are expected to adhere to all health and safety policies at all times, whether they are in writing or verbalized by a supervisor.\n\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.\n\nThe above is intended to describe the general content of and requirements for the performance of this job. It is not to be construed as an exhaustive statement of duties, responsibilities, or physical requirements. Nothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions\n\nJob Type: Full-time\n\nPay: From $16.00 per hour\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nDisability insurance\nEmployee assistance program\nFlexible spending account\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\nDay shift\nMonday to Friday\nOvertime\n\nApplication Question(s):\n\nBest email and phone number to reach you at?\n\nEducation:\n\nBachelor's (Required)\n\nExperience:\n\nSage X3: 2 years (Required)\nAccounts payable: 2 years (Preferred)\n\nWork Location: One location",
    "slug": "a/p-clerk",
    "selectedSkills": [
      "Dental insurance",
      "Health insurance",
      "401(k)",
      "Flexible spending account",
      "Employee assistance program",
      "Sage",
      "Accounts payable",
      "Communication skills",
      "Time management",
      "Bachelor's degree",
      "Background check"
    ],
    "sourceUrl": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=7&pn=4&job=BzR_NMwZSyPQwbH474hXGc0kXLSoriKQIkvCUbIL3pc-hvZYZK--fw"
  }
]
