[{"position":"PUBLIC HEALTH LABORATORY SCIENTIST SUPERVISOR (FULL TIME CONTRACTUAL)","labName":"State of Maryland","location":"Linthicum, MD","age":"1 day ago","type":"Full-time","salaryMin":"$29.89 ","salaryMax":" $38.95 an hour","jobDescriptionCopy":"GRADE\n20\nLOCATION OF POSITION\nMDH, Maryland Medical Cannabis Commission, Linthicum, MD\nMain Purpose of Job\nThe Public Health Laboratory Scientist Supervisor functions as a full-performance laboratory scientist in the Maryland Medical Cannabis Commission Office of Scientific Support (OSS) Reference Laboratory. This position performs, and supervises Public Health Laboratory Scientists performing, a variety of laboratory tests, assays, analytical procedure validations and quality assurance and quality control studies in such fields as analytical and environmental chemistry, and diagnostic and environmental microbiology.\nMINIMUM QUALIFICATIONS\n\nEducation: A Bachelor’s degree in Biochemistry, Biology, Biotechnology, Chemistry, Genetics, Immunology, Microbiology, Molecular Biology, Medical Technology, Pharmacy or Zoology from an accredited college or university.\n\nExperience: Four years of experience working in a chemistry laboratory performing analytical tests on environmental, biological or multi-matrix samples; or four years of experience working in a medical or public health laboratory performing diagnostic or public health testing on human specimens.\n\nNotes:\n1. Candidates may substitute additional graduate education at an accredited college or university at the rate of 30 credit hours in the above noted disciplines for each year of the required experience for up to two years of the required experience.\n\n2. Candidates may substitute U.S. Armed Forces military service experience as a commissioned officer in Health Science Research Officer classifications or Medical Laboratory Specialists specialty codes in the Science related field of work on a year-for-year basis for the required education.\n\nSPECIAL REQUIREMENTS\nEmployees in this classification are subject to substance abuse testing in accordance with Code of Maryland Regulations 17.04.09, Testing for Illegal Use of Drugs.\nSELECTION PROCESS\n\nApplicants who meet the minimum (and selective) qualifications will be included in further evaluation. The evaluation may be a rating of your application based on your education, training and experience as they relate to the requirements of the position. Therefore, it is essential that you provide complete and accurate information on your application. Please report all related education, experience, dates and hours of work. Clearly indicate your college degree and major on your application, if applicable. For education obtained outside the U.S., any job offer will be contingent on the candidate providing an evaluation for equivalency by a foreign credential evaluation service prior to starting employment (and may be requested prior to interview).\n\nComplete applications must be submitted by the closing date. Information submitted after this date will not be added.\n\nIncorrect application forms will not be accepted. Resumes will not be accepted in lieu of a completed application.\n\nCandidates may remain on the certified eligible list for a period of at least one year. The resulting certified eligible list for this recruitment may be used for similar positions in this or other State agencies.\n\nBENEFITS\n\nContractual employees who work for an agency covered under the State Employee and Retiree Health and Welfare Benefits Program, have a current employment contract and work 30 or more hours a week (or on average 130 hours per month) may be eligible for subsidized health benefits coverage for themselves and their dependents. As a contractual employee, you will be responsible for paying 25% of the premiums for your medical and prescription coverage, including any eligible dependents you have enrolled. The State of Maryland will subsidize the remaining 75% of the cost for these benefits. You can also elect to enroll in dental coverage, accidental death and dismemberment insurance, and life insurance, but will be responsible to pay the full premium for these benefits.\n\nLeave may be granted to a contractual employee who has worked 120 days in a 12 month period. This leave accrues at a rate of one hour for every 30 hours worked, not to exceed 40 hours per calendar year.\n\nFURTHER INSTRUCTIONS\n\nOnline applications are highly recommended. However, if you are unable to apply online, the paper application (and supplemental questionnaire) may be submitted to MDH, Recruitment and Selection Division, 201 W. Preston St., Room 114-B, Baltimore, MD 21201. Paper application materials must be received by 5 pm, close of business, on the closing date for the recruitment, no postmarks will be accepted.\n\nIf additional information is required, the preferred method is to upload. If you are unable to upload, please fax the requested information to 410-333-5689. Only additional materials that are required will be accepted for this recruitment. All additional information must be received by the closing date and time.\n\nFor questions regarding this recruitment, please contact the MDH Recruitment and Selection Division at 410-767-1251.\n\nIf you are having difficulty with your user account or have general questions about the online application system, please contact the MD Department of Budget and Management, Recruitment and Examination Division at 410-767-4850 or Application.Help@maryland.gov.\n\nAppropriate accommodations for individuals with disabilities are available upon request by calling: 410-767-1251 or MD TTY Relay Service 1-800-735-2258.\n\nWe thank our Veterans for their service to our country.\n\nPeople with disabilities and bilingual candidates are encouraged to apply.\n\nAs an equal opportunity employer, Maryland is committed to recruitment, retaining and promoting employees who are reflective of the State's diversity.","slug":"public-health-laboratory-scientist-supervisor-full-time-contractual-eaa6874a-dc41-44eb-85c4-764c577ec888","benefits":["Prescription drug insurance","Dental insurance","Health insurance","AD&D insurance","Life insurance"],"selectedSkills":["Military","Laboratory experience","Public health","Bachelor's degree"],"jobType":"free","applyURL":"https://jobapscloud.com/MD/sup/bulpreview.asp?R1=22&R2=001094&R3=0006"},{"position":"Cannabis Production Technician","labName":"Default Company","location":"Freeport, IL","age":"7 days ago","type":"Full-time","salaryMin":"$32,000 ","salaryMax":" $44,000 a year","jobDescriptionCopy":"Duties and Responsibilities\nThe main responsibilities of the Production Technician include all aspects of the daily care of medicine from harvest to packaging; monitoring weights and measurements; presentation; and maintain the highest levels of cleanliness and sterility inside the processing area. Other duties may be assigned.\nAssists in harvesting, processing and packaging finished medicine\nPrepare equipment and plant materials for extraction\nMaintain strict inventory records of all plant materials, chemicals and equipment used in the laboratory\nRecords and tracks accurate weights and measurements of medicine throughout the processing and packaging procedures using company systems and protocols\nMaintains cleanliness of laboratory, keep post processing glassware clean and ready for use, help to clean extraction equipment and general laboratory facility duties\nInspects medicine for defects using a variety of magnification tools\nAssist in cannabis extraction preparation, winterization, and filtration\nMust be able to proficiently handle the following hazardous materials; butane, propane, ethanol, pentane, isopropyl alcohol, critically hot material, cryogenic cold material\nCalibrates, operates, cleans, and stress packaging equipment including heat sealers, etc. according to Company policy and as directed by the Processing Manager\nMaintains quality control measures to ensure a high-quality product\nEnsures compliance with State regulations and testing requirements\nPrepares inventory reports to ensure products are available, on point and in demand\nMaintains inventory of supplies, materials, equipment, including material safety data sheets for all chemicals and products\nDemonstrates basic knowledge of cannabis medical products (distillate, oils, terpenes, tinctures, topicals, concentrates, edibles etc.)\nReceive, unpack, and deliver goods/supplies; re-stock items as necessary; label shelves etc.\nReview the processing schedule and forecasts for key dates, quantities, strains, etc.\nAdvise on the effects of management decisions relating to processing, strain selection, and processes\nInteract with Metrc, inventory systems, and Excel reports to ensure that all material is being tracked in accordance with state law; as well as logging and reporting as required by state law\n\nBasic Qualifications:\nHigh school diploma or equivalent.\nMinimum of 1 year experience in horticulture, botany, or related field, preferred\nKnowledge of basic computer and office equipment operations (inventory systems; Word; Excel; Office equipment such as copiers/telephone systems)\nMath required for inventory, projections, and measurements\n\nAdditional Qualifications:\nAssociate degree in biology or chemistry, preferred.\nWork history showing progressive responsibility, willingness to accept additional projects or challenges\nExcellent organizational and communication skills\nMust be a self-starter, flexible to work in a collaborative structure and thrive in a fast-paced environment.\nExperience with a commercial cannabis, Agricultural, or landscaping facility/company preferred\nAdvanced knowledge of the cannabis plant and genetics strongly preferred, though a strong agricultural background may be considered\nKnowledge of large-scale commercial plant cultivation including nutrient requirements, mediums, light requirements, temperature control, humidity manipulation, air flow, etc.\nKnowledge of different strains of cannabis and their unique growing demands desired\nAbility to execute techniques consistently\nGood documentation, inventory, and organization skills\nAbility to keep to a tight schedule\nMust be proficient with computers\nExcellent time-management skills\nAbility to effectively plan and prioritize, maintain confidentiality, attention to detail, work effectively as part of a team and communicate clearly and calmly.\nPhysical Requirements\nExtended time standing, walking, bending, and reaching\nClose visual focus required\nThis position occasionally requires the extended and repetitive use of arms, hands and fingers to cut and manipulate small objects\nMust pass State Mandated Background Check","slug":"cannabis-production-technician-5dd3a32a-1b2a-4e6d-b94b-30d9a77566ee","benefits":[],"selectedSkills":["Horticulture","Genetics","Microsoft Excel","Communication skills","Computer literacy","High school diploma or GED","Associate's degree","Background check"],"jobType":"free","applyURL":"https://x.careersincannabis.com/job/3959?utm_source=indeed&utm_medium=dashboard&utm_campaign=promote"},{"position":"Manufacturing Technician","labName":"Default Company","location":"Egg Harbor Township, NJ","age":"7 days ago","type":"Full-time","salaryMin":"$35,000 ","salaryMax":" $47,000 a year","jobDescriptionCopy":"Job Summary:\nThe Manufacturing Technician will assist with the production of high-quality cannabis extracts and products, along with cleaning and maintenance of laboratory grade equipment, recording and entering data in multiple forms, and associated tasks delegated by management. The Manufacturing Technician will be responsible for consistent, sanitary and safe production of extracts adhering to company policies to successfully uphold quality control and consistent product production. The individual has the responsibility of extracting, refining and purifying terpenes and cannabinoids from plant material into concentrated forms with or without using solvents. The individual will also assist in the filling and packaging of medical cannabis derived products.\n\nDuties/Responsibilities:\nPrepare biomass for solvent based extraction and post processing.\nSample preparations and logging for analytical testing.\nAdhere to specific manufacturing and quality control SOP’s regarding procedural operations and quality of product.\nFollow current good manufacturing practices (cGMP).\nIdentify unsafe scenarios as they pertain to the Manufacturing Department.\nPerforms daily safety inspections for extraction systems.\nSafely and effectively perform all methods of the cannabis extraction and refinement process practiced at the Egg Harbor Township facility as directed by Management, including but not limited to, ethanol and CO2 extractions, winterization, filtration, color remediation, ethanol recovery and distillation.\nClean and maintain extraction equipment and the manufacturing facility\nAssist in the manufacturing of medical grade products according to company SOPs as needed\nAssist in packaging approved manufactured products into their designated packaged materials for dispensing; this may include syringe filling, capping, vape cartridges, tincture bottles, etc. and assembly of product containers.\nKeep track of and update inventory records of supplies, materials, and equipment.\nEnsure proper storage of supplies and equipment, disposal of waste according to state guidelines.\nComplies with Egg Harbor Township facility SOPs and New Jersey guidance on proper disposal methods for solvent and cannabis contaminated waste.\nManage high-stress situations and be flexible and adaptable in a fast-paced environment, when the situation requires.\nPerform general routine maintenance on manufacturing equipment - troubleshooting, preventative maintenance and regular data logging.\nWash and sanitize lab surfaces, glassware, equipment, and any other ancillary lab equipment.\nEffective communication with the Management Team to ensure all operational needs are met and any procedural problems are addressed and resolved proactively\nOpen to constructive criticism and guidance and offer the same to others in the department.\nAbility to work a varying schedule including nights, weekends, and overtime as determined by process demands.\nSupport as necessary other departmental personnel and activities as process demands.\nPunctuality – Must arrive on time for each shift and take breaks/ lunch as scheduled.\nMay help in other departments as needed/Other duties as assigned.\n\nCompetencies - Required Skills/Abilities:\nExcellent time management skills with a proven ability to meet deadlines.\nStrong mechanical and problem-solving ability.\nAbility to function well in a high-paced and at times stressful environment.\nProficient with Microsoft Office Suite.\nKnowledge of production laboratory processes and procedures.\nUnderstanding of basic laboratory terminology and concepts.\nMeticulous organizational skills and attention to detail.\nInterpret and follow complex, written, verbal and technical instructions. Must be able to adhere to facility SOPs.\nLearn complex technical procedures in a timely manner.\nAbility to work independently once fully trained.\nPass the State of NJ required background check.\n\nEducation and Experience:\nHigh School Diploma or equivalent, and 1-2 years experience in a manufacturing setting preferred.\nBachelor’s degree\n\nPhysical Requirements:\nMust be able to work quickly but efficiently, while maintaining the integrity of the product.\nLight to moderate lifting of up to 50 lbs; heavier weights with assistance.\nMust be able to stand for prolonged periods of time.\nRepetitive motions and understanding of lab equipment.\nMust wear provided lab coat, hair/beard nets, gloves, surgical masks and safety glasses/ goggles/ splash shield, while working in the lab.\nMust adhere to the Egg Harbor Township facility general hygiene requirements.\nCapacity to stay focused on the task at hand.\nTeam player - works well with others.","slug":"manufacturing-technician-b3718f60-9c86-46cb-b753-101577133829","benefits":[],"selectedSkills":["Manufacturing","Time management","Microsoft Office","Bachelor's degree","High school diploma or GED","Background check"],"jobType":"free","applyURL":"https://x.careersincannabis.com/job/3963?utm_source=indeed&utm_medium=dashboard&utm_campaign=promote"},{"position":"Extraction Team Lead","labName":"Trulieve","location":"Adel, GA","age":"8 days ago","type":"Full-time","salaryMin":"$40,000 ","salaryMax":" $53,000 a year","jobDescriptionCopy":"“Trulieve Grows One Patient at a Time”\n\nIf you have an interest in being part of one of the fastest growing industries in the nation in you may consider wanting to work for Trulieve! If you have a desire to help others in need through your efforts, this may be the role for you!\n\nAt Trulieve, we strive to bring our patients the relief they need in a product they can trust. Our plants are hand-grown in an environment specially designed to reduce unwanted chemicals and pests, keeping the process as natural as possible at every turn.\n\nOur products are designed to alleviate seizures, severe and persistent muscle spasms, pain, nausea, loss of appetite, and other symptoms associated with serious medical conditions such as cancer.\n\nOur specially trained staff works hand-in-hand with physicians to provide the right products and the correct dosage to ensure patients get the compassionate care they need.\n\nRequisition ID: 1017\n\nRemote Work Available: No\n\nJob Title: Extraction Lead\n\nDepartment: Processing\n\nFLSA Status: Regular- Non-Exempt\n\nLocation: Adel, GA\n\nRole Summary:\nTrulieve is looking for an Extraction Lead to support our extraction and production operations.? You should be very technically astute in mechanical, electrical, and computer operated systems utilized in production/manufacturing environments. You need to be proactive, quick thinking and innovative in your approach.\n\nKey Duties and Responsibilities:\nEnsure that team members are properly communicated the goals of the shift, week, and month\nTraining new team members on extraction equipment and procedures.\nEnsuring policy and procedure compliance across all processes within the department.\nMonitoring employee attendance and performance.\nOversee equipment cleaning and maintenance policies, ensuring equipment is well maintained.\nMaintaining strict inventory records of all plant materials, chemicals, and equipment used in the facility, assisting in improving records when needed\nOversee process flow throughout department, making changes in allocation of resources to meet demand\nOperating, maintaining, and making adjustments and repairs to extraction equipment\nEnsuring team members store supplies and equipment and disposal of waste according to guidelines\nMaintaining inventory records of supplies, materials, and equipment and preparing requisitions as needed\nMaintaining material safety data sheets for all chemicals and products\nFollowing all standard operating procedures regarding product creation and lab safety\nWorks with testing laboratory as defined by state guidelines\nOther duties as assigned\n\nSKILLS AND QUALIFICATIONS:\nBachelor’s or Associate degree or its equivalent, from a recognized college or university, with a major in chemistry or biology preferred\nUnderstanding of state and local laws\nUnderstanding of proper and safe handling of hazardous materials\nFamiliarity with separations, isolations and fractionation\nKnowledge of solvent and solvent free extraction methods\nStay current of practices and new developments in the cannabis extraction industry\nAbility to work quickly without compromising accuracy\nAbility to discern the quality of plant material and finished products\nStrong computer and social skills\nCannabis knowledge including specifically Ethyl extraction\nStrong leadership skills\nStrong communication skills\nManufacturing experience preferred\n\nADDITIONAL MINIMUM QUALIFICATIONS:\nMust be a minimum of 21 years of age\nMust successfully complete a comprehensive background screening\n\nPHYSICAL REQUIREMENTS:\nMust be able to push, pull, move, and/or lift a minimum of 50 lbs to a minimum height of 5 feet and able to push, pull, move, and/or carry such weight a minimum distance of 50 feet, with or without mechanical assistance\nMust be able to work seated/standing as appropriate at workstations for extended periods of time, maintain body equilibrium while climbing ladders, stairways, stopping, kneeling, crouching, and reaching, and use hands/fingers to hold, grasp, turn, pick, pinch frequently/constantly to complete tasks\nMust be able to handle organic matter daily, able to wear PPE as appropriate (eye, face, hand, arm, head, foot, body, fall protection), and able to be exposed to hot, cold, wet, humid, or windy conditions while wearing PPE (95 degrees or greater)\nMust have visual acuity with/without job aids to perform activities such as; reading, viewing a computer terminal, visual inspection involving small parts/details. Clarity of vision at 20 ft or more in day and night/dark conditions\nMust be able to speak and communicate verbally at conversation levels with co-workers, vendors, etc. (Moderate noise)\n\nWORK SCHEDULE:\n40+ hours weekly with flexible hours depending on department needs. Must be available to work occasional evenings, weekends, and holidays\n\nEqual Opportunity Employer l Trulieve Supports a Drug Free Workplace\n\nCustom Fields\n\nSalary will be commensurate with experience. A comprehensive benefits package including paid time off is offered with this position. This position will work an average of 40 hours per week and will be available “after hours” if an emergency situation should arise.\n\nTrulieve provides equal employment opportunities to all employees and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, pregnancy or any other characteristic protected by federal, state or local laws.","slug":"extraction-team-lead-3d611f1e-ad2c-4d3e-9134-6ce475857874","benefits":["Health insurance","Paid time off","Flexible schedule"],"selectedSkills":["Manufacturing","Computer skills","Leadership","Communication skills","Bachelor's degree","Associate's degree","21 years or older"],"jobType":"free","applyURL":"https://careers.trulieve.com/job/Adel-Extraction-Team-Lead-GA-31620/888908500/?feedId=364400&utm_source=Indeed&utm_campaign=Trulieve_Indeed"},{"position":"Testing Lab Manager","labName":"Standard Wellness","location":"Gibsonburg, OH","age":"9 hours ago","type":"Full-time","salaryMin":"$65,000 ","salaryMax":" $75,000 a year","jobDescriptionCopy":"Standard Wellness’s mission is to improve quality of life through safe and easy access to cannabis by providing consistent, high-quality product through innovation, vertical integration and aggressive regulatory reform. We aim to create a new standard in the medical cannabis industry for quality, care, innovation, and education while still maintaining a focus and conscious understanding of how our decisions within the role effect the social and environmental impact in our community and for our patients. We’re committed to a research-driven, patient-centric approach in all that we do, and we will work to have a lasting positive impact in our community.\n\nOur Core Values include:\nOne Team - We’re all in this together\n\nGrowth - Pride in growing our teams, footprint, patient base and ourselves\n\nEmpathy - Compassion for our people and patients leads to success\n\nAccountability - Do what we say we will do and stand behind our actions\n\nPosition Summary:\nThe Testing Laboratory Manager will be responsible for testing plant material and processed products, validate formulations, and assist in the research and development of new formulations. Will also be responsible for assisting in optimizing the drying and curing process. The Testing Laboratory Manager will oversee the daily operations of the testing lab, including staff and ensuring the lab operates in compliance with State of Ohio laws and regulations while maintaining quality standards of Standard Wellness.\n\nEssential Job Functions:\nPerforming tests on plant material and processed products to include but not limited to potency, microbials, terpene ratios, and moisture content\nPrepare test samples according to testing procedures and accurately track and record samples; communicate with external testing laboratories to ensure consistency and accuracy\nCollect and interpret data to monitor and adjust daily operations for maximum output and quality\nDevelop operations, quality, and troubleshooting procedures\nSet up, run, and troubleshoot HPLC, PCR, QPCR, and GC instrumentation\nMaintain laboratory equipment in good working order by establishing quality standards and performing regular maintenance, calibrations, and quality checks to ensure testing procedures meet quality standards set by Standard Wellness\nResponsible for arranging replacement, service, or repair of laboratory equipment\nResponsible for ordering and monitoring inventory of laboratory supplies\nDirect hiring, scheduling, training, development, performance reviews, discipline, promotion, or termination activities of the testing laboratory staff\nMaintain a safe, clean, and sanitary work environment\nOther duties as assigned by supervisor\n\nQualifications:\nRequired:\nMust be at least 21 years of age\nMust have a high school diploma, or the equivalent\nBachelor’s degree in Biology, Chemistry, or related scientific field; a combination of education and experience will be considered\n2 or more years’ supervisory experience in a regulated laboratory environment\nMust be able to pass all background checks and licensing requirements as set forth by the Department of Commerce\nMust be able to perform the essential functions of the job with or without a reasonable accommodation\nMust be able to read, write, speak, and understand the English language\n\nPreferred:\nExperience working in an ISO 17025 accredited laboratory\nAnalytical experience in the cannabis industry\n\nKnowledge, Skills, and Abilities:\nThis section outlines the knowledge, skills, and abilities necessary for the Testing Laboratory Manager to be successful in their role. It is not intended to be an all-inclusive list.\n\nKnowledge of quality control methods\nKnowledge of state and local cannabis policy and law\nKnowledge of seed to sale tracking systems, specifically METRC and Leaf Logix\nKnowledge of math, weights, and quantities\nKnowledge of Good Laboratory Practices\nStrong organizational skills\nDemonstrated leadership and interpersonal skills\nAccurate data-entry and recordkeeping skills\nAbility to prioritize assignments and ensure completion, accuracy, documentation, and communication of results in a timely manner\nStrong attention to detail with the ability to work in a fast-paced environment\nAbility to stand for long periods of time\nAbility to work evenings, nights, weekends, and holidays, if needed\nExcellent computer skills, specifically with Microsoft Office and Windows-based applications\nExcellent written and verbal communication skills\n\nBenefits: Health, dental, vision, 401(k) w/match, PTO","slug":"testing-lab-manager-c669808c-2ebc-451d-90a5-e67e451185b5","benefits":["Dental insurance","Health insurance","401(k)","401(k) matching","Paid time off"],"selectedSkills":["Windows","GLP","Laboratory experience","Leadership","Communication skills","Bachelor's degree","High school diploma or GED","21 years or older"],"jobType":"free","applyURL":"https://secure2.entertimeonline.com/ta/EVSWC1005.careers?ShowJob=453165446"},{"position":"Extraction Technician","labName":"Trulieve","location":"Hancock, MD","age":"8 days ago","type":"Full-time","salaryMin":"$33,000 ","salaryMax":" $43,000 a year","jobDescriptionCopy":"“Trulieve Grows One Patient at a Time”\n\nIf you have an interest in being part of one of the fastest growing industries in the nation in you may consider wanting to work for Trulieve! If you have a desire to help others in need through your efforts, this may be the role for you!\n\nAt Trulieve, we strive to bring our patients the relief they need in a product they can trust. Our plants are hand-grown in an environment specially designed to reduce unwanted chemicals and pests, keeping the process as natural as possible at every turn.\n\nOur products are designed to alleviate seizures, severe and persistent muscle spasms, pain, nausea, loss of appetite, and other symptoms associated with serious medical conditions such as cancer.\n\nOur specially trained staff works hand-in-hand with physicians to provide the right products and the correct dosage to ensure patients get the compassionate care they need.\n\nRequisition ID: 1076\n\nRemote Work Available: No\n\nJob Title: Extraction Technician\n\nDepartment: Manufacturing\n\nLocation: Hancock, MD\n\nShift: 1st, 2nd, 3rd\n\nRole Summary:\nTrulieve is looking for an Extraction Technician to support our extraction and production operations. You should be very technically astute in mechanical, electrical, and computer operated systems utilized in production/manufacturing environments. You need to be proactive, quick thinking and innovative in your approach.\n\nKey Duties and Responsibilities:\nPreparation of equipment and plant materials for extraction\nExecution of extraction and processing in accordance with state and local standards\nOperation of sophisticated extraction equipment\nEnsure consistency and efficiency of product through quality control testing and procedures\nCleaning and maintenance of extraction equipment and manufacturing facility\nMaintaining strict inventory records of all plant materials, chemicals, and equipment used in the facility\nOversee day-to-day operations of the entire extraction space beginning with storing the raw cannabis through the extraction process and all the way to fulfillment of orders\nOperating, maintaining, and making adjustments and repairs to extraction equipment\nStoring supplies and equipment and disposal of waste according to guidelines\nComplete the cleaning and sanitization of all production equipment, work surfaces, and tools\nMaintaining inventory records of supplies, materials, and equipment and preparing requisitions as needed\nMaintaining material safety data sheets for all chemicals and products\nFollowing all standard operating procedures regarding product creation and lab safety\nAssist in packaging and labeling of finished products\nWorks with testing laboratory as defined by state guidelines\nAll other duties as assigned\n\nRequirements\n\nSKILLS AND QUALIFICATIONS:\nBachelor’s or Associate degree or its equivalent, from a recognized college or university, with a major in chemistry or biology preferred\nUnderstanding of state and local laws\nUnderstanding of proper and safe handling of hazardous materials\nFamiliarity with separations, isolations and fractionation\nKnowledge of solvent and non-solvent extraction methods\nStay current of practices and new developments in the cannabis extraction industry\nAbility to work quickly without compromising accuracy\nAbility to discern the quality of plant material and finished products\nStrong computer and social skills\n\nPHYSICAL REQUIREMENTS:\nMust be able to push, pull, move, and/or lift a minimum of 25lbs to a minimum height of 5 feet and able to push, pull, move, and/or carry such weight a minimum distance of 50 feet, with or without mechanical assistance\nMust be able to work seated/standing as appropriate at workstations for extended periods of time, maintain body equilibrium while climbing ladders, stairways, stopping, kneeling, crouching, and reaching, and use hands/fingers to hold, grasp, turn, pick, pinch frequently/constantly to complete tasks\nMust be able to handle organic matter daily, able to wear PPE as appropriate (eye, face, hand, arm, head, foot, body, fall protection), and able to be exposed to hot, cold, wet, humid, or windy conditions while wearing PPE (95 degrees or greater)\nMust have visual acuity with/without job aids to perform activities such as; reading, viewing a computer terminal, visual inspection involving small parts/details. Clarity of vision at 20 ft or more in day and night/dark conditions\nMust be able to speak and communicate verbally at conversation levels with co-workers, vendors, etc. (Moderate noise)\n\nWORK SCHEDULE:\n40+ hours weekly with flexible hours depending on department needs. Must be available to work occasional evenings, weekends, and holidays\n\nEqual Opportunity Employer l Trulieve Supports a Drug Free Workplace\n\nSalary will be commensurate with experience. A comprehensive benefits package including paid time off is offered with this position. This position will work an average of 40 hours per week and will be available “after hours” if an emergency situation should arise.\n\nTrulieve provides equal employment opportunities to all employees and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, pregnancy or any other characteristic protected by federal, state or local laws.","slug":"extraction-technician-677e9a90-9178-4d98-b58e-16cc4f248145","benefits":["Paid time off","Flexible schedule","Health insurance"],"selectedSkills":["Computer skills","Bachelor's degree","Associate's degree"],"jobType":"free","applyURL":"https://careers.trulieve.com/job/Hancock-Extraction-Technician-MD-21750/890391100/?feedId=364400&utm_source=Indeed&utm_campaign=Trulieve_Indeed"},{"position":"Manufacturing Final Production Technician","labName":"Default Company","location":"Syracuse, NY","age":"7 days ago","type":"Full-time","salaryMin":"$30,000 ","salaryMax":" $43,000 a year","jobDescriptionCopy":"Job Summary:\nThe Final Packaging Technician will assist with the production of an uninterrupted supply of safe, pure and properly formulated finished medicinal products, ensuring no lapse in supply to Acreage/ The Botanist dispensaries. The Final Packaging Technician will assist with recording and entering data in multiple forms, and associated tasks as delegated by Management.\nThe Final Product Technician will professionally represent the Final Packaging department in all daily activities and will be responsible for consistent, sanitary and safe production of final products adhering to company policies to successfully uphold quality control and consistent Final Packaging production.\n\nDuties/Responsibilities:\nAbility to work in a fast-paced environment, to manage high-stress situations, and to be flexible and adaptable when the situation requires.\nWeigh and dispense actives of finished product raw materials and excipients.\nOperate downstream machinery including Final Packaging equipment associated with, but not limited to heating, diluting, mixing, cooking, dispensing, encapsulation, compression, packaging, labeling and storing.\nSample preparations and logging for analytical testing.\nDocument all Final Packaging activities consistent with Good Manufacturing Practices (GMP).\nParticipate with commissioning new process equipment.\nPerform manual Final Packaging activities as required.\nPerform manual, semi-automatic and automatic equipment cleaning and sanitization, including controlled drying and storage procedures.\nMaintain Final Packaging and facility spaces in a clean and hygienic state.\nPerforms daily safety inspections of filling and final packaging equipment.\nMaintain room and equipment cleaning and inspection logbooks.\nMaintain a safe work environment, actively contributing to continuous improvements. This may include inspection of fire suppression equipment, personnel emergency showers and eye wash stations as well as ensuring the local availability and use of required personal protective equipment.\nComplies with Syracuse facility SOPs and New York State guidance on proper disposal methods for solvent and cannabis contaminated waste.\nMaintain personal training status and records consistent with company policies and procedures.\nContribute to the creation of and revision to Manufacturing Standard Operating Procedures (SOPs).\nPerform minor equipment and facility maintenance activities.\nUtilize proprietary software regarding detailed, regulated material identification labeling, location and inventory level tracking.\nPerform weekly and monthly Final Packaging raw material and component physical inventory counts, ensuring uninterrupted material supply in advance of their scheduled use.\nReport Final Packaging physical inventory numbers to the Production Manager at week and month end using various methods and platforms.\nSubmit, consistent with identified standard lead-times, regulatory agency notifications of both sample and finished product delivery movements.\nSupport, as necessary, other departments and activities as process demands at the Syracuse Facility and as directed by Management.\nContribute to process improvements including machine recommendation and purpose as well as workflow assessments.\nPerform compliance activities regarding instrument calibrations and preventive maintenance.\nDemonstrate effective daily communication with the Final Packaging Lead Technician and the Production Manager to ensure all aspects of the Final Packaging process is efficient.\nPerform all job functions in direct compliance with company policies regulatory guidance.\nPunctuality – Must arrive on time for each shift and take breaks/ lunch as scheduled.\nMay help in other departments as needed/Other duties as assigned.\n\nCompetencies - Required Skills/Abilities:\nPerform general mathematical calculations including addition, subtraction, multiplication and division.\nFunction well in a high-paced and at times stressful environment.\nExcellent time management skills with a proven ability to meet deadlines.\nGeneral knowledge of Microsoft Office Suite.\nAttention to detail in all aspects of job responsibilities, including but not limited to good documentation practices, strict adherence to SOPs and Manufacturing Batch Record instructions, equipment and area hygiene and safety, personal protective equipment requirements adherence, the release versus quarantine status of all manufacturing materials, general packaging and labeling requirements.\nCommunicate constructively and effectively with manufacturing support groups including, but not limited to, QA/ QC, Cultivation, Processing, Laboratory, Extraction, Facility Maintenance, Security as well as contract vendors or equipment start-up and/or maintenance representatives.\nOperate laboratory scales.\nProfessionally represent Acreage/ The Botanist in all personnel interactions including those associated with regulatory agency inspection and/or audits.\nThe ability to recognize machine normal operating conditions (e.g. sound, temperature, speed, accuracy, smell) and the initiative to take direct action in the event of any equipment anomaly including, machine shut-down, product protection and informing Management.\nComprehend the set-up, operation, controls and troubleshooting of new machine equipment.\nInterpret in-process and finished product analytical assays.\nMaintain the flexibility required to support Acreage/ The Botanist through anticipated continual growth and expansion.\nPass the State of NY required background check\n\nEducation and Experience:\nHigh School Diploma or equivalent.\n\nPhysical Requirements:\nMust be able to work quickly but efficiently, while maintaining the integrity of the product.\nLight to moderate lifting of up to 50 lbs; heavier weights with assistance.\nMust be able to stand for prolonged periods of time.\nRepetitive motions and understanding of lab equipment.\nMust wear provided warm up jacket, hair/beard nets, gloves, surgical masks, safety glasses/ goggles/ splash shield, as process demands.\nMust adhere to the Syracuse facility general hygiene requirements.\nCapacity to stay focused on the task at hand.\nTeam player - works well with others.","slug":"manufacturing-final-production-technician-697dd0f9-a7bb-48a4-bcf4-cb10bdc0dc4b","benefits":[],"selectedSkills":["Time management","Microsoft Office","High school diploma or GED","Background check"],"jobType":"free","applyURL":"https://x.careersincannabis.com/job/3962?utm_source=indeed&utm_medium=dashboard&utm_campaign=promote"},{"position":"R&D Lab Technician","labName":"Default Company","location":"Centreville, MD","age":"7 days ago","type":"Full-time","salaryMin":"$35,000 ","salaryMax":" $44,000 a year","jobDescriptionCopy":"The Role\nThe R&D Laboratory Technician performs many of the day to day tasks and demands of the Research & Development Lab. This position is responsible for assisting with the research and development lab, which tackles a wide variety of tasks including (but not limited to) extraction, winterization, distillation, analytical equipment, and production of cannabis infused products. They also keep a sharp eye on compliance, documentation, and workplace safety. The ideal candidate is naturally curious, and excited about creation & innovation within the cannabis space. The ideal candidate will have experience in a cannabis extraction lab.\nRequirements\nExecute lab scale and small batch experimentation to support all levels of formulation, analytics, and processing for multiple cannabis-based research projects.\nAid in the maintenance of inventories for research and developments raw materials, chemicals, and equipment, as well as formulation spreadsheets, inventories, traceability logs, tracking logs, etc.\nFollow complex instructions and formulations in the preparation of cannabis extract, concentrates, and infused products.\nEvaluate and updates technologies and operating procedures associated with research and development.\nAid compliance and accuracy involving all product tracking, product security, and product creation.\nOperate laboratory instruments, makes observations, calculates and records results.\nAssist in monitoring of production line and collecting samples for various testing and stability programs.\nTake personal responsibility to ensure compliance and meet Good Laboratory Practices and Good Manufacturing Practices compliance.\nPractice highly sterile laboratory cleaning procedures throughout the facility with focus and personal contributions towards a clean and organized assigned work area at the end of the assigned shift.\nCapable of troubleshooting, fixing, and services a wide range of equipment and software with little to no assistance.\nOther duties as assigned\nQualifications\nBachelor’s or Associate's degree preferred in biology, chemistry, or physics.\nPrior Laboratory experience.\nEquivalent combinations of education and experience may be considered, including internal experience.\nPrior experience in research.\nIntermediate math skills.\nExcellent verbal and written communication skills with coworkers and management.\nFamiliarity with OSHA guidelines for dealing with hazardous chemicals.\nFlexibility and the ability to shift work schedule according to research and development needs.\nAbility to use standard office equipment, computer equipment and software including word processing, database management, spreadsheet applications and email.\nEnthusiasm for research and formulating/improving product formulations.\nMust be able to carry out repetitive tasks at a continuously high level of quality.\nCapable of working with hazardous chemicals and able to identify and report unsafe equipment, conditions and practices so that they may be corrected prior to an incident.\nAdditional Requirements\nMust be a minimum of 21 years of age.\nMust pass all required background checks.\nMust be and remain compliant with all legal & company regulations for working in the industry.\nMust be approved by the State of Maryland to receive a badging in order to handle cannabis\nWorking Conditions\nWhile performing the duties of this job, the employee is regularly required to perform grasping, talking, hearing, seeing and repetitive motions\nPhysical demands – May be required to stand and/or walk for extended periods of time. Must be able to lift, carry and balance up to 50 pounds (200 pounds with assistance).","slug":"rd-lab-technician-4b3b4e90-e574-442e-9b92-7f8452e960cd","benefits":[],"selectedSkills":["Laboratory experience","Communication skills","Research","Math","OSHA","Bachelor's degree","Associate's degree","21 years or older"],"jobType":"free","applyURL":"https://x.careersincannabis.com/job/3896?utm_source=indeed&utm_medium=dashboard&utm_campaign=promote"},{"position":"Cultivation Safety Technician","labName":"Trulieve","location":"Quincy, FL","age":"6 days ago","type":"Full-time","salaryMin":"$29,000 ","salaryMax":" $42,000 a year","jobDescriptionCopy":"“Trulieve Grows One Patient at a Time”\n\nIf you have an interest in being part of one of the fastest growing industries in the nation in you may consider wanting to work for Trulieve! If you have a desire to help others in need through your efforts, this may be the role for you!\n\nAt Trulieve, we strive to bring our patients the relief they need in a product they can trust. Our plants are hand-grown in an environment specially designed to reduce unwanted chemicals and pests, keeping the process as natural as possible at every turn.\n\nOur products are designed to alleviate seizures, severe and persistent muscle spasms, pain, nausea, loss of appetite, and other symptoms associated with serious medical conditions such as cancer.\n\nOur specially trained staff works hand-in-hand with physicians to provide the right products and the correct dosage to ensure patients get the compassionate care they need.\n\nRequisition ID: 1183\n\nRemote Work Available: No\n\nDescription & Requirements\n\nDescription\n\nJob Title: Safety Tech\n\nDepartment: Cultivation HS&E\n\nReports to: Cultivation Safety Manager\n\nFLSA Status: Regular- Non-Exempt\n\nRole Summary:\nSafety Tech - to assist in the overall supervision and administration of project safety to maintain a safe and healthy work environment. The successful individual will coordinate safety efforts with each business unit and communicate details of safety conditions/behaviors with all levels of management. Responsible for developing, enhancing, inspecting and evaluating the workplace environment, equipment and processes in manufacturing, cultivation, warehouse, grounds, laboratory and office working areas to ensure compliance with safety regulations and industry standards. Maintain applicable records and documentation demonstrable during an inspection or audit. Champions a culture of preparedness and safety.\n\nKey Duties and Responsibilities:\nChampion all safety programs and initiatives\n\nGrow the safety culture by training, personal interaction, and developing relationships with all hourly and salaried team members\n\nParticipate in developing and conducting compliance training\n\nManage Worker Compensation claims\n\nDaily inspection of machinery, equipment, and working conditions to ensure compliance with regulatory requirements and safe work practices\n\nConduct hazard assessments to determine appropriate personal protection equipment. Observe employees to determine appropriate use of prescribed equipment\n\nInspection of specified areas for fire-prevention equipment, first-aid supplies, and other safety devices\n\nTest working areas for hazard exposures (noise, toxic, etc.) using associated testing equipment\n\nPrepare report of findings with recommendations for corrective action\n\nInvestigation of accidents per program procedures to establish root cause for use in recommending preventive safety measures\n\nBuild cross-functional safety teams to drive a world class safety culture\n\nMaintain chemical inventory, SDS and waste inspections per EPA guidelines\n\nDocumenting all accidents, safety violations, unsafe conditions, or behavior\n\nImplement and manage a behavioral based safety program to reduce incidents and drive engagement\n\nAssisting in development of standardized job safety analysis (JSA) as well as project specific safety plans\n\nConduct safety meetings with associates to instruct them on project safety practices and requirements\n\nDemonstrate use of equipment and develop safety related standard operating procedures\n\nOther duties as assigned\n\nSKILLS AND QUALIFICATIONS:\n2 or more years of experience or education in a safety related position. (Preferred)\n\nDemonstrates competency in understanding and correcting data discrepancies; data querying; identifying root cause analysis; understanding and identifying data trends\n\nPossess computer proficiency, speed and knowledge of Microsoft Office applications (Word, Excel, PowerPoint, Outlook)\n\nWorking knowledge of OSHA / EPA regulations and practices.\n\nBasic knowledge of manufacturing / transportation safety a plus\n\nOSHA 10- and 30-hour certifications (Preferred)\n\nMust acquire OSHA 501 Certification within a specified time period\n\nMust possess excellent communication and interpersonal skills\n\nAbility to work a flexible schedule\n\nMust be able to support multiple site locations as necessary\n\nAbility to multi-task and work in a methodical and organized way\n\nHighly Motivated, Attention to detail\n\nStrong Communication Skills\n\nSelf-motivated attitude with excellent work ethic\n\nBi-Lingual is a plus\n\nADDITIONAL MINIMUM QUALIFICATIONS:\nHigh School Diploma / 2- or 4-year Degree (Preferred)\n\nMust possess a valid driver’s license and good driving record\n\nMust be a minimum of 21 years of age\n\nMust successfully complete a comprehensive background screening\n\nPHYSICAL REQUIREMENTS:\nMust be able to push, pull, move, and/or lift a minimum of 50 lbs. to a minimum height of 5 feet and able to push, pull, move, and/or carry such weight a minimum distance of 50 feet, with or without mechanical assistance\n\nMust be able to work seated/standing as appropriate at workstations for extended periods of time, maintain body equilibrium while climbing ladders, stairways, stopping, kneeling, crouching, and reaching, and use hands/fingers to hold, grasp, turn, pick, pinch frequently/constantly to complete tasks\n\nMust be able to handle organic matter daily, able to wear PPE as appropriate (eye, face, hand, arm, head, foot, body, fall protection), and able to be exposed to hot, cold, wet, humid, or windy conditions while wearing PPE (95 degrees or greater)\n\nMust have visual acuity with/without job aids to perform activities such as reading, viewing a computer terminal, visual inspection involving small parts/details. Clarity of vision at 20 ft or more in day and night/dark conditions\n\nMust be able to speak and communicate verbally at conversation levels with co-workers, vendors, etc. (Moderate noise)\n\nWORK SCHEDULE:\n40+ hours weekly with flexible hours depending on department needs. Must be available to work occasional evenings, weekends, and holidays\n\nEqual Opportunity Employer l Trulieve Supports a Drug Free Workplace\n\nSalary will be commensurate with experience. A comprehensive benefits package including paid time off is offered with this position. This position will work an average of 40 hours per week and will be available “after hours” if an emergency situation should arise.\n\nTrulieve provides equal employment opportunities to all employees and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, pregnancy or any other characteristic protected by federal, state or local laws.","slug":"cultivation-safety-technician-9b7d2608-6791-4207-bbae-0f04f7e5b9c2","benefits":["Health insurance","Paid time off","Flexible schedule"],"selectedSkills":["Microsoft Excel","OSHA 10","Driver's License","Computer skills","OSHA","Bachelor's degree","High school diploma or GED","21 years or older","Clean driving record"],"jobType":"free","applyURL":"https://careers.trulieve.com/job/Quincy-Cultivation-Safety-Technician-FL-32351/893157900/?feedId=364400&utm_source=Indeed&utm_campaign=Trulieve_Indeed"},{"position":"Extraction Technician","labName":"Default Company","location":"Syracuse, NY","age":"7 days ago","type":"Full-time","salaryMin":"$31,000 ","salaryMax":" $41,000 a year","jobDescriptionCopy":"Essential Duties and Responsibilities:\nThe Extraction Technician will assist with the production of high-quality cannabis extracts along with cleaning and maintaining laboratory grade equipment, recording, and entering data in multiple forms, and associated tasks delegated by management. The Extraction Technician will be responsible for consistent, sanitary, and safe production of extracts adhering to company policies to successfully uphold quality control and consistent product production. The individual has the responsibility of extracting, refining and purifying cannabinoids from plant material into a concentrated form using solvents.\nPreparing biomass for solvent based extraction and post processing.\nSample preparations and logging for analytical testing.\nAdhere to specific quality control SOP’s regarding procedural operations and quality of product produced.\nIdentify unsafe scenarios as they pertain to the Manufacturing Department.\nPerforms daily safety inspections for extraction systems.\nSafely and effectively perform all methods of the cannabis extraction and refinement process practiced at the Syracuse facility as directed by Management, including but not limited to, ethanol and CO2 extractions, winterization, filtration, color remediation, ethanol recovery and distillation.\nComplies with Syracuse facility SOPs and New York State guidance on proper disposal methods for solvent and cannabis contaminated waste.\nManage high-stress situations and be flexible and adaptable in a fast-paced environment when the situation requires.\nPerform general routine maintenance on lab equipment - troubleshooting, preventative maintenance, and regular data logging.\nWash and sanitize lab surfaces, glassware, equipment, and any other ancillary lab equipment.\nRecord all cleaning activities in daily logs.\nMaintain and log all data sheets for chemicals and products physically and digitally.\nEffective communication with the Management Team to ensure all operational needs are met and any procedural problems are addressed and resolved proactively\nOpen to constructive criticism and guidance and offer the same to others in the department.\nAbility to work a varying schedule including nights, weekends, and overtime as determined by process demands.\nSupport as necessary other departmental personnel and activities as process demands.\nPunctuality – Must arrive on time for each shift and take breaks/ lunch as scheduled.\nMay help in other departments as needed/Other duties as assigned.\n\nBasic Qualifications:Education and/or Work Experience Requirements:\nStrong analytical and problem-solving ability.\nAbility to prioritize tasks.\nAbility to function well in a high-paced and at times stressful environment.\nUnderstanding of basic laboratory terminology and concepts.\nMeticulous organizational skills and attention to detail.\nAble to interpret and follow complex, written, verbal and technical instructions. Must be able to adhere to facility SOPs.\nSound technical ability and ability to learn complex procedures in a timely manner.\n\n- Pass the State of NY required background check\nHigh School Diploma or equivalent.\nBachelor’s degree in biology, chemistry, or related field.\n\nAdditional Qualifications:\n\n- Excellent verbal and written communication skills, including ability to effectively communicate with internal and external customers\n- Excellent computer proficiency (MS Office – Word, Excel, and Outlook)\n- Must have certification\n- Must be able to work under pressure and meet deadlines, while maintaining a positive attitude and providing exemplary customer service\n- Ability to work independently and to carry out assignments to completion within parameters of instructions given, prescribed routines, and standard accepted practices\n- Proficient with BioTrack.\n- Light to moderate lifting (up to 70lbs); heavier weights with assistance.\n- Must be able to sit or stand for prolonged periods of time.\n- Learn complex technical procedures in a timely manner.\n- Pass the State of NY required background check\n- Team player - works well with others.\n- Must wear provided lab coat, hair/beard nets, gloves, surgical masks, and safety glasses/ goggles/ splash shield, while working in the lab.","slug":"extraction-technician-646ee2a7-efca-46b6-b1ec-72ef7c683302","benefits":[],"selectedSkills":["Analysis skills","Microsoft Excel","Computer skills","Microsoft Outlook","Communication skills","Bachelor's degree","High school diploma or GED","Background check"],"jobType":"free","applyURL":"https://x.careersincannabis.com/job/3960?utm_source=indeed&utm_medium=dashboard&utm_campaign=promote"},{"position":"Laboratory Technician I","labName":"Montrose Environmental Group, Inc.","location":"Durham, NC","age":"7 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate about the environment and ready to join an inclusive work environment, committed to excellence, to new ideas, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you based in our Durham, NC lab. Who are we? We are Montrose, the premier environmental services provider.\n\nThe Laboratory Technician I will be responsible for various laboratory functions. You’ll need some basic knowledge of a lab environment and welcome the opportunity to make an impact from day one.\n\nWHAT WE CAN OFFER TO YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nCompetitive medical, dental, and vision insurance coverage\nMedical, Dependent Care and Transit Flexible Spending Accounts\nCompany paid Life and Disability Insurance and access to additional voluntary programs\n401k with a competitive employer match\nProgressive vacation policies and company holiday to ensure work/life balance for our people.\nA financial assistance program to help support peers in need.\nAccess to telemedicine and employee assistance programs\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of 10 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nAs a key member of the Durham team, this role will be responsible for a full range of activities including:\n\nPreparation of samples for analysis\nPreparation of reagents for lab use and/or shipment\nSample extractions\nSpectrophotometric analyses\nDetermining the volume of samples\nCleaning of laboratory glassware\nMaintaining clean laboratory areas\nMaintaining organized records of sample preparation and analysis\nOverhead projects designed to improve efficiency of, or accuracy of analyses\nAssisting the Group Leaders and analysts in acquiring and inventorying consumables, chemicals, and parts for instrumentation\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Lab Director\n\nQUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nBachelor's degree in Chemistry, Biology, Environmental Science, or related field preferred\n2 years of relevant lab experience allows direct advancement to Tech II (academic lab counts)\n\nPREFFERED SKILLS\n\nPrior Laboratory experience preferred but not required as this is an entry level position\nKnowledge of analytical method, analytical instruments, general lab practices and lab safety\nAbility to work independently and in a team\nGood organizational skills and strong communication skills","slug":"laboratory-technician-i-5543d3ef-1a33-4ec4-b947-e94aca0f1b6f","benefits":["Dental insurance","Health insurance","Employee assistance program","Disability insurance","401(k) matching"],"selectedSkills":["Laboratory experience","Communication skills","Organizational skills","Bachelor's degree"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-NC-Durham-Capitola-Drive/Laboratory-Technician-I_R2143?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Manufacturing Manager","labName":"Trulieve","location":"Quincy, FL","age":"6 days ago","salaryMin":"$63,000 ","salaryMax":" $81,000 a year","jobDescriptionCopy":"“Trulieve Grows One Patient at a Time”\n\nIf you have an interest in being part of one of the fastest growing industries in the nation in you may consider wanting to work for Trulieve! If you have a desire to help others in need through your efforts, this may be the role for you!\n\nAt Trulieve, we strive to bring our patients the relief they need in a product they can trust. Our plants are hand-grown in an environment specially designed to reduce unwanted chemicals and pests, keeping the process as natural as possible at every turn.\n\nOur products are designed to alleviate seizures, severe and persistent muscle spasms, pain, nausea, loss of appetite, and other symptoms associated with serious medical conditions such as cancer.\n\nOur specially trained staff works hand-in-hand with physicians to provide the right products and the correct dosage to ensure patients get the compassionate care they need.\n\nRequisition ID: 1081\n\nRemote Work Available: No\n\nPosition Summary\n\nThe Extraction Manager is responsible for leading and navigating day-to-day oil extraction laboratory operations. This includes working with extraction equipment to assist with the extraction process, cleaning equipment, and conducting general extraction lab duties, to ensure products consistently meet specifications. In addition, ensure processes and procedures are optimized, equipment is maintained regularly, and workflow meets the necessary specifications. Our goal is to optimize lab procedures and succeed in producing consistent, safe, and quality products. Communication skills, organization, attention to safety, detail, and time management are critical to the success of our lab.\n\nCore Duties\n\nUnder direction of the Plant Manager and Assistant Plant Processing Manager, the Extraction Manager duties shall include, but not be limited to, the following:\n\nProvide supervision and leadership to the Extraction Lab, regarding production schedules, associated testing, continuously improving quality, reducing waste, and increasing throughput.\nLeading the operation and maintenance of extraction equipment.\nHelp develop and execute Standard Operating Procedures (SOPs).\nOversee the front-end processing of raw materials, including weighing, grinding, cleaning and general lab work.\nEnsure preparation of the workspace, equipment, and materials daily.\nOversee washing and sterilization of laboratory glassware and equipment.\nSchedule and perform regular maintenance, cleaning, and repairs of all equipment.\nDirect administrative tasks, such as documenting all machine maintenance, logging test results, printing labels, and auditing products and supplies with Supervisors.\nEnsure accurate weighing and recording all product weights.\nOversee samples to be sent to lab.\nResponsible for inventory, recordkeeping, quality of product, and maintaining inventory via the ERP System.\nDevelop, discipline, and coach Supervisors, Leads, and team members.\n\nEssential Work Experience and Qualifications:\nStrong knowledge of chemical extraction and distillation/refining theory.\nExperience with extraction, preparation, and purification of cannabinoids via, Ethanol, CO2, and Hydrocarbon extraction methods.\nSupervisory experience, preferably in chemical process operations.\nExperience with detailed record keeping, proper labeling, and data tracking.\nSolid computer skills, including Microsoft and Google Suites (Docs, Sheets, Calendar).\nExcellent written and verbal communication skills.\nIn-depth understanding of compliance laws for the Florida cannabis industry.\nMotivated and self-driven.\nDeep technical knowledge and proven experience in extraction methods and techniques, and a passion for cannabis extracts.\nAbility to work with minimal direction and solid problem-solving skills.\nEmbrace change and new ideas.\nStrict adherence to policies and procedures.\nMust be at least 21 years of age.\n\nMinimum Education and Experience\n\n3 to 4 years’ experience in manufacturing operations.\n2 to 3 years’ experience in a supervisory capacity.\nBachelor’s degree or equivalent experience required.\nWorking knowledge of OSHA and EPA regulations.\nGMP manufacturing experience.\nAbility to coach and mentor employees on a one-on-one basis as well as in a group.\n\nAdditional Requirements\n\nFlorida Driver's License or ability to obtain one.\nMust be a minimum of 21 years of age.\nMust be and remain compliant with all legal or company regulations for working in the cannabis industry.\nAbility to pass a Level 2 Background check.\n\nWorking Conditions\n\nMust be able to push, pull, move, and/or lift a minimum of 50 lbs. to a minimum height of 5 feet and able to push, pull, move, and/or carry such weight a minimum distance of 50 feet, with or without mechanical assistance.\nMust be able to work seated/standing as appropriate at workstations for extended periods of time, maintain body equilibrium while climbing ladders, stairways, stopping, kneeling, crouching, and reaching, and use hands/fingers to hold, grasp, turn, pick, pinch frequently/constantly to complete tasks.\nMust be able to handle organic matter daily, able to wear PPE as appropriate (eye, face, hand, arm, head, foot, body, fall protection).\nMust have visual acuity with/without job aids to perform activities such as reading, viewing a computer terminal, visual inspection involving small parts/details.\nMust be able to speak and communicate verbally at conversation levels with co-workers, vendors, etc., in moderate noise.\n\nSalary will be commensurate with experience. A comprehensive benefits package including paid time off is offered with this position. This position will work an average of 50 hours per week and will be available “after hours” if an emergency should arise. We are an EOE company\n\nSalary will be commensurate with experience. A comprehensive benefits package including paid time off is offered with this position. This position will work an average of 40 hours per week and will be available “after hours” if an emergency situation should arise.\n\nTrulieve provides equal employment opportunities to all employees and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, pregnancy or any other characteristic protected by federal, state or local laws.","slug":"manufacturing-manager-81e775f3-5951-459b-927f-9fa4806e973f","benefits":["Health insurance","Paid time off"],"selectedSkills":["Manufacturing","Google Docs","Driver's License","Computer skills","CGMP","Bachelor's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://careers.trulieve.com/job/Quincy-Manufacturing-Manager-FL-32351/893395500/?feedId=364400&utm_source=Indeed&utm_campaign=Trulieve_Indeed"},{"position":"Laboratory Technician - SVOA Extraction","labName":"Montrose Environmental Group, Inc.","location":"Orange, CA","age":"5 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 2,500 employees across 70+ locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicity testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Orange, CA facility is currently seeking a Full-Time Laboratory Technician to join our team.\n\nAs a key member of the laboratory team, this role will be responsible for a full range of activities including:\n\nPreparation of samples for analysis\nPreparation of reagents for lab use and/or shipment\nSample extractions\nDetermining the volume of samples\nCleaning of laboratory glassware\nMaintaining clean laboratory areas\nMaintaining organized records of sample preparation and analysis\nCourier supplies to and/or samples from client sites\nOverhead projects designed to improve efficiency of, or accuracy of analyses\nAssisting the Group Leaders and analysts in acquiring and inventorying consumables, chemicals, and parts for instrumentation\nDispose of laboratory waste in a safe manner following prescribed procedures\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Lab Director\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nHigh School diploma or equivalent required\n\nPREFERRED SKILLS\n\nPrior Laboratory experience preferred but not required as this is an entry level position\nKnowledge of analytical method, analytical instruments, general lab practices and lab safety\nAbility to work independently and in a team\nGood organizational skills and strong communication skills\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"laboratory-technician-svoa-extraction-0b1eb95f-69a4-473a-8907-be7fd59f35bd","benefits":["401(k)","Disability insurance","Parental leave","Tuition reimbursement"],"selectedSkills":["Laboratory experience","Communication skills","Organizational skills","High school diploma or GED"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-CA-Orange/Laboratory-Technician---SVOA-Extraction_R2154?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Lab Assistant - Environmental Lab","labName":"Montrose Environmental Group, Inc.","location":"Orange, CA","age":"18 hours ago","type":"Part-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicity testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Orange, CA facility is currently seeking a Full-Time Laboratory Technician to join our team.\n\nAs a key member of the laboratory team, this role will be responsible for a full range of activities including:\n\nPreparing samples for digestion or extraction as needed (includes but is not limited to: weighing soils, making composites, crushing samples, incremental sampling, product sampling, etc)\nWashing glassware\nPreparing reagents as needed\nConducting simple water quality assays\nData entry\nFacility housekeeping/maintenance\nPerform support tasks as needed\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Lab Director\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nHigh School Diploma\nBasic laboratory techniques (knowledge of PPE, use of balance, pipetting, glassware handling, etc)\nBasic Excel skills required\nMust have ability to follow directions and work in a team setting\nMust be comfortable working with strong acids and solvents\nExcellent communication skills required\nDetail oriented\n\nPREFERRED SKILLS\n\nPrior Laboratory experience preferred but not required as this is an entry level position\nKnowledge of analytical method, analytical instruments, general lab practices and lab safety\nAbility to work independently and in a team\nGood organizational skills and strong communication skills\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"lab-assistant-environmental-lab-d632ea46-48b0-465d-8eab-d13f86fea721","benefits":["Disability insurance","Tuition reimbursement","401(k)","Parental leave"],"selectedSkills":["Microsoft Excel","Laboratory experience","Communication skills","Organizational skills","High school diploma or GED"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-CA-Orange/Lab-Assistant---Environmental-Lab_R2176?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Lab Assistant","labName":"Montrose Environmental Group, Inc.","location":"Berkeley, CA","age":"7 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 2,500 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 10 laboratories servicing air, water, soil, tobacco, cannabis, and toxicity testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Berkeley, CA facility is currently seeking a Full-Time Laboratory Assistant to join our team.\n\nAs a key member of our team, this role will be responsible for a full range of activities including:\n\nReceive environmental samples into the laboratory\nLabel the sample containers\nSample bottle preparation\nSample management and disposal\nDriving for sample pickup\nDaily tasks with light labor and cleanup\nBe flexible in work schedule including overtime when needed\nPerform support tasks as needed\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Lab Director\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nHigh School Diploma\nAbility to lift 50lbs to waist height repeatedly\nValid state issued driver's license to drive company vehicles\nMust pass pre-employment drug and background screening\nBasic computer skills Excel & email\nMust have ability to follow directions and work in a team setting\nDetail oriented\n\nPREFERRED SKILLS\n\nAbility to work independently and in a team\nExperience with secure/clean environment is preferred but not required\nGood organizational skills and strong communication skills\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"lab-assistant-4287d0ee-9ae9-4a7d-a175-dc91e2b224d6","benefits":["Disability insurance","Tuition reimbursement","401(k)","Parental leave"],"selectedSkills":["Microsoft Excel","Driver's License","Computer skills","Communication skills","Computer literacy","High school diploma or GED"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-CA-Berkeley/Lab-Assistant_R2131?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Regional Operations Director - Laboratory","labName":"Montrose Environmental Group, Inc.","location":"California","age":"2 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 2,500 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group. Enthalpy is comprised of 11 laboratories servicing air, water, soil, tobacco, cannabis, and toxicity testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nThe Regional Operations Director will have supervisory control of all operations and production aspects of multiple laboratories. The Laboratory Regional Operations Director is primarily responsible for the application and development of the labs’ resources to meet current and future client requirements with lab directors and service center managers reporting to them. The Regional Operations Director is responsible for the development and execution of short- and long-term goals within the region. Critical to the success of the region is creating a sense of in-region collaboration between all sites as well as across Enthalpy’s national lab network.\n\nAs a key member of the Team, this role will be responsible for a full range of activities including:\n\nDefine, revise and implement policies and guidelines for the organization.\nThe Regional Operations Director responsibilities encompass the general business management of the region, and all its resources, including equipment, facilities and personnel.\nThe ability to lead, manage and inspire staff to adopt goals for their department, business, and region through effective communication and goal setting.\nEnsure that the highest standards of quality and customer service are maintained.\nGuide laboratory directors and service center managers throughout the region in developing capabilities that address client needs in a service-oriented manner that maximizes profitability.\nIdentify problems and opportunities and come up with insightful solutions as they arise.\nKeep abreast of new technical developments. Lead continuous improvement initiatives to increase quality of services and operational efficiency.\nFoster a unified culture and facilitate collaboration, cooperation, sharing of information and teamwork.\nManage staff in accordance with organization’s policies and applicable regulations.\nParticipate in the development, implementation, and monitoring of the lab’s and region’s operating budget. Establish standards for cost control and waste reduction. Monitor utilization patterns of services and advise on developing trends.\nImplement corporate programs and directives for Operations, Personnel, Facilities, IT and Financial management.\nHave a thorough understanding of financial and budgeting processes and principles that allow for proper budgeting and achieving quarterly and annual budgeted revenue and profitability goals.\nWork with business development and marketing teams to leverage capabilities within region to current and future clients.\nSupport the company vision, mission and policies\nCommunicate frequently, effectively, clearly, and honestly. Tailor the message to the audience being address, e.g. leadership messages may have more detail and urgency than messages intended for rank and file.\nUp to 30% travel, 20% in region and 10% nationally\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nBachelor’s degree or higher in Chemistry, Biology, or equivalent\nMinimum of 5 years relevant experience required with multiple site responsibility\nMust have familiarity with the assays performed within laboratory\nMust understand the drivers that motivate customers to purchase assays from their lab\nExperience in managing P&L\n\nPREFERRED SKILLS\n\nEffectiveness - Positive outcomes and results of communication skills\nConflict resolution skills - Removes/breaks down organizational communication barriers\nAssertion Skills - Problem diagnosis, assess corrective actions and implement them fully, with follow-up\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"regional-operations-director-laboratory-daa0a818-da4e-45f4-8441-93de3731eab0","benefits":["Disability insurance","Tuition reimbursement","401(k)","Parental leave"],"selectedSkills":["Conflict management","Budgeting","Laboratory experience","Assays","Communication skills","Bachelor's degree"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-CA-Remote/Regional-Operations-Director---Laboratory_R2165?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Project Manager Assistant","labName":"Montrose Environmental Group, Inc.","location":"Richmond, VA","age":"7 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Richmond, VA laboratory is currently seeking a Full-Time Project Management Assistant who will be responsible for is responsible for answering phone, purchasing and reconciling invoices for AP approval. The PMA is also responsible for supporting the Project Manager.\n\nCreates field sampling and bottle order requests\nContacts clients to confirm sampling schedule\nCoordinates with subcontract labs for sample delivery and project status\nGenerates subcontract COCs\nAssists with sample logins\nPuts together sample bottle kits\nReviews work order tickets\nSends client sample receipt confirmation\nReviews draft invoices\nCreates and send preliminary reports to clients\nSetup Electronic Data Deliverables (EDDs) cross tables and checkers\nGenerates and uploads Electronic Data Deliverables (EDDs)\nParticipates in focus teams, if applicable\nGenerates and submit state reporting forms and Self-Monitoring Reports\nManages small, simple accounts\nReviews reports for completeness and accuracy\nGenerates and reviews invoices\nCompletes annual ethic refresher and health and safety training\nOther duties as assigned.\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nHigh school diploma but Associates Degree is highly desirable\n\nPreferred Skills:\nKnowledge of environmental regulations and laboratory methods is a plus\nProficient in Excel, Word, PowerPoint, Adobe\nCommunicate effectively at all levels of the organization\nMaintain professional attitude when interacting with clients\nAble to multi task under strict deadlines\nFlexible in work schedule including overtime\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"project-manager-assistant-f01ed28c-39dd-4479-af39-0bcacd4cfba4","benefits":["401(k)","Disability insurance","Parental leave","Tuition reimbursement"],"selectedSkills":["Microsoft Excel","Microsoft Powerpoint","High school diploma or GED","Associate's degree"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-VA-Richmond-Reymet-Rd/Project-Manager-Assistant_R2136?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Environmental Laboratory Technician I - Extractions","labName":"Montrose Environmental Group, Inc.","location":"Richmond, VA","age":"7 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 2,500 employees across 70+ locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicity testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur South Richmond, VA facility is currently seeking a Full-Time Laboratory Technician to join our team.\n\nAs a key member of the laboratory team, this role will be responsible for a full range of activities including:\n\nPreparation of samples for analysis\nPreparation of reagents for lab use and/or shipment\nSample extractions\nDetermining the volume of samples\nCleaning of laboratory glassware\nMaintaining clean laboratory areas\nMaintaining organized records of sample preparation and analysis\nCourier supplies to and/or samples from client sites\nOverhead projects designed to improve efficiency of, or accuracy of analyses\nAssisting the Group Leaders and analysts in acquiring and inventorying consumables, chemicals, and parts for instrumentation\nDispose of laboratory waste in a safe manner following prescribed procedures\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Lab Director\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nHigh School diploma or equivalent required\n\nPREFERRED SKILLS\n\nPrior Laboratory experience preferred but not required as this is an entry level position\nKnowledge of analytical method, analytical instruments, general lab practices and lab safety\nAbility to work independently and in a team\nGood organizational skills and strong communication skills\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"environmental-laboratory-technician-i-extractions-83bc0cd7-5942-4f9d-a823-0677023269be","benefits":["401(k)","Disability insurance","Parental leave","Tuition reimbursement"],"selectedSkills":["Laboratory experience","Communication skills","Organizational skills","High school diploma or GED"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-VA-Richmond-Reymet-Rd/Environmental-Laboratory-Technician-I_R2140?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Field Sampler","labName":"Kaycha Labs","location":"Gainesville, FL","age":"2 days ago","type":"Full-time","jobDescriptionCopy":"Company Overview:\n\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\n\nJob Purpose:\n\n\nThe Field Sampler is responsible for conducting routine pickups and processing of regulatory compliance samples for laboratory analysis. This includes accurately recording sample and chain of custody documentation and the safe and secure transportation of all samples to the laboratory. Candidates must be located in the Davie, FL area or close proximity.\n\n\nEssential Duties & Responsibilities:\n\n\nPerform onsite field sampling pickups in accordance with all laws and regulations related to the legal cannabis market and laboratory operating procedures.\nCollect and forward weekly inventory requests to the laboratory team.\nCollect payment from clients.\nInterface effectively between customers and the laboratory team.\nContact clients in conjunction with the Client Service Rep(s) to determine if their sampling needs to create a sampling plan (e.g., number of batches, requested analyses, sample information)\nInput orders with required sample information into METRC and the lab’s LIMS system as required.\nFollow detailed procedural requirements as outlined in the Kaycha Labs Sampling and Chain of Custody SOP.\nSafely drive throughout an assigned region, which may include multi-hour destination pickups.\nCollect detailed data in the field according to SOPs.\nMaintain current knowledge of our products and services.\nConsistently maintain customer confidentiality.\nOther duties and special projects as assigned.\n\nKnowledge, Skills, and Abilities:\n\n\nAbility to maintain a high degree of attention to detail and accuracy.\nExcellent communication skills and ability to effectively work, problem solve, and communicate with internal and external customers.\nDemonstrate keen attention to detail and punctuality.\nAbility to work in a dynamic, fast-paced deadline environment while successfully managing multiple tasks.\nDemonstrated ability to be professional, pleasant, and presentable.\nFamiliarity with the assigned geographic area.\nBuild long-lasting customer relationships.\n\nEducation & Experience\n\n\nHigh School Diploma (or GED required.)\nA valid driver’s license and clean driving record (with at least three years of driving experience).\nExposure to the Cannabis industry is a plus.\n\nOther:\n\n\nMust be over 21 years old\nPre-Employment Verifications: Must pass Level 2 background check.\nKaycha Labs offers a competitive and comprehensive benefits package.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.\n\nEssential Functions:\n\n\nThe physical demands described here are representative of those that an employee must meet to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nWhile performing the duties of this job the employee is frequently required to stand, handle or feel, to speak, and to hear. The employee is occasionally required to walk, sit, reach with hands and arms, bend, kneel, crouch, or crawl. The employee must frequently lift and/or move up to thirty-five (35) pounds.\n\n\nSpecific vision abilities required for this job include close (proximity) vision, depth perception, and the ability to adjust focus.\n\n\nWork Environment:\n\n\nThe work environment described here is representative of that which an employee may encounter while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nThe standard analytical laboratory environment is one in which potential health hazards do exist. Administrative, operations, technical, and professional staff are expected to safely operate in accordance with applicable and appropriate health and safety policies and procedures, as prescribed by the applicable Kaycha manuals and policies and/or federal, state, or local standards.\n\n\nLaboratory staff can be expected to work in areas where hazards associated are with, but not limited to, airborne pathogens. Biological materials, hazardous substances, and radioactive material exist and are handled. Appropriate training is provided regarding these hazards and staff are expected to adhere to all health and safety policies at all times, whether they are in writing or verbalized by a supervisor.\n\n\nJob Type: Full-time\n\n\nPay: From $16.00 per hour\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nEmployee discount\nFlexible schedule\nHealth insurance\nLife insurance\nPaid sick time\nPaid time off\nReferral program\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nHome daily\nMonday to Friday\nOvertime\nWeekend availability\n\nTrucking Driver Type:\n\n\nTeam driver\n\nTrucking Route:\n\n\nLocal\n\nCOVID-19 considerations:\nEmployees must wear masks if unvaccinated.\n\n\nApplication Question(s):\n\n\nDesired compensation?\nWhat is the best email/phone number to reach you at?\n\nEducation:\n\n\nHigh school or equivalent (Preferred)\n\nExperience:\n\n\nCustomer service: 1 year (Preferred)\n\nLicense/Certification:\n\n\nDriver's License with a clean driving record? (Required)\n\nWork Location: On the road\n","slug":"field-sampler-f96ddb4d-cb18-4e3d-937b-2d39b7cab6cb","benefits":["Dental insurance","Employee discount","Health insurance","Flexible schedule","Referral program"],"selectedSkills":["Driving","Communication skills","Customer service","Driver's License","High school diploma or GED","Clean driving record","21 years or older","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=fGIDTh8cdUwJ-UodDY6BoEcxUyadGJqB3icCxkJ7PTbdsP-ypjn2UQ"},{"position":"Chemist/Analyst Cannabis Lab","labName":"Canna Labs","location":"Albuquerque, NM","age":"3 hours ago","type":"Full-time | Contract","salaryMin":"$75,000 ","salaryMax":" $100,000 a year","jobDescriptionCopy":"New Cannabis Labatory is in need of an experienced Chemist to run our new Cannabis Testing Facily. Brand new State of the art equipment and huge growth and profit sharing opportunity.\n\n\nJob Types: Full-time, Contract\n\n\nPay: $75,000.00 - $100,000.00 per year\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nEmployee assistance program\nFlexible schedule\nHealth insurance\nLife insurance\nPaid time off\nRelocation assistance\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\n\nSupplemental Pay:\n\n\nBonus pay\n\nAbility to commute/relocate:\n\n\nAlbuquerque, NM 87110: Reliably commute or planning to relocate before starting work (Preferred)\n\nExperience:\n\n\nLaboratory experience: 1 year (Preferred)\n\nWork Location: One location\n","slug":"chemistanalyst-cannabis-lab-81672888-f935-4780-93d6-aeaab711d20a","benefits":["Dental insurance","Health insurance","Employee assistance program","Paid time off","Flexible schedule"],"selectedSkills":["Laboratory experience"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=046MqkCW_alC7Z4u-aQZVXKJygi8ZjwjO9Kv-V33oI9Pl7-gpvwzNw"},{"position":"Chemist for cannabis testing lab","labName":"Paradigm Laboratories","location":"Tucson, AZ","age":"5 days ago","type":"Full-time","salaryMin":"$60,000 ","salaryMax":" $80,000 a year","jobDescriptionCopy":"Core Functions:\n\n\nAssists with developing, altering, or updating analytical methods and/or verifying or validating them prior to implementation.\nTests and analyzes a variety of samples, products, or materials for chemical composition or presence of specific substances; follows standardized analytical procedures.\n\n\nUpon request, may oversee the functionality of an assigned section.\n\n\nMonitors turnaround time and adjusts appropriately.\nReviews data prior to approval.\nPerforms procedures in accordance with the SOPs, project-specific requirements, and policies set forth by the laboratory management.\nUnderstands, adheres, and enforces the QA/QC requirements as established by ISO 17025, ADHS, and SOPs.\nMaintains compliance with all state, federal and local laws, ISO standards, and SOPs.\nTrains and orients new employees.\nAnalyzes samples and reviews data.\nMaintains a neat and organized laboratory.\nPerforms related work as assigned.\n\n\n- Salary DOE\n\n\n- Must be at least 21 years of age.\n\n\n- Must be able to pass a state background check.\n\n\nJob Type: Full-time\n\n\nPay: $60,000.00 - $80,000.00 per year\n\n\nBenefits:\n\n\nDental insurance\nFlexible spending account\nHealth insurance\nHealth savings account\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\n\nAbility to commute/relocate:\n\n\nTucson, AZ 85713: Reliably commute or planning to relocate before starting work (Required)\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\ncannabis lab: 2 years (Required)\nLCMS or GCMS analytical: 2 years (Required)\n\nWork Location: One location\n","slug":"chemist-for-cannabis-testing-lab-6b7b1465-19d0-40dc-923e-a2b75fc849cd","benefits":["Health savings account","Dental insurance","Health insurance","Paid time off","Vision insurance"],"selectedSkills":["Laboratory experience","Bachelor's degree","21 years or older","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=olN3_b05dJJEa00tAnMdb7vdVNuJp_3-10HvfQY9sBZrZ0-BrG9Ksw"},{"position":"Chemist","labName":"Euphoria Wellness","location":"Las Vegas, NV","age":"7 days ago","type":"Full-time | Part-time","salaryMin":"$39,000 ","salaryMax":" $52,000 a year","jobDescriptionCopy":"Role and Responsibilities:\n\n\nThe Chemist is responsible for the preparation and execution of the extraction process. The Chemist will carry out the day to day tasks including extraction, refining, testing, quality assurance and maintenance. The Chemist is responsible for various duties within the laboratory while working compliantly within State and Federal regulatory frameworks.\n\n\nEssential Functions:\n\n\n- Ability to follow and adhere to strict regulatory protocols and standard operating procedures.\n\n\n- Ensure proper handling of pre- and post- extraction materials.\n\n\n- Process raw cannabis material into a crude concentrate.\n\n\n- Perform wet chemistry techniques, filtration, distillation, crystallization and purging.\n\n\n- Carry out cannabinoid concentrate refining process to completion.\n\n\n- Ensure all processes include clear and well defined labeling to ensure traceability.\n\n\n- Analyze and report on product test results.\n\n\n- Assist with daily, weekly, monthly maintenance of the laboratory area and equipment.\n\n\n- Keep equipment operational by following operating instructions; troubleshooting breakdowns; performing preventative maintenance.\n\n\nJob Types: Full-time, Part-time\n\n\nBenefits:\n\n\nDental insurance\nEmployee discount\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nMonday to Friday\n\nCOVID-19 considerations:\nEmployees are required to provide proof of an FDA-approved vaccination against COVID-19.\n\n\nAbility to commute/relocate:\n\n\nLas Vegas, NV: Reliably commute or planning to relocate before starting work (Preferred)\n\nExperience:\n\n\nLaboratory experience: 1 year (Preferred)\n\nWork Location: One location\n","slug":"chemist-6658cef2-4f14-4b0c-8c7c-f750d29eee89","benefits":["Dental insurance","Employee discount","Health insurance","Paid time off","Vision insurance"],"selectedSkills":["Laboratory experience"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=kMt7wLAkGhvl_KlHpY6x96VFA7ci0WHP81dLEiuw8qQJQsW_5n6nTQ"},{"position":"Microbiologist","labName":"Kaycha Labs","location":"Davie, FL","age":"6 days ago","type":"Full-time","salaryMin":"$39,000 ","salaryMax":" $53,000 a year","jobDescriptionCopy":"Company Overview:\n\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\n\nJob Purpose:\n\n\nThe Microbiologist will be responsible for performing, documenting, record checking, and troubleshooting qualitative and quantitative assays on samples using techniques that vary from the use of standard laboratory equipment to highly modern and automated instrumentation.\n\n\nEssential Duties & Responsibilities:\n\n\nAnalyze samples consisting of a variety of matrices and cross trained on various laboratory technologies including, but not limited to, bacterial and fungal plating and PCR.\nTrain incoming analysts and technicians on methodology.\nResponsible for troubleshooting instrumentation to ensure data integrity\nPrepare samples for analysis while displaying good laboratory technique to avoid cross contamination or misidentified samples.\nAccurately prepare quality control samples.\nInterpret and evaluate data in terms of accuracy, precision, trends, and quality control requirements.\nProvide scientific interpretation of results to supervisor, management, or customers as requested.\nMaintain a sterile work environment and undergo cleaning procedures as necessary, to ensure ongoing proper workflow. Report contamination issues to supervisor.\nPrioritize samples and provide guidance and support to the sample prep team for assigned analysis.\nPerform method validations, or verifications with minimal supervision as needed.\nTrack inventory of supplies and reagents to ensure no interruption of work-flow\nOversee root cause analysis for quality assurance.\nAssist in SOP edits as needed for assigned testing analysis and alert management when there is a change in procedure\nMay be able to perform method development to respond to changing client needs or regulations\nResearch new technologies and methodologies to improve laboratory processes and techniques and make recommendations to supervisors.\nOther duties and special projects as assigned.\n\nSkills, Abilities and Competencies:\n\n\nStrong understanding of standard laboratory protocol.\nMaintain high productivity, keen attention to detail, and consistent multi-tasking while yielding a low testing error rate.\nStrong agility, engagement, and flexibility in an ever-changing environment.\nDiligent commitment to logging, organizing, and analyzing data.\nExcellent communication skills and ability to effectively work, problem solve, and communicate with multiple levels of the organization.\nPromote a strong customer service culture while adhering to the highest safety and industry standards, including those that are outlined by the state regulatory body.\n\nEducation & Experience:\n\n\nMinimum BS/BA in Biology, Chemistry, Physics, Engineering or Environmental Sciences required.\nKnowledge of principles, terminology, practices, techniques, and instrumentation commonly used in a laboratory setting required.\nAt least 2 years of microbiology experience is preferred.\nFood science and/or environmental experience is a plus.\nExposure to the cannabis industry is a plus.\n\nOther:\n\n\nMust pass the required background check.\nMust be at least 21 years old.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision, 401k plan with company match and PTO.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.\n\nThe above is intended to describe the general content of and requirements for the performance of this job. It is not to be construed as an exhaustive statement of duties, responsibilities, or physical requirements.\n\n\nCOVID-19 considerations: Face masks required.\n\n\nJob Type: Full-time\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nFlexible spending account\nHealth insurance\nPaid time off\nReferral program\nVision insurance\n\nSchedule:\n\n\n10 hour shift\nMonday to Friday\nWeekend availability\n\nCOVID-19 considerations:\nMask mandate for all unvaccinated employees and visitors.\n\n\nApplication Question(s):\n\n\nWhat is your desired compensation?\nBest phone number/email to reach you at?\n\nEducation:\n\n\nBachelor's (Preferred)\n\nExperience:\n\n\nMicrobiology: 1 year (Required)\n\nWork Location: One location\n","slug":"microbiologist-00b6a32d-2e87-48b4-9ba7-0fc697f03337","benefits":["Dental insurance","Health insurance","Employee assistance program","401(k) matching","Paid time off"],"selectedSkills":["Communication skills","Microbiology","Root cause analysis","Bachelor of Science","Bachelor's degree","21 years or older","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=nqoRcynKd0dK0U1yqK-LWXDvTKtpn-pL_B40PEGFQO05Rw9Pgm_rUw"},{"position":"Lab Technician","labName":"Canalyte Laboratories","location":"Riverside, CA","age":"7 days ago","type":"Full-time | Part-time","salaryMin":"$20 ","salaryMax":" $25 an hour","jobDescriptionCopy":"The Lab Technician will be responsible for receiving, batching, preparing, and loading samples on our instruments to ensure the generation of timely and high-quality data.\n\n\nResponsibilities\n\n\n- Perform wet chemistry techniques for sample preparation for both quality and compliance testing\n\n\n- Conduct laboratory analysis of hemp and cannabis products, and recording of laboratory test data and results\n\n\n- Ensure maximum output of the laboratory by improving and optimizing laboratory processes and operations\n\n\n- Perform daily maintenance of team area and equipment being used\n\n\n- Execution of laboratory-specific operations, and implementation of Good Laboratory Practices (GLP)\n\n\n- Remain up-to-date on all SOPs and maintain documentation required for compliance.\n\n\n- Assist in maintaining the laboratory for ISO/NELAC accreditation standards and future audits.\n\n\n- Work on projects assigned by lab management and work in collaboration with other technicians.\n\n\n- Maintain a safe, clean, stocked, well-organized, and efficient laboratory work environment.\n\n\nRequired Skills & Experience\n\n\n- Must be at least 21 years of age.\n\n\n- Bachelor's Degree in biological, chemical, agricultural, environmental, or related sciences from an accredited college or university; or an Associate’s Degree with at least 2 years of lab experience.\n\n\n- Familiarity with data entry and database management (Lab Information Management System).\n\n\n- Excellent oral and written communication skills are required.\n\n\n- Candidates with GC-MS, GC-MS/MS, and/or LC-MS/MS instrumentation and software experience will be given preference.\n\n\nJob Types: Full-time, Part-time\n\n\nPay: $20.00 - $25.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nVision insurance\n\nSchedule:\n\n\n8 hour shift\n\nEducation:\n\n\nBachelor's (Preferred)\n\nExperience:\n\n\nLaboratory Experience: 2 years (Preferred)\n\nWork Location: One location\n","slug":"lab-technician-2e7f641f-4596-4502-958e-3d2b6241a4fb","benefits":["Dental insurance","Health insurance","Vision insurance"],"selectedSkills":["Database management","Laboratory experience","Communication skills","Data entry","Bachelor's degree","Associate's degree","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=jcPv9nedl15frFE5Y4zNU9x-ozAco44m_iNoWcAZMQkWpQL5mgWmGg"},{"position":"Microbiology Laboratory Technician","labName":"Rm3 Labs","location":"Broomfield, CO","age":"8 days ago","type":"Full-time","salaryMin":"$18 ","salaryMax":" $19 an hour","jobDescriptionCopy":"Company Description:\n\n\nSince our founding in 2009, Rm3 Labs has been a leader in providing scientific analysis for the cannabis community of Colorado. As a fully independent, analytical laboratory located in Broomfield, we bring state-of-the-art scientific expertise and technology to help our clients produce safe, pure, and effective cannabis products. We are ISO/IEC 17025 accredited and licensed and certified by the State.\n\n\nJob Summary:\n\n\nWe are looking for a full-time Microbiology Laboratory Technician to prepare samples for Total Yeast and Mold (TYAM) and qPCR analysis for Salmonella, STEC, and Aspergillus, perform water activity analysis, and assist with other general laboratory tasks and projects.\n\n\nThis position requires being in the lab Tuesdays through Saturdays from 10am - 6:30pm. The person that fills this position may choose to adjust their start time on Saturdays. The schedule for this position is unlikely to change, so the candidate must be comfortable with this schedule.\n\n\nThis is an entry level position with opportunity for growth. Salary is $18/hr for 0 - 1 year of full-time laboratory testing experience and $19/hr for 1 - 2 years of full-time laboratory testing experience. Benefits include three weeks of paid time off, paid holidays, maternity/paternity leave, subsidized healthcare and dental insurance, performance based bonus, and professional development assistance.\n\n\nJob Responsibilities\n\n\nComply with State, Local, OSHA, and ISO 17025 requirements.\nFollow company and laboratory Standard Operating Procedures (SOPs).\nVerify lab equipment before use to ensure they are within acceptable limits.\nPrepare lab reagents, working standards, and/or media and verify them before use.\nWeigh and prepare analytical samples for testing using balances, pipettes, media enrichments, solvent extractions, etc.\nAccurately record data in an organized, legible, and consistent manner on physical documents and in the Laboratory Information Management System (LIMS).\nAdhere to strict reporting deadlines.\nIdentify, investigate, and document departures from the quality system and/or test procedures.\nAssist with cleaning and maintaining laboratory equipment and supplies.\nPerform general laboratory tasks such as inventory, sample archival and disposal, cleaning, and similar lab duties.\nAssist in training new or junior staff; may act an as onboarding buddy to new staff.\nAssist in the development, modification, verification, and validation of methods.\nPerform special projects, as assigned by the Lead Chemist or Lead Microbiologist.\nReport concerns to the Lead Microbiologist.\n\nRequirements\n\n\nMust be comfortable working Tuesdays through Saturdays from 10am - 6:30pm (can adjust start time on Saturdays).\nMust be a Colorado resident and at least 21 years old, no exceptions.\nMust have an Associate Degree in science or higher.\nMust pass an extensive background security check with no felony convictions and must be able to obtain a Colorado Department of Revenue – MED support license prior to or at the time of hire.\nMust be able to work independently and as part of a team.\nMust be able to interact professionally with colleagues.\nMust have good documentation and communication skills.\nMust have strong attention to detail and is accuracy-oriented.\nMust be able to adhere to strict deadlines.\n\nThe Ideal Candidate\n\n\nHas some experience working in a laboratory.\nIs comfortable performing repetitive tasks.\nThrives in a fast-paced environment and adapts well to change.\nHas experience handling large sample loads.\n\nJob Type: Full-time\n\n\nPay: $18.00 - $19.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nParental leave\nProfessional development assistance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nWeekend availability\n\nSupplemental Pay:\n\n\nBonus pay\n\nCOVID-19 considerations:\nWe require employees and visitors to wear masks.\n\n\nApplication Question(s):\n\n\nDo you currently live in Colorado? Unfortunately, we will not be able to consider out of state applicants. No exceptions.\nAre you comfortable with a Tuesday through Saturday 10am - 6:30pm shift (can adjust start time on Saturdays). This schedule is unlikely to change, so we want to make sure all candidates are comfortable with this work schedule.\nList all the times you are available for a 15-30 min phone interview during the next two weeks. Please do not leave this blank.\n\nEducation:\n\n\nAssociate (Required)\n\nWork Location: One location\n","slug":"microbiology-laboratory-technician-40ad75b4-8d12-4917-a690-6dec0d79e950","benefits":["Dental insurance","Health insurance","Paid time off","Professional development assistance","Parental leave"],"selectedSkills":["Laboratory experience","Communication skills","Associate's degree","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=7W6uJakMmyuLUbkaOllJzbAnU4SGw46JFRKsIQNpFWsiM52FY7rr8w"},{"position":"Selection Specialist","labName":"ACT Laboratories, LLC","location":"Toledo, OH","age":"1 day ago","type":"Full-time","jobDescriptionCopy":"About us\n\n\nACT Laboratories, LLC operates a network of laboratories across the Midwest and Northeast providing state regulated cannabis testing for our clients. Working with the largest medical marijuana retailers, ACT Laboratories prides itself on accurate reliable testing, exemplary responsive customer service, and professional knowledgeable technical services. Act collaborates with state provided cannabis programs to ensure standards are met or exceeded within our company. We encourage military veterans and retired law enforcement to consider joining the ACT team to bring your professional experience and respected training to our company.\n\n\nACT Laboratories\nJob Description\n\n\nJob Title: Selection Specialist\nReports To: Selection Specialist Manager\nDate: June 8, 2022\n\n\nJob Summary:\nCollect and transport sample from client location to laboratory location.\n\n\nEssential Duties and Responsibilities:\n\n\nCollect samples from client locations and transport to laboratory in as safe and efficient manner while following state regulations in a company vehicle\nKeep inventory of essential items needed to perform sampling procedures\nMaintain sterility of samples and sampling kits\nInform leadership on emerging compliance and customer issues\nMaintain logs relevant to sample collection and sterilization of equipment\nInform the Senior Driver/Laboratory Manager when vehicles need maintenance\nEstablish and maintain productive working relationships with people inside the laboratory and people outside the laboratory including customers, regulatory staff and corporate staff\n\nSupervisory Responsibilities:\nNone\n\n\nAdditional Responsibilities:\n\n\nClean and sanitize the laboratory\nAutoclave tongs\nPerform waste disposal\nPerform inventory of laboratory supplies\nPerform other duties as may be assigned\n\nQualifications:\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily.\nThe requirements listed below are representative of the knowledge, skills, and/or abilities required.\nReasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nEducation and/or Experience:\n\n\nHigh School Diploma or equivalent\n1 year of customer service experience preferred\nSome laboratory experience preferred\n\nKnowledge, Skills and Abilities Required:\n\n\nKnowledge of federal, state and local laws regarding testing and transport of cannabis products preferred\nKnowledge of cannabis industry\nAbility to follow standard operating procedures\nAbility to drive safely to and from client facilities (not applicable at New York laboratory)\nBasic knowledge and understanding of seed to sale tracking systems\nBasic understanding of the tests the laboratory performs\nAbility to keep a professional and courteous demeanor in day-to-day operations\nBasic knowledge and understanding of Microsoft Office\nAbility to use computers and computer software programs and systems and standard office equipment such as phones, photocopiers and fax machines\nGood written and verbal communication skills to convey and receive information effectively (face-to- face, telephone and electronic)\nGood analytical and judgment skills\nDetail-oriented\nAbility to maintain confidentiality regarding test results\nExcellent organizational skills to work independently, prioritize, handle multiple tasks, manage time\n\nCertifications, Licenses, Registrations:\nValid Driver’s License required (not applicable at New York laboratory)\n\n\nSafety Sensitive Position:\nEquipment or vehicles used and activities performed by this position that could cause serious injury or death to the operator, other employees and/or other individuals if not used properly or safely:\n\n\nDriving a vehicle (not applicable at New York laboratory)\nWorking around testing equipment\nPerforming waste disposal\n\nPhysical Demands:\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nProlonged periods of driving a vehicle and using hands to handle, control a vehicle (not applicable at\n\nNew York laboratory)\n\n\nProlonged periods of walking/moving around and standing, talking and hearing and using hands to handle objects\nOccasional periods of stooping/kneeling, bending\nLifting up to 10 pounds regularly and up to 25 pounds occasionally\nClose vision and ability to focus on computer screens and documents; distance vision; peripheral vision; depth perception\n\nWork Environment:\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. The employee works in a laboratory environment and if applicable travels to client locations throughout the state.\n\n\nWhile performing work related duties, the employee occasionally works in elevated places and if applicable, around fumes or airborne particles and must be aware of outdoor weather conditions for the purpose of travel.\n\n\nThe noise level in the work environment is usually moderate.\n\n\nStressful Conditions in the Work Environment Affecting This Position:\n\n\nChallenging work demands include heavy workload/work quantity and quality demands, infrequent rest breaks, and long or unpredictable work hours\nChallenging situations including dealing with difficult customers/employees/vendors\n\nWork Schedule:\nThe position is full time requiring varying shifts Monday through Friday to cover business operations.\nWork week hours will vary between 40 and 60 hours both in the laboratory and if applicable, traveling to client locations during weekends and holidays.\n\n\nThis job description is intended to describe the essential functions of and requirements for the successful performance of this position. It is not to be interpreted as an exhaustive statement of duties, responsibilities or requirements of this position, nor is it intended to limit the authority of any manager to assign and direct the activities of employees under his or her direction.\n\n\nJob Type: Full-time\n\n\nPay: From $17.50 per hour\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nDisability insurance\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\nMonday to Friday\n\nLicense/Certification:\n\n\nDriver's License (Required)\n\nWork Location: On the road\n","slug":"selection-specialist-f2390e53-fff3-4e26-9630-7a2df80d9aa7","benefits":["Dental insurance","Health insurance","Disability insurance","Paid time off","401(k)"],"selectedSkills":["Analysis skills","Customer service","Driver's License","Laboratory experience","Communication skills","High school diploma or GED"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=pKUfIduh-YMY4Ozz1cgXtxTurQKlQSmAosJgI_UhOqJB6Bt1nv9CbA"},{"position":"Inventory Technician","labName":"CannaPunch","location":"Las Vegas, NV","age":"13 hours ago","type":"Full-time","salaryMin":"$28,000 ","salaryMax":" $38,000 a year","jobDescriptionCopy":"ABOUT AYR WELLNESS\n\nWe’re a new kind of cannabis company, aiming higher in everything we do. We grow and sell the highest-quality cannabis products available anywhere, inspiring wellness and wonder in our customers, wherever they are on their cannabis journey. We operate with a sense of responsibility to our customers and patients, building stronger and more socially responsible communities everywhere we go.\n\nJOB DESCRIPTION\n\nThe Packaging Technician primarily responsible for the accurate weighing, labeling, and packaging of all of our products prior to shipping.\n\nRESPONSIBILITIES\n\nTech I\n\n\nPackage, sticker, and count cannabis products/finished goods\nConfirm batch and lot numbers on finished goods’ product labels are correct\nCreate “Lots” of Bud, Smalls, Shake, and Live Resin in LeafLogix and Metrc as well as physically\nCoordinate third party Laboratory testing and transfers\nConfirm Harvest Batches’ Untrimmed Dry Weights (“Buck” weights) by reweighing and recording weights\nCoordinate and execute conversions and transfers to Extractions Department\nCarefully manage inventory flow during busy order fulfillment periods\nAbility to multi-task repeatedly with attention to detail and minimal errors\nMaintain a clean and organized work environment\nRead, understand, and follow all CCB regulations relating to inventory control and chain of custody\nAssist with supervision of Trim Technicians on trim machine and grinding machine on their workflow and duties\nDelegate cannabis products for processing and trimming\nOther duties as assigned\nSKILLS/ABILITIES REQUIRED\n\n\nAttention to detail with excellent record keeping ability\nWillingness to learn and improve each operation\nAbility to perform repetitive tasks for long periods of time\nAbility to work in a fast-paced environment and multi-task\nCommitment to arrive for scheduled shifts on time and maintain consistent attendance\nAvailability to work occasional weekends and holidays\nREQUIREMENTS/PREFERRED EXPERIENCE\n\n\nHigh school diploma or General Education Diploma (GED)\nMust have a clear understanding of weights and measures and ability to operate a scale\nAbility to work within a team and on an individual basis\nFamiliarity with warehouse procedures\nAbility to work in a timely manner and drive to increase productivity\nExperience and knowledge and familiarity with Cannabis\nProficient in Microsoft Office (Word, Excel and Outlook)\nMust be 21 years of age or older, and be able to pass an extensive background check\nMust be authorized to work in the United States\nPHYSICAL REQUIREMENTS\n\n\nAbility to stand on feet or sit for extended periods of time\nAbility to have extended cannabis exposure, with no adverse physical reaction\nAbility to use repetitive use of hands, wrists and forearms\nFine visual acuity with the ability to adjust focus to inspect closely, ability to recognize different colors.\nNormal vision or corrected by use of glasses and/or contacts for normal reading and viewing abilities to determine the accuracy, neatness, and thoroughness of the work assigned, or to make general observations of facilities or structures.\nRequires eye-hand coordination and manual dexterity sufficient to meet job and operate equipment requirements\nRequires normal range of hearing with the ability to perceive the nature of sounds at normal speaking levels with or without correction and having the ability to receive detailed information through oral communication and making fine discriminations in sound.\nAbility to twist, turn, bend, stand and walk as required to perform the duties associated with functioning as a dispensary manager.\nPushing/pulling/carrying, with the ability to lift up to 50 pounds occasionally\nRegular and on-time attendance (Hours may exceed 40 hours per week)\nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n\nWORK ENVIRONMENT:\nWork is performed in several locations that include a cannabis cultivation and production facility. The working area may be odorous at times and loud due to fans and filtration systems, fluctuating between cold and warm temperatures. Involves frequent contact with staff. Work may include dealing with law enforcement and occasional State inspectors.\n\nDISCLAIMER\n\nAll the above duties and responsibilities are essential job functions subject to reasonable accommodation. All job requirements listed indicate the minimum level of knowledge, skills and/or ability deemed necessary to perform the job proficiently. Employees may be required to perform any other job-related instructions as requested by their supervisor, subject to reasonable accommodation. This document does not create an employment contract, implied or otherwise, other than an “at will” employment relationship.\n\nAyr Wellness is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, veteran status, or any other characteristic protected by federal, state or local law.","slug":"inventory-technician-58f15621-96c8-4bd2-8cb5-8502502d1d83","benefits":[],"selectedSkills":["Microsoft Outlook","Warehouse experience","Microsoft Excel","Microsoft Office","Microsoft Word","High school diploma or GED","Background check","21 years or older","US work authorization"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=ym_z5KMMnRiLEg61_QYzLvSdDoPN25vJ0cAF_jKE6qM6iK0gJrZ2qg"},{"position":"Laboratory Chemist II","labName":"ACT Laboratories, LLC","location":"Morton, IL","age":"6 days ago","type":"Full-time","salaryMin":"$23 ","salaryMax":" $26 an hour","jobDescriptionCopy":"ACT Laboratories\n\n\nJob Description\n\n\nJob Title: Laboratory Chemist II\n\n\nReports To: Laboratory Manager\n\n\nDate: June 3, 2022\n\n\nJob Summary:\n\n\nUnder technical supervision, conduct qualitative and quantitative chemical and/or microbiological analyses\n\n\nEssential Duties and Responsibilities:\n\n\nPerform sample testing following documented procedures in order to analyze organic or inorganic compounds to determine chemical or physical properties, composition, structure, relationships or reactions using chromatography, spectroscopy or spectrophotometry techniques\nPerform microbiological sample testing following documented procedures to determine presence/absence of bacteria, or other microorganisms\nConduct quality control tests\nMaintain laboratory instruments to ensure proper working order\nPrepare test solutions, compounds or reagents for conducting tests\nMake interpretations of data from microbiological plates\nPerform review of data entered into Laboratory Information Management System\nFollow laboratory safety procedures to ensure compliance with standards or to suggest improvements as needed\nConfer with others to interpret test results\nEstablish and maintain productive working relationships with people inside the laboratory and people outside the laboratory including customers, regulatory staff and corporate staff\n\nSupervisory Responsibilities:\n\n\nNone\n\n\nAdditional Responsibilities:\n\n\nWork with Technical Services to improve current methods\nPerform other duties as may be assigned\n\nQualifications:\n\n\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skills, and/or abilities required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nEducation and/or Experience:\n\n\nBachelor's degree in Chemistry, Biology or related science required\nMinimum 3-5 years work-related analytical chemistry experience required\nExperience with HPLC-UV, HS-GC-FID, ICP-MS preferred\nGMP/FDA experience preferred\n\nKnowledge, Skills and Abilities Required:\n\n\nKnowledge of elementary principles of microbiology and chemistry\nKnowledge of basic clinical laboratory skills\nAbility to operate laboratory equipment\nAbility to use computers and computer software programs and systems and standard office equipment such as phones, photocopiers and fax machines\nGood written and verbal communication skills to convey and receive information effectively (face-to-face, telephone and electronic)\nGood analytical and judgment skills\nDetail-oriented\nAbility to maintain confidentiality regarding test results\nExcellent organizational skills to work independently, prioritize, handle multiple tasks, manage time\n\nCertifications, Licenses, Registrations:\n\n\nNone\n\n\nSafety Sensitive Position:\n\n\nEquipment or vehicles used and activities performed by this position that could cause serious injury or death to the operator, other employees and/or other individuals if not used properly or safely:\n\n\nWorking with testing equipment with hot surfaces\nHandling chemicals including acids and solvents used in the testing process\n\nPhysical Demands:\n\n\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nProlonged periods of sitting at a desk and working on a computer, walking/moving around and standing, talking and hearing and using hands to handle, control or feel objects, tools or controls\nOccasional periods of stooping/bending\nLifting up to 25 pounds regularly\nClose vision and ability to focus on computer screens and documents; depth perception; color vision\n\nWork Environment:\n\n\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. The employee works in a laboratory environment.\n\n\nWhile performing work-related duties the employee occasionally works with hazardous, toxic or caustic chemicals such as acids and solvents, works around fumes or airborne particles from laboratory chemicals used/fume hoods works with or near moving mechanical parts from laboratory equipment and works with equipment that vibrates. The noise level in the work environment is usually moderate.\n\n\nStressful Conditions in the Work Environment Affecting This Position:\n\n\nChallenging work demands including heavy workload/work quantity or quality demands, time demands, conflicting/multiple deadlines or tasks and interpreting data\n\nWork Schedule:\n\n\n40-hour minimum workweek\nMay require on-call duty and the ability to work outside of scheduled work hours including weekends and holidays when the need arise\n\nJob Type: Full-time\n\n\nPay: $23.00 - $26.00 per hour\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nReferral program\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\n\nAbility to commute/relocate:\n\n\nMorton, IL 61550: Reliably commute or planning to relocate before starting work (Preferred)\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nLaboratory experience: 2 years (Preferred)\nCannabis: 1 year (Preferred)\nSupervisory: 1 year (Preferred)\n\nWork Location: One location\n","slug":"laboratory-chemist-ii-94b25acb-ad86-4a43-a85c-2d74fdefb5b9","benefits":["Dental insurance","Health insurance","Referral program","401(k)","Paid time off"],"selectedSkills":["High-performance liquid chromatography","Spectroscopy","Laboratory experience","Communication skills","Microbiology","Bachelor's degree","Master's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=_CDn-xA3F5iIJ_4nLiu1at8qfi0uDmuaIOd5ap1N0ywNUfEloUneVQ"},{"position":"Microbiology Lab Technician","labName":"Ace Analytical Laboratory","location":"Las Vegas, NV","age":"7 days ago","type":"Full-time | Part-time","salaryMin":"$15 ","salaryMax":" $17 an hour","jobDescriptionCopy":"We are an ISO/IEC 17025:2017 accredited cannabis testing laboratory in Las Vegas seeking for a highly-motivated Microbiology Technician eager to learn and grow in the new, evolving cannabis industry.\n\n\nDUTIES AND RESPONSABILITIES\n\n\nResponsible for conducting qualitative and quantitative microbial analyses of cannabis products using molecular and cellular methodologies. Among several microorganisms, microbial testing includes Yeast and Mold, Salmonella, E. coli, Enterobacteriaceae and Aerobic bacteria.\n\n\n· Perform laboratory procedures according laboratory’s Standard Operating Procedures (SOPs), under the supervision of the team leader in accordance with ISO 17025 standards and state regulatory requirements\n\n\nPrepare samples using sterile technique to prevent contamination of products, growth medias and equipment when preforming cell culture procedures\nAccurately weight samples, pipetting, prepare dilutions to perform sterile microbial plating and Colony Forming Units (CFU) counting following methods described in SOPs\nHandle chemicals and microbial cell cultures safely using appropriate Personal Protective Equipment (PPE) to prevent cross-contamination and exposure to hazardous material\nAccurate data (Weight, CFU counts) entry using Microsoft Excel sheets\nLaboratory maintenance including cleaning, equipment and scheduled environmental microbial testing\nPrepare DNA samples from cannabis products to perform Polymerase Chain Reaction (PCR) microbial testing\n\nEDUCATION\n\n\nBachelor’s degree with major coursework in microbiology, molecular biology, biology or related field. Candidates with an associate degree and professional experience in a microbiology laboratory will be considered.\n\n\nSKILLS\n\n\nAbility to work independently and coordinate activities with team members to effectively complete assigned tasks and deliver analytical results timely according to the team leader expectations.\nFamiliar with sterile procedures and ability to pipet large and small volumes using specific pipets.\nAbility to learn and adapt quickly with knowledge of the mathematical skills required to perform calculations such as dilutions and buffer preparation.\nHighly organized with attention to details, speed, consistency and accuracy in performing assigned tasks to meet the laboratory deadlines.\nAbility to demonstrate flexibility in work environment, performing a variety of tasks as requested by the team leader.\nGood working knowledge of Microsoft Office Excel.\nHonesty, friendly demeanor and positive interpersonal skills to work closely with team members in a fast, sometime stressful environment.\nCommitment to success with the ability to communicate effectively and respectfully with co-workers to promote a working environment conductive of constructive intellectual exchanges.\n\nJOB TYPE: Full-Time/Part-Time\n\n\nEXPERIENCE\n\n\n· Laboratory Experience: 1 year\n\n\nBENEFITS:\n\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nOTHER\n\n\n· Must pass the required background check\n\n\n· Must be at least 21 years old.\n\n\n· Must be able to lift 20lbs\n\n\nAce Analytical is an Equal Opportunity Employer- All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.\n\n\nIf interested, please submit your resume and a cover letter emphasizing your motivation and how your education and experience make you an appealing candidate for this position. Applications without cover letters will not be considered.\n\n\nJob Types: Full-time, Part-time\n\n\nPay: $15.00 - $17.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nMonday to Friday\nNight shift\nWeekend availability\n\nSupplemental Pay:\n\n\nBonus pay\n\nCOVID-19 considerations:\nMasks and gloves are required and provided. Cleaning protocols are in place throughout the day, as well as hand washing guidelines.\n\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nMicrobiology: 1 year (Required)\nLaboratory Experience: 2 years (Preferred)\n\nWork Location: One location\n","slug":"microbiology-lab-technician-acb8d93f-3061-475f-9f99-b6b783fd5303","benefits":["Dental insurance","Health insurance","Paid time off","Vision insurance"],"selectedSkills":["Microsoft Excel","Laboratory experience","Microbiology","Microsoft Office","Bachelor's degree","Associate's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=8cuBGs7mJizJJmlBUgoIFGHab8fc2OodejaREPaUCaK9NKXABl0lPw"},{"position":"Analytical Chemist","labName":"LabPlex","location":"Long Beach, CA","age":"2 days ago","type":"Full-time","salaryMin":"$55,000 ","salaryMax":" $65,000 a year","jobDescriptionCopy":"Who We Are:\n\n\nLabPlex, Inc. is a new Cannabis Testing lab located in Long Beach, CA. Our leading testing approach provides in-depth data to help our clientele introduce cleaner and safer products into the California marketplace. LabPlex not only offers state of the art testing for cannabis distributors, manufacturers, cultivators, and micro-businesses, we also act as an educational liaison of industry standards for our clients.\n\n\nPosition Summary:\n\n\nThis is a full-time position. The Analytical Chemist must have strong leadership abilities, be able to troubleshoot instrumentation, work with vendors, and take direction from management. This role is integral to our production.\n\n\nWhat You Will Do:\n\n\nScientific writing for reporting, data management reporting, and ability to follow standard operating procedures a must.\nChemical extraction, sample preparation and analysis for cannabis using LCMS/MS, GC-MS/MS, HPLC, GCMS, ICPMS as well as Microbiological analyses (must know one or more of these processes preferably on Shimadzu).\nWillingness to follow internal quality system requirements. Ensuring SOP’s are written or up-to-date for laboratory processes.\nFamiliar with California State regulations for cannabis.\nImplements and maintains appropriate quality control processes and procedures to guarantee accuracy of analysis and quality of results.\nPerforms review of reported data and associated quality control and preparing reports for delivery to client.\nResponsibilities may include general instrument troubleshooting.\nResponsible for ensuring that inventory is properly maintained and ordered on time to meet production demands.\nMaintain GLP standards.\nMust understand calculating workflow, turnaround times, and streamlined approaches.\nMust have a history of working in a production laboratory and an understanding of meeting deadlines.\nMust be able to prioritize and multi-task and have flexibility in working various shifts.\n\nEducation:\n\n\nMinimumBachelor's Degree in Chemistry, Biochemistry, Analytical Chemistry, or related Chemistry field.\n\nExperience:\n\n\nLCMS, GCMS, HPLC, or ICPMS: 2 years (Preferred)\nWet Laboratory: 2 years (Preferred\nMust have 3-5 years of Experience in cannabis or cannabis-related field preferred.\nEnvironmental/Food testing experience will be considered in lieu of Cannabis experience.\nFamiliar with production protocol as required by California State, FDA, ISO 17025 and GLP.\nPREFERENCE GIVEN FOR SHIMADZU EXPERIENCE, LCMS, GCMS, HPLC, or ICPMS for production.\n\nOptional:\n\n\nKnowledge of routine microbiological methods for the analysis of environmental, agricultural and food samples, including AOAC, FDA, BAM, ISO. Experience with PCR or ELISA.\n\nBenefit Conditions:\n\n\nOnly full-time employees eligible\n\nWork Remotely\n\n\nNo\n\nJob Type: Full-time\n\n\nPay: $55,000.00 - $65,000.00 per year\n\n\nBenefits:\n\n\nHealth insurance\nPaid time off\n\nSchedule:\n\n\nMonday to Friday\n\nEducation:\n\n\nBachelor's (Preferred)\n\nExperience:\n\n\nLaboratory Experience: 1 year (Preferred)\n\nWork Location: One location\n","slug":"analytical-chemist-487d6403-b471-4447-9db6-02d42bb86701","benefits":["Paid time off","Health insurance"],"selectedSkills":["Laboratory experience","ELISA","Microbiology","FDA regulations","PCR","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=SASqv-I4QLHxWeqylR1L9iM_AfS8evBcwPp9JztHTDcT1RigtLpx0A"},{"position":"Selection Specialist","labName":"ACT Laboratories","location":"Scranton, PA","age":"3 days ago","type":"Full-time | Part-time","jobDescriptionCopy":"About us\n\n\nACT Laboratories, LLC operates a network of laboratories across the Midwest and Northeast providing state regulated cannabis testing for our clients. Working with the largest medical marijuana retailers, ACT Laboratories prides itself on accurate reliable testing, exemplary responsive customer service, and professional knowledgeable technical services. Act collaborates with state provided cannabis programs to ensure standards are met or exceeded within our company. We encourage military veterans and retired law enforcement to consider joining the ACT team to bring your professional experience and respected training to our company.\n\n\nACT Laboratories\nJob Description\n\n\nJob Title: Selection Specialist\nReports To: Selection Specialist Manager\nDate: June 6, 2022\n\n\nJob Summary:\nCollect and transport sample from client location to laboratory location.\n\n\nEssential Duties and Responsibilities:\n\n\nCollect samples from client locations and transport to laboratory in as safe and efficient manner while following state regulations in a company vehicle\nKeep inventory of essential items needed to perform sampling procedures\nMaintain sterility of samples and sampling kits\nInform leadership on emerging compliance and customer issues\nMaintain logs relevant to sample collection and sterilization of equipment\nInform the Senior Driver/Laboratory Manager when vehicles need maintenance\nEstablish and maintain productive working relationships with people inside the laboratory and people outside the laboratory including customers, regulatory staff and corporate staff\nA company vehicle will be provided and must be garaged at the home of the specialist when not in use\nPosition requires early starts, late arrivals, 100% travel, and the potential for overnight stays occasionally\nPosition is on-call/ as-needed\n\nSupervisory Responsibilities:\nNone\n\n\nAdditional Responsibilities:\n\n\nClean and sanitize the laboratory\nAutoclave tongs\nPerform waste disposal\nPerform inventory of laboratory supplies\nPerform other duties as may be assigned\n\nQualifications:\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily.\nThe requirements listed below are representative of the knowledge, skills, and/or abilities required.\nReasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nEducation and/or Experience:\n\n\nHigh School Diploma or equivalent\n1 year of customer service experience preferred\nSome laboratory experience preferred\n\nKnowledge, Skills and Abilities Required:\n\n\nKnowledge of federal, state and local laws regarding testing and transport of cannabis products preferred\nKnowledge of cannabis industry\nAbility to follow standard operating procedures\nAbility to drive safely to and from client facilities (not applicable at New York laboratory)\nBasic knowledge and understanding of seed to sale tracking systems\nBasic understanding of the tests the laboratory performs\nAbility to keep a professional and courteous demeanor in day-to-day operations\nBasic knowledge and understanding of Microsoft Office\nAbility to use computers and computer software programs and systems and standard office equipment such as phones, photocopiers and fax machines\nGood written and verbal communication skills to convey and receive information effectively (face-to- face, telephone and electronic)\nGood analytical and judgment skills\nDetail-oriented\nAbility to maintain confidentiality regarding test results\nExcellent organizational skills to work independently, prioritize, handle multiple tasks, manage time\n\nCertifications, Licenses, Registrations:\nValid Driver’s License required\n\n\nSafety Sensitive Position:\nEquipment or vehicles used and activities performed by this position that could cause serious injury or death to the operator, other employees and/or other individuals if not used properly or safely:\n\n\nDriving a vehicle\nWorking around testing equipment\nPerforming waste disposal\n\nPhysical Demands:\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nProlonged periods of driving a vehicle and using hands to handle, control a vehicle\nProlonged periods of walking/moving around and standing, talking and hearing and using hands to handle objects\nOccasional periods of stooping/kneeling, bending\nLifting up to 10 pounds regularly and up to 25 pounds occasionally\nClose vision and ability to focus on computer screens and documents; distance vision; peripheral vision; depth perception\n\nWork Environment:\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. The employee works in a laboratory environment and if applicable travels to client locations throughout the state.\n\n\nWhile performing work related duties, the employee occasionally works in elevated places and if applicable, around fumes or airborne particles and must be aware of outdoor weather conditions for the purpose of travel.\n\n\nThe noise level in the work environment is usually moderate.\n\n\nStressful Conditions in the Work Environment Affecting This Position:\n\n\nChallenging work demands include heavy workload/work quantity and quality demands, infrequent rest breaks, and long or unpredictable work hours\nChallenging situations including dealing with difficult customers/employees/vendors\n\nWork Schedule:\nThe position is required varying shifts Monday through Friday to cover business operations.\nWork week hours will vary between 30 and 60 hours both in the laboratory and if applicable, traveling to client locations during weekends and holidays.\n\n\nThis job description is intended to describe the essential functions of and requirements for the successful performance of this position. It is not to be interpreted as an exhaustive statement of duties, responsibilities or requirements of this position, nor is it intended to limit the authority of any manager to assign and direct the activities of employees under his or her direction.\n\n\nJob Types: Full-time, Part-time\n\n\nPay: From $17.50 per hour\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\nMonday to Friday\nOn call\n\nWork Location: On the road\n","slug":"selection-specialist-dc418de5-3a1a-4350-bcdc-7c77f853beb4","benefits":["Dental insurance","Health insurance","Paid time off","401(k)","Vision insurance"],"selectedSkills":["Analysis skills","Customer service","Driver's License","Laboratory experience","Communication skills","High school diploma or GED"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=e-OZFtq_YIqHYdQ1yJUBaSWvCgxONcwtLzsL_OLfs7ny55jFjNQWnw"},{"position":"Chemistry Analyst","labName":"Rm3 Labs","location":"Broomfield, CO","age":"7 days ago","type":"Full-time","salaryMin":"$19 ","salaryMax":" $22 an hour","jobDescriptionCopy":"Company Description\n\n\nSince our founding in 2009, Rm3 Labs has been a leader in providing scientific analysis for the cannabis community of Colorado. As a fully independent, analytical laboratory located in Broomfield, we bring state-of-the-art scientific expertise and technology to help our clients produce safe, pure, and effective cannabis products. We are ISO/IEC 17025 accredited and licensed and certified by the State.\n\n\nJob Summary\n\n\nWe are looking for a full-time Chemistry Analyst in our LC-MS department to perform chemical tests, analyze and record test results. This position involves preparing and analyzing cannabis flower, concentrates, and infused products for pesticide and mycotoxin contamination.\n\n\nThis position requires being in the lab Mondays through Fridays from 10am – 6:30pm. During training (approximately first 1-2 months), the schedule will be Mondays through Fridays from 9am - 5:30pm.\n\n\nThe hourly rate is based on the number of years of full-time laboratory testing experience (minimum required is 1 year of full time laboratory testing experience). Benefits include three weeks of paid time off, paid holidays, maternity/paternity leave, subsidized healthcare and dental insurance, holiday bonus based on performance, and professional development assistance.\n\n\nNOTE: The State of Colorado requires analysts to have a four-year degree in chemistry, biochemistry or related field and one year of full-time experience in a testing laboratory. Candidates will need a Marijuana Enforcement Division (MED) employee license. Only current Colorado residents that have a four-year degree in a natural science and one year of full-time experience in a testing laboratory will be considered.\n\n\nResponsibilities\n\n\nComply with State, Local, OSHA, and ISO 17025 requirements.\nFollow company and laboratory Standard Operating Procedures (SOPs).\nVerify lab equipment before use to ensure they are within acceptable limits.\nPrepare lab reagents and working standards and verify them before use.\nPrepare and test analytical samples using traditional laboratory technologies such as HPLC, GC-MS, LC-MS/MS, and ICP-MS.\nAccurately record and interpret data in an organized, legible, and consistent manner on documents and in the Laboratory Information Management System (LIMS).\nReview and authorize data for test reports to be created and sent to clients within prescribed reporting deadlines.\nIdentify, investigate, and document departures from the quality system and/or test procedures.\nTroubleshoot, clean, and maintain laboratory equipment and supplies.\nPerform general laboratory tasks such as inventory and consumables ordering, sample archival and disposal, cleaning, and similar lab duties.\nAssist with training new or junior staff; may act an as onboarding buddy to new staff.\nAssist in the development, modification, verification, and validation of methods.\nPerform special projects, as assigned by the Lead Chemist, Chemistry Lab Manager, and/or Laboratory Director.\nReport concerns to the Lead Chemist.\n\nRequirements\n\n\nBS/BA in chemistry, biochemistry, or related field and at least one year of full-time laboratory testing experience is required by State regulation, no exceptions.\nMust pass an extensive background check with no felony convictions and obtain a Colorado Department of Revenue – MED employee license prior to or at the time of hire.\nAble to work independently and part of a team in a fast-paced environment.\nAble to interact professionally with colleagues and bring up concerns immediately when you are faced with them.\nGreat written and verbal communication skills.\nExcellent laboratory troubleshooting skills.\nDetail and accuracy oriented.\nComputer skills and experience in Windows and Microsoft Office, particularly Excel.\n\nThe Ideal Candidate\n\n\nThrives in a fast-paced, professional, and fun work environment.\nIs self-motivated, curious, and focused on continual improvement.\nHas a passion for cannabis or the cannabis industry.\nLC-MS experience and/or sample preparation experience for pesticides or mycotoxins testing is a strong plus.\nExperience with other instruments such as HPLC, GC-MS, and/or ICP-MS is a strong plus.\nExperience in high-throughput, ISO/IEC 17025 accredited, and or FDA/EPA/USDA labs is a strong plus.\n\nJob Type: Full-time\n\n\nPay: $19.00 - $22.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nParental leave\nProfessional development assistance\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\n\nSupplemental Pay:\n\n\nBonus pay\n\nCOVID-19 considerations:\nAll employees and visitors must wear a mask.\n\n\nApplication Question(s):\n\n\nAre you currently a Colorado resident? Unfortunately, we need to fill this position quickly and residency is needed per state regulations.\nWhat analytical instrumentation do you have experience with (please also include what the instrument tests for)?\nDo you have any HPLC or LC-MS experience? If so, please elaborate.\nPlease list all the times you are available between 8am - 5pm Mondays - Fridays for a 15-30 minute phone interview in the next two weeks.\n\nExperience:\n\n\nFULL-TIME laboratory testing experience outside of college: 1 year (Required)\n\nWork Location: One location\n","slug":"chemistry-analyst-35711a47-b689-4280-b416-8c87d1b30754","benefits":["Dental insurance","Health insurance","Professional development assistance","Paid time off","Parental leave"],"selectedSkills":["Microsoft Excel","Windows","High-performance liquid chromatography","Laboratory experience","Communication skills","Bachelor of Science","Bachelor's degree","Master's degree","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=5A0aSftcRFLU7l5iQ43_bbgu9nMLyUtwvdxLNPzoEyuq0lZHJ7nP0g"},{"position":"Quality and Process Improvement Specialist","labName":"GH Group","location":"Adelanto, CA","age":"47 minutes ago","type":"Full-time","salaryMin":"$70,000 ","salaryMax":" $74,000 a year","jobDescriptionCopy":"PLUS Products has an immediate opportunity available for an experienced Quality and Process Improvement Specialist at its Adelanto facility.\n\n\nResponsibilities:\n\n\nSupport the coordination and implementation the Quality Management system (SQF, ISO, etc.) that includes quality manual, document controls, non-conforming product control, product identification, new product planning, customer complaints analysis, etc.\nPerform the activities of the SQF practitioner when the designated SQF practitioner is not available (SQF Practitioner backup)\nPerform qualitative analysis of product quality at all stages of production.\nPerform quantitative chemical analysis of raw materials and finished products using HPLC.\nTroubleshoot production processes and laboratory equipment.\nAnalyze test results and notify the Quality Manager of results that are out of specification.\nUnderstand and follow safety rules, standards, practices, and policies.\nReceive instruction from management and follow operating procedures.\nFollow GMP guidelines and processes as established in department SOPs.\nMaintain a clean, safe and organized work environment.\nCollaborate with the Product Development & R&D teams for the implementation of new product or processes.\nResponsible for supervising, coordinating, coaching, and training lab technicians on their responsibilities such as but not limited to: correct use of lab equipment, quality audits, product analysis, etc.\nAnalyzing abnormal quality results to find the root of the irregularity and coordinating efforts to implement countermeasures.\nAssures consistent quality of production by developing and enforcing good manufacturing practices (GMP) systems and adhesion to quality management procedures.\nReport discovered defects to all relevant departments for correction.\nWrite and review testing plans.\nControl inventory of oil following all procedures (Metrc, etc.)\nAssess whether employees need training to prevent mistakes during production.\nSupport manager to define, implement, and improve a plant audit program, food safety management reviews and daily/monthly metrics tracking and necessary corrective and preventative actions.\nResponsible for ensuring product and regulatory requirements are met.\nExecute process improvement solutions to business problems, using data analysis, and optimization tools to support strategic process improvement plans.\nLead Kaizen projects based on the priorities defined by Manager\nParticipate in weekly meetings- where objectives & performance goals are presented and approved.\nBuild relationships with associates to identify savings opportunities, development of cost-effective solutions, and follow through implementation.\nWorks with all areas to develop standard operating procedures, documenting workflow and process steps.\nDefine, implement and provide induction training for all new employees when requested\nDefine and implement training matrix for all associates.\nIdentify training needs and include in training matrix\nDevelops tools and methods to track and report relevant key performance indicators (KPI’s).\nAssisting in defining and implementing a cleaning program for all the plant\nCover production leads when needed.\nPerform System simulation for new/changes in system (Odoo)\nPerforms other related duties as assigned by Quality Manager\nEnsure that all improvements are included in the SOPs and SOPs reflect best practices and reflect what is happening in the shop floor otherwise needs to be reported to management.\n\nQualifications:\n\n\nBachelor’s degree Minimum BS in Chemistry, Or related Science\nHACCP Certification\nKnowledge of Lean Manufacturing practices\nLaboratory experience\nExperience in a QA/QC environment\nExperience with food safety in a manufacturing environment\nExperience with SQF\nExperience with ingredient/supplier qualification\nExperience with microbiology\nFamiliarity with operation and maintenance of HPLCs\nStrong analytical, problem solving, and mathematics skills\nAbility to solve problems\nAbility to multi-task and meet tight deadlines\nAbility to communicate with all levels of the organization effectively\nAbility to define priorities on own initiative\nAbility to work in a team environment\nSix sigma green belt preferred\nComputer skills; Intermediate to advanced Excel required; Odoo is a plus\nBi-lingual (English & Spanish)\n\nPLUS Products provides equal employment opportunities to all individuals regardless of their race, colour, creed, religion, gender, age, sexual orientation, national origin, disability, veteran status, or any other characteristic protected by state, federal, or local law.\n\n\nJob Type: Full-time\n\n\nPay: $70,000.00 - $74,000.00 per year\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\nMonday to Friday\nWeekend availability\n\nApplication Question(s):\n\n\nAre you HACCP Certified?\nPlease describe your experience working in a Lean Manufacturing environment.\n\nEducation:\n\n\nBachelor's (Required)\n\nWork Location: One location\n","slug":"quality-and-process-improvement-specialist-029372ee-7395-4eb9-8bfc-43741e663624","benefits":["Dental insurance","Health insurance","401(k)","Paid time off","Vision insurance"],"selectedSkills":["Manufacturing","QA/QC","Microsoft Excel","Lean manufacturing","Laboratory experience","Bachelor of Science","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=G7Mv9ml3JPEYs7G_huN2GP3vGRQvBn7Iwn4NrPmN_ZxthM7NmQp50w"},{"position":"Lab Technician (Weekend) Part hour-Full time pay","labName":"Coral Reef Labs","location":"Jonestown, PA","age":"6 days ago","type":"Full-time","salaryMin":"$20 ","salaryMax":" $25 an hour","jobDescriptionCopy":"Job Description\n\n\nA rapidly-growing compliance testing laboratory in Jonestown, PA is seeking a well-organized, detail-oriented Laboratory Technologist to join our lab team. The position is for the day shift on Friday, Saturday, and Sunday. You will work ~30 hours and be paid for 40.\n\n\nYou will be part of an exciting new industry helping to keep cannabis safe. There is excellent growth potential for anyone wanting to work hard and grow with us!\n\n\nPosition: The Molecular/Microbiologist will primarily be responsible for preparing, running, troubleshooting, and analyzing cannabis samples, utilizing standardized and in-house lab methodologies.\n\n\nDuties include:\n\n\n1) Sample preparation for Potency, Pesticides, Terpenes, Heavy Metals, Residual Solvents, etc\n\n\n2) Weighing and recording sample weights.\n\n\n3) Maintain ISO 17025 standards of performance.\n\n\n4) Works independently with little guidance as well as provide support and training for others in a team environment.\n\n\n5) Ensure test equipment is clean, maintained and in good working order.\n\n\n6) Maintain a safe, clean and sanitary work area.\n\n\n7) Ensure high quality standards are met through performing calibrations, quality checks, and proficiency programs\n\n\n8) Maintain an accurate notebook and logbook.\n\n\n9) Strictly follow all safety procedures and documents\n\n\nQualifications:\n\n\n· · 2 years lab experience (Cannabis knowledge/ lab experienced preferred).\n\n\n· · Experience with data analysis and LIMS.\n\n\n· · Excellent analytical skills and attention to detail.\n\n\n· · Proficiency with Microsoft Word, Excel and Outlook.\n\n\n· · Specific training for ISO 17025 Standard.\n\n\n· · Hands-on experience with instrument maintenance and trouble-shooting.\n\n\n· · Experience importing, validating, and exporting electronic data in a variety of formats.\n\n\n· · Proven organizational and problem-solving skills.\n\n\n· · Ability to stand for long periods.\n\n\nTo apply: Send resume and cover letter in PDF format with salary expectations. Please do not call regarding this position.\n\n\nWhat we offer\n\n\n· Medical, dental, vision, and life insurance\n\n\n· Paid holidays/vacation\n\n\n· Opportunities for growth\n\n\n· Work in a fun and fast-growing industry! We are looking for candidates to start ASAP!\n\n\nJob Type: Full-time\n\n\nPay: $17.00 - $25.00 per hour\n\n\nJob Type: Full-time\n\n\nPay: $20.00 - $25.00 per hour\n\n\nBenefits:\n\n\n401(k)\nHealth insurance\n\nSchedule:\n\n\n12 hour shift\nWeekend availability\n\nSupplemental Pay:\n\n\nBonus pay\n\nWork Location: One location\n","slug":"lab-technician-weekend-part-hourfull-time-pay-36c9c69c-40ae-4e43-902f-6cd256005c6c","benefits":["Dental insurance","Health insurance","401(k)","Vision insurance","Life insurance"],"selectedSkills":["Analysis skills","Microsoft Excel","Microsoft Outlook","Laboratory information management systems","Laboratory experience"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=kE1xAXUgCa_-MN0aAt1IFo9RPv6GQg50a7vMd1ggnOOztbZrY-fnqg"},{"position":"Analytical Chemist","labName":"Advanced Analytical Testing Labs","location":"Santa Rosa, CA","age":"8 days ago","type":"Full-time","salaryMin":"$25 ","salaryMax":" $35 an hour","jobDescriptionCopy":"Job Description\n\n\nA rapidly-growing ISO accredited laboratory in the Santa Rosa, Sonoma County, is seeking a well-organized, detail-oriented and energetic Analytical Chemist to join our awesome lab team. You will be part of an exciting new industry helping to keep cannabis safe. There is excellent growth potential for anyone wanting to work hard and grow with us!\n\n\nPosition: The Analytical Chemist will primarily be responsible for preparing cannabis samples (flowers, edibles etc) running, troubleshooting and analyzing cannabis samples with a GC, HPLC and/or ICP system utilizing standardized and in-house lab methodology; and performing basic and complex laboratory operations.\n\n\nDuties include:\n\n\n· Sample preparation for Potency, Pesticides, Terpenes, Heavy Metals, Residual Solvents, etc\n\n\n· Set up, run and troubleshoot GC/MS, GC-MS/MS, LC/MS/MS and ICP-MS systems.\n\n\n· Maintain validated ISO 17025 standards of performance for analytical chemical testing.\n\n\n· Demonstrate leadership ability and excellent interpersonal skills. Formulate and clearly communicates ideas, both verbally and in writing.\n\n\n· Works independently with little guidance as well as provide support and training for others in a team environment.\n\n\n· Develop procedures for documenting results from data collected.\n\n\n· Ensure test equipment is clean, maintained and in good working order.\n\n\n· Maintain a safe, clean and sanitary work area.\n\n\n· Ensure high quality standards are met through performing calibrations, quality checks, and proficiency programs\n\n\n· Maintain an accurate notebook and logbook.\n\n\n· Strictly follow all safety procedures and documents.\n\n\nQualifications:\n\n\n· · Bachelors/Master of Science Degree.\n\n\n· · 2-4 years analytical lab experience (Cannabis knowledge/ lab experienced preferred).\n\n\n· · Experience with data analysis and LIMS.\n\n\n· · Excellent analytical skills and attention to detail.\n\n\n· · Proficiency with Microsoft Word, Excel and Outlook.\n\n\n· · Specific training for ISO 17025 Standard.\n\n\n· · Experience/knowledge with the analytical instrumentation: HPLC, GCMS, LC-MS/MS, GC-MS/MS, ICPMS.\n\n\n· · Experience with method development and optimization.\n\n\n· · Hands-on experience with instrument maintenance and trouble-shooting.\n\n\n· · Experience importing, validating and exporting electronic data in a variety of formats.\n\n\n· · Proven organizational and problem-solving skills.\n\n\n· · Ability to stand for long periods.\n\n\n· Experience ordering supplies and monitoring consumable inventory.\n\n\nTo apply: Send resume and cover letter in PDF format with salary expectations. Please do not call regarding this position.\n\n\nWhat we offer\n\n\n· Medical, dental, vision, and life insurance\n\n\n· Opportunities for growth\n\n\n· Work in a fun and fast-growing industry!\n\n\nLocation: Santa Rosa, Sonoma County, Ca\n\n\nJob Type: Full-time\n\n\nJob Type: Full-time\n\n\nPay: $25.00 - $35.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nMonday to Friday\nNight shift\nWeekend availability\n\nAbility to commute/relocate:\n\n\nSanta Rosa, CA 95404: Reliably commute or planning to relocate before starting work (Preferred)\n\nEducation:\n\n\nBachelor's (Preferred)\n\nWork Location: One location\n","slug":"analytical-chemist-e1cadf3b-c9bf-4a8f-a856-4b8a1f353c20","benefits":["Dental insurance","Health insurance","Vision insurance","Life insurance"],"selectedSkills":["Analysis skills","Microsoft Excel","High-performance liquid chromatography","Microsoft Outlook","Laboratory information management systems","Master of Science","Bachelor's degree","Master's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=lIfghy5QAHYmK194DmzI2YLj5QdUAIHah9wm6uSI_PlRnFjYapmLvA"},{"position":"Courier and Accessioning Technician","labName":"Rm3 Labs","location":"Broomfield, CO","age":"8 days ago","type":"Full-time","salaryMin":"$17 an hour","jobDescriptionCopy":"Company Description\n\n\nSince our founding in 2009, Rm3 Labs has been a leader in providing scientific analysis for the cannabis community of Colorado. As a fully independent, analytical laboratory located in Broomfield, we bring state-of-the-art scientific expertise and technology to help our clients produce safe, pure, and effective cannabis products. We are ISO/IEC 17025 accredited and licensed and certified by the State.\n\n\nJob Summary\n\n\nWe are looking for a full-time Courier and Accessioning Technician to plan routes, pick up samples from client facilities in the Denver metro area, Fort Collins/Boulder, and/or Colorado Springs/Pueblo, accession samples in-house, and provide excellent customer service.\n\n\nThis position will require driving in a personal vehicle (58 cents per mile mileage reimbursement paid when using personal vehicle) or the company car, if available. It is estimated that a personal vehicle will need to be used for 150 - 200 miles per week. After courier routes, the rest of the workday will be spent in the lab accessioning samples into our system.\n\n\nThe schedule for this position is Mondays through Fridays from 8:30am - 5pm, unless assigned the south route, in which case the scheduled hours will be from 5:30am - 2pm.\n\n\nBenefits include three weeks of paid time off, six paid holidays, maternity/paternity leave, subsidized healthcare and dental insurance, holiday bonus based on performance, and professional development assistance.\n\n\nResponsibilities\n\n\nComply with State, Local, OSHA, and ISO 17025 requirements.\nFollow company Standard Operating Procedures (SOPs).\nMaintain Rm3 Labs’ brand essence when communicating with clients and lab visitors by demonstrating professional, courteous, and cooperative behavior.\nMaintain general knowledge on Rm3 Labs’ services, Metrc, and current testing and sampling rules.\nOperate the front desk reception area and greet and check-in visitors.\nReceive samples from client facilities or from clients in the lobby and accession samples into our system.\nCheck samples for accuracy, tampering and/or possible adulteration and ensure all pertinent information is documented.\nLabel samples with the internal Rm3 Labs ID and test analyses required and deliver samples to the appropriate department inbox.\nAnswer phones and contact clients to correct issues with samples or manifests.\nSchedule sample pick-ups and provide courier information to clients.\nPlan and follow the most efficient routes for picking up samples and drive safely to client facilities to pick up samples.\nAssist with training new or junior staff; may act an as onboarding buddy to new staff.\nPerform other tasks, as assigned by the Accessioning Lead or Client Services Lead.\nReport concerns to the Accessioning Lead or Client Service Lead.\n\nRequirements\n\n\nMust pass an extensive background check with no felony convictions and obtain a Colorado Department of Revenue – Marijuana Enforcement Division (DOR-MED) employee license prior to or at the time of hire.\nExcellent driving record and a reliable vehicle.\nExperience in customer service, data entry, and/or similar high-volume, detailed work.\nAble to work independently and part of a team in a fast-paced environment.\nAble to interact professionally with colleagues and bring up concerns immediately when you are faced with them.\nGood written and verbal communication skills.\nDetail and accuracy oriented.\n\nThe Ideal Candidate\n\n\nEnjoys driving.\nThrives in a fast-paced, professional, and fun work environment.\nIs self-motivated and focused on continual improvement.\nHas a passion for the cannabis industry.\nCannabis industry experience and/or METRC experience is a strong plus.\nHaving a current MED employee badge is a strong plus.\nComputer skills and experience in Windows and Microsoft Office is a plus.\n\nJob Type: Full-time\n\n\nPay: $17.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid sick time\nPaid time off\nParental leave\n\nSchedule:\n\n\nDay shift\nMonday to Friday\n\nSupplemental Pay:\n\n\nPerformance bonus\n\nTrucking Driver Type:\n\n\nCompany driver\n\nTrucking Route:\n\n\nLocal\nRegional\n\nCOVID-19 considerations:\nWe require employees and visitors to wear masks.\n\n\nApplication Question(s):\n\n\nAre you a Colorado resident? Unfortunately, we can only consider Colorado residents at this time.\nAre you comfortable driving your own vehicle with a 58 cent per mile mileage reimbursement for about 150 - 200 miles per week?\nDo you already have a MED badge?\nPlease list all the times you are available for a 15-30 min phone interview over the next two weeks.\n\nLicense/Certification:\n\n\nDriver's License (Required)\n\nWork Location: One location\n","slug":"courier-and-accessioning-technician-45160c8e-2213-4852-a09b-918e57fb1fe2","benefits":["Dental insurance","Health insurance","Mileage reimbursement","Paid time off","Professional development assistance"],"selectedSkills":["Customer service","Driver's License","Computer skills","Communication skills","Data entry","Background check","Reliable transportation"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=5YAtlJRNNrDHsL5YJorP0KhSJaxy8bb6jizZpMvC73Y6-0BMrvW4jQ"},{"position":"Laboratory Supervisor","labName":"Viridis North LLC","location":"Bay City, MI","age":"3 days ago","type":"Full-time","salaryMin":"$70,000 a year","jobDescriptionCopy":"LOCATION: Bay City, MI\n\n\nREPORTS TO: Laboratory Director\n\n\nThe mission of Viridis North is to ensure health and safety within the cannabis industry by testing cannabis products for potency and purity; and to report results of this testing to consumers, manufacturers and regulatory agencies. As a growing company, we are looking for a full-time Laboratory Supervisor our facility located in the Bay City, Michigan area. Michigan is a medical-marijuana state. Hours will be Monday through Friday, 8am-4pm, with occasional weekend work.\n\n\nESSENTIAL DUTIES AND RESPONSIBILITIES:\n\n\nAssists the Laboratory Director with maintaining sample throughput and laboratory workflow.\nAssist the Laboratory Director and Chief Science Officer with maintaining analytical and regulatory requirements for State of Michigan-required cannabis testing on various instrument platforms.\nAssist and direct scientists and technicians with daily workflow.\nInteract with Field Team management to maintain sample volume and customer expectations\nDelegation of daily operational tasks to staff as appropriate.\nPreparation and analysis of samples as needed.\nProduction of reagents, mobile phases, calibrators, and controls as needed\nOperation and troubleshooting of instruments as needed\nData review and reporting\nTracking of sample progress through the workflow, ensuring result completion in a timely fashion\nRelaying operational issues and staff needs to laboratory director\nCustomer contact and outreach as needed, including monitoring of results and accepting inquiries\nInterface with METRC as needed\nAssist Lab Director with maintaining QA/QC documentation for accreditation.\nInteract with IT staff as needed on LIS, METRC or result reporting issues.\nTraining of new staff on sample preparation, instrument operation and review of data.\nInteracting with laboratory management and advising on laboratory needs and issues.\nAdherence to all security procedures for ensuring confidentiality of client information.\nAdherence to all established guidelines outlined in Viridis’ Playbook.\nAssists with staff hiring, performance reviews and disciplinary actions.\nWorks in a leadership role with laboratory staff to ensure a positive work environment.\nOther duties as assigned by management.\n\nEDUCATION AND EXPERIENCE\n\n\nBS degree in a laboratory science or equivalent relevant field\n\nKNOWLEDGE, SKILLS, AND ABILITIES\n\n\nWorking knowledge of chromatography/mass spectrometry\nWorking knowledge of microbiology and testing instrumentation\nMethod Development experience in chemistry, toxicology or microbiology\nAbility to troubleshoot laboratory instrumentation\nLeadership and personal skills and abilities to deal with diverse individuals and personality types\n\nPHYSICAL DEMANDS AND WORK ENVIRONMENT\n\n\nThe physical demands described here are representative of those that must be met by an employee to perform the essential functions of this position successfully. Reasonable accommodations may be made to enable individuals with disabilities to perform the functions.\n\n\nThe employee must occasionally lift and/or move up to 25 pounds.\nSpecific vision abilities required by this position include close vision, distance vision, color vision, peripheral vision, and the ability to adjust focus.\nThe noise level in the work environment is usually moderate.\nClimate-controlled office and testing laboratory environment\nMay be potential exposure to toxic or hazardous materials\nDomestic travel may be required on occasion.\n\nCOMPENSATION AND BENEFITS PACAKGE:\n\n\nSalary negotiable and commensurate with education and experience. This position is eligible for a matching 401K program and health care benefits. Applicant screening will include a background check and drug screening. The applicant shall not have a conflict of interest within the industry.\n\n\nPlease have a list of references available for the interview process.\n\n\n\\*Per MRA guidelines, candidates must be 21+ years of age to be eligible for employment\\*\n\n\nJob Type: Full-time\n\n\nPay: $70,000.00 per year\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nMonday to Friday\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nLaboratory Experience: 2 years (Preferred)\n\nWork Location: One location\n","slug":"laboratory-supervisor-ceec25ec-3398-4ec4-98d0-8913f365cbd7","benefits":["Dental insurance","Health insurance","401(k) matching","Paid time off","401(k)"],"selectedSkills":["Laboratory experience","Microbiology","Toxicology","Bachelor of Science","Bachelor's degree","Pass drug screening","21 years or older","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=BkjZgfbV-MznRH7sfIRTiTB4bFqyVhn9UNZvf1uNP_b4FMvhuMONdg"},{"position":"Accounting Clerk","labName":"Kaycha Labs","location":"Fort Lauderdale, FL","age":"3 days ago","type":"Full-time","jobDescriptionCopy":"Company Overview:\n\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\n\nEssential Duties & Responsibilities:\n\n\nEnter A/P invoices\nMatch supporting documentation to Credit Card transactions\nFiling\nMail payments\nOther duties as assigned to support Accounting Manager\n\nEducation & Experience:\n\n\nBachelor’s degree in accounting, finance or general business administration preferred.\nSage X3 Experience (2-3 years, preferred)\n\nSkills, Abilities and Competencies:\n\n\nExcellent verbal and written communication skills.\nTeam-oriented individual with strong attention to detail\nSolid organization skills, such as multitasking and effective time-management\nMulti-tasker who can prioritize tasks to achieve time-sensitive deadlines\n\nOther:\n\n\nMust pass Level 2 background check.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.f.\n\nEssential Functions:\n\n\nThe physical demands described here are representative of those that an employee must meet to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nWhile performing the duties of this job the employee is frequently required to stand, handle or feel, to speak, and to hear. The employee is occasionally required to walk, sit, reach with hands and arms, bend, kneel, crouch, or crawl. The employee must frequently lift and/or move up to thirty-five (35) pounds.\n\n\nSpecific vision abilities required for this job include close (proximity) vision, depth perception, and the ability to adjust focus.\n\n\nWork Environment:\n\n\nThe work environment described here is representative of that which an employee may encounter while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nThe standard analytical laboratory environment is one in which potential health hazards do exist. Administrative, operations, technical, and professional staff are expected to safely operate in accordance with applicable and appropriate health and safety policies and procedures, as prescribed by the applicable Kaycha manuals and policies and/or federal, state, or local standards.\n\n\nLaboratory staff can be expected to work in areas where hazards associated are with, but not limited to, airborne pathogens. Biological materials, hazardous substances, and radioactive material exist and are handled. Appropriate training is provided regarding these hazards and staff are expected to adhere to all health and safety policies at all times, whether they are in writing or verbalized by a supervisor.\n\n\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.\n\n\nThe above is intended to describe the general content of and requirements for the performance of this job. It is not to be construed as an exhaustive statement of duties, responsibilities, or physical requirements. Nothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions\n\n\nJob Type: Full-time\n\n\nPay: From $16.00 per hour\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nDisability insurance\nEmployee assistance program\nFlexible spending account\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nPhysical Setting:\n\n\nOffice\n\nSchedule:\n\n\n8 hour shift\nDay shift\nMonday to Friday\nOvertime\n\nApplication Question(s):\n\n\nBest email and phone number to reach you at?\nDesired compensation?\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nSage X3: 2 years (Preferred)\nAccounts payable: 2 years (Preferred)\n\nWork Location: One location\n","slug":"accounting-clerk-e5deaa7d-12da-4794-bbe7-17d0897b33d6","benefits":["Dental insurance","Health insurance","401(k)","Flexible spending account","Employee assistance program"],"selectedSkills":["Sage","Accounts payable","Communication skills","Time management","Bachelor's degree","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=qccvoHXLxJdn4eu140rMH-wRHxjwx8Uwhhg_Z79k7qR3vu4EwjH7LA"}]