[{"position":"Laboratory Technician I","labName":"Montrose Environmental Group, Inc.","location":"Richmond, VA","age":"6 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:Competitive compensation packages\n\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Richmond, VA facility is currently seeking a Full-Time Technician I (Toxicology).\n\nA Toxicology Laboratory Technician I is responsible for conducting aerosol exposure studies and analyzing data collected. The ideal candidate will have experience in working under possibly hazardous conditions (e.g. pathogens or chemicals). He/She will be well-trained to maintain safety conditions and will be passionate for doing work that makes things move forward.\n\nHelp conduct aerosol exposure studies for determining potential mutagenic, genotoxic and cytotoxic activity of complex mixtures or experimental test articles from various sources.\nAnalyze data collected in real time data and assess experimental progress\nFollow study protocols and methods based on published scientific articles and technical reports.\nWork with and without supervision to setup up instruments used in aerosol exposure studies and document experimental setups and results.\nOperate, maintain and troubleshoot laboratory equipment and instruments\nConduct laboratory day-to-day duties, such as preparation of laboratory materials and solutions as well as housekeeping and ordering responsibilities\nAssist in data compilation, review and interpretation.\nPrepare summary of findings and observation\nWork in a GLP compliant environment\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Lab Director\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nBS degree in the sciences, engineering, or related field with laboratory experience.\nAerosol knowledge and experience is a plus.\n\nPreferred Skills:\nDetail oriented, reliable, highly motivated, and will interact well in a team environment.\nWorking knowledge of fluid/aerosol flow and pressure.\nGood organizational skills, a high energy level, a sense of commitment to assure that obligations and quality are met\nCapable of handling multiple assignments concurrently\nWorking knowledge of basic computer skills, especially MS Office.\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"laboratory-technician-i-d3320b82-a20d-449e-90ed-eace1d9ec7f8","benefits":["Disability insurance","Tuition reimbursement","401(k)","Parental leave"],"selectedSkills":["Computer skills","Laboratory experience","Computer literacy","Microsoft Office","Organizational skills","Bachelor of Science","Bachelor's degree"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-VA-Richmond-East-Parham-Rd/Laboratory-Technician-I_R2208?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Content Marketing Specialist","labName":"American Association For Laboratory Accreditation","location":"Frederick, MD","age":"4 days ago","type":"Full-time","salaryMin":"$42,000 ","salaryMax":" $60,000 a year","jobDescriptionCopy":"Description: A2LA is a non-profit, public service membership organization offering compliance and accreditation services to organizations all over the world. A2LA is dedicated to formally recognizing testing, calibration and other laboratories and related organizations for their quality and technical competency with a variety of international standards (ISO/IEC 17025, ISO 15189, etc.), federal requirements (FDA, GLP, FCC, etc.), state (cannabis, etc.), and local requirements (water testing, etc.).\nWhether it is the clean air that you breathe, the water you drink or the vehicle you drive, A2LA helps make the world a better, safer place by working to ensure that organizations are releasing products and services that are meeting testing and quality standards. Detailed information about our services can be found on our website at https://www.a2la.org/about.\nThe Role\nA2LA is seeking a results-driven and engaging professional to develop captivating content and build brand awareness by working closely with our marketing team. This is an exceptional opportunity to grow within a global non-profit organization as a Content Marketing Specialist. This position will report directly to the Marketing Manager.\nAbout You\nYou are someone who is passionate about marketing trends and thrives in a fast-paced environment. You have proven excellent communication skills and know how to manage your time effectively. You are someone who enjoys developing content strategies through print and digital marketing while working on a team. You are self-motivated especially good at turning technical information into reader-friendly stories with personality.\nResponsibilities\n\n\nManage list building, persona development, and creative messaging.\nOversee campaign execution, producing fresh content, and monitoring analytics.\nTake the lead on drafting communications materials for campaigns, contributing to blog posts, podcasts, press releases, e-letters, and social media posts.\nStay current on the latest marketing news trends through various continuing education outlets and following relevant resources.\nWrite, edit, and proof other content as needed to ensure consistency in quality, style, and brand voice across the business.\nWork closely with digital marketing and graphic design to produce assets that are SEO-friendly, visually appealing, and on-brand.\nProactively share best practices and expertise with the marketing team.\nPerform other duties as assigned.\n\n. Requirements: A2LA may provide exceptions to educational requirements for veterans who demonstrate the ability to perform the duties listed in this job posting.\nA successful candidate for these positions typically meets the following criteria:\n\n\n5+ years of proven experience with web design, graphic design, and creative/copywriting.\nBachelor’s Degree in Business, Marketing, Communications, or Journalism.\nAbility to adapt writing style to engage the target audience.\nExperience with Adobe Suite – InDesign, Illustrator, and Photoshop.\nExcellent written and oral communication skills.\nAbility to translate communication strategy to internal teams.\nCapacity to learn new platforms and tools quickly.\nStrong attention to detail and organizational skills.\nAbility to learn A2LA services.\n\nBenefits and Compensation\nThe salary for this position is commensurate with experience. In addition, A2LA offers a robust 403(b) retirement plan and benefits package including medical, dental, HSA, FSA (medical and dependent), life insurance, short- and long-term disability, employee assistance program (EAP), AFLAC, tuition reimbursement and other pre-taxed benefits, paid-time off, 10 paid government holidays, 1 floating holidays, training and development, career advancement opportunities and much more!\nWorking Environment & Physical Requirements\nThe physical demands and work environment described here reflect those of a person, in this position, will typically encounter.\n\n\nPhysical Demands: While performing the duties of this job, the employee is required to walk; sit for long hours, use fingers for typing; talk and hear. Specific vision abilities required by the job include close vision for reviewing documents on the computer or in hard copy state.\nWork Environment: Work is typically performed in an office setting. Hours are flexible, but they should normally encompass at least the core hours of 9:00AM to 3:00PM, total at least forty (40) hours for each work week, and suit the needs of various training clients, where appropriate.\n\nTo perform this job successfully, an individual must be able to perform the essential duties satisfactorily. The requirements listed above are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\nA2LA is an equal opportunity employer. A2LA does not discriminate in employment based upon race, color, religion, national origin, citizenship status, ancestry, age, sex (including sexual harassment), sexual orientation, marital status, physical or mental disability, military status or unfavorable discharge from military service, or any other federally protected classification.\nMilitary/Military Spouse Personnel are encouraged to apply.\n\n\nJob Type: Full-time\n\n\nWork Location: One location\n","slug":"content-marketing-specialist-1a7f8968-4a3c-4062-a0e1-e804c186d336","benefits":["Health savings account","Dental insurance","Health insurance","Flexible spending account","403(b)"],"selectedSkills":["Adobe Photoshop","Communication skills","Organizational skills","Writing skills","Graphic design","Bachelor's degree"],"jobType":"free","applyURL":"https://recruiting.paylocity.com/recruiting/jobs/Details/1154435/American-Association-For-Laboratory-Accreditation/Content-Marketing-Specialist"},{"position":"Analyst - Metals","labName":"Montrose Environmental Group, Inc.","location":"Orange, CA","age":"5 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Orange, CA facility is currently seeking a Full-Time Analyst to join our Metals Department.\n\nAs a key member of the laboratory team, this role will be responsible for a full range of activities including:\n\nDaily monitoring of sample scheduling to ensure that samples are analyzed within EPA's and methods’ holding time\nSchedule workload in order to report data within clients expected due dates\nRoutine sample preparation and analysis according to Standard Methods 846 and EPA methods\nPerforms analyst's review of data and QC\nReviews of QA/QC criteria for batch acceptance\nAdheres to Standard Operating Procedures and follow safe work practices\nParticipates in instruments' preventative maintenance and trouble shooting\nParticipates in focus teams to improve efficiency\nBe flexible in work schedule including overtime when needed\nReact to change productively and handle other essential tasks as assigned\nPerforming other duties and responsibilities as prescribed by the Company\nCompliance with Enthalpy's Quality Assurance Program and other policies\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nBachelor's degree in Chemistry, Biology, Environmental Science, or related field\nMinimum 2-4 years of lab experience preferred\nKnowledge of analytical method, analytical instruments, general lab practices and lab safety\nExperience in ICP, ICPMS or IC is a plus\n\nPreferred Skills\n\nKnowledge of analytical method, analytical instruments, general lab practices and lab safety\nMust be flexible in work schedule (including Saturday) and able to work overtime\nWell organized and have an attention to detail\nAble to multi-task\nAbility to work independently and make sound decisions\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"analyst-metals-7bdb417e-642e-4ca8-9df2-2e665c5a9a32","benefits":["401(k)","Disability insurance","Parental leave","Tuition reimbursement"],"selectedSkills":["Laboratory experience","Bachelor's degree"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-CA-Orange/Analyst---Metals_R2204?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Marketing Manager","labName":"American Association For Laboratory Accreditation","location":"Frederick, MD","age":"4 days ago","type":"Full-time","salaryMin":"$65,000 ","salaryMax":" $87,000 a year","jobDescriptionCopy":"Description: A2LA is a non-profit, public service membership organization offering compliance and accreditation services to organizations all over the world. A2LA is dedicated to formally recognizing testing, calibration and other laboratories and related organizations for their quality and technical competency with a variety of international standards (ISO/IEC 17025, ISO 15189, etc.), federal requirements (FDA, GLP, FCC, etc.), state (cannabis, etc.), and local requirements (water testing, etc.).\nWhether it is the clean air that you breathe, the water you drink or the vehicle you drive, A2LA helps make the world a better, safer place by working to ensure that organizations are releasing products and services that are meeting testing and quality standards. Detailed information about our services can be found on our website at https://www.a2la.org/about.\nThe Role\nA2LA is seeking a strong marketing professional who is passionate about leading a dynamic team. The Marketing Manager is also responsible for planning and implementing cross-functional marketing programs, both short and long-range, targeted toward retaining existing and attracting potential customers. This person will work in tandem with the Director of Marketing & Communications to develop and deliver the strategic marketing plan. This is an exceptional opportunity to grow within a global non-profit association as a Marketing Manager.\n*\nAbout You*\nYou’re an action-oriented marketer with experience in B2B/B2C marketing and have experience growing and supporting a team. You know how to identify and define a target audience, craft creative messages, and enjoy working collaboratively to execute an effective marketing strategy. You know your way around various digital platforms, understand digital analytics and most importantly, you are a strong communicator who is especially passionate about leading a team. You can think strategically, you’re a quick learner on unfamiliar topics and are adept at brand storytelling.\nResponsibilities\n\n\nManage day-to-day activities of the team and is responsible for monitoring the performance of team members.\nMaintain an intimate understanding of traditional and emerging marketing channels.\nMotivate, communicate, guide, encourage, coach, assist, and problem solve with staff.\nAssists in the development and implementation of the strategic marketing plan.\nProvides input to the Director of Marketing and Communications (DMC) regarding the marketing budget.\nOversee SEO and marketing analytics; proposes and implement changes based on findings.\nPlans and implements advertising and promotion activities including print, online, digital media, and direct mail.\nReviews and evaluates market research and adjusts marketing strategy to meet changing market and competitive conditions.\nEstablishes and maintains relationships with industry influencers and key strategic partners.\nPrepares marketing activity reports and presents information to the DMC.\nEnsures consistent branding throughout all promotional materials, social media usage, training and accreditation services, and other events.\nRepresent the marketing team in cross-functional groups.\nCoordinates A2LA’s social media & manages the website.\nOther duties, assignments, and projects as assigned.\n\n. Requirements:\n\n\n5-7 years’ work experience in B2B/B2C marketing, communications, or business development.\n3 to 5 years of experience managing teams of three or more.\nBachelor’s Degree in Business, Marketing, Communications, or Journalism.\nSuperb writing moxie; experience developing engaging content.\nDemonstrated experience managing social media campaigns and online communities.\nFamiliar with Google Analytics and social media analytics.\nAbility to translate communications strategy to internal teams.\nExperience with CRMs (preferably Pardot, Salesforce), familiar with Adobe Suite InDesign, Illustrator, Photoshop.\nOutstanding attention to detail and organizational skills.\nYou are optimistic, realistic, practical, and thrive in a fast-paced environment.\n\nBenefits and Compensation\nThe salary for this position is commensurate with experience. In addition, A2LA offers a robust 403(b) retirement plan and benefits package including medical, dental, HSA, FSA (medical and dependent), life insurance, short- and long-term disability, employee assistance program (EAP), AFLAC, tuition reimbursement and other pre-taxed benefits, paid-time off, 10 paid government holidays, 1 floating holidays, training and development, career advancement opportunities and much more!\nWorking Environment & Physical Requirements\nThe physical demands and work environment described here reflect those of a person, in this position, will typically encounter.\n\n\nPhysical Demands: While performing the duties of this job, the employee is required to walk; sit for long hours, use fingers for typing; talk and hear. Specific vision abilities required by the job include close vision for reviewing documents on the computer or in hard copy state.\nWork Environment: Work is typically performed in an office setting. Hours are flexible, but they should normally encompass at least the core hours of 9:00AM to 3:00PM, total at least forty (40) hours for each work week, and suit the needs of various training clients, where appropriate.\n\nTo perform this job successfully, an individual must be able to perform the essential duties satisfactorily. The requirements listed above are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\nA2LA is an equal opportunity employer. A2LA does not discriminate in employment based upon race, color, religion, national origin, citizenship status, ancestry, age, sex (including sexual harassment), sexual orientation, marital status, physical or mental disability, military status or unfavorable discharge from military service, or any other federally protected classification.\nMilitary/Military Spouse Personnel are encouraged to apply.\n\n\nJob Type: Full-time\n\n\nWork Location: One location\n","slug":"marketing-manager-031008f5-ca44-43bf-b029-0d207493ded0","benefits":["Health savings account","Dental insurance","Health insurance","Flexible spending account","403(b)"],"selectedSkills":["Growing experience","Business development","Adobe Photoshop","B2B marketing","Leadership","Bachelor's degree"],"jobType":"free","applyURL":"https://recruiting.paylocity.com/recruiting/jobs/Details/1154394/American-Association-For-Laboratory-Accreditation/Marketing-Manager"},{"position":"Technician II - GCMS","labName":"Montrose Environmental Group, Inc.","location":"Richmond, VA","age":"4 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Richmond, VA facility is currently seeking a Full-Time Laboratory Technician II in GCMS.\n\nA Laboratory Technician II is responsible for performing tasks required to meet the expectations of our clients, in addition to efficiently and profitably generating defensible data in a timely manner. The ideal candidate will have experience in working under possibly hazardous conditions (e.g. chemicals).\n\nRole and Responsibilities\n\nCleaning of sampling equipment\nPreparation of sampling equipment for prep orders\nPreparation of samples for analysis\nWeighing samples for analysis\nAssisting with loading canisters and samples for analysis\nMaintaining clean laboratory areas\nMaintaining organized records of equipment cleaning and sample prep\nOverhead projects designed to improve efficiency of, or accuracy of analyses\nAssisting the Group Leaders and analysts in acquiring and inventorying consumables and parts for instrumentation\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Lab Director\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nHigh school diploma or general education degree (GED) required, associate's or Bachelor's degree in a scientific field preferred\nTheir documentation, timeliness, and throughput must meet the standard of the laboratory.\n\nPreferred Skills\n\nPrior Laboratory experience required\nKnowledge general lab practices and lab safety\nAbility to work independently and in a team\nGood organizational skills and strong communication skills\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.\n\n#LI-MEG","slug":"technician-ii-gcms-9832b885-37ba-48b3-9e4a-18dd24a72081","benefits":["401(k)","Disability insurance","Parental leave","Tuition reimbursement"],"selectedSkills":["Laboratory experience","Communication skills","Organizational skills","Bachelor's degree","High school diploma or GED","Associate's degree"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-VA-Richmond-East-Parham-Rd/Technician-II---GCMS_R2213?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"QA Director - DOD/Environmental Laboratory","labName":"Montrose Environmental Group, Inc.","location":"El Dorado Hills, CA","age":"1 day ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur El Dorado Hills, CA Lab is currently seeking at QA Director to join our Lab Team.\n\nAs a key member of the Quality team, this role will be responsible for a full range of activities including:\n\nManaging the Quality Management System (QMS), standards compliance, and laboratory accreditations.\nDesigning and implementing improvements in human, technical, safety and quality systems to improve data quality, operational effectiveness and efficiency.\nUnderstanding and evaluating the analytical chemistry methods used by the laboratory; ensuring compliance of the laboratory’s procedures with promulgated methods and accepted validation requirements\nThe QA Manager functions independently from Laboratory Operations, having responsibility for quality assurance, independent of production deadlines and financial responsibility.\nLeading the laboratory’s QA/QC and data quality improvement activities\nManaging, maintaining, and expanding the lab’s accreditations and licenses\nImplementing and revising the QA program as needed to address deficiencies as well as opportunities for improvement\nEnsuring the laboratory’s QA Manual and SOP’s are written, organized and compliant to standards\nCompleting, evaluating, and reporting PT results; completing associated corrective actions as needed\nEnsuring documentation of personnel training, (IDOC’s) is compliant and readily available\nProviding QA/QC training for staff; identifying additional training needs and developing training materials\nProactively ensuring compliance to ethics program\nDocumenting & evaluating the validation of new analytical chemistry testing methods\nConducting internal audits and data assessments; hosting and participating in external audits\nDetecting, resolving, monitoring, and closing non-conformances and corrective actions\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nBachelor's degree in Chemistry, Biology or related sciences\nMinimum 5 years prior experience in an environmental testing laboratory\nExperience the with Department of Defense Quality Systems Manual (DoD QSM) requirements preferred\nDemonstrated knowledge of environmental testing regulations and requirements, including TNI/NELAP/ISO-17025, DoD/DoE QSM, SDWA, CWA, RCRA\n\nPreferred Skills\n\nWorking knowledge of laboratory procedures, data interpretation and evaluation of data usability\nAbility to collaborate with lab team members to gather, interpret and consolidate data, review data and information for presentation and review\nEffective written and oral communication\nDetail oriented\nEffective time management\nGood knowledge of word processing, spreadsheets, table and graph generation and use of applicable computer software\nDemonstrated editorial and proofreading skills\nGood problem solving and troubleshooting abilities\nEffective leadership and personnel management\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"qa-director-dodenvironmental-laboratory-9f063155-f823-4e6f-a632-3aafa597bd84","benefits":["Disability insurance","Tuition reimbursement","401(k)","Parental leave"],"selectedSkills":["Word processing","Laboratory procedures","Quality systems","Software troubleshooting","Laboratory experience","Bachelor's degree"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-CA-El-Dorado-Hills/QA-Director---DOD-Environmental-Laboratory_R2236?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Environmental Analyst II - Volatile","labName":"Montrose Environmental Group, Inc.","location":"Richmond, VA","age":"6 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nWe are currently seeking a full-time Volatile Analyst II in our Richmond, VA lab. The Analyst will have shown that they have developed a skill set for some assays that makes them a resource for an entire lab or at least a group of assays. He/She/They will be able to handle the most challenging and most non-routine samples. He/She/They will be able to increase the technical ability of the lab to handle certain assays and have the ability to do significant method development and have well above average troubleshooting skills.\n\nAs a key member of the laboratory team, this role will be responsible for a full range of activities including:\n\nQuantitative sample analysis\nMethod development and troubleshooting\nPreparation of data summaries for inclusion in client reports\nInstrument calibration, validation, and method development\nInstrument maintenance and troubleshooting\nMaintaining organized records of sample preparation and analysis, equipment maintenance and data collected off site\nMaintain consumables and parts for instruments\nOverhead projects designed to improve efficiency of, or accuracy of analyses\nCommunicating relevant updates to applicable people in a timely manner\nPerforming other duties and responsibilities as prescribed by the Company\nCompliance with Enthalpy’s Quality Assurance Program and other policies\nCompliance with Company’s Health and Safety Plan\nOther duties as assigned\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nBachelor’s degree or higher in Chemistry, Biology, or equivalent\nMinimum of 5 years relevant laboratory experience required\nMust have familiarity for the assays performed within laboratory\nThey must be able to handle some non-routine samples or situations\nThey must be able to work with only minimal instruction from their supervisor\nWithout supervision, they must be able to routinely meet QA/QC requirements for the assays they perform\nTheir documentation, timeliness, and throughput must meet the standard of the laboratory\nThey must possess in-depth knowledge and experience on the operation of the instrument or the chemistry involved in the assays they perform\nExceptional troubleshooting skills\n\nPreferred Skills\n\nSuperior knowledge of analytical method, analytical instruments, general lab practices and lab safety\nStrong scientific writing and presentation skills\nAnalytical thinking to solve technical problems\nStrong Research and Development skills\nEffective communication skills\nSuperior time management skills\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"environmental-analyst-ii-volatile-9a6227a6-82f6-4c38-9012-c0a183713dad","benefits":["Disability insurance","Tuition reimbursement","401(k)","Parental leave"],"selectedSkills":["Writing skills","Research","Laboratory experience","Assays","Communication skills","Bachelor's degree"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-VA-Richmond-Reymet-Rd/Environmental-Analyst-II---Volatile_R2209?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"UNIV - Program Assistant - Psychiatry: Addiction Sciences Division","labName":"Medical University of South Carolina","location":"Charleston, SC","age":"6 days ago","type":"Full-time","jobDescriptionCopy":"Job no: 545822\nEntity: MUSC University\nDepartment: COLLEGE OF MEDICINE - COM-Psychiatry\nSub Department: UNIV-2262600-Addiction Sciences Division\nWork type: Full-Time\nEmployee Type: UNIV - Research Grant\nLocation: Charleston, SC\nCategories: Research\nPay scale: UNIV-Band 4: $29,061.00 - $41,415.00 - $53,769.00 (min - mid - max)\n\nFLSA: Hourly\n\nWork Schedule: M-F, 8:00AM - 4:30PM\n\nJob Summary: The Department of Psychiatry and Behavioral Sciences is seeking a Program Assistant for the Addiction Sciences Division. The candidate will work on a group of research studies within MUSC’s Youth Collaborative that focus on evaluating treatments for youth alcohol and cannabis use disorder. The candidate will assist the Principal Investigators (Drs. Kevin Gray and Lindsay Squeglia) in the recruitment of research participants, the collection of psychological and biological research data, data entry, and organizational tasks. Primary duties include the coordination of a study testing cannabidiol (CBD) as a possible medication to treat alcohol use disorder. The candidate will be directly involved in the collection of questionnaire, interview, laboratory, and other research data related to ongoing and future research studies. After-hours and weekend work are required. Travel around the local Charleston area may also be required.\n\nPayscale Salary Range: UNIV-Band 4: $28,216.00 - $40,210.00 - $52,204.00 (min - mid - max)\n\nJob Duties:\n25% - The Program Assistant will coordinate and assist with tracking of all research participants, which includes recruitment, screening, and scheduling of research participants. Manage scheduling of medical personnel for research study visits when necessary. Participate in weekly research team meetings. - (Essential)\n25% - Conduct study visits, including performing diagnostic interviews consisting of structured clinical interviews and other related instruments. Document participant assessment data in research records. Study visits after regular work hours (evenings, weekends, lesser holidays) may be required to accommodate participants’ schedules for visit completion and/or recruitment activities. - (Essential)\n10% - Assists with functional and structural magnetic resonance imaging sessions and data transfer. - (Essential)\n10% - Enter data into a computerized database and manage ongoing organization of patient data files. - (Essential)\n10% - Initiate and maintain accurate and comprehensive documentation as required by FDA, Institutional Review Board, study sponsors, and Good Clinical Practice Guidelines in connection with research trials. - (Essential)\n10% - Collection and testing of biological samples (urine, blood, saliva, breathalyzer). - (Essential)\n5% - Scrutinize on an ongoing basis the effectiveness of study procedures and suggest changes in procedures when indicated. - (Essential)\n5% - Maintain research supplies and monitor and arrange for periodic calibration of laboratory equipment. - (Essential)\n\nMinimum Experience and Training Requirements: A high school diploma and two years relevant program experience. A bachelor's degree may be substituted for the required program experience.\n\nPreferred Experience & Additional Skills: A bachelor’s degree in psychology, premed, neuroscience, biology, nursing, or other life sciences or health care field is preferred. Prior research experience in a lab, knowledge of REDCap data entry, management, reporting tools, interviewing research participants, conducting structured clinical interviews, neuropsychological tests and collecting biospecimens not required but valued. Commitment to diversity, equity, and inclusion. Experience working with adolescents and emerging young adults (ages 13-25). Excellent verbal communication and problem-solving skills. Attention to detail and the ability to work independently and assure accuracy. The ability to collect, organize, and analyze information in a clear and concise manner. Must be able to work evenings and weekends, as these are the times young adults are typically available to participate in the studies.\n\nPhysical Requirements: Ability to perform job functions in an upright position. (Frequent) Ability to perform job functions in a seated position. (Frequent) Ability to perform job functions while walking/mobile. (Frequent) Ability to work indoors. (Continuous) Ability to work outdoors in all weather and temperature extremes. (Infrequent) Ability to work in confined/cramped spaces. (Infrequent) Ability to perform job functions from kneeling positions. (Infrequent) Ability to squat and perform job functions. (Infrequent) Ability to perform 'pinching' operations. (Infrequent) Ability to fully use both hands/arms. (Continuous) Ability to perform repetitive motions with hands/wrists/elbows and shoulders. (Frequent) Ability to reach in all directions. (Frequent) Possess good finger dexterity. (Continuous) Ability to maintain tactile sensory functions. (Continuous) Ability to lift and carry 15 lbs., unassisted. (Infrequent) Ability to lift objects, up to 15 lbs., from floor level to height of 36 inches, unassisted. (Infrequent) Ability to lower objects, up to 15 lbs., from height of 36 inches to floor level, unassisted. (Infrequent) Ability to push/pull objects, up to 15 lbs., unassisted. (Infrequent) Ability to maintain 20/20 vision, corrected. (Continuous) Ability to see and recognize objects close at hand. (Frequent) Ability to see and recognize objects at a distance. (Frequent) Ability to determine distance/relationship between objects; depth perception. (Frequent) Good peripheral vision capabilities. (Continuous) Ability to maintain hearing acuity, with correction. (Continuous) Ability to hear and/or understand whispered conversations at a distance of 3 feet. (Frequent) Ability to perform gross motor functions with frequent fine motor movements. (Frequent) Ability to work in dusty areas. (Infrequent)\n\nThe Medical University of South Carolina is an Equal Opportunity Employer. MUSC does not discriminate on the basis of race, color, religion or belief, age, sex, national origin, gender identity, sexual orientation, disability, protected veteran status, family or parental status, or any other status protected by state laws and/or federal regulations. All qualified applicants are encouraged to apply and will receive consideration for employment based upon applicable qualifications, merit and business need.\n\nOpening date: 20 Jun 2022 Eastern Daylight Time\nApplications close: 06 Jul 2022 11:55 PM Eastern Daylight Time","slug":"univ-program-assistant-psychiatry-addiction-sciences-division-3b1c5c43-f2f9-4e95-b2cc-9f6f9b79f654","benefits":[],"selectedSkills":["Research","Communication skills","Data entry","Bachelor's degree","High school diploma or GED"],"jobType":"free","applyURL":"https://careers.pageuppeople.com/756/cw/en-us/job/545822/univ-program-assistant-psychiatry-addiction-sciences-division?source=IND"},{"position":"Technical Director - Environmental","labName":"Montrose Environmental Group, Inc.","location":"Richmond, VA","age":"4 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, part of the larger organization, Montrose Environmental Group, is comprised of 10 laboratories performing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nThe Technical Director is the laboratory’s lead analytical and technical resource, responsible for improving procedures and implementing new technologies to meet quality standards and client requirements, reducing costs, and maximizing operating efficiencies by effectively managing and developing available technology solutions. They will also improve efficiencies by minimizing down-time and maximizing instrument through-put and assisting the Group Leaders in training staff to operate new and existing analytical equipment.\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nJob Responsibilities - This role will be responsible for a full range of activities including:\n\nPosition is the laboratory’s lead test & measurements technical resource, responsible for improving procedures and implementation of new technologies to reduce costs, and maximize operating efficiencies by effectively managing and developing available technology solutions.\nImprove efficiencies by minimizing down-time and maximizing instrument through-put and assisting the Group Leaders in training staff to operate new & existing test and measurement equipment.\nResponsible for production of all Departments by ensuring timely and profitable production of chemical measurement services\nResponsible for technical data review utilizing Laboratory Information System.\nAssist the Group Leaders in training staff to operate new and existing test and measurement equipment\nCoordinate work scheduling and laboratory resource allocation\nMeet TAT, financial, and quality objectives\nSupervise and manage adherence to QA/QC, hold time and turnaround requirements\nAssign and clearly communicating operational priorities\nAllocate lab resources to meet client schedule & requirements\nSupervise Group Leaders, supervisors, and staff\nAssist with and conducting employee performance reviews and audits\nProjecting staffing needs: hiring and firing staff\nOther duties, as assigned by Laboratory Director\n\nMinimum Qualifications\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nBA/BS in Chemistry or Science required. Master’s or PhD degree is a plus.\nEPA, 40CFR and NELAC expertise or background is a plus\nMinimum of 4 years of experience in a laboratory testing environment\nThe Technical Director must meet the requirements of the accrediting body(ies) of the laboratory\n\nPreferred Skills\n\nSuperior time management skills\nRespectful and effective communication skills – ensure positive interactions with the team to build professional relationships;\nEffective training - teach complex topics to team members of varying scientific backgrounds and ensuring their proficiency\nConflict resolution: Removes/Breakdown organizational communication or operational barriers\nAssertion Skills: Sets expectations, provides regular feedback, creates a positive work environment.\nManagement behavior shows serious thought and reliable actions; leads with integrity and honesty\nTeam player – Cooperative and collaborative, focused on the outcome of the group as a whole;\nTakes responsibility, diagnoses problems, assesses corrective action, and does not shift blame\nFlexible – able to shift priorities on short notice\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.\n\n#LI-MEG","slug":"technical-director-environmental-22037400-eb2b-487b-9adb-a13813c93580","benefits":["Disability insurance","Tuition reimbursement","401(k)","Parental leave"],"selectedSkills":["Laboratory experience","Communication skills","Time management","Doctoral degree","Bachelor of Science","Bachelor's degree","Master's degree","Doctor of Philosophy"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-VA-Richmond-Reymet-Rd/Technical-Director---Environmental_R2216?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Visiting Assistant Professor of Chemistry","labName":"State of Colorado Job Opportunities","location":"Pueblo, CO","age":"1 day ago","type":"Full-time | Temporary","salaryMin":"$47,000 ","salaryMax":" $55,000 a year","jobDescriptionCopy":"Department Information\n\nThe Chemistry Department is approved by the American Chemical Society (ACS) to offer ACS-certified degrees and stresses excellence in teaching. The faculty believe that providing opportunities for research is an integral part of an undergraduate education.\n\nThe department has excellent facilities and a wide array of instrumentation to support undergraduate and masters-level research. The Chemistry Department is a Colorado Commission of Higher Education designated Program of Excellence with a substantial array of instrumentation including FT NMR (2), GC/MS (3), GC-FID (3), AFM, LC/MS, LC/MS/MS, ICP-MS, UV-Vis, HPLC, SEM and FTIR (2). Faculty and students are active in both undergraduate and master's level research.\n\nThe goals of the program are:\n1) To prepare graduates in the discipline of chemistry to become productive members of the profession whether they go on to industry, post-graduate education or other areas;\n\n2) To prepare students in the verbal, written and quantitative skills that are prerequisite to advanced study or careers in chemistry;\n\n3) To prepare students in the theoretical principles of chemistry as well as in the laboratory approach to problem solving;\n\n4) To maintain certification of the program through the American Chemical Society (ACS);and\n\n5) To provide a variety of emphasis areas and minors including a basic chemistry degree, an ACS certified degree, a biochemistry emphasis, a chemistry/teacher certification emphasis, an environmental chemistry emphasis, chemistry minor, and a double major options.\n\nThe Chemistry department has always been committed to experiential learning via laboratory courses, undergraduate and graduate research, and internships, and has made new commitments to recruit students via our Discovery Scholars programs. The success of the Cannabis Biology and Chemistry program, coupled with the presence of the Institute for Cannabis Research on our campus, provide new and expanded opportunities for students and faculty.\n\nDescription of Job\n\nResponsibilities of this non-tenure track, nine month position (with summer teaching possibly available) include teaching 12 credit hours per semester in chemistry courses; holding at least 5 regular office hours per week for students; and fulfilling basic service duties to the program, college, university, and / or profession.\n\nThe Chemistry Department also houses the Cannabis Biology and Chemistry (CBC) degree option. Applicants with teaching and research interest and expertise with cannabinoids derived from hemp, including those with interest and expertise that overlaps with the Cannabis Biology and Chemistry degree program are encouraged to apply.\n\nPrimary Duties\n\nInstruct baccalaureate and master’s level courses in the chemistry program in accordance with program needs. This includes preparing and presenting course materials, administering appropriate tests, evaluating student outcomes, selecting and ordering texts, preparing, administering and grading assignments, and assigning final grades. It will also include proposing curriculum changes and program modifications to the Department Chair.\nEngage in scholarly activity including grant writing, preparation, and submission; scholarly work appropriate to the discipline while including undergraduate and graduate students in research when possible and appropriate; and dissemination at appropriate national, regional, and local venues. If they wish to engage in research with students or require resources, they may do so by collaboration with a faculty member on a mutually agreeable project.\nConduct student advising to ensure appropriate course and field work is completed to accomplish program objectives. This requires the faculty member to establish, post, and communicate to students at least five regularly scheduled office hours per week. Participate in student recruitment, campus meetings, University, college and department committees, University functions and other duties as assigned.\n\nMinimum Qualifications, Substitutions, Conditions of Employment & Appeal Rights\n\nMinimum Qualifications\n\nPh.D. in chemistry (awarded by the initial contract date)\nPreferred Qualifications\nPh.D. in inorganic chemistry\nPost-doctoral coursework or research\nPrevious college-level teaching experience\nExperience in fields of research that complement momentum in the department and university including the CBC program\nCondition of Employment\nEvidence of your being fully vaccinated for COVID-19, or applicable exemption, is required as a condition of employment with CSU Pueblo. Employment is contingent upon your submission of records showing full vaccination for COVID-19, or receiving the first dose of a two-dose vaccine—or a single dose vaccine—before your hire date and submitting evidence of a second dose (as necessary, based on vaccination type) within 30 calendar days of your hire date, or completion of an exemption before your hire date.\n\nInformation about medical and non-medical exemptions is available at https://www.csupueblo.edu/coronavirus/vaccinations/index.html. Those employees who qualify for an exemption may be required to follow additional public health requirements or precautions, such as isolation, quarantine, testing, or other measures, particularly if there is a COVID-19 outbreak, in accordance with the direction and guidance of public health officials and University and CSU System policy.\n\nSupplemental Information\n\nAll interested candidates must apply through the on-line application system. No other format of application materials will be accepted.\n\nApplicants must attach the following documents, in order to be considered for this position:\n\na letter of intent (cover letter);\na current resume or CV;\na statement of teaching philosophy; and\nunofficial or official transcripts showing required degree conferred.\nIf research activity is anticipated, an optional statement may be included indicating your current or proposed research interests and how they align with current faculty research.\n\nAdditionally, applicants must include current contact information for three professional references, either within the online application or as an attachment.\n\nApplications submitted without the required attachments/information above will be considered incomplete and will not move forward in the selection process. Once submitted, applicants will not be able to make changes or add information to their application packet, with the exception of their personal contact and demographic information.\n\nEarly submission of application materials is encouraged. Screening of application materials will begin immediately and continue until filled.\n\nAbout Colorado State University Pueblo\nColorado State University Pueblo is a comprehensive state university with an enrollment of 4,000 students. CSU Pueblo provides relevant professional coursework and superior instruction with a small student-to-faculty ratio for an ever-changing global economy. Students can choose from 35 undergraduate programs with 81 fields of study in the College of Science, Technology, Engineering and Mathematics; the Hasan School of Business; the College of Humanities, Arts and Social Sciences; and the College of Health, Education, and Nursing; and 13 graduate programs.\n\nCSU Pueblo is dedicated to interdisciplinary learning and entrepreneurship that elevates our people and our community, creates educational opportunities, fosters unique collaborations, and supports inclusion, access, and affordability as a gateway to the world. CSU Pueblo is equally committed to serving the diverse population of the region; this emphasis is reflected in the demographic characteristics of the student body. Because more than 25 percent of our students are Hispanic, the Federal Government has designated CSU Pueblo a Hispanic Serving Institution. Besides reflecting our commitment to serve this critically important and rapidly growing segment of the student population, that designation also allows the University to compete for certain federal grant funds to support its ability to better serve all students.\n\nAmong its unique features, CSU Pueblo is one of seven schools in the nation to offer a degree in mechatronics, which combines electrical and mechanical engineering. The Hasan School of Business ranks among the top 15 percent of all business schools internationally with graduate and undergraduate programs in business administration accredited by the AACSB International Board of Directors. The College of STEM houses an undergraduate engineering program that was ranked in the nation's top 100 by U.S. News and World Report. CSU Pueblo has an ever-changing campus landscape that features a newly renovated Library, a new general academic classroom building, and a newly renovated and expanded student center.\n\nAt CSU Pueblo, Student Life offerings have increased significantly with the transition of the campus from a commuter environment to a more traditional collegiate experience. Competing at the NCAA Division II level, CSU Pueblo is a member of the Rocky Mountain Athletic Conference and offers 22 varsity intercollegiate sports and also has active intramural and club sports teams that allow students to get involved in campus life.\n\nColorado State University Pueblo offers a comprehensive benefits package including:\n\nMedical Insurance and Prescription Drugs\nDental Insurance\nVision Insurance\nFlexible Benefit Plan\nBasic Term Life Insurance\nVoluntary Term Life and AD&D Insurance\nLong-Term Disability Insurance\nEmployee Assistance Plan (EAP)\nTravel Accident Insurance\nVoluntary Critical Illness and Accident Insurance\nWellness Incentive Program\nAnnual & Sick Leave\nRetirement Plans\n\nAbout Pueblo, Colorado\nThe city of Pueblo is a historically and culturally rich, diverse city of more than 100,000, located in the southern part of the state along the Arkansas River near the Wet Mountains and the majestic Sangre de Cristo range. Pueblo enjoys ideal year-round climate with four distinct mild seasons, crisp mountain air and 300+ days of sunshine per year. Pueblo attracts outdoor enthusiasts to a full slate of summer and winter recreational activities, encompassing water sports at Lake Pueblo, biking or running along Pueblo's beautiful river trail system, golfing, tennis, hiking or skiing in the mountains to the west. The region is heavily agricultural, with large and small-scale farming and ranching, and a diverse mix of service, manufacturing, and technology industries.\n\nCSU Pueblo is committed to providing a safe and productive learning and living community. To achieve that goal, we conduct background investigations for all final candidates being considered for employment. Background checks may include, but are not limited to, criminal history (felony and misdemeanor), national sex offender search, and/or motor vehicle history. Candidates who are extended an offer of employment must submit to and pass a background check prior to beginning employment. Some positions depending on the job duties may be required to complete a DMV and/or credit check.\n\nThe University reserves the right to check additional references, with prior notification given to the candidate.\n\nNote: The successful candidate must provide official transcripts of academic work completed and, under U.S. Citizenship and Immigration Services regulations, be able to submit evidence of the ability to accept work in the U.S. by the day employment begins.\n\nIt is the policy of Colorado State University Pueblo to provide reasonable accommodations for employees and applicants with disabilities. If you need accommodations, please contact the Office of Human Resources& Institutional Equity at (719) 549-2441 or hr@csupueblo.edu.\n\nIn compliance with the Clery Act of 1990, the University's annual security report is available at: https://www.csupueblo.edu/campus-safety.\n\nColorado State University Pueblo is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, or veteran status. Additionally, the University complies with all other relevant, federal, state, and local laws regarding employment practices.","slug":"visiting-assistant-professor-of-chemistry-7d3e5f3e-19e5-4e66-b77b-aae64f8733f9","benefits":["Dental insurance","Health insurance","Employee assistance program","Disability insurance","AD&D insurance"],"selectedSkills":["Teaching Certification","Research","Doctoral degree","Bachelor's degree","Doctor of Philosophy","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.governmentjobs.com/careers/colorado/jobs/3607454/visiting-assistant-professor-of-chemistry"},{"position":"Cannabis Testing Laboratory Director","labName":"Coastal Diagnostic Services","location":"Los Angeles, CA","age":"2 days ago","type":"Full-time","jobDescriptionCopy":"We are a Licensed Cannabis Testing Laboratory in Los Angeles working on DCC and ISO certification requirements including but not limited to:\n\n\nFinal validation and correspondence with DCC policy\nLIMS selection and implementation\n\nCandidates should have already successfully led one or more Cannabis Testing Laboratories through City, State and ISO 17025 certification processes.\n\n\nCandidates have extensive working knowledge and experience in DCC and ISO certification processes.\n\n\nQualifications:\n\n\nBachelors of Science or greater\n\n\nCA Cannabis Laboratory Management experience of 3+ years\n\n\nLIMS knowledge and experience\n\n\nExperience in Metrix, Accela and Microsoft business tools\n\n\nManagerial experience in ALL aspects of a California Cannabis Testing Laboratory\n\n\nJob Responsibilities include:\n\n\nMethod development\n\n\nProcess creation and process flow development and optimization\n\n\nPolicy Development and optimization\n\n\nSOP creation, development and editing per FDA/ISO standards\n\n\nValidation processes per DCC requirements\n\n\nLearn, run, optimize, trouble shoot and train employees on all necessary aspects of LCMS, ICP-MS, GCMS and HPLC equipment for Perkin Elmer\n\n\nLearn, run, optimize and train employees on Agilent PCR machine\n\n\nManaging, supervising and optimizing laboratory personal and vendors\n\n\nPurchasing of all laboratory supplies and equipment as needed\n\n\nResponsible for oversight of all building maintenance issues and reporting these to the Executive Team\n\n\nEnsure all equipment and applications are in clean, well-maintained and in good working order\n\n\nEnsuring compliance with laboratory policies, procedures and state regulations\n\n\nCandidates should have already successfully led one or more Cannabis Testing Laboratories through City, State and ISO 17025 certification processes.\n\n\nCandidates have extensive working knowledge and experience in DCC and ISO certification processes.\n\n\nQualifications:\n\n\nBachelors of Science or greater\n\n\nCA Cannabis Laboratory Management experience of 3+ years\n\n\nLIMS knowledge and experience\n\n\nExperience in Metrix, Accela and Microsoft business tools\n\n\nManagerial experience in ALL aspects of a California Cannabis Testing Laboratory\n\n\nJob Responsibilities include:\n\n\nMethod development\n\n\nProcess creation and process flow development and optimization\n\n\nPolicy Development and optimization\n\n\nSOP creation, development and editing per FDA/ISO standards\n\n\nValidation processes per DCC requirements\n\n\nLearn, run, optimize, trouble shoot and train employees on all necessary aspects of LCMS, ICP-MS, GCMS and HPLC equipment for Perkin Elmer\n\n\nLearn, run, optimize and train employees on Agilent PCR machine\n\n\nManaging, supervising and optimizing laboratory personal and vendors\n\n\nPurchasing of all laboratory supplies and equipment as needed\n\n\nResponsible for oversight of all building maintenance issues and reporting these to the Executive Team\n\n\nEnsure all equipment and applications are in clean, well-maintained and in good working order\n\n\nEnsuring compliance with laboratory policies, procedures and state regulations\n\n\nJob Type: Full-time\n\n\nPay: From $100,000.00 per year\n\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\n\nAbility to commute/relocate:\n\n\nLos Angeles, CA 90021: Reliably commute or planning to relocate before starting work (Preferred)\n\nEducation:\n\n\nDoctorate (Preferred)\n\nExperience:\n\n\nResearch: 1 year (Preferred)\n\nLicense/Certification:\n\n\nASCP Certification (Preferred)\n\nWork Location: One location\n","slug":"cannabis-testing-laboratory-director-61730a00-5a93-4b89-afbe-1a9ac5567cdb","benefits":[],"selectedSkills":["Research","ASCP Certification","FDA regulations","Laboratory information management systems","Laboratory management","Doctoral degree","Bachelor of Science","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=O__DSUHJWij7nB1os04KMd2CfKQKQIbXmXUXSHoV0hopxzObJpqluA"},{"position":"Chief Scientific Officer - Cannabis Testing Solutions","labName":"E4 Bioscience","location":"Chicago, IL","age":"6 days ago","type":"Full-time","salaryMin":"$175,000 ","salaryMax":" $225,000 a year","jobDescriptionCopy":"Chief Scientific Officer – Cannabis Testing Services\n\n\nAbout the Company\n\n\nFounded in 1925 and headquartered in Akron, Ohio, Smithers is a multinational provider of testing, consulting, information, and compliance services. With over 900 employees, it has laboratories and operations in North America, Europe, and Asia, and is currently undergoing a rapid expansion in cannabis safety testing. Currently, Smithers’ Cannabis Testing Services (CTS) business has three (3) testing laboratories and is expected to grow through a combination of greenfield build and acquisitions to 12-14 labs. This CSO position requires a combination of technical laboratory knowledge, business development acumen, and strong interpersonal skills.\n\n\nJob Summary\n\n\nRepresent Smithers to clients and perspective clients. Coordinate client events, attend trade shows, partner with subject matter experts and Sales and Marketing to prepare commercial material.\nHelp Cannabis Testing Services (CTS) President and State Directors prepare technical and commercial proposals for clients and prospects.\nSet standards that are applied across all CTS labs. This will include assisting in drafting job descriptions, participating in the hiring, mentoring, training and development of scientific staff across the CTS business.\nParticipate in the due diligence process for perspective acquisitions. This will include participation in the evaluation and valuation of new sites, evaluating the technical skills of the staff and overseeing the integration of technical staff and processes into Smithers.\nProvide consulting services to clients.\nBackfill critical technical roles should the business experience turnover. Likely positions include state director and operations manager positions.\n\nJob Duties\n\n\nEssential FunctionsThe technical face to the industry. This means participation in:\n\n\nCustomer visits and occasional discussions with clients about unusual results and what they mean.\nTrade shows.\nBreakfast/lunch seminars.\nDevelopment of marketing materials.\nParticipate in technical committees in the Industry as a technical expert.\nThe technical leader and standard setter for the division. This means participation in: Development of job descriptions, recruiting, hiring and mentorship of senior leaders at each site.\nCreating and implementing minimum standards for equipment, methods, and facilities.\nOngoing development of technical skills for him/herself as well as those of site leadership.\nEvaluate new test methods for implementation.\nOversight of the development and approval of analytical testing method development, optimization, and validation, and new technology additions to the division.\nTrouble-shooting suspect results/methods.\nSupporting cross-departmental compliance with all relevant regulations including: ISO 17025, AOAC International, ASTM, USP, etc...\nMust be able to understand and follow laboratory safety standards.\nNew site development. This means participation in: Evaluation and valuation of new sites for acquisition.\nTechnical due diligence.\nTechnical integration.\nAdvisory/project consulting.\nProvide extra support to a site if we have turnover in the site director role.Location: There is a preference for candidates to live in Akron, OH (Assistance will be provided for candidates if needed) but we are flexible to candidates living in any of the primary CTS locations (ex: NY, NJ or IL)\n\nTravel Requirements:\n\n\nOvernight travel: 40% out of office travel. Majority travel is overnight.\n\nJob Specifications and Qualifications\n\n\nMinimum a bachelors, preferably a masters degree or above in either biology or chemistry.\nAt least (2) years and strong preference for (5) plus years working with cannabis technology.\n(10) plus years of cumulative work experience.\nExceptional technical writing skills [written and oral comprehension, written and oral expression].\nExceptional ability to integrate observations [visual and written discrimination] into evaluation process.\nExceptional problem-solving skills [mathematical reasoning].\nAbility to work at a fast pace, prioritize work assignments for assigned staff and handle stress [high productivity].\nComfortable working with standard computer software [word processing, spreadsheets, data bases, statistical software].\n\nJob Type: Full-time\n\n\nPay: $175,000.00 - $225,000.00 per year\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nFlexible schedule\nHealth insurance\nLife insurance\nPaid time off\nRelocation assistance\nVision insurance\n\nSchedule:\n\n\nMonday to Friday\n\nWillingness to travel:\n\n\n25% (Required)\n\nWork Location: On the road\n","slug":"chief-scientific-officer-cannabis-testing-solutions-f04ab8dd-4126-48c4-9385-ac0f8b44dcc0","benefits":["Dental insurance","Health insurance","401(k) matching","Paid time off","Flexible schedule"],"selectedSkills":["Technical writing","Statistical software","Business development","Bachelor's degree","Master's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=2M6RJjhoBGjSTHmH0HH2uHE1EMu-ZdqI3dZiWe-4ZqrFBQI7CThZtA"},{"position":"Field Sampler (Driver)","labName":"Kaycha Labs","location":"Orlando, FL","age":"5 days ago","type":"Full-time","salaryMin":"$29,000 ","salaryMax":" $39,000 a year","jobDescriptionCopy":"Company Overview:\n\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\n\nJob Purpose:\n\n\nThe Field Sampler is responsible for conducting routine pickups and processing of regulatory compliance samples for laboratory analysis. This includes accurately recording sample and chain of custody documentation and the safe and secure transportation of all samples to the laboratory. Candidates must be located in the Orlando, FL area or close proximity.\n\n\nEssential Duties & Responsibilities:\n\n\nPerform onsite field sampling pickups in accordance with all laws and regulations related to the legal cannabis market and laboratory operating procedures.\nCollect and forward weekly inventory requests to the laboratory team.\nCollect payment from clients.\nInterface effectively between customers and the laboratory team.\nContact clients in conjunction with the Client Service Rep(s) to determine if their sampling needs to create a sampling plan (e.g., number of batches, requested analyses, sample information)\nInput orders with required sample information into METRC and the lab’s LIMS system as required.\nFollow detailed procedural requirements as outlined in the Kaycha Labs Sampling and Chain of Custody SOP.\nSafely drive throughout an assigned region, which may include multi-hour destination pickups.\nCollect detailed data in the field according to SOPs.\nMaintain current knowledge of our products and services.\nConsistently maintain customer confidentiality.\nOther duties and special projects as assigned.\n\nKnowledge, Skills, and Abilities:\n\n\nAbility to maintain a high degree of attention to detail and accuracy.\nExcellent communication skills and ability to effectively work, problem solve, and communicate with internal and external customers.\nDemonstrate keen attention to detail and punctuality.\nAbility to work in a dynamic, fast-paced deadline environment while successfully managing multiple tasks.\nDemonstrated ability to be professional, pleasant, and presentable.\nFamiliarity with the assigned geographic area.\nBuild long-lasting customer relationships.\n\nEducation & Experience\n\n\nHigh School Diploma (or GED required.)\nA valid driver’s license and clean driving record (with at least three years of driving experience).\nExposure to the Cannabis industry is a plus.\n\nOther:\n\n\nMust be over 21 years old\nPre-Employment Verifications: Must pass Level 2 background check.\nKaycha Labs offers a competitive and comprehensive benefits package.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.\n\nEssential Functions:\n\n\nThe physical demands described here are representative of those that an employee must meet to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nWhile performing the duties of this job the employee is frequently required to stand, handle or feel, to speak, and to hear. The employee is occasionally required to walk, sit, reach with hands and arms, bend, kneel, crouch, or crawl. The employee must frequently lift and/or move up to thirty-five (35) pounds.\n\n\nSpecific vision abilities required for this job include close (proximity) vision, depth perception, and the ability to adjust focus.\n\n\nWork Environment:\n\n\nThe work environment described here is representative of that which an employee may encounter while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nThe standard analytical laboratory environment is one in which potential health hazards do exist. Administrative, operations, technical, and professional staff are expected to safely operate in accordance with applicable and appropriate health and safety policies and procedures, as prescribed by the applicable Kaycha manuals and policies and/or federal, state, or local standards.\n\n\nLaboratory staff can be expected to work in areas where hazards associated are with, but not limited to, airborne pathogens. Biological materials, hazardous substances, and radioactive material exist and are handled. Appropriate training is provided regarding these hazards and staff are expected to adhere to all health and safety policies at all times, whether they are in writing or verbalized by a supervisor.\n\n\nJob Type: Full-time\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nEmployee discount\nFlexible schedule\nHealth insurance\nLife insurance\nPaid sick time\nPaid time off\nReferral program\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nHome daily\nMonday to Friday\nOvertime\nWeekend availability\n\nTrucking Driver Type:\n\n\nTeam driver\n\nTrucking Route:\n\n\nLocal\n\nCOVID-19 considerations:\nEmployees must wear masks if unvaccinated.\n\n\nApplication Question(s):\n\n\nDesired compensation?\nWhat is the best email/phone number to reach you at?\n\nEducation:\n\n\nHigh school or equivalent (Preferred)\n\nExperience:\n\n\nCustomer service: 1 year (Preferred)\n\nLicense/Certification:\n\n\nDriver's License with a clean driving record? (Required)\n\nWork Location: On the road\n","slug":"field-sampler-driver-312fd4dc-1230-4763-baad-e7cbbad62067","benefits":["Dental insurance","Employee discount","Health insurance","Flexible schedule","Referral program"],"selectedSkills":["Driving","Communication skills","Customer service","Driver's License","High school diploma or GED","Clean driving record","21 years or older","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=Ixbo1vM-CGok0NpzqtbTmRqisHWxO7ZTd5dZHhUY1QQufu3nZsHypA"},{"position":"Packaging Technician","labName":"KYND","location":"Sparks, NV","age":"2 days ago","type":"Full-time","salaryMin":"$27,000 ","salaryMax":" $37,000 a year","jobDescriptionCopy":"ABOUT AYR WELLNESS\n\nWe’re a new kind of cannabis company, aiming higher in everything we do. We grow and sell the highest-quality cannabis products available anywhere, inspiring wellness and wonder in our customers, wherever they are on their cannabis journey. We operate with a sense of responsibility to our customers and patients, building stronger and more socially responsible communities everywhere we go.\n\nJOB DESCRIPTION\n\nThe Packaging Technician primarily responsible for the accurate weighing, labeling, and packaging of all of our products prior to shipping.\n\nRESPONSIBILITIES\n\nTech I\n\nPackage, sticker, and count cannabis products/finished goods\nConfirm batch and lot numbers on finished goods’ product labels are correct\nCreate “Lots” of Bud, Smalls, Shake, and Live Resin in LeafLogix and Metrc as well as physically\nCoordinate third party Laboratory testing and transfers\nConfirm Harvest Batches’ Untrimmed Dry Weights (“Buck” weights) by reweighing and recording weights\nCoordinate and execute conversions and transfers to Extractions Department\nCarefully manage inventory flow during busy order fulfillment periods\nAbility to multi-task repeatedly with attention to detail and minimal errors\nMaintain a clean and organized work environment\nRead, understand, and follow all CCB regulations relating to inventory control and chain of custody\nAssist with supervision of Trim Technicians on trim machine and grinding machine on their workflow and duties\nDelegate cannabis products for processing and trimming\nOther duties as assigned\n\nSKILLS/ABILITIES REQUIRED\n\nAttention to detail with excellent record keeping ability\nWillingness to learn and improve each operation\nAbility to perform repetitive tasks for long periods of time\nAbility to work in a fast-paced environment and multi-task\nCommitment to arrive for scheduled shifts on time and maintain consistent attendance\nAvailability to work occasional weekends and holidays\n\nREQUIREMENTS/PREFERRED EXPERIENCE\n\nHigh school diploma or General Education Diploma (GED)\nMust have a clear understanding of weights and measures and ability to operate a scale\nAbility to work within a team and on an individual basis\nFamiliarity with warehouse procedures\nAbility to work in a timely manner and drive to increase productivity\nExperience and knowledge and familiarity with Cannabis\nProficient in Microsoft Office (Word, Excel and Outlook)\nMust be 21 years of age or older, and be able to pass an extensive background check\nMust be authorized to work in the United States\n\nPHYSICAL REQUIREMENTS\n\nAbility to stand on feet or sit for extended periods of time\nAbility to have extended cannabis exposure, with no adverse physical reaction\nAbility to use repetitive use of hands, wrists and forearms\nFine visual acuity with the ability to adjust focus to inspect closely, ability to recognize different colors.\nNormal vision or corrected by use of glasses and/or contacts for normal reading and viewing abilities to determine the accuracy, neatness, and thoroughness of the work assigned, or to make general observations of facilities or structures.\nRequires eye-hand coordination and manual dexterity sufficient to meet job and operate equipment requirements\nRequires normal range of hearing with the ability to perceive the nature of sounds at normal speaking levels with or without correction and having the ability to receive detailed information through oral communication and making fine discriminations in sound.\nAbility to twist, turn, bend, stand and walk as required to perform the duties associated with functioning as a dispensary manager.\nPushing/pulling/carrying, with the ability to lift up to 50 pounds occasionally\nRegular and on-time attendance (Hours may exceed 40 hours per week)\n\nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n\nWORK ENVIRONMENT:\nWork is performed in several locations that include a cannabis cultivation and production facility. The working area may be odorous at times and loud due to fans and filtration systems, fluctuating between cold and warm temperatures. Involves frequent contact with staff. Work may include dealing with law enforcement and occasional State inspectors.\n\nDISCLAIMER\n\nAll the above duties and responsibilities are essential job functions subject to reasonable accommodation. All job requirements listed indicate the minimum level of knowledge, skills and/or ability deemed necessary to perform the job proficiently. Employees may be required to perform any other job-related instructions as requested by their supervisor, subject to reasonable accommodation. This document does not create an employment contract, implied or otherwise, other than an “at will” employment relationship.\n\nAyr Wellness is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, veteran status, or any other characteristic protected by federal, state or local law.","slug":"packaging-technician-fc424e08-bc1a-47e5-ab02-a2cb0f23bb40","benefits":[],"selectedSkills":["Microsoft Outlook","Warehouse experience","Microsoft Excel","Microsoft Office","Microsoft Word","High school diploma or GED","Background check","21 years or older","US work authorization"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=cp23SxqzW6lHZ35QJfA6P1yl-yXDy-V2cgFnTaufz5I5PWY34aRqUQ"},{"position":"Laboratory Intake & Accessioning Professional","labName":"Apollo Labs","location":"Scottsdale, AZ","age":"3 days ago","type":"Full-time","salaryMin":"$40,000 ","salaryMax":" $50,000 a year","jobDescriptionCopy":"Please only apply if you meet the education requirements as we will not respond to any candidates who do not meet the criteria. Candidates willing to work second shift and weekends will receive priority\n\n\nCannabis Testing Laboratory seeks a highly motivated individual to serve in an intake and junior chemist role. Ideal individuals must have a minimum of a Bachelors of Science (physical sciences or biological sciences recommended) and be comfortable in a laboratory environment.\n\n\nThis position is for the role of Intake/Accessioning and Junior Chemist at Apollo Labs, the fastest-growing cannabis safety- and potency-analysis laboratory in Arizona.\n\n\nAt Apollo, we are looking for individuals with experience in highly regulated industries with a strong focus on quality, cleanliness, and professionalism. We prioritize data quality and integrity – curious, eager, and ethical chemists are crucial to achieving those goals. Above all, we want to do good science that will build respect and trust for the cannabis industry. Priority is given to individuals with a pharmaceutical-industry, semiconductor-industry, or cGMP-regulated background. Cannabis industry experience is not required.\n\n\nJob responsibilities include, but are not limited to: data entry, handling of contained cannabis samples, and various administrative duties (inventory tracking, compliance tracking, paperwork/data management, etc.). This is a full-time position and perfect for a recent grad who is looking to get initial experience at a laboratory with opportunity for advancement to a Chemist position, should they show the interest and aptitude.\n\n\nCandidate must be extremely detail oriented and willing to learn, have full command of the English language. Applicant is organized, articulate and efficient. Prior experience working in a laboratory a plus. In addition to good computer skills, the ideal applicant must be comfortable functioning and thriving in a fast-paced environment. Familiarity with Microsoft Office Suite (Word, Excel – Access is a plus) required.\n\n\nIndividuals with interest in computer science, scripting, database management, and more are encouraged to apply, as opportunities for parsing and management of large bodies of data and statistical analysis may arise.\n\n\nGeneral Responsibilities:\n\n\nIntake, inspect, and accession samples as they are received\nAbility to learn about and grow with the cannabis industry and the science associated with laboratory testing\nResponsible for maintaining accurate and compliant cannabis inventory, including flower and processed product\nAbility to work with a diverse team of individuals and rapidly changing goals and expectations\nSample splitting/sorting and data entry\nPrepare laboratory specimens for designated departments/locations prior to laboratory testing\nAbility to respect and maintain client analysis and testing confidentiality\nRoute specimens by types of various staging areas\nAbility to work efficiently and effectively under areas time constraints\nFollow detailed chain of custody protocols according to state regulations\nPossess the ability to weigh, calculate, and prepare cannabis products.\nHandling of analytical balances and analytical equipment\nInput data into LIMS and track-and-trace systems, as required\nMaintain compliance using a centralized tracking system.\nCommunicate with lab testing personnel and laboratory director regarding sample testing and coordination of sample receipt\nPerform other tasks as required – be eager to potentially take on other instrumentation and analytical chemistry techniques\n\nEducation and Experience Required:\n\n\nMust have a Bachelors of Science or more advanced degree\nMust be 21 years old\nComfortable working in a fast-paced environment with time management skills and ability to self-manage\nPersonable, organized, and punctual\n\nJob Type: Full-time\n\n\nPay: $40,000.00 - $50,000.00 per year\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\n\nSchedule:\n\n\n8 hour shift\nIndividuals willing to work second shift, nights, and/or weekends are strongly favored, but not necessary\n\nExperience:\n\n\nLaboratory Experience: 1 year (Preferred)\n\nWork Location:\n\n\nOne location\n\nCompany's website:\n\n\nwww.apollolabscorp.com\n\nWork Remotely:\n\n\nNo\n\nJob Type: Full-time\n\n\nPay: $40,000.00 - $50,000.00 per year\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nEvening shift\nMonday to Friday\nWeekend availability\n\nSupplemental Pay:\n\n\nBonus pay\n\nCOVID-19 considerations:\nAll employees are expected to be vaccinated for COVID-19 - we will work to facilitate this if you are not yet vaccinated.\n\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nLaboratory Experience: 1 year (Preferred)\n\nWork Location: One location\n","slug":"laboratory-intake-accessioning-professional-82141954-31a2-4cb2-96ab-331e7a0521b0","benefits":["Dental insurance","Health insurance","401(k)","Paid time off","Opportunities for advancement"],"selectedSkills":["Microsoft Excel","Laboratory experience","Microsoft Office","Microsoft Access","Computer skills","Bachelor of Science","Bachelor's degree","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=i554d-i0UiXDzQVB3D2LFKX-fv4LdrjXA8XthZTlw9hFNxrMJVXmGA"},{"position":"Lab Technician","labName":"PharmLabs LLC","location":"San Diego, CA","age":"6 days ago","type":"Full-time | Part-time","salaryMin":"$19 ","salaryMax":" $24 an hour","jobDescriptionCopy":"The PharmLabs brand is a rapidly expanding DEA and ISO 17025 accredited scientific cannabis analytical testing laboratories. PharmLabs scientifically tests purity and potency of cannabis, hemp and related products to ensure product safety and State/Federal legal compliance. We are looking for a laboratory Technician to join the lab team that has a high attention for detail and able to prepare testing samples for analytical instrument runs.\n\n\nGreat opportunity to get into an amazing company in the cannabis and hemp testing industry and start on the ground and grow lightning fast.\n\n\nCore Responsibilities:\n\n\nUnderstands and adheres to strict PharmLabs' Standard Operating Procedures regarding California compliance and quality testing of cannabis and cannabis products;\nComplies with and supports continuous improvement of the ISO 17025 accredited laboratory Quality Management System;\nConducts analytical laboratory investigations, experiments and/or research activities, applies statistical techniques to validate methods, analyzes testing data, and prepares a report of findings;\nUtilizes solvent extraction, solid phase extraction and sample preparation techniques for testing analysis.\nAdds internal standards, prepares quality control samples, and conducts other quality control functions;\nPerforms system suitability checks, preventive maintenance, and calibrates analytical instrumentation.\nProcesses, organizes and summarizes data and computerized results of analysis through the Laboratory Information Management System (LIMS);\nConsults with the Laboratory Director to develop and implement new laboratory methods, techniques, and protocols;\nAssists Laboratory Director with special studies in sample preparation;\nPrepares and conducts quality checks on laboratory equipment;\nAssists in the security and cleanliness of laboratory and equipment;\nConducts supply inventory to ensure availability of consumable laboratory materials;\nPerforms other duties as assigned.\nCleans and organizes the lab\nAssists with ordering lab supplies\n\nMinimum Qualifications:\n\n\n1 year lab experience\nMUST have a positive attitude\n\nJob Types: Full-time, Part-time\n\n\nPay: $19.00 - $24.00 per hour\n\n\nBenefits:\n\n\n401(k)\nFlexible schedule\nHealth insurance\nHealth savings account\nPaid time off\n\nSchedule:\n\n\n4 hour shift\n8 hour shift\nDay shift\nMonday to Friday\nWeekend availability\n\nEducation:\n\n\nAssociate (Preferred)\n\nExperience:\n\n\nLaboratory: 1 year (Preferred)\n\nWork Location: One location\n","slug":"lab-technician-e998a805-0b3d-4422-87fa-e41ddeec058f","benefits":["Health savings account","Health insurance","Paid time off","Flexible schedule","401(k)"],"selectedSkills":["Laboratory experience","Associate's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=JTNGnVZ24a6iPDRZyxtDcoPpP3xfLi0eY-vcXBNOHUHIrK6pMpeYsw"},{"position":"Analytical Chemist","labName":"Quales","location":"Frederick, MD","age":"3 days ago","type":"Full-time | Part-time | Temporary | Contract | Internship","salaryMin":"$35,000 ","salaryMax":" $50,000 a year","jobDescriptionCopy":"Quales is an independent cannabis testing laboratory. We provide state-of-the-art testing services for licensed medical marijuana producers and distributors. We provide the most accurate results in the industry while helping ensure customer safety and compliance with state regulations.\n\n\nhttps://www.quales.us\n\n\nResponsibilities:\n\n\nAnalyzing samples consisting of a variety of matrices using traditional laboratory technologies such as HPLC, GC/MS, ICP/MS and LC/MS/MS\nAnalyzing samples consisting of a variety of matrices using plating methods and qPCR\nPreparing samples for analysis\nMaintaining and troubleshooting laboratory instrumentation\nEnsure that all data generated meet quality control requirements\nResearching new technologies and methodologies to improve laboratory processes and techniques\nReport to the chemistry team leader\nWork with the laboratory team to meet reporting deadlines\nConsumables ordering, sample storage and disposal, cleaning and similar lab processes\n\nQualifications:\n\n\nMinimum BS/BA in chemistry, biochemistry, or related field and at least 1 year of laboratory work experience\nExcellent written/verbal communication skills\nExcellent laboratory troubleshooting skills\nDetail oriented\nExperience with HPLC and/or LC/MS/MS instrumentation experience is a strong plus\nExperience with GC, GC/MS, ICP/MS or a qPCR is a plus\nFood science experience is a plus\nMust pass an extensive level 2 background security check with no convictions\n\nEducation:\n\n\nBachelor's (Required)\n\nJob Types: Full-time, Part-time, Contract, Temporary, Internship\n\n\nPay: $35,000.00 - $50,000.00 per year\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nFlexible schedule\nHealth insurance\nHealth savings account\nPaid time off\nRetirement plan\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nAfter school\nDay shift\nEvening shift\nHolidays\nMonday to Friday\nNight shift\nOvernight shift\nSelf-determined schedule\nWeekend availability\n\nSupplemental Pay:\n\n\nBonus pay\n\nAbility to commute/relocate:\n\n\nFrederick, MD 21703: Reliably commute or planning to relocate before starting work (Required)\n\nWork Location: One location\n","slug":"analytical-chemist-91eff904-9071-4450-9fd2-91ed83899134","benefits":["Health savings account","Dental insurance","Health insurance","Flexible schedule","401(k)"],"selectedSkills":["High-performance liquid chromatography","Laboratory experience","Communication skills","Gas chromatography","Bachelor of Science","Bachelor's degree","Master's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=SIZ0Mcstkn9yZEKbczmqVrDlTcNbs3v6SAWZl9sYzCdHdQyA5MAesA"},{"position":"Production Lab Technician","labName":"Cannvital, LLC","location":"Las Vegas, NV","age":"3 days ago","type":"Full-time","salaryMin":"$20 ","salaryMax":" $22 an hour","jobDescriptionCopy":"Job Description – Lab Technician- Pharmaceutical (on-site)  \n\n\n \n\n\nJob Location:  Las Vegas NV (on-site only)  \n\n\n \n\n\nCannvital NV LLC is a global hemp-based CBD extraction and refinement company with its headquarters and production facility located in Las Vegas, NV. Cannvital is seeking several Lab Technician to bring on to our expanding team.  \n\n\n \n\n\nCannvital is looking to fill a position for our production team. The preferred candidate will have had at least 1 year of experience with cannabis or hemp extraction within a professional and/or commercial environment and familiar with current cannabis and hemp extraction techniques. Personality, skillset, and professionalism all play a large part in our selection. You will be joining a small, tight-knit team that operates in close quarters.  \n\n\nReliable transportation to and from the facility.  \n\n\nJob Duties include but are not limited to:   \n\n\n- Preparing equipment and crude oil for distillation.\n\n\n- Preparing equipment and distillate for crystallization  \n\n\n- Operating Distillation equipment  \n\n\n- Operating Isolation Equipment\n\n\n- Work with the Department Supervisor and Production Manager to facilitate optimum production and to meet facility sales demands and forecasts  \n\n\n- Regular cleaning and maintenance of lab equipment and facility.  \n\n\n- Weigh extract, prepare samples and precipitation for isolation and testing.  \n\n\n- Promote programs and automation to produce in a cost-effective manner, employing economy while maintaining an acceptable level of quality  \n\n\n- Inventory and record keeping of lab equipment. Maintain inventory records of supplies, materials, and temperatures of machinery.  \n\n\n- Assist laboratory and equipment cleanup. Wash and sterilize lab surfaces and glassware.  \n\n\n- General routine maintenance on lab equipment. Troubleshooting, preventative maintenance and regular data logging.  \n\n\n- Maintain and log all data sheets for chemicals and products.  \n\n\n- Assure 100 % legal compliance with all applicable laws and regulations regarding packaging, processing and inventory-tracking procedures  \n\n\n  \n\n\nApplicant must be able to stand for long periods of time, lift up to 50 lbs, bend, stoop, and have full physical range of motion in order to perform this job.  \n\n\nExperience:    \n\n\n2+ years experience in a professional or commercial lab space  \n2+ Years operating a Wiped Film Evaporator \nUnderstanding of Short Path Distillation \nUnderstanding of isolation techniques\n\n \n\n\nEducation: High school or above or equivalent   \n\n\nJob Type: Full Time  \n\n\nCompensation: TBD (based on Experience)  \n\n\nWork Location: Las Vegas Nevada\n\n\nJob Type: Full-time\n\n\nPay: $20.00 - $22.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\n\nAbility to commute/relocate:\n\n\nLas Vegas, NV 89118: Reliably commute or planning to relocate before starting work (Required)\n\nWork Location: One location\n","slug":"production-lab-technician-6007d917-5dd6-4297-a071-f09eadff893e","benefits":["Paid time off","Dental insurance","Health insurance","Vision insurance"],"selectedSkills":["Laboratory experience","High school diploma or GED","Reliable transportation"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=Or6LkRWER9vQUKFa_uMynmdP-Rur8RUgNsptnvnxbF2NXvxaGTT19A"},{"position":"Microbiologist I","labName":"Certified Testing and Data","location":"Orlando, FL","age":"1 day ago","type":"Full-time","salaryMin":"$55,000 ","salaryMax":" $79,000 a year","jobDescriptionCopy":"Description:\nDepartment: Microbiology\n\nPosition Title: Microbiologist I (Instrumentation or Research)\n\nReports to: Microbiology Supervisor or Laboratory Manager (Instrumentation or Research)\n\nPosition Type: Full-time, Non-exempt\n\nCompany Description\n\nCertified Testing and Data - The soon to be premier provider in the cannabis and hemp testing space. Founders have extensive experience in Cannabis as well as leading Multi-Billion dollar lab companies. Opportunity to participate in the growth and success of the company with a stock grant awarded to founding team members. Prior business led by management was top 15 Fastest growing company by Inc 5000. CTND has a great culture, excellent professional growth opportunities, and one of the nicest working lab spaces in the country. Submit your application today.\n\nCertified Testing and Data, an analytical testing facility, provides consultations and analytical results across the entire spectrum of the plant medicine industry. Building on a record of excellence, Certified Testing and Data features one of the largest full-service testing laboratories in the United States. Dedication to personalized service and superior scientific practices is the foundation of Certified Testing and Data success.\n\nJob Description\n\nTo perform a variety of standard microbiological assays and determinations on different substances and materials requiring the understanding of diverse principles and techniques; to undertake infrequently performed and specialized analyses of a limited scope; and to prepare and assure accuracy of standards.\n\nMicrobiologist I is the first tier of specialized scientist in the analytical microbiology laboratory, and serves as the introduction to the more advanced procedures, techniques, and responsibilities of the microbiology laboratory wherein professional growth is expected and assessed. The Microbiologist I is tasked with learning and becoming efficient at performing all routine pathogen laboratory procedures in each rotation, as well as maintaining the stock cultures and materials necessary for the lab to function.\n\nTherefore, the Microbiologist I is expected to demonstrate a teachable attitude and a dedication to improvement by paying careful attention to instructions, asking clarifying questions and taking personal notes as required. The Microbiologist I has the ability to follow methods and gather data from specialized equipment and instrumentation and is expected to develop the ability to independently perform all routine analyses and collaborate on method modification as needed. The Microbiologist I operates equipment and instrumentation on a regular basis and ensures the quality of data. The Microbiologist I ensures that activities are carried out in accordance with established Standard Operating Procedures (SOPs) and protocols.\n\nResponsibilities and Duties\n\nTo have working knowledge of the principles, practices, and techniques of microbiological analysis in order to perform a variety of standard tests, assays, and determinations on diverse substances and materials without detailed supervision.\nExercise discretion in selecting appropriate equipment and in planning time for assigned work.\nTo evaluate and solve problems related to any tests performed.\nTo undertake or assist with infrequently performed analyses using unfamiliar procedures.\nTo have a broad base of fundamental knowledge and skills encompassing several related areas.\nPlan ahead for the various procedures which may require foresight extending over several weeks.\nPerform any of the responsibilities of the Laboratory Technician if such assistance is required.\nTo serve a leadership role among the technicians due to his or her increased experience or educational background.\nOrganize, analyze, and present data in a scientifically acceptable manner.\nTo know the basic principles involved in the assigned procedures, although not necessarily the details.\nConduct limited reviews of related literature and references to obtain the required information and subsequently apply it.\nBe familiar with standard laboratory equipment is essential at the Microbiologist level.\nUnderstand routine calibration and repair of laboratory equipment.\nPerforms a variety of standard analytical testing on diverse substances and materials, including those of the same nature as performed at the Laboratory Technician level.\nPerforms more complex analyses using unfamiliar or non-routine methods\nFunctions as primary data generator, records and calculates data, signs assay sheets\nSolves problems related to routine methods and assays performed\nPrepares and assures accuracy of standards\nPrepares reagents and culture media\nPerforms routine calibration of instruments\nAssures the proper disposal of contaminated materials\nMay be responsible for technical supervision and/or training of one or more technicians\nAssures compliance with quality control programs\nCarries out assignments in a timely, diligent, and safe manner and performs work in accordance with laboratory, department and standard operating procedures.\nParticipate in the weekend rotation schedule (both Saturdays and Sundays).\n\n. Requirements:\nWorking knowledge of a broad range of plant medicine products, processes, and cultivation preferred (e.g. Cannabis, Hemp, CBD and Fungi).\nWorking knowledge of regulations (local and federal), Good Laboratory Practices, and current official methods with at least 3 years experience working in an accredited laboratory.\nExcellent oral and written communication skills. Demonstrated expertise in plant medicine safety, quality and value.\nExperience as an CTND Laboratory Technician III is a plus.\nEquipment and Instrumentation (e.g. Analytical Balance, pH Meter, qPCR Cycler, Bioarray, Autoclave) experience preferred.\nMust have strong organizational, leadership, and technical skills.\nBasic knowledge of budgeting, sales, business development, and strategic planning preferred.\nAbility to generate respect and trust from staff and external constituencies.\nBS/BA degree required, MS/MA degree preferred.\nMust be at least 21 years of age and pass required background check.\nExperience in a food testing laboratory is a plus.\n\nPhysical Requirements\n\nThese physical demands are representative of the physical requirements necessary for an employee to successfully perform the essential functions of the job. Reasonable accommodation can be made to enable people with disabilities to perform the described essential functions. While performing the responsibilities of the job, the employee is required to communicate with coworkers and managers by conversing, sending emails, answering phone calls and exchanging information regarding laboratory functions throughout 50% of the work day. The employee is required to stand 30% of most work days, sit 70% of most work days and use their hands and fingers to enter data into the LIMS system, perform microbiological analyses, review data, prepare special media and occasionally load and unload the autoclave (this list is not all inclusive). The employee is occasionally required to lift up to 50lbs and pull up to 150lbs while performing laboratory duties such as loading and unloading the autoclave and lifting boxes of samples. The employee must be able to reach. Vision abilities required by this job include close vision to count plates and be able to distinguish colors to identify bacterial colonies. The employee must be able to move about in the laboratory regularly throughout the work day. The employee must be able to occasionally work in extreme cold (below 32 degrees F) temperatures for periods of more than one hour when retrieving samples, cleaning out retained samples and reorganizing stored samples. The employee must be able to occasionally work in extreme hot (above 100 degrees F) temperatures for periods of more than one hour when working in the autoclave room. The employee must be able to tolerate moderate amounts of noise from laboratory equipment. The employee must be able to regularly tolerate very strong odors. Provided with proper protective equipment, the employee must work with microbiological and chemical hazards.","slug":"microbiologist-i-79480369-5430-4505-9fe7-b6f6b8f38af2","benefits":[],"selectedSkills":["GLP","Budgeting","Business development","Strategic planning","Laboratory experience","Bachelor of Science","Bachelor's degree","Master's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=o5wJTm3HzVyPK42CJR0nPDZZ3JX4kHTIDBQeYG58g8_7LYYIaS_COw"},{"position":"Analytical Chemist","labName":"Kaycha Labs","location":"Natick, MA","age":"3 days ago","type":"Full-time","salaryMin":"$51,000 ","salaryMax":" $66,000 a year","jobDescriptionCopy":"Company Overview:\n\n\nKaycha Group, LLC is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\n\nJob Purpose:\n\n\nThe Lab Analyst, Level I will be responsible for performing, documenting, record checking, and basic troubleshooting of qualitative and quantitative assays on samples using techniques that vary from the use of standard laboratory equipment to highly modern and automated instrumentation.\n\n\nEssential Duties & Responsibilities:\n\n\nAnalyze samples consisting of a variety of matrices using traditional laboratory technologies including, but not limited to, HPLC, GC/MS, LC/MS, and ICP/MS.\nPrepare samples for analysis while displaying good laboratory technique to avoid cross-contamination or misidentified samples.\nAccurately prepare calibration curves and quality control samples.\nInterpret and evaluate data in terms of accuracy, precision, trends, and quality control requirements.\nMaintain laboratory equipment by cleaning, and otherwise ensuring ongoing proper working order. Report equipment issues to supervisor\nCollaborate with the laboratory team to meet reporting deadlines.\nAble to perform method validations, or verifications as needed.\nManage inventory supplies and alert supervisor in advance when materials must be ordered\nMay participate in root cause analysis for quality assurance.\nAssist with training incoming analysts and technicians on methodology.\nParticipate in the development or updating of departmental SOP’s.\nOther duties and special projects as assigned.\n\nEducation & Experience:\n\n\nMinimum BS/BA in Chemistry, Biology, Physics, Engineering or Environmental Sciences required or based on state requirements.\nKnowledge of principles, terminology, practices, techniques, and instrumentation commonly used in a laboratory setting required.\nAt least 1 year of laboratory experience.\nExperience with GC/MS is highly preferred.\nDemonstrated proficiency in at least one analytical instrument preferred.\nFood science and/or environmental experience is a plus.\nExposure to the cannabis industry is a plus.\n\nSkills, Abilities and Competencies:\n\n\nBasic understanding of standard laboratory protocol.\nMaintain high productivity, keen attention to detail, and consistent multi-tasking while yielding a low testing error rate.\nStrong agility, engagement, and flexibility in an ever-changing environment.\nDiligent commitment to logging, organizing, and analyzing data.\nExcellent communication skills and ability to effectively work, problem solve, and communicate with multiple levels of the organization.\nPromote a strong customer service culture while adhering to the highest safety and industry standards, including those that are outlined by the state regulatory body.\n\nOther:\n\n\nMust pass the required background check.\nMust be at least 21 years old.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.\n\nEssential Functions:\n\n\nThe physical demands described here are representative of those that an employee must meet to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nWhile performing the duties of this job the employee is frequently required to stand, handle or feel, to speak, and to hear. The employee is occasionally required to walk, sit, reach with hands and arms, bend, kneel, crouch, or crawl. The employee must frequently lift and/or move up to thirty-five (35) pounds.\n\n\nSpecific vision abilities required for this job include close (proximity) vision, depth perception, and the ability to adjust focus.\n\n\nWork Environment:\n\n\nThe work environment described here is representative of that which an employee may encounter while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nThe standard analytical laboratory environment is one in which potential health hazards do exist. Administrative, operations, technical, and professional staff are expected to safely operate in accordance with applicable and appropriate health and safety policies and procedures, as prescribed by the applicable Kaycha manuals and policies and/or federal, state, or local standards.\n\n\nLaboratory staff can be expected to work in areas where hazards associated are with, but not limited to, airborne pathogens. Biological materials, hazardous substances, and radioactive material exist and are handled. Appropriate training is provided regarding these hazards and staff are expected to adhere to all health and safety policies at all times, whether they are in writing or verbalized by a supervisor.\n\n\nThe above is intended to describe the general content of and requirements for the performance of this job. It is not to be construed as an exhaustive statement of duties, responsibilities, or physical requirements. Nothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions\n\n\nJob Type: Full-time\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nEmployee discount\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nReferral program\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\nWeekend availability\n\nApplication Question(s):\n\n\nWhat is your desired compensation?\nPlease list the best email address and phone number to reach you.\nAre you open to working weekends and/or evenings when needed?\n\nEducation:\n\n\nBachelor's (Required)\n\nWork Location: One location\n","slug":"analytical-chemist-7b443521-cc47-408b-ba94-47cab8843b73","benefits":["Health savings account","Dental insurance","Employee discount","Health insurance","Referral program"],"selectedSkills":["Laboratory experience","Communication skills","Gas chromatography","Root cause analysis","Bachelor of Science","Bachelor's degree","Master's degree","21 years or older","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=zHFUr2Bjd3FVKSc887_TTlnoxo02Xdwxvs0warFYk8qf_6BgHK4--Q"},{"position":"Scientist I","labName":"Certified Testing and Data","location":"Orlando, FL","age":"1 day ago","type":"Full-time","salaryMin":"$79,000 ","salaryMax":" $110,000 a year","jobDescriptionCopy":"Description:\nDepartment: Chemistry\n\nPosition Title: Scientist I (Instrumentation or Research)\n\nReports to: Chemistry Supervisor or Laboratory Manager (Instrumentation or Research)\n\nPosition Type: Full-time, Non-exempt\n\nCompany Description\n\nCertified Testing and Data - The soon to be premier provider in the cannabis and hemp testing space. Founders have extensive experience in Cannabis as well as leading Multi-Billion dollar lab companies. Opportunity to participate in the growth and success of the company with a stock grant awarded to founding team members. Prior business led by management was top 15 Fastest growing company by Inc 5000. CTND has a great culture, excellent professional growth opportunities, and one of the nicest working lab spaces in the country. Submit your application today.\n\nCertified Testing and Data, an analytical testing facility, provides consultations and analytical results across the entire spectrum of the plant medicine industry. Building on a record of excellence, Certified Testing and Data features one of the largest full-service testing laboratories in the United States. Dedication to personalized service and superior scientific practices is the foundation of Certified Testing and Data success.\n\nJob Description\n\nThe Scientist I for Instrumentation or Research is a subject matter expert high level leadership position wherein professional growth is expected and assessed. Therefore, the Scientist I is expected to demonstrate a teaching attitude and a dedication to improvement by providing transfer of knowledge and careful attention to instruction, answering clarifying questions and developing training as required. The Scientist I has the ability to perform methods and gather data from specialized instrumentation and is expected to have the ability to independently perform all routine analyses including calibration, trouble shooting, method development and training as needed. The Scientist I leads instrumentation operation on a regular basis, ensures the quality of data and operational efficiency. The Scientist I ensures that activities are carried out in accordance with established Standard Operating Procedures (SOPs) and protocols.\n\nResponsibilities and Duties\n\nExpert knowledge of at least one (1) type of instrumentation with the ability to develop methods, identify issues, trouble shoot and work with leadership to resolve them when required.\nInterprets and explains results in conjunction with manager.\nWorks in conjunction with technicians and chemists to ensure a seamless transition from raw sample to final results.\nAssists with special projects requiring long term testing or very specialized technical skill.\nLead problem solving related to procedures or instrumentation to maximize efficiency and lifetime of equipment.\nPrepares reagents and standards, and prepares samples of various matrices to be analyzed on instrumentation.\nPerform any of the responsibilities of the Laboratory technician and chemist if such assistance is required.\nFollows strict adherence to Standard Operating Procedures and follows Good Laboratory Practices to ensure the generation of high quality and reliable data.\nMaintains a neat and organized laboratory notebook for scientific record and maintains maintenance and run logbooks for instruments.\nLeads developing new procedures or techniques, which significantly enhance work quality or cost effectiveness.\nLeads preventive maintenance on instrumentation to maximize instrument lifetime.\nPerform other related duties as needed.\n\n. Requirements:\nWorking knowledge of a broad range of plant medicine products, processes, and cultivation preferred (e.g. Cannabis, Hemp, CBD and Fungi).\nWorking knowledge of regulations (local and federal), Good Laboratory Practices, and current official methods with at least 3 years experience working in an accredited laboratory.\nExcellent oral and written communication skills. Demonstrated expertise in plant medicine safety, quality and value.\nExperience as an CTND Chemistry Chemist III is a plus.\nInstrumentation (e.g. LC, GC, GCMSHS, LCMS, GCMS, ICPMS) experience preferred.\nMust have strong organizational, leadership, and technical skills.\nBasic knowledge of budgeting, sales, business development, and strategic planning preferred.\nAbility to generate respect and trust from staff and external constituencies.\nPhD degree + 3 years laboratory experience or MS/MA degree + 5 years laboratory experience or BS degree + 10 years laboratory experience required\nMust be at least 21 years of age and pass required background check.\n\nPhysical Requirements\n\nThese physical demands are representative of the physical requirements necessary for an employee to successfully perform the essential functions of the job. Reasonable accommodation can be made to enable people with disabilities to perform the described essential functions. While performing the responsibilities of the job, the employee is required to communicate with coworkers and managers by conversing and exchanging information regarding laboratory functions throughout 50% of the work day. The employee is required to stand 50% of most work days, sit 50% of most work days, and use their hands and fingers to record data on laboratory worksheets, enter data into spreadsheet workbooks, enter data into the LIMS system, and perform chemical analyses. The employee is occasionally required to lift up to 50lbs and pull up to 150lbs while performing laboratory duties such storing or retrieving chemicals. The employee must be able to reach. Vision abilities required by this job include close vision to record data on laboratory worksheets, enter data into spreadsheet workbooks, enter data into the LIMS system, and perform chemical analyses. The employee must be able to move about in the laboratory regularly throughout the work day. The employee must be able to occasionally work in extreme cold (below 32 degrees F) temperatures when retrieving samples, cleaning out retained samples and reorganizing stored samples. The employee must be able to tolerate moderate amounts of noise from laboratory equipment. The employee must be able to regularly tolerate very strong chemical odors. Provided with proper protective equipment, the employee must work with chemical hazards.","slug":"scientist-i-87ddd6d3-24f9-4350-8622-67bb40e02985","benefits":[],"selectedSkills":["GLP","Budgeting","Business development","Strategic planning","Laboratory experience","Doctoral degree","Bachelor of Science","Bachelor's degree","Master's degree","Doctor of Philosophy","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=Iuc00U24HMjLT39rm0zMTbgF_zXaikg0tdVxSFYjv26P0EHq0Po5aQ"},{"position":"LC-MS Analyst","labName":"Green Scientific Labs","location":"Phoenix, AZ","age":"3 days ago","type":"Full-time","jobDescriptionCopy":"The LC-MS Analyst prepares and analyzes cannabis, hemp, CBD, and other samples using both standard and complex testing according to scientific and standard methodology in compliance with Green Scientific Laboratory’s Quality Assurance programs and SOP’s, validates and reviews data for accuracy through Level I reviews. Must be knowledgeable of a broad range of laboratory testing equipment requiring the exercise of discretion and judgment in its operation.\n\n\nLC-MS Analyst responsibilities include, but are not limited to, the following:\n\n\nBatch and prep samples for analysis taking into account special and varied client and QA requirements\nMake reagents for sample analysis\nPrepare appropriate standards to ensure compliant data\nOperate, calibrate, and maintain laboratory instrumentation\nAssist in training new analysts on laboratory procedure\nPerform Level I and II review of data produced to ensure accuracy\nAid management in special sample preparation requests\nLog nonconformances and/or deviations for projects related to QA issues\nMonitor refrigerator temperatures\nMaintain logbooks\nResponsible for performing job functions within Green Scientific’s EHS and QA standards\nMaintain housekeeping standards for work area\nInventory and stock laboratory supplies\nRequest supply orders\nWash and inventory glassware\nDispose of analyzed samples\nAssist in other areas of laboratory when needed\nUpload laboratory data into LIMS system, including QC charts and data packages\n\nBasic Minimum Qualifications:\n\n\nBS or BA in chemistry or related field\nMinimum 2 years’ experience in operation, maintenance, and calibration of LC-MS and/or LC-MS/MS instrumentation\nPrevious production-oriented work is a plus\nAuthorization to work in the United States indefinitely without restriction or sponsorship\nMust pass an extensive level 2 background check\n\nJob Type: Full-time\n\n\nPay: From $45,000.00 per year\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\n\nEducation:\n\n\nBachelor's (Required)\n\nWork Location: One location\n","slug":"lcms-analyst-e802c0bb-61d4-4adb-ae22-ce9ff9a0af34","benefits":["Paid time off","Dental insurance","Health insurance","Vision insurance"],"selectedSkills":["Bachelor of Science","Bachelor's degree","Background check","US work authorization"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=S4OgQoKvsdIgPhvGanRcF2HZzf9yaS8-KBQ-ZwJMIoqkMd-L78XVUA"},{"position":"Lead Lab Technician","labName":"Green Thumb","location":"Paterson, NJ","age":"5 days ago","salaryMin":"$31,000 ","salaryMax":" $42,000 a year","jobDescriptionCopy":"The Role\n\nEvery day in the lab, our team works the magic of distillation, extraction, winterization, and the production of our cannabis-infused products. The Lab Technician is there to grind away at the day to day details that go into running the lab. The ideal candidate is a positive team-player with an extra dab of attention to detail. As a naturally curious human, you will study and comprehend all policies, procedures and operational guidelines set by the management team to help our lab team achieve the high standards we set for ourselves. Provides direction to team in absence of Lab Supervisor.\n\nResponsibilities\nLeads and assures accurate preparation of oil and MIP formulations\nMaintains inventory of respective space\nResponsible for hygiene, organization, and overall appearance of laboratory\nFamiliarity with basic scientific principles and laboratory experience. Can follow written direction and maintain a laboratory notebook\nSolves equipment failures and works with leadership to address more complicated issues and preventative maintenance\nMust follow all applicable policies, procedures and guidelines. This includes the safe and proper operation of any/all applicable machinery, instrumentation, and equipment\nSets up, operates, and maintains laboratory instruments, monitor experiments, makes observations, calculates and records results\nPerforms analytical testing, i.e. HPLC testing, and monitors product disposition to support quality control\nMaintains and enforces Chemical Hygiene Policy and related labeling\nEmployee may also be responsible for monitoring production line and collecting samples for analysis\nFollow SOP and standard analytical procedures to meet Good Laboratory Practices and Good Manufacturing Practices compliance\nRecords data in lab notebooks, computer databases, and test reports\nGood communication skills, verbal and written, with co-workers and management\nPractice good housekeeping habits throughout the facility with focus and personal contributions towards a clean and organized assigned work area at the end of the assigned shift\nCapable of working with hazardous chemicals and is able to identify and report unsafe equipment, conditions and practices so that they may be corrected prior to an incident\nFlexibility and the ability to shift work schedule according to production needs\nProvides direction and supervision to Lab Tech and Lab Tech Senior\nSome technical writing\nOther duties as assigned\nQualifications\nAbility to establish and maintain effective working relationships with all employees\nBasic to intermediate math skills\nFamiliarity with OSHA guidelines for dealing with hazardous chemicals\nUnderstanding & adhering to applicable federal, state and local laws and regulations as they pertain to the industry, safety regulations, local municipal codes and organizational rules, regulations, directives and standard operating procedures\nAbility to use standard office equipment, computer equipment and software including word processing, database management, spreadsheet applications and email\nKnowledge of laboratory best practices\nExperience as a Laboratory Technician\nAssociates or Bachelor's degree in biology, chemistry, or physics\nIntermediate level Laboratory experience\nEquivalent combinations of education and experience may be considered, including internal experience\nAdditional Requirements\nMust pass any and all required background checks\nMust be and remain compliant with all legal or company regulations for working in the industry\nMust be a minimum of 21 years of age\nMust be approved by the D.O.A. to receive an Agent badge\nWorking Conditions\nWhile performing the duties of this job, the employee is regularly required to perform grasping, talking, hearing, seeing and repetitive motions.\nPhysical demands – May be required to stand and/or walk for extended periods of time. Must be able to lift, carry and balance up to 50 pounds (200 pounds with assistance)","slug":"lead-lab-technician-8d7e6b31-16e7-4010-b809-92e66700c6f2","benefits":[],"selectedSkills":["Laboratory experience","Database management","Communication skills","OSHA","Bachelor's degree","Associate's degree","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=czQCPfGib6xHtCOMku6cVh6qdkL4MAAu5mrxa7raG4O2EueHBKsjbg"},{"position":"Laboratory Supervisor","labName":"Holistic Industries","location":"Monson, MA","age":"1 day ago","type":"Full-time","salaryMin":"$54,000 ","salaryMax":" $77,000 a year","jobDescriptionCopy":"About Us:\nAt Holistic Industries we are building a great place to work, shop and invest in cannabis. Our mission is to provide patients and customers with the highest quality, safest cannabis medicine possible. As our name suggests, we care for the whole person. Scaling from a seed of inspiration in 2011, Holistic Industries is now one of the largest and fastest growing private MSOs (Multi-State Operators) in the country. We're able to deliver consistent value to employees, patients, and investors because of the values that drive our work - how we do business and why. We have one of the most seasoned teams in the industry, a budding \"Greenhouse of Brands\" and a meaningful model of doing well by doing good. Our company develops and offers a wide range of proprietary strains that increase desired cannabinoids such as CBD. These high CBD strains have become our foundation for growing, packaging, and selling the best cannabis in our markets. We are committed to harvesting and crafting industry-leading strains, consumer brands, and medical-grade products based on the most progressive science in the space. Holistic Industries has a unique model and approach that enables it to win licenses, scale operations and introduce national brands successfully in highly regulated markets. The company has proven to be responsible stewards of capital since its inception by sourcing licenses on merit rather than simply acquiring them on the open market. A \"GREENHOUSE OF BRANDS\" beginning with our flagship retail and wholesale brand, Liberty Cannabis, we continue to prove our ability to launch new brands from scratch and attract noteworthy partners.\nWe are deeply and actively committed to the communities we serve; our efforts under Liberty Cannabis Cares are focused on four pillars: Social Equity, Diversity, Community, and Cannabis Literacy.\nOur team includes the nation’s most knowledgeable experts in cultivation and medical dispensing, along with professionals who are top of their fields in medical professions, security, agriculture, real estate, and the legal distribution of other highly controlled substances. We are a team of best-in-class executives and staff from within and outside the industry who share a passion for advancing cannabis products and retail experience at scale.\nOur well-established company is growing rapidly and adding to our team of professionals and specialists. Our employees receive PTO, paid Sick Leave, medical, dental, vision and other leave benefits as part of our highly competitive compensation package. Join us as we build a great place to work, shop, and invest.\nHolistic Industries is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.\n\nAbout the Job:\nThe Laboratory Supervisor acts as an assistant to the Processing Manager. This position will work to organize and maintain laboratory operations and procedures, handle daily operations with a focus on efficiency and time management, maintain intra-office/lab communication protocols, streamline administrative procedures, inventory control, and task delegation.\nAssist Processing Manager in management of day-to-day laboratory operations\nSupervise and assign daily tasks of laboratory technicians, packaging supervisor and packaging laborers\nAssist with production scheduling to ensure turnaround times are maintained, coordinated and communicated among laboratory, sales and administrative personnel\nResponsible for ensuring adherence to all laboratory scheduling including, but not limited to: production, equipment maintenance, sanitation SOPs, annual personelle training and safety inspections\nEnsure the lab is well organized, workflows are streamlined, and hold regular meetings with laboratory staff to set work priorities\nAssist Processing Manager to identify and implement procedural and policy changes to improve lab operational efficiency\nOversees Quality Assurance of all batch records and data collection for laboratory and packaging processes\nMaintains laboratory and packaging reports, records and files\nEnsure personnel are trained on SOPs\nMaintain laboratory consumables inventory and manages ordering\nPerforms data and inventory audits to ensure accuracy and ahearance to corporate and state mandated regulations\nCoordinate workflow and work schedules from sampler dispatch through testing and reporting of data to customers\nWork with 3rd party laboratories to submit samples and interpret data results\nRequired to maintain strict adherence to safety and Quality Assurance protocols\nPhysical Demands: VERY LABOR INTENSIVE. Must be able to lift, carry and balance up to 75 pounds (125 pounds with assistance), may include walking or standing for extended periods of time, as well as stooping, bending over and/or crouching. Moderate to loud exposure to noise level.\n\nAbout You:\nGeneral\nRegulations require that incumbent be at least 21 years of age and able to obtain and maintain state marijuana work credentials\n\nEducation/Experience:\nBachelor’s Degree in a related field required\nPrevious marijuana industry experience preferred with priority given to candidates with experience in licensed facilities\n3+ yrs experience in laboratory operations\n1+ yrs management experience preferred\n\nTechnological Skills:\nAbility to use standard office equipment, computer equipment and software including word processing, database management, spreadsheet applications and email\n\nRequired Knowledge and Skills:\nExcellent management skills with demonstrated ability to manage complex projects and technical team\nHighly detail oriented and organized, critical eye for optimizing workflows\nExcellent communication skills with ability to clearly and succinctly explain organizational goals and specific tasks\nAbility to inspire and motivate employees; encourage productivity, teamwork, and a collaborative environment\nDemonstrate effective delegation of tasks\nAbility to manage and develop key performance indicators of staff members\nExcellent problem solving and critical thinking skills with demonstrated ability to gather information and develop solutions\nEffectively manage changing priorities and remain calm under pressure\nStrong organizational and planning skills\nDemonstrate responsibility, accountability, and dependability toward assigned tasks and duties\nDisplays professionalism and positive attitude toward assigned tasks, projects and colleagues\nStrong ethics and sound judgment\nMust be able to successfully pass a thorough internal and external background check.","slug":"laboratory-supervisor-3e0fc373-21a5-435e-a16b-9ec5badc9d25","benefits":["Dental insurance","Health insurance","Paid time off","Paid sick time","Vision insurance"],"selectedSkills":["Database management","Laboratory procedures","Data collection","Laboratory experience","Communication skills","Bachelor's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=iWxqC8kSebvmVgbw0WHcXXkeAAXtkiGu019_A7YUmagfPZV6nk_SZQ"},{"position":"Processing Lab Technician","labName":"Curaleaf","location":"Webster, MA","age":"3 days ago","salaryMin":"$36,000 ","salaryMax":" $50,000 a year","jobDescriptionCopy":"Curaleaf Holdings, Inc. (CSE: CURA) (OTCQX: CURLF) (\"Curaleaf\") is a leading international provider of consumer products in cannabis, with a mission to improve lives by providing clarity around cannabis and confidence around consumption. As a high-growth cannabis company known for quality, expertise, and reliability, the company and its brands, including Curaleaf and Select provide industry-leading service, product selection, and accessibility across the medical and adult-use markets. In the United States, Curaleaf currently operates in 23 states with 130 dispensaries, 25 cultivation sites, and over 30 processing sites, and employs over 5,000 team members. Curaleaf International is the leading vertically integrated cannabis company in Europe with a unique supply and distribution network throughout the European market, bringing together pioneering science and research with cutting-edge cultivation, extraction, and production. Home | Curaleaf | Cannabis with Confidence\n\nOur corporate social responsibility is Rooted In Good Diversity, Equity, Inclusion + Social Equity + Sustainability Social Responsibility | Curaleaf | Cannabis with Confidence We believe in taking corporate and social responsibility very seriously, from our educational outreach to national partnerships, state-wide initiatives and local causes. Giving back to the communities where we operate is important to us, and helps to change old attitudes by showing the positive impact of cannabis in creating jobs, changing lives, and helping local communities.\n\nWe educate. We advocate. We give.\n\nWe are looking for a Laboratory Technician to join our growing team! The Laboratory Technician will work within the Processing Laboratory Department and report to the Lab Manager. The Laboratory Technician will assist the Lab Manager by carrying out day-to-day tasks. This task includes but are not limited to: Prepping chemicals, preventative maintenance, Calibration, Tracking, Documenting, Packaging, Labeling, and Cleaning, in accordance with the state of Massachusetts and standards set by Curaleaf. It is expected that you will learn and be able to perform all tasks within the laboratory area.\n\nPrimary Duties and Responsibilities:\nKeeping their workspace clean (cleaning glassware, wiping down their work station, mopping, etc.)\nTracking data through paperwork and on an iPad using our electronic batch record system\nUsing our internal tracking systems BioTrack and METRC\nResponsible for increasing operational efficiency and reducing waste through ownership, teamwork, communication and collaboration.\nPerform in-process and post-process quality assurance testing and conducting visual inspections to ensure all product meets or exceed CL's specifications and patient's expectations.\nEnsures 100% compliance involving proper weighing, data recording, product tracking and security throughout all processes.\nConsistently operates in an efficient manner that also complies with all OSHA regulations, CSATC SOP's, CL SOP's, and all applicable required procedures\nResponsible for ensuring each product is properly labeled in compliance with the MA Regulations\nTake instructions and help out on tasks delegated by laboratory management\nResponsible for the preparation of material to be processed in accordance with daily task\nEnsures consistency and efficacy of product through quality control testing\nPerforms all other assigned duties required to ensure a clean and safe production facility\nHas understanding of Good Manufacturing Practices (GMP) and all safety procedures to ensure the highest level of safety\nCompletes the sanitation of all production equipment and tools including workspace, all equipment, containers, and appliances\n\nQualifications:\nMust be at least 21 years of age\nAbility to pass a national background check per state cannabis regulations\nHigh School diploma or General Education Diploma (GED)\nExcellent verbal interpersonal communication skills to interact with team members\nMust possess basic math skills\nMust have be highly organized with strong attention to detail\nHave an understanding of weights and measurements\nMust be comfortable working in fast paced environment\nMust have the ability to adapt\nExperience with safe handling and proper disposal of harmful chemicals and hazardous waste\nAdaptable/flexible and able to work in an ever-changing environment\nPrevious agriculture or manufacturing experience preferred but not required\nAbility to work independently throughout a workday with given directive\nAbility to travel approximately 5%\n\nPhysical Requirements:\nStanding, bending, and lifting-up to 50 pounds, carrying product totes, pushing carts, moving and making adjustments to process equipment\nHave the ability to climb and work on raised platforms\nClose vision (clear vision at 20 inches or less)\nManual dexterity sufficient to reach/handle items, work with fingers\n\nFacility Environment\n\nAllergen warnings -Potential exposure to dust, pollen, and plant pathogens\nExposure to cleaning solvents, such as high volumes of isopropyl alcohol\nAll jobs require daily use of provided PPE, such as masks, hair nets, beard covers, respirators, boot covers, scrubs, non-slip shoes, and Tyvek suits as necessary\nExposure to loud noises, including but not limited to air compressors, packaging equipment, and alarms\nExposure to CO2 manufacturing procedures at OSHA approved CO2 levels\nHigh stress tolerance, adaptable, ability to work in an ever-changing environment, flexible\n\nCuraleaf is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.","slug":"processing-lab-technician-c5fe91a7-014c-4282-8da6-6fe1d70e1b1f","benefits":["Safety equipment provided"],"selectedSkills":["Communication skills","Manufacturing","Basic math","Agriculture","CGMP","High school diploma or GED","Background check","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=sEI0Dn3aNBeudyC0TeFwrResJQxZk71-O5-0SrzYD9l-1tBvMBvFKw"},{"position":"Lab Technician, Extraction","labName":"Kaycha Labs","location":"Natick, MA","age":"3 days ago","type":"Full-time","salaryMin":"$18 an hour","jobDescriptionCopy":"Company Overview:\n\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\n\nJob Purpose:\n\n\nThe Lab Technician is responsible for working closely with our laboratory team to develop analytical skills and related experience. This position consists of many aspects from homogenizing, weighing and extracting samples, performing quality control checks, verifying various support equipment and properly disposing of all waste.\n\n\nEssential Duties & Responsibilities:\n\n\nExecute laboratory protocol and procedures under the supervision of the Lab Director.\nRegularly display good laboratory technique to avoid cross-contamination or misidentified samples.\nPerform sample preparation procedures including homogenization, weighing and liquid extraction.\nPerform QC duties as assigned, including LCS and matrix spikes.\nPerform qualitative and quantitative tests, as assigned.\nUtilize the LIMS system to create batches, enter sample prep information and maintain physical and electronic records.\nAdhere to ISO 17025 standards as well as state regulatory requirements.\nPromote a strong customer service culture while adhering to the highest safety and industry standards.\nOther duties and/or special projects as assigned.\n\nSkills, Abilities and Competencies:\n\n\nAbility to maintain an incredibly high degree of attention to detail and accuracy.\nStrong agility, engagement, and flexibility in an ever-changing environment.\nWorking knowledge of logging, organizing, and analyzing data.\nAbility to work in a dynamic, fast-paced deadline environment while successfully managing multiple tasks.\nStrong knowledge of Microsoft Office, including Excel, PowerPoint, and Word.\nWorking knowledge of standard laboratory protocol.\nExcellent communication skills and ability to effectively work, problem solve, and communicate with multiple levels of the organization.\n\nEducation & Experience:\n\n\nMinimum of Bachelor’s degree in chemistry, biochemistry or related field based on state requirements.\n0-1 year of lab experience.\nKnowledge of principles, terminology, practices, techniques commonly used in a laboratory setting preferred.\nExposure to the cannabis industry is a plus.\n\nOther:\n\n\nMust pass Level 2 background check.\nMust be at least 21 years old.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status\n\nJob Type: Full-time\n\n\nPay: $18.00 per hour\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nEmployee assistance program\nFlexible spending account\nHealth insurance\nLife insurance\nPaid time off\nReferral program\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nMonday to Friday\nWeekend availability\n\nCOVID-19 considerations:\nFace masks required for non vaccinated employees.\n\n\nApplication Question(s):\n\n\nWhat is your desired compensation?\nWhat is the best phone # and email to reach you at?\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nLaboratory Experience: 1 year (Preferred)\n\nWork Location: One location\n","slug":"lab-technician-extraction-e09bcf19-d656-430d-a996-044b5f06034a","benefits":["Dental insurance","Health insurance","Referral program","401(k)","Flexible spending account"],"selectedSkills":["Microsoft Excel","Microsoft Powerpoint","Laboratory experience","Communication skills","Microsoft Office","Bachelor's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=uorxrUa0Y6Dap39OdjsbZHXL7MeDG9PFsTLa9Oha_PGG6QTwDJ84wA"},{"position":"Laboratory Analyst III","labName":"CB Labs Novato","location":"Novato, CA","age":"2 days ago","type":"Full-time","salaryMin":"$70,000 ","salaryMax":" $80,000 a year","jobDescriptionCopy":"Job Overview: This position will be responsible for performing chemical extraction procedures on a variety of cannabis and hemp products as well as performing sample preparation and analysis for cannabinoid content and other analytes using one or more of these instruments; HPLC, GC-MS, LC-MS, ICP-MS, and PCR. Perform lab start up and shut down duties. Additionally, include ability to perform the full range of laboratory technician assignments and directing the overall extraction and preparation of samples for analysis.\n\n\nResponsibilities\n\n\n· Understands rules and regulations that apply to sample preparation\n\n\n· Follows and ensures strict lab safe environment\n\n\n· Produces reliable and precise data to support scientific investigation\n\n\n· Operates standard lab equipment (i.e. scale, centrifuge, pipets, vortex, sonicator)\n\n\n· Carries out routine tasks accurately and following strict methodologies and SOP’s\n\n\n· Maintains a clean laboratory\n\n\n· Maintains client records. Protects client confidentiality by adhering to state and federal privacy laws.\n\n\n· Directs lab resources to efficiently perform extraction and sample preparation\n\n\n· Understands rules and regulations that apply to analytical sample preparation and analysis\n\n\n· Keeps tabs on lab resources and tracks use of consumables.\n\n\n· Directs projects focused on improving extraction methods\n\n\n· Actively training to learn one analytical workflow with goal of becoming proficient to perform that systems sample analysis\n\n\n· This position uses considerable judgment in making decisions requiring the interpretation and application of extraction techniques\n\n\n· Follow detailed Quality System documentation relevant to responsibilities, including the Quality Manual, SOPs, methods, and protocols. Adhere to the proper handling and transport of laboratory test samples.\n\n\n· Performs duties relating to lab and instrument upkeep\n\n\n· Maintain, troubleshoot, calibrate and verify instrument performance\n\n\n· Independently carries out analytical testing analyses\n\n\n· Maintain detailed documentation to ensure we are compliant with required standards\n\n\n· Proficient in the use of basic laboratory hardware such as analytical balances, pipettes, vortexers, and centrifuges.\n\n\n· Perform laboratory house-keeping duties such as cleaning glassware, making solutions, and tracking reagent inventory.\n\n\nQualifications\n\n\n· MUST BE OVER 21 YEARS OLD\n\n\n· Degree, BS or MS in Physical, Chemical, or Biological Sciences\n\n\n· 3-5 years experience in a laboratory setting with knowledge applicable to HPLC, LC-MS, GC-MS and quality management systems.\n\n\n· Knowledge of OSHA, or HIPAA regulation, and HAZMAT guidelines preferred\n\n\n· Experience with basic laboratory tasks such as pipetting\n\n\n· Know basic mathematic calculations related to chemistry\n\n\n· Experience with software applications such as MS Office applications (Word, Excel, and Outlook)\n\n\n· Be meticulous and detail-oriented\n\n\n· Ability to read, speak, write, understand, and follow English verbal and written instructions\n\n\n· Ability to work collaboratively with a team and/or independently\n\n\n· Ability to perform tasks in a high-volume production environment\n\n\n· Capable of organizing multiple tasks, using time management skills\n\n\nCompensation\n\n\nBase Salary Range - $70, 000-$80,000 BOE\n\n\nMedical Benefits after 90 days\n\n\nState Savings program\n\n\nFive (5) paid holidays a year\n\n\nPaid Vacation and Sick Time\n\n\nJob Type: Full-time\n\n\nPay: $70,000.00 - $80,000.00 per year\n\n\nBenefits:\n\n\n401(k)\nHealth insurance\nPaid time off\n\nSchedule:\n\n\n8 hour shift\n\nAbility to commute/relocate:\n\n\nNovato, CA 94947: Reliably commute or planning to relocate before starting work (Required)\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nLaboratory: 2 years (Required)\n\nWork Location: One location\n","slug":"laboratory-analyst-iii-10c11100-5db2-464b-9400-74988175790d","benefits":["Health insurance","Paid time off","401(k)"],"selectedSkills":["Hazmat","Quality management","Microsoft Excel","OSHA","HIPAA","Bachelor of Science","Bachelor's degree","Master's degree","21 years or older","US work authorization"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=bzv54cjXlO4R3S_n1JA25osAPLwhmTiBoj2zl8_sKDsd8Mb-Q5wPCg"},{"position":"Chemist I","labName":"Certified Testing and Data","location":"Orlando, FL","age":"1 day ago","type":"Full-time","salaryMin":"$61,000 ","salaryMax":" $77,000 a year","jobDescriptionCopy":"Description:\nDepartment: Chemistry\n\nPosition Title: Chemist I (Instrumentation or Research)\n\nReports to: Chemistry Supervisor or Laboratory Manager (Instrumentation or Research)\n\nPosition Type: Full-time, Non-exempt\n\nCompany Description\n\nCertified Testing and Data - The soon to be premier provider in the cannabis and hemp testing space. Founders have extensive experience in Cannabis as well as leading Multi-Billion dollar lab companies. Opportunity to participate in the growth and success of the company with a stock grant awarded to founding team members. Prior business led by management was top 15 Fastest growing company by Inc 5000. CTND has a great culture, excellent professional growth opportunities, and one of the nicest working lab spaces in the country. Submit your application today.\n\nCertified Testing and Data, an analytical testing facility, provides consultations and analytical results across the entire spectrum of the plant medicine industry. Building on a record of excellence, Certified Testing and Data features one of the largest full-service testing laboratories in the United States. Dedication to personalized service and superior scientific practices is the foundation of Certified Testing and Data success.\n\nJob Description\n\nThe Chemist I for Instrumentation or Research is an entry level leadership position wherein professional growth is expected and assessed. Therefore, the Chemist I is expected to demonstrate a teachable attitude and a dedication to improvement by paying careful attention to instructions, asking clarifying questions and taking personal notes as required. The Chemist I has the ability to perform methods and gather data from specialized instrumentation and is expected to develop the ability to independently perform all routine analyses including calibration and training as needed. The Chemist I operates instrumentation on a regular basis and ensures the quality of data. The Chemist I ensures that activities are carried out in accordance with established Standard Operating Procedures (SOPs) and protocols.\n\nResponsibilities and Duties\n\nExpert knowledge of at least one (1) type of instrumentation with the ability to identify issues and work with leadership to resolve them when required.\nInterprets and explains results in conjunction with manager.\nWorks in conjunction with technicians to ensure a seamless transition from raw sample to final results.\nAssists with special projects requiring long term testing or very specialized technical skill.\nObserves problem solving related to procedures or instrumentation to maximize efficiency and lifetime of equipment.\nPrepares reagents and standards, and prepares samples of various matrices to be analyzed on instrumentation.\nPerform any of the responsibilities of the Laboratory Technician if such assistance is required.\nFollows strict adherence to Standard Operating Procedures and follows Good Laboratory Practices to ensure the generation of high quality and reliable data.\nMaintains a neat and organized laboratory notebook for scientific record and maintains maintenance and run logbooks for instruments.\nLeads developing new procedures or techniques, which significantly enhance work quality or cost effectiveness.\nLeads preventive maintenance on instrumentation to maximize instrument lifetime.\nPerform other related duties as needed.\n\n. Requirements:\nWorking knowledge of a broad range of plant medicine products, processes, and cultivation preferred (e.g. Cannabis, Hemp, CBD and Fungi).\nWorking knowledge of regulations (local and federal), Good Laboratory Practices, and current official methods with at least 3 years experience working in an accredited laboratory.\nExcellent oral and written communication skills. Demonstrated expertise in plant medicine safety, quality and value.\nExperience as an CTND Chemistry Technician III is a plus.\nInstrumentation (e.g. LC, GC, GCMSHS, LCMS, GCMS, ICPMS) experience preferred.\nMust have strong organizational, leadership, and technical skills.\nBasic knowledge of budgeting, sales, business development, and strategic planning preferred.\nAbility to generate respect and trust from staff and external constituencies.\nBS/BA degree required, MS/MA degree preferred.\nMust be at least 21 years of age and pass required background check.\n\nPhysical Requirements\n\nThese physical demands are representative of the physical requirements necessary for an employee to successfully perform the essential functions of the job. Reasonable accommodation can be made to enable people with disabilities to perform the described essential functions. While performing the responsibilities of the job, the employee is required to communicate with coworkers and managers by conversing and exchanging information regarding laboratory functions throughout 50% of the work day. The employee is required to stand 50% of most work days, sit 50% of most work days, and use their hands and fingers to record data on laboratory worksheets, enter data into spreadsheet workbooks, enter data into the LIMS system, and perform chemical analyses. The employee is occasionally required to lift up to 50lbs and pull up to 150lbs while performing laboratory duties such storing or retrieving chemicals. The employee must be able to reach. Vision abilities required by this job include close vision to record data on laboratory worksheets, enter data into spreadsheet workbooks, enter data into the LIMS system, and perform chemical analyses. The employee must be able to move about in the laboratory regularly throughout the work day. The employee must be able to occasionally work in extreme cold (below 32 degrees F) temperatures when retrieving samples, cleaning out retained samples and reorganizing stored samples. The employee must be able to tolerate moderate amounts of noise from laboratory equipment. The employee must be able to regularly tolerate very strong chemical odors. Provided with proper protective equipment, the employee must work with chemical hazards.","slug":"chemist-i-4a4eb21e-d6a1-47ea-a2dc-d52e435d52d6","benefits":[],"selectedSkills":["GLP","Budgeting","Business development","Strategic planning","Laboratory experience","Bachelor of Science","Bachelor's degree","Master's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=t1ymjnFUSCP4rj2yRMYS5sUPS-ZPWC2_RMU666ozWNuS3PAsjWhCNg"},{"position":"Field Technician","labName":"Viridis Laboratories","location":"Lansing, MI","age":"5 days ago","type":"Full-time","salaryMin":"$17.00 ","salaryMax":" $21.50 an hour","jobDescriptionCopy":"LOCATION: Lansing, MI\n\n\nREPORTS TO: Field Technician Supervisor\n\n\nThe mission of Viridis Laboratories is to ensure health and safety within the cannabis industry by testing cannabis products for potency and purity, and to report results of this testing to consumers, manufacturers and regulatory agencies. As a growing company, we are looking for a full-time Field Technician with cannabis industry experience or experience in random sampling protocols, sample intake, sample tracking and sample storage.\n\n\nESSENTIAL DUTIES AND RESPONSIBILITIES:\n\n\nSample collection, receipt, accessioning and storage.\nFamiliarity/compliance with the chain-of-custody process.\nFamiliarity/compliance with personal protective equipment and its use for safety and in the prevention of cross-contamination of collected samples.\nAssisting scientific staff with ensuring test results are reported through the laboratory information management system to clients, government agencies and other involved or mandated parties.\nAssisting with maintenance of laboratory records and documentation.\nAssisting clients, government agencies and other involved or mandated parties with requests related to laboratory testing or results.\nAssisting with meeting accreditation requirements.\nAssisting with research or inquiries as requested.\nOther duties as assigned.\n\nEDUCATION AND EXPERIENCE REQUIRED:\n\n\nMinimum of high school diploma or relative Military experience\nOne years’ experience in an analytical or academic laboratory setting and/or two years' experience in cannabis industry.\nFamiliarity with data entry and throughput.\nAttention to detail and excellent communication skills.\n\nCOMPENSATION AND BENEFITS PACKAGE:\n\n\nSalary negotiable and commensurate with experience and education (range $17.00 - $21.50/hour). This position is eligible for a matching 401K program and health care benefits.\n\n\nApplicant screening will include a background check. This position requires compliance with random drug testing and on-going random drug testing.\n\n\nApplicants must be at least 21-years-old to be eligible for employment within Michigan's Cannabis industry.'\n'\nWork Location:\n\n\nOne location\n\nWork Remotely\n\n\nNo\n\nJob Type: Full-time\n\n\nPay: $17.00 - $21.50 per hour\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nOvertime\nWeekend availability\n\nCOVID-19 considerations:\nCompany provided PPE\n\n\nAbility to commute/relocate:\n\n\nLansing, MI 48912: Reliably commute or planning to relocate before starting work (Required)\n\nLicense/Certification:\n\n\nDriver's License (Preferred)\n\nWork Location: One location\n","slug":"field-technician-01f543dc-4a97-488d-9970-dd68d4a6e1e8","benefits":["Dental insurance","Health insurance","401(k) matching","Paid time off","401(k)"],"selectedSkills":["Driver's License","Military","Laboratory experience","Communication skills","Data entry","High school diploma or GED","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=8qGFeLidU6jInLG5T3IQ_eAl7mjbNZfF0BJm-Ork3b4cIfW1hRskcA"},{"position":"Cannabis Extraction Lab Technician","labName":"Ocean Breeze Cultivators LLC","location":"Gloucester, MA","age":"4 days ago","type":"Full-time","salaryMin":"$17 ","salaryMax":" $18 an hour","jobDescriptionCopy":"Cannabis Extraction Lab Technician\n\n\nJOB OVERVIEW: The Extraction Lab Technician supports the preparation and execution of the extraction process. This position is responsible for monitoring and maintaining cleanliness, efficacy, and efficiency of the manufacturing processes.\n\n\nThe Extraction LabTechnician will strictly follow the company’s standard operating procedures and quality control measures to maintain production of high-quality products. The position is responsible for carrying out day-to-day tasks including prepping, measuring, extracting, refining, and packaging of cannabis products.\n\n\nThe Extraction Technician must monitor and maintain the laboratory environment in accordance with company needs and state regulations.\n\n\nREPORTS TO: Head of Extraction\n\n\nESSENTIAL RESPONSIBILITIES AND DUTIES • Properly handle pre-extraction plant matter with care and attention. • Perform extractions following standard operating procedures. • Provide vital systematic cleaning and sanitization of the extraction laboratory. • Understand and comply to procedures, methodologies, and compliance steps for tracking cannabis product from seed to sale. • Accurately calibrate scales and balances to ensure proper measurement of products. • Ensure consistency and efficacy of product through quality control testing, standard operating procedures and proper documentation. • Ensure personal hygiene is acceptable before performing any production activities by washing hands, wearing a hair net and other personal protective equipment, etc. • Sanitize all production equipment and tools including workspace, utensils, containers, and machinery. • Assist Head of Extraction with the creation of batch production records and labels in accordance with state regulations. • Assist Head of Extraction with the weighing, packaging, labeling, and documentation of all products, as well as the tracking of batch numbers, lot numbers, and expiration dates. • Ensure the above information is accurate, appropriately documented and listed clearly in accordance with the state regulations and company standard operating procedures. • Additional job duties as assigned.\n\n\nQUALIFICATIONS/ REQUIREMENTS: • Must have knowledge of or in the process of learning about cannabis processing and extraction. • Must have understanding of functions relating to an extraction laboratory. • Familiar with industry terminology and scientific techniques of a commercial cannabis lab. • Ability to work in a fast-paced, changing, and challenging environment. • High level of integrity and a strong work ethic. • Strong interpersonal skills; team player. • Demonstrated ability to work comfortably and effectively within a diverse, multicultural, multigenerational environment. • Must be 21+, with a valid State ID\n\n\nEDUCATION/ EXPERIENCE:\n\n\nRequired: High School Diploma, Bachelor of Science (Preferred)\n\n\nWork Experience: 2 to 3 years working in a team environment.\n\n\nLANGUAGE SKILLS: Ability to read, write and speak English fluently. Ability to read and interpret documents such as standard operating procedures, employee handbook and other company documents.\n\n\nOTHER SKILLS, ABILITIES AND/OR TRAINING: • Knowledge of state medical marijuana regulations • Basic understanding of chemistry. • Committed to providing outstanding service both internally and externally. • Ability to preserve confidentiality of information. • Ability to work as part of a team to achieve company goals. • Ability to work weekends on an occasional basis. • Ability to work extended days on an occasional basis. • Ability to work daytime or evening hours. • Demonstrate accuracy and attention to detail. • Ability to organize and prioritize a variety of tasks/ projects. • Ability to work within strict time frames and resolute deadlines. • Ability to work within the company’s strategic approach as designed by the executive team. Personal transportation.\n\n\nPHYSICAL DEMANDS The physical demands described below are representative of those that must be met to successfully perform the essential responsibilities and duties of this job. Regularly required to do the following activities: • Stand dynamically for long periods without a break. • Use hands to finger, handle, and/or feel; the ability to type, pick, pinch with fingers, seize, hold, grasp or turn with hands and perceive attributes of objects and materials such as size, shape, temperature, or texture, by touching with fingertips • Maintain balance while walking, standing or crouching. • Twist upper torso. • Reach up and out with hands and arms. • Ability to lift 20 to 40 pounds and carry a distance of one hundred feet.\n\n\nJob Type: Full-time\n\n\nPay: $17.00 - $18.00 per hour\n\n\nBenefits:\n\n\nHealth insurance\nPaid time off\n\nSchedule:\n\n\n8 hour shift\n\nAbility to commute/relocate:\n\n\nGloucester, MA 01930: Reliably commute or planning to relocate before starting work (Required)\n\nWork Location: One location\n","slug":"cannabis-extraction-lab-technician-c05fe4f9-cadc-497b-a90e-e08a5761649d","benefits":["Paid time off","Health insurance"],"selectedSkills":["Typing","Bachelor of Science","Bachelor's degree","High school diploma or GED","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=hbClrAEz7XPz4gm11cKoxXDIR6aROQE6YKY35_g3zme5K8kHNt1YDA"},{"position":"President, Chief Operating Officer","labName":"Sonoma Lab Works, LLC","location":"Santa Rosa, CA","age":"2 days ago","type":"Full-time","salaryMin":"$110,000 ","salaryMax":" $150,000 a year","jobDescriptionCopy":"Description:\nSonoma Lab Works is a state-of-the-art laboratory facility in Santa Rosa, California. Licensed by the California Department of Cannabis Control, we engage in scientific testing of cannabis and hemp products for both compliance and research & development purposes. We work closely with our clients to provide knowledge and technology to support expedited time-to-market for their products. Our unmatched ability to tie accuracy and precision of testing to speed of results for our clients enables our business to thrive. Visit http://www.sonomalabworks.com for more information.\n\nJob Summary:\nReporting to the Chairman & CEO of Sonoma Lab Works, the President & Chief Operations Officer will plan, direct, coordinate, and oversee board and investor relations, annual business plans and strategies, business development, revenue growth and customer acquisition and retention strategies, government relations, and public relations. The President will work closely with the Chief Operating Officer at Kenwood Investments. In addition, the President will work with the Chief Financial Officer, Human Resources Director, and General Counsel to oversee Company activities, ensuring development and implementation of efficient operations and cost-effective systems to meet the Company’s current and future needs. This is a full-time job, and the President will be expected to regularly work from the Company’s Santa Rosa, California headquarters. The position of President is an exempt, at-will employment position and is subject to and conditioned upon the President’s execution of the Company’s written employment agreement.\n\n. Requirements:\nDuties/Responsibilities:\nPlan and monitor the day-to-day operations.\nProvide day-to-day leadership and management to support the mission and core values of the company.\nResponsible for ensuring all company policies are upheld and all company-provided standard operating procedures are adhered to along with Lab Director and Chief Science Officer.\nSolve workflow issues that may arise, handle inter-departmental communication and work with Human Resources and Management to help build a culture based on the company’s core value system and commitment.\nCreate work schedules and flow for both weekday and weekend work allowing for adequate coverage for regular and holiday schedules.\nWork with Human Resources to develop training programs including onboarding and continued quarterly/annual training needs.\nAnalyzing data and reporting trends to the President and senior management.\nOversee the maintenance and facilities personnel upholding the highest levels of cleanliness and sterilization of the administrative and common areas of the building.\nEstablishes, implements, and communicates the strategic direction of the organization’s operations.\nCollaborates with executive leadership to develop and meet company goals while supplying expertise and guidance on operations projects and systems.\nIdentifies, recommends, and implements new processes, technologies, and systems to improve and streamline organizational processes and use of resources and materials.\nEnsures that departmental decisions and project plans such as those for staffing, development, organization, material efficiency, hardware acquisitions, and facilities are in line with the organization’s business plan and vision.\nEnsure that the laboratory operates in accordance with the ISO- 17025 Laboratory Standard.\nManage negotiations with global suppliers and vendors.\nImplement key performance indicators to drive improvements while providing leadership and growing the team.\nWork with cross-functional leaders to align and execute overall strategies.\nEstablishes, communicates, and implements operations-related policies, practices, standards, and security measures to ensure effective and consistent support and execution.\nReviews and approves cost-control reports, cost estimates, and staffing requirements for projects.\nEstablishes and administers the department’s budget.\nPresents periodic performance reports and metrics to the executive team.\nMaintains knowledge of emerging technologies and trends in operations management.\nIdentifies training needs and ensures proper training is developed and provided.\n\nSupervisory Responsibilities:\nRecruits, interviews, and trains staff for lab operations.\nOversees the daily workflow of the lab.\nProvides constructive and timely performance evaluations.\nHandles discipline and termination of employees in accordance with company policy.\n\nRequired Skills/Abilities:\nExcellent verbal and written communication skills.\nStrong supervisory and leadership skills.\nExtensive knowledge of the principles, procedures, and best practices in the industry.\nExcellent organizational skills and attention to detail.\nStrong analytical and problem-solving skills.\nIn-depth knowledge of laboratory instruments and equipment.\nProficient with Microsoft Office Suite and laboratory data management software.\nKnowledge of OSHA\nKnowledge of the CA Department of Cannabis Control Regulations\n\nEducation and Experience:\nBachelor’s degree in Biology, Chemistry, Business Administration, or other industry-related field required; advanced degree preferred\nAt least 10 years of industry-related experience including four years in executive management required.\n\nPhysical Requirements:\nProlonged periods of sitting at a desk and working on a computer.\nAble to travel by air and auto, overnight travel occasionally required.\n\nSonoma Lab Works is an equal opportunity employer. We consider qualified applicants without regard to race, color, religion, sex, national origin, sexual orientation, disability, gender identity, protected veteran status, or other protected class.","slug":"president-chief-operating-officer-659317f2-cb45-4de6-a9b9-ea023a33f3a3","benefits":[],"selectedSkills":["Analysis skills","OSHA","Leadership","Communication skills","Microsoft Office","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=wIcFXIueTHlm-wd9mi2q3WDClhLdtItmxuosJiLTOyM2qV1YCU81qQ"},{"position":"Microbiology Technician","labName":"Highgrade Labs","location":"Phoenix, AZ","age":"5 days ago","type":"Full-time","salaryMin":"$15 an hour","jobDescriptionCopy":"Highgrade Labs of Arizona is seeking a full-time Microbiology Technician to assist in preparation and analysis of cannabis products for microbiological contaminants. This position reports to the Microbiologist and assists the Lab Director in receiving and preparing clients samples for testing according to approved SOPs and good microbiological laboratory practices (GMLP). This position will assist the lab in testing completed cannabis products (including flower, edibles, topicals and concentrates) for e. coli, salmonella, aspergillus, HLV, shelf life, and other tests as they become approved methods of analysis by the Arizona Department of Health Services (ADHS).\n\n\nResponsibilities\n\n\n· Adhere to ISO17025 and ADHS requirements\n\n\n· Learn or perform aseptic sampling and handling techniques according to GMLP\n\n\n· Assist in the detection of microbiological contaminants using pathogen detection testing methods such as aerobic and coliform count plates, as well as quantitative polymerase chain reaction (qPCR)\n\n\n· Accurately record and maintain records containing sample data, analytical data, and logs of critical steps in sample preparation\n\n\n· Prepare SOPs, protocols, scientific reports, and technical documents\n\n\n· Perform preventative or corrective maintenance on microbiological instruments, pipettes, dispensettes, and workspaces\n\n\n· Work independently while retaining self-motivation & function as an influential team player\n\n\nPreferred Qualifications\n\n\n· Bachelor of Science in Biology or Microbiology\n\n\n· 1-3 years of laboratory experience\n\n\n· Experience analyzing samples using qPCR instruments\n\n\n· Experience analyzing samples using plating techniques\n\n\n· Keen attention to detail in preventing contamination and the correct reporting of test results\n\n\n· Strong communication skills (written and oral)\n\n\n· Ability to collaborate cross-functionally with team members on various projects\n\n\n· Ideal candidates are comfortable seeking input from colleagues in times of limited supervision or guidance\n\n\nRelevant Experience\n\n\n· Cannabis or hemp testing\n\n\n· Food Testing\n\n\nAbout our Company\n\n\nHighgrade Labs of Arizona is a Phoenix-based hemp and cannabis testing laboratory. Highgrade Labs was founded in Oklahoma in 2019, and now has accredited labs in Oklahoma, Arizona, Maryland, and New Jersey. We are a veteran-owned, and entrepreneurial minded Company focused on becoming the local standard for reliability in our test results, turnaround time dependability, and overall quality as a testing service provider. We are looking to build upon our strong foundation of competent, thoughtful, and motivated scientists and professionals to support our growth in the rapidly-evolving cannabis industry.\n\n\nJob Type: Full-time\n\n\nPay: $15.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nFlexible schedule\nHealth insurance\nPaid time off\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\nNo nights\nNo weekends\n\nSupplemental Pay:\n\n\nBonus pay\n\nAbility to commute/relocate:\n\n\nPhoenix, AZ: Reliably commute or planning to relocate before starting work (Required)\n\nWork Location: One location\n","slug":"microbiology-technician-e12df818-cdc8-41d3-994b-f43099667ee8","benefits":["Dental insurance","Health insurance","Paid time off","Flexible schedule"],"selectedSkills":["Laboratory experience","Communication skills","Bachelor of Science","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=_ii-eCxQ2Qmjv3aGPJzy8gxaFtj0C9vGC2pXK3XehlKD2hoCjO_O0g"},{"position":"Medical Doctor","labName":"CannaMD","location":"Lake Mary, FL","age":"3 days ago","type":"Part-time | Contract","jobDescriptionCopy":"CannaMD is one of the fastest growing networks of medical marijuana physicians in Florida. With statewide locations, CannaMD prides itself on providing compassionate care to Florida patients through evidence-based application of medical cannabis research.\n\n\nWe are currently looking for a personable, tech-savvy physician to oversee our Tallahassee office part time. We’ve already established a strong area presence in this market, and look forward to entrusting the right candidate with a sizable, already established patient-base preferred.\n\n\n1-2 days per week to start, can grow to 4-5 days per week if candidate prefers.\n\n\nIn accordance with state law, all CannaMD physicians must hold an active, unrestricted license as either an allopathic physician or osteopathic physician and be in compliance with all state-mandated education requirements. At this time, educational requirements include completing an annual course and exam administered by either the Florida Medical Association or Florida Osteopathic Medical Association.\n\n\nAlso in line with Senate Bill 8A, CannaMD physicians may not be employed by, or have any direct or indirect economic interest in, any medical marijuana treatment centers or marijuana testing laboratories.\n\n\nCannaMD may, at its discretion, provide industry training and/or reimbursement for state-required licensure, fees, and courses.\n\n\nVery competitive compensation arrangements available. Please inquire for more information.\n\n\nJob Types: Part-time, Contract\n\n\nPay: Up to $240,000.00 per year\n\n\nBenefits:\n\n\nEmployee discount\nFlexible schedule\n\nSchedule:\n\n\nDay shift\n\nCOVID-19 considerations:\nCannaMD follows all CDC guidelines in regards to COVID 19\n\n\nLicense/Certification:\n\n\nBC/BE (Preferred)\nMedical License (Preferred)\n\nWillingness to travel:\n\n\n25% (Preferred)\n\nWork Location: Multiple Locations\n","slug":"medical-doctor-6617a3c9-4fb2-444a-ad22-4c0ba2bd49b2","benefits":["Employee discount","Flexible schedule"],"selectedSkills":["BC/BE","Medical License","US work authorization"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=5jcYaSIHB0OqhPvOv8xWMMyQ0_ViJfXPk4D49wxKT-CLFmxHXTaCwQ"}]