[{"position":"Lab Technician","labName":"Pure Labs AZ","location":"Phoenix, AZ","age":"1 day ago","salaryMin":"$35,000 ","salaryMax":" $47,000 a year","jobDescriptionCopy":"Follow all of our SOP regarding sample testing, lab safety, and all other SOPs.\nEnsures consistency and efficiency of product through quality control testing and procedures.\nMaintain compliance with company policies and procedures.\nMaintain compliance with all AZ DHS regulations and laws.\nMaintain inventory records of supplies, materials, and equipment.\nMaintains strict inventory records of all plant materials, chemicals, and equipment.\nStores supplies and equipment and disposal of waste according to Pure Lab SOPs.\nClean and maintain our testing facility which includes the cleaning and sanitization of all testing equipment, work surfaces, and tools.\nDiligently work in a focused, quick and efficient manner which includes cross training throughout our lab.\nPerform clerical work related to laboratory activities: record keeping, filing, and use of LIMS.\nResponsibly and carefully handle all products throughout the process so as to maintain a high degree of quality control.\n\nPlease submit your resume with a cover letter for consideration. We are hiring now. Join THE top cannabis testing lab in Arizona.\n\nContact Us to apply.","slug":"lab-technician-066e7516-095e-491d-a521-9d146f608571","benefits":[],"selectedSkills":[],"jobType":"free","applyURL":"https://purelabsaz.com/careers/"},{"position":"Micropropagation Manager - Rocky Hill","labName":"CT Pharma","location":"Rocky Hill, CT","age":"2 days ago","salaryMin":"$29,000 ","salaryMax":" $40,000 a year","jobDescriptionCopy":"Job Summary:\nThe Micropropagation Manager is responsible for coordinating and supervising the micropropagation process and ensuring all pertinent SOPs are being followed. In addition, the manager will oversee the micropropagation department and provide regular coaching and development opportunities to ensure continual team growth and improve productivity.\n\nEssential Duties and Responsibilities:\nPrimary duties include protocol development, implementation, scheduling, and production coordination of cultivars through micropropagation with the laboratory director and operations manager.\nThe RT-PCR plant diagnostics ie. pathogen, viral, sex screening.\nMaintaining product tracking records, generating analytical reports, inventories, maintaining COA's and SDS's for consumables.\nSecondary duties include ordering of consumables that are related to laboratory function and testing.\nThe maintenance and cleaning of the laboratory facilities and equipment.\nCreate, develop, and utilize resources to provide training to assistant managers.\nMotivate team by creating daily goals, rewarding staff, or providing constructive feedback based on achievements.\nImplement and enforce SOPs, methods, policies, objectives to advance micropropagation, and ensure continuing operations to increase productivity and regulatory compliance.\nMonitor and maintain quality control measures in accordance with state and local laws.\nAdhere to enforce company policies and Standard Operating Procedures (SOP).\nMaintain a clean and safe working environment within the facility and production areas.\nWork within company continuous improvement system and strive to increase productivity.\nRegularly clean and sanitize propagation equipment, tools, and work areas, including trimming machine, containers, and workstation.\nProvide support to additional cultivation, harvest, and production teams as needed to achieve facility production goals.\nPerform other duties as assigned by management.\n\nMinimum Qualifications:\nMicropropagation experience is required.\nHorticulture, Plant biotech, tissue culture, and aseptic technique experience\nLarge scale micropropagation for production level experience\nExcellent organizational and interpersonal communication skills.\nMust have a positive attitude and work well with others in a team environment.\nEffective time management and multitasking skills.\nAbility to sit and stand for at least 8 hours per day, lifting up to 25 pounds.\nMust be authorized to work in the United States.\nMust be 21 years of age or older and able to successfully register with the state's cannabis commission as an agent.\nMust comply with all laws, regulations, and policies associated with the industry.\n\nPreferred Qualifications:\nPrevious experience in a regulated production facility (food, beverage, CPG, etc.) preferred.\n1 year Management experience preferred\n\nPhysical and Mental Demands:\nWhile performing the duties of this job, the employee is frequently required to remain in a stationary position, move and/or position oneself, communicate, operate and/or prepare, place, position objects, tools, or controls. The employee must occasionally move packages weighing up to 25 lb. Specific vision abilities required by this job include close observation and the ability to adjust focus. The mental and physical requirements described here are representative of those that must be met by an individual, with or without reasonable accommodation, to successfully perform the essential functions of this position.\n\nWorking Environment:\nWork is performed in a warehouse environment. The employee is occasionally exposed to moving mechanical parts and risk of electrical shock. The noise level in the work environment is usually moderate. The work environment characteristics described here are representative of those an individual encounters while performing the essential functions of this position.\n\nEEO Statement:\nWe are proud to be an equal opportunity employer. We place priority in an environment of inclusion, diversity and social justice and are committed to securing a better, brighter way forward for our employees, our markets and our communities.","slug":"micropropagation-manager-rocky-hill-8b49b3a5-203d-48b1-bce4-947c0d062e38","benefits":[],"selectedSkills":["Horticulture","Communication skills","Tissue culture","Management","Time management","21 years or older","US work authorization"],"jobType":"free","applyURL":"https://boards.greenhouse.io/ctpharma/jobs/5138730003?gh_src=66697b203us"},{"position":"Manager, PB Laboratories Operations","labName":"TriCore Reference Laboratories","location":"Albuquerque, NM","age":"1 day ago","type":"Full-time","salaryMin":"$72,000 ","salaryMax":" $98,000 a year","jobDescriptionCopy":"Job ID #: 12279 City, State: NM - Albuquerque\n\nFunctional Area: Health/Medical Department Name:\nPosition Type: Regular - Full Time Education Required: See Minimum Qualifications\nExperience Required: See Minimum Qualifications Relocation Provided:\n\nJob Summary\n\nPrecision Botanical Laboratories\n\nWe help New Mexico hemp and cannabis growers produce safe, high-quality products by delivering precise, accurate, and reliable laboratory testing.\n\nPrecision Botanical Laboratories provides regulation-compliant laboratory testing to ensure safety and effectiveness of medical and adult-use cannabis and hemp.\n\nResponsible for the overall direction and management of the Precision Botanical Laboratories (PBL) operations (technical performance, personnel, education, training and administrative functions); coordination of activities with other areas of the organization and with internal and external customers to ensure that financial and quality standards are met. Work closely with Director, regarding decisions on matters relating to technical performance, quality and finances.\n\nESSENTIAL FUNCTIONS:\nDEPARTMENT MANAGEMENT AND STAFF OVERSIGHT:\n1. Responsible for the overall supervision of assigned department management staff.\n\na. Ensure that appropriate application, interview and selection processes are established and followed in the division, including, but not limited to interviews with peers and supervisors/tech specialists. Personally interview final candidates and work with Human Capital Management in making final selections.\n\nb. Oversee effective completion of performance evaluations and approve compensation process. Regularly communicate with direct reports regarding their performance and counsel them as needed. Let direct reports know when they are and are not meeting job expectations. Provide guidance to direct reports on how to improve performance.\n\nc. Oversee and conduct employee coaching, counseling and disciplinary actions as needed or appropriate. Manage dismissal actions utilizing Human Capital Management for advice and seeking approval from the appropriate leadership regarding the proposed action.\n\nd. Ensure that appropriate staff recognition programs are in place.\n\ne. Ensure standardized orientation, training programs, and competency programs for new and existing employees are established, maintained, and monitored according to regulatory guidelines.\n\nf. Be available to assist staff with questions and problem solving.\n\ng. Maintain appropriate channels of communication within the division.\n\nh. Provide information to staff regarding job expectation, relevant information concerning workload, workflow, process and procedure changes and general information regarding the department and the organization as a whole.\n\ni. Listen effectively and with the purpose of understanding employee concerns, questions, ideas and opinions. Actively solicit staff input and feedback.\n\nj. Coordinate and conduct department meetings on a regular basis.\n\nEDUCATION AND TRAINING\n\n1. Ensure appropriate training programs are in place and executed for all levels of students assigned for rotations in departments.\n\n2. Oversee client training and educational programs/meetings.\n\n3. Assist with problem resolution for external clients as needed.\n\n4. Consults with clients regarding appropriate testing, test results and interpretations.\n\nFINANCIAL\n\n1. Coordinate preparation and justification of budgets. Review and submit proposed budget to Director, PBL Operations.\n\n2. Approve submitted capital requests and vendor payments/invoices prior to submission for final approval.\n\nQUALITY ASSURANCE (QA)/COMPLIANCE\n\n1. Participate in quality assurance programs to ensure that quality standards are met. Demonstrate ability to consistently improve quality standards. Evaluate the needs and expectations of the “customers” of the area annually and implement new quality programs designed to ensure that the quality of services meet or exceed customers’ expectations. Prepare QA reports as appropriate. Lead, facilitate and/or participate in Quality Management and other process improvement teams as appropriate.\n\n2. In conjunction with the Director, develop, revise and implement department goals and objectives. Ensure that all goals and objectives are appropriately aligned and prioritized with company strategic goals.\n\n3. Actively support and implement company and department procedures, policies and strategies to support the corporate vision.\n\n4. Assures regulatory and accreditation compliance by working with Quality and the Director.\n\n5. Ensure patient, employee and organizational confidentiality.\n\nWORKFLOW/EFFICIENCY\n\n1. Oversee workflow and productivity.\n\n2. Develop, revise and implement appropriate work systems within the department that are designed to meet the needs of the organization as well as the needs of internal and external customers. Identify opportunities for new or improved service to both internal and external customers and implement new or improved services as appropriate.\n\n3. Responsible for ensuring that the department operates efficiently. Look for ways to get maximum benefit from all resources. Continually assess department staffing levels and needs including scheduling strategies and full time vs. part time ratios when employees leave, examine current staffing levels and needs, and determine appropriate replacement needs. Continually assess department resources and needs. Initiate requests for additional resources as appropriate, including cost justifications. Develop and monitor standards for measuring cost effectiveness.\n\n4. Provide backup or coordinate fill in for department staff during times of unusually high workload or other special circumstances.\n\nCUSTOMER SERVICE AND COMMUNICATION\n\n1. Maintain effective communication and coordination with other departments within the organization.\n\n2. Serve as a liaison to the external communication process to keep customers informed of testing and service changes. Assures that all relevant customer needs are met. Coordinate the scheduling of tests to meet customer expectations.\n\nTECHNICAL\n\n1. Maintain an up-to-date understanding of new requirements and technology through continuing education.\n\n2. Coordinate with the Director to ensure that test menus and services are consistent with the client expectations and financial expectations.\n\nOTHER RESPONSIBILITIES:\n1. Attend all managerial meetings and other meetings or workgroups as assigned.\n\n2. Maintain working relationships with vendors.\n\n3. Participate in the development and implementation of strategic initiatives.\n\nThe above statements describe the general nature and level of work being performed by individuals assigned to this classification. This is not intended to be an exhaustive list of all responsibilities and duties required of personnel so classified.\n\nMinimum Qualifications\n\nMINIMUM EDUCATION\n\nBachelor's degree in a relevant science.\n\nMINIMUM EXPERIENCE:\nSix (6) years of experience in a clinical or analytical laboratory with at least one year of management/supervisory experience.\n\nPREFERENCES:\nMaster’s degree.\nCannabis certification.\n\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class.","slug":"manager-pb-laboratories-operations-9b7dde1a-d862-40e3-8b84-5938cf65ec84","benefits":[],"selectedSkills":["Clinical laboratory experience","Laboratory experience","Supervising experience","Bachelor's degree","Master's degree"],"jobType":"free","applyURL":"https://careers.peopleclick.com/careerscp/client_tricore/external/jobDetails.do?functionName=getJobDetail&jobPostId=27362&localeCode=en-us"},{"position":"Sales Executive","labName":"CannaSafe","location":"Van Nuys, CA","age":"1 day ago","salaryMin":"$62,000 ","salaryMax":" $78,000 a year","jobDescriptionCopy":"Job Summary\n\nThe Sales Executive is responsible for generating new business, as well as maintaining and deepening our existing customer relationships. This includes sourcing, coordinating with, and meeting potential customers in the industry that have cannabis testing needs. Primary areas of focus are identifying new customers, promoting existing customer retention, and successfully onboarding new accounts. This role is an outside sales position.\n\nEssential Duties and Responsibilities\n\nProvide the highest level of customer service at all times. This is a relationship business.\nPartner with cannabis professionals to educate them regarding testing requirements and benefits that CannaSafe delivers (our value proposition).\nDeliver market research to industry professionals.\nImplement industry knowledge to strengthen our existing customer relationships and broaden our lead pipeline.\nServe as a subject matter expert in our offerings, including, but not limited to, pricing, differentiation, and what we provide that our competitors do not.\nTake sales orders and submit for processing per our internal SOP.\nEducate customers on our process and ensure appropriate expectations are established and maintained regarding order timing and outcomes.\nDeliver sales presentations to customers and for internal training purposes.\nNetwork at industry events to gain key updates. Inform the team accordingly.\nPerform heavy cold calling to schedule in person appointments. This may require creative sourcing methods, such as leveraging social media.\nMeet our minimum number of in person and telephonic customer check-in meetings each week. These are focused on growing existing relationships and expanding services.\nHit and surpass other quotas as defined by the TBD Sales Leader.\nRegularly maintain accurate, detailed, and current notes in HubSpot. This includes notes for existing and potential contacts.\nPartner will all levels of employees to ensure communication is seamless at all times regarding updates to customer orders.\nGenerate and regularly deliver a variety of reports to the Leadership team.\nFoster a success-oriented, accountable, and ethical environment.\nBuild strong internal, external, and cross-functional relationships.\nOther duties and special projects as assigned.\n\nKnowledge, Skills, and Abilities\n\nHigh degrees of self-motivation, initiative, sales acumen, analytical/technical ability, and decisive judgement.\nAbility to build positive relationships and nurture them as needed in a sales environment.\nAbility to maintain an incredibly high degree of attention to detail and accuracy\nAbility to maintain confidence, confidentially, and composure during difficult and/or complex situations.\nAbility to work in a dynamic, fast-paced deadline environment while successfully managing multiple tasks.\nStrong knowledge of Microsoft Office, including Excel, PowerPoint, and Word.\nExcellent communication skills and ability to effectively work, influence, problem solve, and communicate with all levels of the organization.\nProven work experience as sales representative in Cannabis Sales/lab Services\nTravel up to 50%, including overnight travel.\n\nEducation and Experience\nRequired: A high school diploma (or GED) and at least three (3) years of related sales experience.\nRequired: A valid driver’s license and clean driving record.\nKnowledge of chemistry and analytical laboratory principles, terminology, practices, techniques, and instrumentation.\nExposure to the cannabis industry.\n\nEssential Functions\n\nThe physical demands described here are representative of those that an employee must meet to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nWhile performing the duties of this job the employee is frequently required to stand, handle or feel, to speak, and to hear. The employee is occasionally required to walk, sit, reach with hands and arms, bend, kneel, crouch, or crawl. The employee must frequently lift and/or move up to thirty-five (35) pounds. Specific vision abilities required for this job include close (proximity) vision, depth perception, and the ability to adjust focus.\n\nWork Environment\n\nThe work environment described here is representative of that which an employee may encounter while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nThe standard analytical laboratory environment is one in which potential health hazards do exist. Administrative, operations, technical, and professional staff are expected to safely operate in accordance with applicable and appropriate health and safety policies and procedures, as prescribed by the applicable CannaSafe manuals and policies and/or federal, state, or local standards.\n\nLaboratory staff can be expected to work in areas where hazards associated are with, but not limited to, airborne pathogens. Biological materials, hazardous substances, and radioactive material exist and are handled. Appropriate training is provided regarding these hazards and staff are expected to adhere to all health and safety policies at all times, whether they are in writing or verbalized by a supervisor.","slug":"sales-executive-b9f27230-90b1-45aa-93a5-1ebf2c8d7bc9","benefits":[],"selectedSkills":["Communication skills","Microsoft Excel","Driver's License","Sales","Microsoft Powerpoint","High school diploma or GED","Clean driving record"],"jobType":"free","applyURL":"https://csalabs.com/careers/?gnk=job&gni=8a7883a9798f6e5e0179afb44e7e441f&gns=Indeed+Free"},{"position":"Associate Scientist II, ISO QC","labName":"Cayman Chemical Company","location":"Ann Arbor, MI","age":"17 hours ago","type":"Full-time","salaryMin":"$51,000 ","salaryMax":" $68,000 a year","jobDescriptionCopy":"Headquartered in Ann Arbor, Michigan, Cayman Chemical Company supplies scientists worldwide with the resources necessary for advancing human and animal health. We offer a vast product catalog that is constantly growing to meet the needs of our clients. Additionally, we provide service programs that include comprehensive solutions to drive clients’ projects to completion.\n\nOur mission is to make research possible. That starts by employing a talented and highly qualified group of experts that develop the tools to support research scientists.\n\nCurrently, we are looking to add an Associate Scientist II to our ISO Quality Control team:\n\nResponsibilities and Duties:\nChemical analyses, analytical method development, and validation for small molecule, synthetic compounds to support our growing Forensic and Cannabis testing catalogs.\nRoutine testing of synthetic compounds using analytical techniques such as HPLC, LCMS, GCFID, GCMS, FTIR, NMR, KF, LOD and ROI analysis, following standard operating procedures.\nConduct method development and validation for new products/projects, including materials containing complex mixtures.\nInterpret and peer review analytical test data and corresponding documents for accuracy and completeness.\nParticipate in the drafting and implementation protocols specific to ISO/IEC 17025 and ISO 17034 standard requirements.\nParticipate in general lab upkeep as well as maintenance of laboratory equipment.\nMay attend conferences, present posters, and write scientific papers.\n\nRequirements:\nEducation: Bachelor’s degree, Master’s degree, or Ph.D. in Chemistry or related field.\nExperience: 2 years of lab experience including HPLC method development and method validation. LC-MS/MS experience desired.\nComputer Skills: Microsoft Office\nProficient in instrumental analysis including HPLC, GC, NMR, FTIR, KF and mass spec.\nAvailability to work on-site in Ann Arbor, Monday through Friday.\nDemonstrates Cayman’s Core Values – Integrity, Collaboration, Teamwork, Learning, and Excellence.\n\nWhat we Provide:\nCompetitive compensation\nMedical, dental and vision insurance\nGenerous paid time-off (4 weeks) for vacations, sick and/or personal reasons\nOver 10 paid holidays per year, including the week of 12/24 through 1/1\n401(k) plan with company match\nTuition Reimbursement and Student Debt Payment Program\nLife and disability insurance plans\nFlexible spending accounts for medical and dependent care (FSA)\nFun employee events all year long\nFlexible work schedules\nEmployee assistance program\nCasual dress\nOnsite Gym Facility","slug":"associate-scientist-ii-iso-qc-93bea95a-b7d5-4683-911f-5cc5e3ca0255","benefits":["Dental insurance","Health insurance","Employee assistance program","Disability insurance","On-site gym"],"selectedSkills":["High-performance liquid chromatography","Laboratory experience","Microsoft Office","Doctoral degree","Bachelor's degree","Master's degree","Doctor of Philosophy"],"jobType":"free","applyURL":"https://recruiting.ultipro.com/CAY1000CAY/JobBoard/3be29d0c-a09f-45c5-a17f-ab2e5015c885/OpportunityDetail?opportunityId=83a0134b-6278-4d33-a9d9-4fa830580eff&postingId=2419ceb1-ec3b-48f2-b2b3-478d61ec4f2c"},{"position":"PUBLIC HEALTH LABORATORY SCIENTIST GENERAL LEAD (FULL TIME CONTRACTUAL)","labName":"State of Maryland","location":"Linthicum, MD","age":"1 day ago","type":"Full-time","salaryMin":"$28.02 ","salaryMax":" $36.49 an hour","jobDescriptionCopy":"GRADE\n19\nLOCATION OF POSITION\nMDH, Maryland Medical Cannabis Commission, Linthicum, MD\nMain Purpose of Job\nThe Microbiologist functions as a full-performance laboratory scientist in the Maryland Medical Cannabis Commission Office of Scientific Support (OSS) Reference Laboratory. This position will perform a variety of laboratory tests, assays, analytical procedure validations and quality assurance and quality control studies on cannabis and hemp samples collected by the Commission. This position will also assign, review and approve the work of other laboratory employees. Testing is performed as part of the MMCC-OSS activities to promote, protect, and preserve the health and well-being of the medical cannabis patients in Maryland.\nMINIMUM QUALIFICATIONS\n\nEducation: A Bachelor’s degree in Biochemistry, Biology, Biotechnology, Chemistry, Genetics, Immunology, Microbiology, Molecular Biology, Medical Technology, Pharmacy or Zoology from an accredited college or university.\n\nExperience: Three years of experience working in a chemistry laboratory performing analytical tests on environmental, biological or multi-matrix samples; or three years of experience working in a medical or public health laboratory performing diagnostic or public health testing on human specimens.\n\nNotes:\n1. Candidates may substitute additional graduate education at an accredited college or university at the rate of 30 credit hours in the above noted disciplines for each year of the required experience for up to two years of the required experience.\n\n2. Candidates may substitute U.S. Armed Forces military service experience as a commissioned officer in Health Science Research Officer classifications or Medical Laboratory Specialists specialty codes in the Science related field of work on a year-for-year basis for the required experience and education.\n\nSPECIAL REQUIREMENTS\nEmployees in this classification are subject to substance abuse testing in accordance with Code of Maryland Regulations 17.04.09, Testing for Illegal Use of Drugs.\nSELECTION PROCESS\n\nApplicants who meet the minimum (and selective) qualifications will be included in further evaluation. The evaluation may be a rating of your application based on your education, training and experience as they relate to the requirements of the position. Therefore, it is essential that you provide complete and accurate information on your application. Please report all related education, experience, dates and hours of work. Clearly indicate your college degree and major on your application, if applicable. For education obtained outside the U.S., any job offer will be contingent on the candidate providing an evaluation for equivalency by a foreign credential evaluation service prior to starting employment (and may be requested prior to interview).\n\nComplete applications must be submitted by the closing date. Information submitted after this date will not be added.\n\nIncorrect application forms will not be accepted. Resumes will not be accepted in lieu of a completed application.\n\nCandidates may remain on the certified eligible list for a period of at least one year. The resulting certified eligible list for this recruitment may be used for similar positions in this or other State agencies.\n\nBENEFITS\n\nContractual employees who work for an agency covered under the State Employee and Retiree Health and Welfare Benefits Program, have a current employment contract and work 30 or more hours a week (or on average 130 hours per month) may be eligible for subsidized health benefits coverage for themselves and their dependents. As a contractual employee, you will be responsible for paying 25% of the premiums for your medical and prescription coverage, including any eligible dependents you have enrolled. The State of Maryland will subsidize the remaining 75% of the cost for these benefits. You can also elect to enroll in dental coverage, accidental death and dismemberment insurance, and life insurance, but will be responsible to pay the full premium for these benefits.\n\nLeave may be granted to a contractual employee who has worked 120 days in a 12 month period. This leave accrues at a rate of one hour for every 30 hours worked, not to exceed 40 hours per calendar year.\n\nFURTHER INSTRUCTIONS\n\nOnline applications are highly recommended. However, if you are unable to apply online, the paper application (and supplemental questionnaire) may be submitted to MDH, Recruitment and Selection Division, 201 W. Preston St., Room 114-B, Baltimore, MD 21201. Paper application materials must be received by 5 pm, close of business, on the closing date for the recruitment, no postmarks will be accepted.\n\nIf additional information is required, the preferred method is to upload. If you are unable to upload, please fax the requested information to 410-333-5689. Only additional materials that are required will be accepted for this recruitment. All additional information must be received by the closing date and time.\n\nFor questions regarding this recruitment, please contact the MDH Recruitment and Selection Division at 410-767-1251.\n\nIf you are having difficulty with your user account or have general questions about the online application system, please contact the MD Department of Budget and Management, Recruitment and Examination Division at 410-767-4850 or Application.Help@maryland.gov.\n\nAppropriate accommodations for individuals with disabilities are available upon request by calling: 410-767-1251 or MD TTY Relay Service 1-800-735-2258.\n\nWe thank our Veterans for their service to our country.\n\nPeople with disabilities and bilingual candidates are encouraged to apply.\n\nAs an equal opportunity employer, Maryland is committed to recruitment, retaining and promoting employees who are reflective of the State's diversity.","slug":"public-health-laboratory-scientist-general-lead-full-time-contractual-e4de3383-6525-4322-b82a-3dde4d83ca7f","benefits":["Prescription drug insurance","Dental insurance","Health insurance","AD&D insurance","Life insurance"],"selectedSkills":["Military","Laboratory experience","Public health","Bachelor's degree"],"jobType":"free","applyURL":"https://jobapscloud.com/MD/sup/bulpreview.asp?R1=22&R2=001093&R3=0003"},{"position":"Environmental Analyst II","labName":"Montrose Environmental Group, Inc.","location":"Richmond, VA","age":"17 hours ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nWe are currently seeking a full-time Senior Scientist in our Richmond, VA lab. The Senior Scientist will have shown that they have developed a skill set for some assays that makes them a resource for an entire lab or at least a group of assays. He/She/They will be able to handle the most challenging and most non-routine samples. He/She/They will be able to increase the technical ability of the lab to handle certain assays and have the ability to do significant method development and have well above average troubleshooting skills.\n\nAs a key member of the laboratory team, this role will be responsible for a full range of activities including:\n\nQuantitative sample analysis\nMethod development and troubleshooting\nPreparation of data summaries for inclusion in client reports\nInstrument calibration, validation, and method development\nInstrument maintenance and troubleshooting\nMaintaining organized records of sample preparation and analysis, equipment maintenance and data collected off site\nMaintain consumables and parts for instruments\nOverhead projects designed to improve efficiency of, or accuracy of analyses\nCommunicating relevant updates to applicable people in a timely manner\nPerforming other duties and responsibilities as prescribed by the Company\nCompliance with Enthalpy’s Quality Assurance Program and other policies\nCompliance with Company’s Health and Safety Plan\nOther duties as assigned\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nBachelor’s degree or higher in Chemistry, Biology, or equivalent\nMinimum of 5 years relevant laboratory experience required\nMust have familiarity for the assays performed within laboratory\nThey must be able to handle some non-routine samples or situations\nThey must be able to work with only minimal instruction from their supervisor\nWithout supervision, they must be able to routinely meet QA/QC requirements for the assays they perform\nTheir documentation, timeliness, and throughput must meet the standard of the laboratory\nThey must possess in-depth knowledge and experience on the operation of the instrument or the chemistry involved in the assays they perform\nExceptional troubleshooting skills\n\nPreferred Skills\n\nSuperior knowledge of analytical method, analytical instruments, general lab practices and lab safety\nStrong scientific writing and presentation skills\nAnalytical thinking to solve technical problems\nStrong Research and Development skills\nEffective communication skills\nSuperior time management skills\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"environmental-analyst-ii-c6faa062-c38f-40cf-9ce7-8664fcb98459","benefits":["Disability insurance","Tuition reimbursement","401(k)","Parental leave"],"selectedSkills":["Writing skills","Research","Laboratory experience","Assays","Communication skills","Bachelor's degree"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-VA-Richmond-Reymet-Rd/Environmental-Analyst-II_R2107?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Lab Manager","labName":"Curaleaf","location":"Winslow, NJ","age":"5 days ago","salaryMin":"$63,000 ","salaryMax":" $80,000 a year","jobDescriptionCopy":"Curaleaf Holdings, Inc. (CSE: CURA) (OTCQX: CURLF) (\"Curaleaf\") is a leading international provider of consumer products in cannabis, with a mission to improve lives by providing clarity around cannabis and confidence around consumption. As a high-growth cannabis company known for quality, expertise, and reliability, the company and its brands, including Curaleaf and Select provide industry-leading service, product selection, and accessibility across the medical and adult-use markets. In the United States, Curaleaf currently operates in 23 states with 130 dispensaries, 25 cultivation sites, and over 30 processing sites, and employs over 5,000 team members. Curaleaf International is the leading vertically integrated cannabis company in Europe with a unique supply and distribution network throughout the European market, bringing together pioneering science and research with cutting-edge cultivation, extraction, and production. Home | Curaleaf | Cannabis with Confidence\n\nOur corporate social responsibility is Rooted In Good Diversity, Equity, Inclusion + Social Equity + Sustainability Social Responsibility | Curaleaf | Cannabis with Confidence We believe in taking corporate and social responsibility very seriously, from our educational outreach to national partnerships, state-wide initiatives and local causes. Giving back to the communities where we operate is important to us, and helps to change old attitudes by showing the positive impact of cannabis in creating jobs, changing lives, and helping local communities.\n\nWe educate. We advocate. We give.\n\nThe Lab Manager oversees and maintains all oil production, medication formulating, and testing throughout the Processing Suite. Leadership and supervision extend to all oil production steps, analytical testing, formulation of medications, and all associated departmental functions. Also, provide leadership guidance and assistance as required in all Post-Harvest and Filling/Packaging operations. The Lab Manager must monitor and maintain the production facility in accordance with the State of Ohio regulations and standards set by the company.\n\nResponsibilities and General Job Duties:\nFull scientific oversight of the Labs and all processes\nManage extraction process, purification process, formulation process, and analytical testing in their entirety\nBuild a strong high functioning team and manage through both engagement and accountability\nRecruit new talent Hire all new staff from Extraction Technicians through Chemists\nComplete employee evaluations and performance-based coaching\nResource planning and staff scheduling\nDevelop and oversee all applicable training programs\nCapacity and production planning for departments based on constraints and calculated requirements\nValidations and qualifications of SOPs, equipment, and methods\nConducting IQ OQ PQ projects for new equipment\nComplete R&D projects as required for product and process expansion\nCreate and track all department metrics and KPIs (focusing on safety, quality, and productivity)\nLiaison with Corporate applicable SMEs\nEngineer technical solutions for departmental expansion\nExecute on short-term projects as well as long-term vision for the departments\nMaintain all cGMPs based on set facility standards\nConduct quality-based investigations and create CAPAs\nWrite and review all department specific SOPs, Work Instructions, Forms, or other technical and controlled documents\nImplement continuous improvement initiatives including six sigma and 5S\nManaging procurement process of department and maintain an OPEX budget\nEnsure all associated personnel are trained in and comply with all New York DOH applicable regulations\nEnsure processing operation is fully compliant with state regulations and state/federal law\nAssure that operation adheres to all business and industry license requirements\n\nSpecific Job Duties and Qualifications:\nCannabis industry specific processes related to Post-Harvest (drying, curing, trimming), Processing (extraction, purification, formulation, filling, and packaging), Kitchen Formulation (edibles) and Analytical Testing (potency reporting)\nQA/QC duties that require analytical testing for quality and consistency; data review and analysis of HPLC and GC equipment\nOversight of highly sophisticated CO2 based extraction equipment; Processing concentrates and extracts with heat and pressure\nOperating, maintaining, repairing and adjusting laboratory equipment such as winterizers, pumps, balances, centrifuges, roto-evaporates, decarb ovens, stills, homogenizers, and another laboratory equipment\nStoring supplies and equipment, disposal of waste according to guidelines, and keeping laboratory, storerooms, harvest rooms, and working areas immaculate\nAble to process samples by collection, extraction, preparing for analysis, and quantifying results\nScientific laboratory procedures and techniques as used in a chemistry laboratory including methods of measurements\nHealth and safety practices and precautions (including HazCom) applicable to a laboratory and manufacturing\nDevelopment of automation tools specifically related to filling and packaging (injectors, cappers, de-dusters, case counters, box erectors, carton sealers, labelers, etc.)\nMaintaining strict inventory compliance and records of all controlled substances tracked through BioTrackTHC\n\nRequirements and Education:\nMust be at least 21 years of age\nSubject to background check per state cannabis regulations\nAbility to lift up to 50 lbs. and complete repetitive tasks as required\nBS/BA Degree or greater in a related field with at least 3 years' experience in a pharmaceutical lab or highly regulated manufacturing/production setting\nDegree in Chemistry or Chemical Engineering preferred\nScientific writing for processes, training, and procedures which require technical documentation\nAnalytical Lab experience with HPLC and GC analysis highly preferred\nStrong verbal and communication skills\nAbility to work in a cross-functional team environment\nKnowledge of Microsoft Office Suite with strong abilities within Excel\n\nCuraleaf is an Equal Employment Opportunity\n\nCuraleaf is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.","slug":"lab-manager-7a15ec89-a95a-4784-b92a-163aef06c3d8","benefits":[],"selectedSkills":["Gas chromatography","Manufacturing","Microsoft Excel","High-performance liquid chromatography","Laboratory experience","Bachelor of Science","Bachelor's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://boards.greenhouse.io/curaleaf/jobs/6161348002?gh_src=f79118362us"},{"position":"Entry Level Scientist for Cannabis Lab","labName":"Keystone State Testing","location":"Harrisburg, PA","age":"20 hours ago","type":"Full-time","salaryMin":"$15 ","salaryMax":" $21 an hour","jobDescriptionCopy":"A Prominent Cannabis testing laboratory with a need for a sample technician to join their chemical analysis team. They perform purity and potency testing to measure cannabinoids, terpenoids, mycotoxins, heavy metals, pesticide residues, residual solvent levels, and microbial contaminants.\n\n\nResponsibilities:\n\n\nHigh attention to detail\n\n\nExperience preparing and analyzing samples in a high-throughput laboratory\n\n\nKnowledge of HPLC, QPCR, ICP-AES, LC-MS/MS, GC-MS/MS preferred but not required.\n\n\nExperience in an ISO 17025 regulated laboratory\n\n\nWorking knowledge of the cannabis industry\n\n\nRequirements:\n\n\nMinimum: BSc in chemistry, biology, biochemistry, microbiology, or a related field\n\n\nApplicants with graduate level degrees in a science-related field are strongly encouraged to apply\n\n\nJob Type: Full-time\n\n\nPay: $15.00 - $21.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n10 hour shift\n8 hour shift\n\nSupplemental Pay:\n\n\nBonus pay\n\nAbility to commute/relocate:\n\n\nHarrisburg, PA 17109: Reliably commute or planning to relocate before starting work (Required)\n\nEducation:\n\n\nBachelor's (Preferred)\n\nWork Location: One location\n","slug":"entry-level-scientist-for-cannabis-lab-7d686261-bc8a-4d3e-a99d-a9fca83c9fd3","benefits":["Dental insurance","Health insurance","Paid time off","Vision insurance"],"selectedSkills":["High-performance liquid chromatography","Laboratory experience","Detailing","Bachelor of Science","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&job=4KRCoGDnaSMvVl5xffJozxnDKtzUmVslG3UHl0brP3XGFdcBfxHZAQ"},{"position":"Cannabis Operations Manager","labName":"Mericratic Society LLC","location":"Seaside, CA","age":"1 day ago","salaryMin":"$70,000 ","salaryMax":" $84,000 a year","jobDescriptionCopy":"Cannabis Distribution and Manufacturing company is seeking an experienced Manager to manage the direction and oversight of our manufacturing, packaging, and distribution facility. Candidates should have experience in manufacturing, product and packaging management as well as managing people and teams. This candidate should be trustworthy, self-driven, and ready to execute.\n\nWe are seeking candidates with high levels of integrity and who are eager to take full ownership of their position. Candidates will create and keep up to date best practice Standard Operating Procedures (SOPs) that ensure consistency and regulatory compliance. This individual should have excellent organizational and communication skills and should have experience in a highly regulated production environment.\n\nCompensation:\n$70,000 - $84,000 DOE\n\nResponsibilities:\nManages the entire production process and facility\nCoordinate the operations including, but not limited to crew management, facility and equipment maintenance\nEnsure personnel actions including scheduling, training and providing necessary equipment to fulfill job responsibilities, is completed in an appropriate manner\nManage intake of all flower products including proper storage and processing procedures\nAssist in launching new products and maintaining efficient processes for successful projects\nCreation of all SKUs\nEnsure that production schedules are met\nOversee quality control\nReport daily metrics to senior management\nCoordinate with other key stakeholders (sourcing, distribution, sales, inventory) to ensure seamless production cycle\nInteract and ensure and smooth transition from sourcing to packing operations meeting all internal company and customer quality standards\nPrepare accurate reports for organizational leadership\nPlanning of production and packaging schedules based on demand\nSupervise and provide support to the production and packaging teams to ensure goals are met or exceeded\nOversee preparation and execution of purchase orders to ensure adequate supplies while staying within budget\nWrite and maintain Standard Operating Procedures (SOPs) for all activities within the department\nInterface with third-party laboratory to facilitate product testing\nMaintain an extremely sterile work environment\nFacilitate interdepartmental and wholesale transfers of product\nMaintain strict compliance with all relevant regulations\nHold regularly scheduled employee training\nCollaborate with other department heads to ensure cohesion and meet company goals\n\nQualifications:\nStrong working knowledge of Microsoft Office – strong Excel skills required\nExcellent written and verbal communication skills\nCollaborative nature and ability to work well with others\nExcellent problem solving and troubleshooting skills\nAbility to get things done and make decisions in an autonomous work environment without extensive oversight\nManagement experience a must\nPositively contribute to the company’s mission, vision, strategies and quality programs by possessing a strong work ethic\nAt least 3+ years experience in production management\nAbility to develop and strictly adhere to protocols\nAbility to work nights and weekends as necessary\nExcellent written and verbal communication skills\nPassion for producing high-quality products\nExcitement to work in a fast-paced constantly changing environment\n\nAbout Company\n\nMericratic Society is a professional management company that assists with hiring and managing local talent to help fulfill our client's employment needs.\n\nWe are a team that brings transparency, unique perspectives, excellence, and enthusiasm to our expanding operations.\n\nInnovation, communication, and collaboration are important to us and are critical to our shared success.","slug":"cannabis-operations-manager-7edb1872-437a-4018-aa2d-ece171b75ac6","benefits":[],"selectedSkills":["Production management","Communication skills","Packaging","Microsoft Excel","Management"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&job=vJ_o9thZyErf48DJXgUjl0eTh6QHVb7n0_rWUR-gLvzg516S6UjuRA"},{"position":"Cannabis Laboratory Technician","labName":"SBT LABS","location":"Long Beach, CA","age":"17 hours ago","type":"Full-time","jobDescriptionCopy":"GENERAL STATEMENT OF RESPONSIBILITIES:\n\n\nThe Laboratory Technician will be part of a small, collaborative group, but must also be comfortable working independently in a high throughput testing environment. The Technician is responsible for homogenization and extraction of samples and also preparing equipment for sample analysis.\n\n\nDuties and Responsibilities:\n\n\nDuties of this job include, but are not limited to:\n\n\nPreparing equipment and plant materials for extraction.\nProcessing flower, edibles, concentrates and extracts.\nCleaning and maintenance of extraction equipment and laboratory facility.\nMaintaining strict inventory records of all plant materials, chemicals and equipment used in the laboratory.\nOperation, maintenance and repairs to laboratory equipment such as liquid chromatography systems, pumps, balances, centrifuges, and other laboratory equipment.\nMaintaining inventory records of supplies, materials, and equipment, and preparing requisitions as needed.\nStoring supplies and equipment, disposal of waste according to guidelines, and keeping laboratory, storerooms and working areas immaculate.\nWashing and sterilizing laboratory glassware.\nPerforming clerical work related to laboratory activities such as word processing, record keeping and filing.\nMaintaining material safety data sheets for all department chemicals and products.\nAdherence to quality control documentation.\nCompliance with local and state guidelines requiring chain of custody of controlled substances.\nOther duties as assigned.\n\nMinimum Qualifications:\n\n\nExperience with Extraction Purification and Analysis preferred, but not required.\nExperience with ISO/IEC 17025:2017.\nEffective time-management skills and ability to multi-task.\nAbility to work in a fast-paced and challenging environment.\nBachelor of Science Degree in Biological, Chemical, agricultural, environmental, or related sciences from an accredited college or university; or have completed two years of college or university education that included coursework in biological, chemical, agricultural, environmental, or related sciences from an accredited college or university and at least one year full-time practical experience.\n\nPHYSICAL REQUIREMENTS:\n\n\nRequires prolonged sitting, standing, walking, bending, lifting, and use of hands\nObserve, see, hear, and respond to directions given with effective outcome.\nAbility to lift 30 lbs. from the floor to a waist-high table when necessary.\nHandle the responsibilities and routine stress often associated with this position.\n\nJob Type: Full-time\n\n\nPay: From $45,000.00 per year\n\n\nBenefits:\n\n\nHealth insurance\nPaid time off\n\nSchedule:\n\n\nMonday to Friday\n\nEducation:\n\n\nBachelor's (Preferred)\n\nExperience:\n\n\nLaboratory: 1 year (Preferred)\nCannabis Laboratory: 1 year (Preferred)\n\nWork Location: One location\n","slug":"cannabis-laboratory-technician-29d654b2-a5b9-4974-8939-dc7f2165dbf3","benefits":["Paid time off","Health insurance"],"selectedSkills":["Laboratory experience","Time management","Bachelor of Science","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=ZEhk41mwnmPGrMXGBfWK5F4mGbhlnNMnz3RXaPBhu9GZW4iOdHLXCA"},{"position":"HPLC and/or GCMS QC Chemist","labName":"US Cannalytics","location":"East Hanover, NJ","age":"1 day ago","type":"Full-time","salaryMin":"$24 ","salaryMax":" $27 an hour","jobDescriptionCopy":"QC CHEMIST QUALIFICATIONS\n\n\n· Have a valid driver’s license.\n\n\n· Pass criminal background check.\n\n\n· Be at least 21 years old.\n\n\n· Have 2 years of relevant laboratory experience.\n\n\n· Must have, at a minimum, a bachelor’s degree in a natural science, to include, but not be limited to, biology, chemistry, physics, engineering, or environmental sciences.\n\n\nQC CHEMIST RESPONSIBILITIES\n\n\nThe QC Chemist is responsible and accountable for testing, instrumentation and testing methodology, quality control, and tracking of cannabis material. Ensures the safe, accurate, and timely testing of cannabis products.\n\n\nESSENTIAL DUTIES\n\n\nFollow policies and procedures for the daily operations and fully comply with state medical marijuana regulations\nUse of aseptic technique to handle, prepare, and analyze samples\nExpertise in sample preparation and testing methods using analytical instrumentation (HPLC, LC-MS/MS, ICP-MS, GCMS)\nResponsible for inventory of supplies and cannabis tracking and destruction\nResponsible for accurate weighing and recording all product weights\nWorks in a timely manner and strives to improve quality and maintain accuracy\nPerform area and instrument cleaning, maintenance and calibration including compliant documentation of associated logs\nDevelop, performs, or assists in method validations\nAnalyzes data from testing performed and submits to laboratory director or lab director designee\nPerforms all other tasks and duties as assigned, which may include cannabis sampling, transport, and sample preparation\n\nJob Type: Full-time\n\n\nPay: $24.00 - $27.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nFlexible schedule\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n10 hour shift\n8 hour shift\nDay shift\nMonday to Friday\nOvertime\nWeekend availability\n\nSupplemental Pay:\n\n\nBonus pay\n\nAbility to commute/relocate:\n\n\nEast Hanover, NJ 07936: Reliably commute or planning to relocate before starting work (Required)\n\nEducation:\n\n\nBachelor's (Preferred)\n\nExperience:\n\n\nGCMS: 1 year (Required)\nAnalytical Chemists: 1 year (Required)\nnon-academic laboratory experience do you have?: 1 year (Required)\n\nWork Location: One location\n","slug":"hplc-andor-gcms-qc-chemist-875fa65a-aef3-4707-b260-35c777ae7e36","benefits":["Dental insurance","Health insurance","Paid time off","Flexible schedule","Vision insurance"],"selectedSkills":["Driver's License","Laboratory experience","Bachelor's degree","21 years or older","Criminal background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=sOu8VClgKOyek8o4m0tskxQtjw8JPuo3-Vs9GPPkBtv3VYYRM6wPZw"},{"position":"Driver","labName":"Kaycha Labs","location":"Natick, MA","age":"1 day ago","type":"Part-time","jobDescriptionCopy":"Company Overview:\n\n\nKaycha Group, LLC is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\n\nJob Purpose:\n\n\nDrivers pickup samples at customer sites. These professionals will report to the lab on designated days at the beginning of each shift to receive daily schedules for pickup of customer samples.\n\n\nEssential Duties & Responsibilities:\n\n\nSample Collection:\n\n\nDrive to scheduled clients to collect samples and return with samples to lab\nVerify sample and client information during each pickup\nCollect and maintain METRC and Chain of Custody forms of the samples from the client to the lab\nWhenever necessary, enter orders with required sample information into the lab’s LIMS system\n\nCustomer Relations:\n\n\nContact clients approximately 15 minutes prior to arrival to notify approximate arrival time.\nGreet clients in a friendly manner to represent the company well\nMaintain/enhance customer relations.\n\nOther Duties:\n\n\nCoordinate intake activities with CSR, Intake Specialist and Lab Manager\nPerform duties as requested\nThis job description is not designed to cover or contain a comprehensive listing of activities, duties, or other responsibilities that are required of the employee. Duties, responsibilities and activities might change or new ones assigned at any time with or without notice.\n\nQualifications and Competencies:\n\n\nMust be over 25 years old\nA minimum completion of at least two years of college coursework preferred\nCompletion of Kaycha Driver training\nMust have excellent customer relationship management skills\nProof of an excellent driving record and a valid driver’s license are required\nExcellent oral and written communication skills\nStrong time management skills\nAbility to demonstrate teamwork and collaborate with fellow drivers, co-workers, and supervisor.\nDemonstrate responsibility, accountability, and dependability toward assigned tasks and duties\nAbility to demonstrate professional, positive attitude toward assigned tasks, projects and colleagues\nAccredited laboratory environment requires strict adherence to safety, regulatory and Quality Assurance protocols.\nBackground check required\n\nEssential Functions:\n\n\nThe physical demands described here are representative of those that an employee must meet to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nWhile performing the duties of this job the employee is frequently required to stand, handle or feel, to speak, and to hear. The employee is occasionally required to walk, sit, reach with hands and arms, bend, kneel, crouch, or crawl. The employee must frequently lift and/or move up to thirty-five (35) pounds.\n\n\nSpecific vision abilities required for this job include close (proximity) vision, depth perception, and the ability to adjust focus.\n\n\nWork Environment:\n\n\nThe work environment described here is representative of that which an employee may encounter while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nThe standard analytical laboratory environment is one in which potential health hazards do exist. Administrative, operations, technical, and professional staff are expected to safely operate in accordance with applicable and appropriate health and safety policies and procedures, as prescribed by the applicable Kaycha manuals and policies and/or federal, state, or local standards.\n\n\nLaboratory staff can be expected to work in areas where hazards associated are with, but not limited to, airborne pathogens. Biological materials, hazardous substances, and radioactive material exist and are handled. Appropriate training is provided regarding these hazards and staff are expected to adhere to all health and safety policies at all times, whether they are in writing or verbalized by a supervisor.\n\n\nThe above is intended to describe the general content of and requirements for the performance of this job. It is not to be construed as an exhaustive statement of duties, responsibilities, or physical requirements. Nothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nJob Type: Part-time\n\n\nPay: From $16.00 per hour\n\n\nBenefits:\n\n\nPaid time off\n\nSchedule:\n\n\n8 hour shift\nDay shift\n\nApplication Question(s):\n\n\nDesired compensation?\nBest email and phone # to reach you at?\n\nEducation:\n\n\nHigh school or equivalent (Preferred)\n\nExperience:\n\n\nDriving: 1 year (Preferred)\n\nWork Location: On the road\n","slug":"driver-f9554173-b0ff-4089-bcde-8dbbb95ad80e","benefits":["Paid time off"],"selectedSkills":["Quality assurance","Communication skills","Driving","Driver's License","Time management","High school diploma or GED","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=qPXDnmhi0zrW7cKez7Qv2_4oNFD2CR68xN8-LyxUAzFquC-hqD8DnA"},{"position":"Packaging Technician","labName":"CannaPunch","location":"Las Vegas, NV","age":"5 days ago","type":"Full-time","salaryMin":"$28,000 ","salaryMax":" $37,000 a year","jobDescriptionCopy":"ABOUT AYR WELLNESS\n\nWe’re a new kind of cannabis company, aiming higher in everything we do. We grow and sell the highest-quality cannabis products available anywhere, inspiring wellness and wonder in our customers, wherever they are on their cannabis journey. We operate with a sense of responsibility to our customers and patients, building stronger and more socially responsible communities everywhere we go.\n\nJOB DESCRIPTION\n\nThe Packaging Technician primarily responsible for the accurate weighing, labeling, and packaging of all of our products prior to shipping.\n\nRESPONSIBILITIES\n\nTech I\n\nPackage, sticker, and count cannabis products/finished goods\nConfirm batch and lot numbers on finished goods’ product labels are correct\nCreate “Lots” of Bud, Smalls, Shake, and Live Resin in LeafLogix and Metrc as well as physically\nCoordinate third party Laboratory testing and transfers\nConfirm Harvest Batches’ Untrimmed Dry Weights (“Buck” weights) by reweighing and recording weights\nCoordinate and execute conversions and transfers to Extractions Department\nCarefully manage inventory flow during busy order fulfillment periods\nAbility to multi-task repeatedly with attention to detail and minimal errors\nMaintain a clean and organized work environment\nRead, understand, and follow all CCB regulations relating to inventory control and chain of custody\nAssist with supervision of Trim Technicians on trim machine and grinding machine on their workflow and duties\nDelegate cannabis products for processing and trimming\nOther duties as assigned\n\nTech II\n\nMeets all requirements of Tech I\nRegularly exceeds minimum productivity expectations\nMinimum of 1 year experience packaging experience\nAbility to work independently\nOffers mentorship to new employees\n\nTech III\n\nMeets all requirements of Tech II\nMinimum of 2 years packaging experience\nPoint of contact for new employees\nConducts new hire department training\nAble to perform duties of all departmental zones\n\nSKILLS/ABILITIES REQUIRED\n\nAttention to detail with excellent record keeping ability\nWillingness to learn and improve each operation\nAbility to perform repetitive tasks for long periods of time\nAbility to work in a fast-paced environment and multi-task\nCommitment to arrive for scheduled shifts on time and maintain consistent attendance\nAvailability to work occasional weekends and holidays\n\nREQUIREMENTS/PREFERRED EXPERIENCE\n\nHigh school diploma or General Education Diploma (GED)\nMust have a clear understanding of weights and measures and ability to operate a scale\nAbility to work within a team and on an individual basis\nFamiliarity with warehouse procedures\nAbility to work in a timely manner and drive to increase productivity\nExperience and knowledge and familiarity with Cannabis\nProficient in Microsoft Office (Word, Excel and Outlook)\nMust be 21 years of age or older, and be able to pass an extensive background check\nMust be authorized to work in the United States\n\nPHYSICAL REQUIREMENTS\n\nAbility to stand on feet or sit for extended periods of time\nAbility to have extended cannabis exposure, with no adverse physical reaction\nAbility to use repetitive use of hands, wrists and forearms\nFine visual acuity with the ability to adjust focus to inspect closely, ability to recognize different colors.\nNormal vision or corrected by use of glasses and/or contacts for normal reading and viewing abilities to determine the accuracy, neatness, and thoroughness of the work assigned, or to make general observations of facilities or structures.\nRequires eye-hand coordination and manual dexterity sufficient to meet job and operate equipment requirements\nRequires normal range of hearing with the ability to perceive the nature of sounds at normal speaking levels with or without correction and having the ability to receive detailed information through oral communication and making fine discriminations in sound.\nAbility to twist, turn, bend, stand and walk as required to perform the duties associated with functioning as a dispensary manager.\nPushing/pulling/carrying, with the ability to lift up to 50 pounds occasionally\nRegular and on-time attendance (Hours may exceed 40 hours per week)\n\nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n\nWORK ENVIRONMENT:\nWork is performed in several locations that include a cannabis cultivation and production facility. The working area may be odorous at times and loud due to fans and filtration systems, fluctuating between cold and warm temperatures. Involves frequent contact with staff. Work may include dealing with law enforcement and occasional State inspectors.\n\nDISCLAIMER\n\nAll the above duties and responsibilities are essential job functions subject to reasonable accommodation. All job requirements listed indicate the minimum level of knowledge, skills and/or ability deemed necessary to perform the job proficiently. Employees may be required to perform any other job-related instructions as requested by their supervisor, subject to reasonable accommodation. This document does not create an employment contract, implied or otherwise, other than an “at will” employment relationship.\n\nAyr Wellness is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, veteran status, or any other characteristic protected by federal, state or local law.","slug":"packaging-technician-f178c3a2-5fb6-45c9-8318-a5b234986af3","benefits":[],"selectedSkills":["Warehouse experience","Microsoft Excel","Microsoft Outlook","Packaging","Microsoft Office","High school diploma or GED","21 years or older","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=WZ5bJwp7C-Fzv6FmA795O4rpRcTKBIGlFj5PQs0Z9jWiDr3KlSj84A"},{"position":"Lab Technician","labName":"Gold Naturals","location":"Provo, UT","age":"1 day ago","type":"Full-time | Part-time","salaryMin":"$15 ","salaryMax":" $18 an hour","jobDescriptionCopy":"Gold Naturals is rapidly-growing cannabis, and hemp manufacturing laboratory based in Provo, Utah is seeking a qualified individual who has prior experience in a laboratory setting with a background in either cannabis and/or chemistry for Medical and Hemp Cannabis products.\n\n\nJob Skills/Requirements\n\n\n· This position is responsible for the commercial production and refinement of Medical Cannabis and Hemp products including concentrates and medicinal products.\n\n\n· Responsible for the preparation and execution of extraction and processing of cannabinoid products under State and local standards\n\n\n· Ensures consistency and efficacy of product through quality control testing and procedures\n\n\n· Performs all assigned duties required to ensure a clean and safe production facility\n\n\n· Follows all defined Good Manufacturing Practices (GMP) to ensure the highest level of product and laboratory safety\n\n\n· Completes sanitation of all production equipment and tools including workspace, lab equipment, containers, and appliances\n\n\n· Assists with the creation of batch production records and labels per State and local standards\n\n\n· Assists with weighing, packaging, labeling, and documentation of all products, as well as the tracking of batch numbers, lot numbers, and expiration dates\n\n\n· Works with local, State-approved laboratories to send samples for regular testing of extracted products and document all results for compliance with State regulations\n\n\n· Ability to work on process development and improvement and document all production and batch reports\n\n\n· Ability to follow SOPs (Standard Operating Procedures)\n\n\n· Ability to communicate effectively and work well with others\n\n\n· Work towards meeting department goals around efficiencies, yields, and cost\n\n\nRequired Skills\n\n\n· Must be highly motivated, detail-oriented, and be able to work efficiently in a fast-paced environment\n\n\n· Excellent research and data organization skills are very important\n\n\n· Acute problem-solving skills coupled with a strong mechanical aptitude.\n\n\n· Must be able to lift 100lbs.\n\n\nJob Types: Full-time, Part-time\n\n\nPay: $15.00 - $18.00 per hour\n\n\nSchedule:\n\n\nMonday to Friday\n\nAbility to commute/relocate:\n\n\nProvo, UT 84606: Reliably commute or planning to relocate before starting work (Preferred)\n\nWork Location: One location\n","slug":"lab-technician-b859ac2d-e5b2-4e49-ae2b-66afce47e17d","benefits":[],"selectedSkills":["Laboratory experience","Research","Mechanical knowledge"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=MGyyjKP7uUfKRJ7Z0mYg41C59Ly2aBq5BzWiIaXamMgcrLyB5KWgOA"},{"position":"Extraction Technician","labName":"Columbia Care","location":"Vineland, NJ","age":"16 hours ago","type":"Full-time","jobDescriptionCopy":"Reports to: Manager/Supervisor, Laboratory or Manager/Supervisor, Production\n\nPosition Overview:\nThe Extraction Technician is responsible for the facility’s overall extraction process and day-to-day production following established protocol and regulations. The Extraction Technician will lead the extraction lab team through the activities required to manufacture, store, maintain equipment and materials necessary to run a world-class extraction lab.\n\nSchedule: Full Time\n\nPay: $20+\n\nMajor Areas of Responsibility include:\nFollows Policies & Procedures for the daily operations and fully comply with state medical marijuana regulations.\nMaintains testing and formulating operations by initiating, coordinating and enforcing operational policies and procedures.\nPerforms QA/QC through analytical testing for quality, consistency and efficacy.\nWorks closely with production team on all elements of the testing and formulating process.\nMasters various techniques for marijuana extraction and infusion, including butane extraction.\nDevelops expertise in testing and formulating methods as well as the purification, separation and isolation of various compounds of cannabis.\nResponsible for inventory, recordkeeping and quality of product at all times, maintaining inventory via seed to sale tracking.\n\nMinimum Qualifications (Skills, Knowledge & Abilities):\nAll applicants must be at least 21 years of age.\nBachelor’s degree preferably in chemistry or similar field.\n1-4 years of experience in related position with an emphasis in an operations production/manufacturing environment.\nExperience must include hands-on responsibility for the full scope production activities, both operations and analysis.\nExperience with analytical testing required and HPLC- specific experience preferred.\nExperience in various cannabis testing or formulation methods preferred.\n\nTravel %: 0-10\n\nFLSA status: Non-exempt\n\nAdditional Abilities Required:\nThe job requires physical activity, including prolonged standing, repetitive bending, climbing, and lifting or moving up to 10 pounds (or more with a coworker). Good visual acuity, hand-eye coordination, manual dexterity, and ability to perform repetitive motions with accuracy is required. The noise level in the work environment is usually moderate.\nNote: Nothing in this job description restricts the company’s right to assign or reassign duties and responsibilities to this position at any time. Reasonable accommodations may be made in appropriate circumstances to enable individuals to perform the essential functions of the position.\n\nAbout Columbia Care\nColumbia Care is one of the largest and most experienced cultivators, manufacturers and providers of cannabis products and related services, with licenses in 18 U.S. jurisdictions and the EU. Columbia Care operates 130 facilities including 99 dispensaries and 31 cultivation and manufacturing facilities, including those under development. Columbia Care is one of the original providers of medical cannabis in the U.S. and now delivers industry-leading products and services to both the medical and adult-use markets. In 2021, the company launched Cannabist, its new retail brand, creating a national dispensary network that leverages proprietary technology platforms. The company offers products spanning flower, edibles, oils, and tablets, and manufactures popular brands including Seed & Strain, Triple Seven, gLeaf, Classix, Plant Sugar, Press, Amber and Platinum Label CBD. For more information on Columbia Care, please visit www.col-care.com.\n\nRecognized for its comprehensive benefits, ongoing training opportunities and commitment to diversity, equity inclusion both internally and with external vendors, Columbia Care has earned a spot on mg Magazine’s America’s Top Cannabis Industry Employers list.","slug":"extraction-technician-5229afa5-b236-4640-a5d7-08b64ca1e226","benefits":["Health insurance"],"selectedSkills":["Manufacturing","High-performance liquid chromatography","Bachelor's degree","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=zBDtvI90V4rt6QJO2AFKVcztZi8Aluh5BW_noEqdDWuZAXtR_rEljA"},{"position":"Analyst I","labName":"R.I. Analytical Laboratories, Inc.","location":"Warwick, RI","age":"5 days ago","type":"Full-time","salaryMin":"$18 ","salaryMax":" $23 an hour","jobDescriptionCopy":"R.I. Analytical Laboratories, Inc.\n\n\nPosition Announcement\n\n\nJob Title: Analyst I\n\n\nPosition: Environmental Chemist\n\n\nDepartments: Metals\n\n\nSupervisor: Department Team Lead\n\n\nPosition Summary:\n\n\nRI Analytical Laboratories, Inc. is a leading environmental, product & materials, and cannabis testing laboratory that has been serving the southern New England area for over 40 years. RI Analytical is seeking a highly motivated individual to join our team in Warwick, RI as a full-time analyst in our metals department.\n\n\nIn this role you will be responsible for providing operational support in your department by actively participating in daily laboratory production. Further, you will work with the department Team Lead to develop laboratory skills to ensure that workflow is managed according to sample holding time, priority status, and due dates while remaining compliant with RI Analytical’s quality systems, standard operating procedures (SOPs), health & safety regulations, and company policies. As skills develop, you will assist with the training of Chemists and perform basic troubleshooting of laboratory issues.\n\n\nAs an Analyst I, your essential functions will be to:\n\n\nActively participate in daily laboratory production. This should account for approximately 90% of your work time. In time, this may include review of raw data.\nWith assistance from the Team Lead, coordinate workflow to achieve most effective production while satisfying requirements for quality, on-time performance, and holding time with minimal supervision.\nPerform basic troubleshooting of common laboratory issues.\nFollow procedures as outlined in SOPs relevant to trained assays.\nComplete an Initial Demonstration of Capability (IDC) prior to performing analytical testing on samples independently and then complete an annual Continuing Demonstration of Capability (CDC).\nAdhere to R.I. Analytical’s Chemical Hygiene Plan, Code of Ethics and other policies defined in the Quality Manual, and Employee Handbook.\nCommunicate any laboratory issues in a timely manner to the Team Lead.\nMaintain and promote clean, organized, and functional work areas.\nOther duties as assigned by the Team Lead or senior management.\n\nQualifications:\n\n\nEducation - At minimum, an Associates’ degree in chemistry or related science.\nA Bachelor’s degree in chemistry or related science is preferred.\n\n\nExperience - A minimum 2 of year’s laboratory experience is preferred.\n\n\nRI Analytical Laboratories, Inc. is an equal opportunity employer.\n\n\nJob Type: Full-time\n\n\nPay: $18.00 - $23.00 per hour\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nFlexible schedule\nHealth insurance\nLife insurance\nPaid time off\nReferral program\nRetirement plan\nTuition reimbursement\nVision insurance\n\nSchedule:\n\n\n8 hour shift\n\nCOVID-19 considerations:\nAll persons entering the building are required to weak a mask if unvaccinated and common areas are sanitized on a regular basis.\n\n\nEducation:\n\n\nBachelor's (Preferred)\n\nExperience:\n\n\nLaboratory Experience: 2 years (Preferred)\n\nWork Location: One location\n","slug":"analyst-i-b67778eb-8947-4e4d-86e5-0572a8f36aa2","benefits":["Health insurance","401(k) matching","Tuition reimbursement","Paid time off","Flexible schedule"],"selectedSkills":["Laboratory experience","Bachelor's degree","Associate's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=ssb728a9bEEZs4Xd11uVZ-kxsf3iL7kkO9UhEX4mW_G2fLv7XhbX8Q"},{"position":"Compliance Technician","labName":"Showdown Enterprises","location":"Edmond, OK","age":"7 days ago","type":"Full-time","jobDescriptionCopy":"We are looking for a Compliance Technician to join our team!\n\n\nResponsibilities:\n\n\nWork directly with Compliance Manager to ensure that our operations and business transactions follow all relevant OMMA and newly mandated seed-to-sale compliance tracking program (METRC)\n\n\nYou will be in assisting in all compliance related matters including product intakes, production, inventory control (both packaging AND plants), laboratory testing, outgoing products, and more.\n\n\nAssist in audit processes, practices and documents to identify weaknesses\n\n\nCollaborate with external auditors (OMMA, METRC) and HR when needed\n\n\nAssist in maintaining regulations and industry practices\n\n\nKeep abreast of internal standards and business goals\n\n\nQualifications:\n\n\nYou should be familiar with the industry’s standards for all compliance tracking, have previous industry experience working hands on with third-party Seed to Sale systems or METRC\nSpecific experience working with third-party Seed to Sale systems or METRC in Oklahoma or a cannabis legal state\n\n\nKnowledge of legal requirements and controls (e.g. OMMA regulations, METRC requirements, Oklahoma cannabis testing and inventory rules and regulations, etc.)\n\n\nFamiliarity with industry practices and professional standards\n\n\nExcellent communication skills\n\n\nIntegrity and professional ethics\n\n\nTeamwork skills\n\n\nAttention to detail\n\n\nSeed-to-sale compliance: 1 year (Required)\n\n\nJob Type: Full-time\n\n\nPay: From $14.00 per hour\n\n\nBenefits:\n\n\nEmployee discount\n\nSchedule:\n\n\n8 hour shift\n\nCOVID-19 considerations:\nWe have face masks, gloves, and hair nets on site due to the nature of our business.\n\n\nEducation:\n\n\nHigh school or equivalent (Preferred)\n\nExperience:\n\n\nSeed to Sale: 2 years (Required)\n\nWork Location: One location\n","slug":"compliance-technician-1f5985cc-8668-43e2-945b-a00890532e5f","benefits":["Employee discount"],"selectedSkills":["Communication skills","High school diploma or GED"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=7E6izN06KeGU5bhbV7mFLs90W4iOYPDHNJBpmxEdGy7QL1ts1Q4iJA"},{"position":"VP, Scientific R&D","labName":"Fluresh","location":"Grand Rapids, MI","age":"5 days ago","type":"Full-time","salaryMin":"$69,000 ","salaryMax":" $100,000 a year","jobDescriptionCopy":"Company:\n\n\nFluresh is a modern wellness company dedicated to empowering patients to confidently improve their well-being through cannabis. Our goal is to provide the Michigan marketplace with a growing portfolio of high-quality, branded cannabis products that are safe, reliable and trustworthy. Fluresh has two state-of-the-art integrated operations in Adrian and Grand Rapids, Michigan, to grow, harvest, process, provision and package the highest quality premium medical cannabis product to allow patients to make the right choice with trust, dependability, consistency, and care.\n\n\nPosition Summary:\n\n\nThe VP, Scientific R&D is responsible for the scientific direction of the company and for developing and implementing the company’s scientific strategy. The VP oversees the research and development (R&D) department, which is responsible for creating new products and technologies, and its staff. He/she works closely with the CEO and other senior executives to ensure that the company’s products and technologies are aligned with the company’s business goals and advance Fluresh’s reputation as a leader in the industry. He/she works with the marketing and sales departments to ensure that the company’s products are positioned correctly in the marketplace and that they meet customer needs.\n\n\nThe VP is expected to stay updated on technological advances and industry trends and to advise the Company’s's senior management in scientific matters. This may include making recommendations on future projects, such as new research opportunities or technological ventures.\n\n\nEssential Duties and Responsibilities:\n\n\nLead science-focused strategic planning activities, such as identifying new research opportunities, assessing potential commercial applications of research, and developing long-term research plans\nDirect research on current areas of interest such as conversion of cannabinoids into water soluble products; optimizing plant feed formulations; developing unique, alternative methods for extraction of cannabinoids\nDevelop research and new product development proposals, budgets, and timelines for new projects\nLead development of patentable innovations\nManage the Company’s research budget to ensure that projects are properly funded, completed on time, and within budget\nEstablish alliances with industry organizations, government agencies, and academic instititues that have similar research interests or goals in order to keep up with and advance industry knowledge\nRepresent the scientific goals and interests of the company at press conferences, meetings, conventions and shareholder events\n\nRequired Experience, Education, and Skills\n\n\nBachelor’s degree in chemistry, pharmacy, or food science or related field is required from an accredited college or university\n3-5 years experience as a Laboratory Technician/Manager in a raw materials, brand products, or contract manufacturing company required\n7+ years of experience in industry, academia, and/or consumer product / cannabis research organizations preferred\nExperience in the consumer health and beauty aids industry or the food industry working on a variety of products is highly preferred\nWorking knowledge and experience in GMP, GAP, GLP regulated environments\nLab Information Management Systems (LIMS) experience is required\nExperience leading sensory panel testing is required\nPractical/production knowledge of nano particle reduction, nano emulstification, and product formulation technologies.\nUnderstanding of and actions to undertake from Sap analysis\nProven record of strategic research leadership, including the ability to drive innovative, collaborative, and interdisciplinary research programs and partnerships with multiple stakeholders\nExcellent people manager and mentor of scientific staff to build high-performing teams\nExceptional written and verbal communication skills to scientific, patient, and lay audiences\nStrong critical thinking and problem-solving skills\nAbility to thrive in an entrepreneurial, fast-paced, solution-oriented, and highly collaborative environment\n\nJob Type: Full-time\n\n\nBenefits:\n\n\n401(k) matching\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\n\nSupplemental Pay:\n\n\nBonus pay\n\nEducation:\n\n\nBachelor's (Preferred)\n\nExperience:\n\n\nLab Tech, Manager in manufacturing: 3 years (Preferred)\nResearch & development: 7 years (Preferred)\nConsumer Packaged Goods: 4 years (Preferred)\nGMP and GLP: 2 years (Preferred)\n\nWork Location: One location\n","slug":"vp-scientific-rd-c46b954d-2947-4e28-bc05-0d3120baee4f","benefits":["Dental insurance","Health insurance","401(k) matching","Paid time off","401(k)"],"selectedSkills":["Manufacturing","Research","GLP","CGMP","Laboratory experience","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=0jcoaesJ2SkA3tlmvFgCjIMI_FLuY_2v0NcJV7jZJa1EsIPeLXix_Q"},{"position":"Senior Analytical Chemist","labName":"Harrens Lab Inc.","location":"Hayward, CA","age":"2 days ago","type":"Full-time","salaryMin":"$81,000 ","salaryMax":" $110,000 a year","jobDescriptionCopy":"We are a testing laboratory on food, food suplement, agricultural products, plants, cannabis, hemp and other matrix for nutritional factors, purity, residue of pesticides and solvents, microbiology , etc. We are currently looking for a hard working talent to join our diverse team.\n\n\nDuties\n\n\nMethod development and validation, optimize SOPs\nMaintain, trouble shoot and optimize the analytical instruments such as HPLC, GC, LC/MS/MS, GC/MS/MS etc.\nEnsure proficient workflow in timely.\norder lab supply and consumable\nOperate and data interpret LC/MS/MS, GC/MS/MS, HPLC, GC and other instruments, and make sure all tests compliance with all regulations\nproblem solving\nMaintain a clean and safe laboratory environment\n\nQualifications:\n\n\n\\* Education on analytical chemistry, biochemistry, bio-engineering or related area\n\n\n\\* At least 5 years experience on HPLC, GC, LC/MS/MS, GC/MS/MS etc. experience with Shimadza is a plus\n\n\n\\* Good communication skill and good personality.\n\n\n\\* Management experience.\n\n\n\\* Attention to details\n\n\n\\* Fast path, meet the deadline and can work under the pressure\n\n\n\\* Motivated and hard working\n\n\n\\*Independent and team player\n\n\nPlease send your resume, cover letter and salary expectation to the email on indeed. We will contact the candidate who meet the requirement. Thank you very much for applying.\n\n\nJob Type: Full-time\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\n\nAbility to commute/relocate:\n\n\nHayward, CA: Reliably commute or planning to relocate before starting work (Required)\n\nExperience:\n\n\nAnalytical chemistry: 5 years (Preferred)\n\nWork Location: One location\n","slug":"senior-analytical-chemist-5c28828a-08a8-43f2-b0c7-053b2a83db1f","benefits":["Paid time off","Dental insurance","401(k)","Health insurance","Vision insurance"],"selectedSkills":["Gas chromatography","Communication skills","Management","Analytical chemistry","High-performance liquid chromatography"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=qRCCXHRLpgnncSzNcKGUZx_o9WzBqjNjWAw0n_PrIo8qCMQdbekYRw"},{"position":"Extraction Manager","labName":"WholesomeCo Cannabis","location":"Centerville, UT","age":"5 days ago","type":"Full-time","salaryMin":"$60,000 ","salaryMax":" $80,000 a year","jobDescriptionCopy":"Job Title: Extraction Manager\nJob Status: Full-time\nLocation: Centerville, Utah\nSalary: $60,000 - $80,000 based on experience\nBenefits: PTO, medical insurance with employer contribution, dental insurance with employer contribution, vision insurance with employer contribution, HSA with match, and 401(k) with match\n\n\n*\nAbout WholesomeCo: *\n\n\nWholesomeCo Cannabis is a leading medical cannabis provider in Utah. We are a complete plant to patient pharmacy that has grown rapidly since inception. We believe in the medicinal value of cannabis as a natural path to health and wellness. We are constantly adapting ourselves to better serve our patients, community, and employees. Our company prides itself on fostering a collaborative, friendly, and productive workforce. Every new hire is critical to our success as a business.\n\n\n*\nAbout This Role: *\nWholesomeCo Cannabis is seeking an exceptional Extraction Manager to lead the vision, strategy, and execution of extraction production goals.\n\n\nThe Extraction Manager facilitates and supervises the process of commercial production of Cannabis distillate as well as Cannabis concentrate production. The Manager is required to critically assess biomass, actuate respective production goals and develop and oversee each stage of the process to materialize these goals. The Manager is responsible for gathering critical data to evaluate each step of the process (yields, loss, optimization, etc) and present weekly productivity reports to their supervisor. The Manager is required to maintain compliance with state guidelines and manage operations in accordance with company standards to meet production goals. This position is responsible for the development of standard operating procedures for each piece of equipment, and integrating proprietary processing techniques to maintain a competitive advantage amongst cannabis processors in Utah. The Manager is responsible for providing a clear plan of action for employees to reach established goals set forth by management to attain department bonus potential. The ideal Manager will have experience in Hydrocarbon, Ethanol, and Solventless extraction methods, in addition to experience/knowledge on concentration production.\n\n\n*\nJob Responsibilities: *\n\n\nOrganizing and maintaining laboratory operations procedures, scheduling, and staffing to ensure cost-efficient and timely production of medical cannabis products meeting management goals.\nTroubleshoot and maintain laboratory equipment\nEnsure consistency and efficacy of products.\nAccurately track production and use of raw materials utilized in producing finished goods.\nProvide expert recommendations on specific Cannabis concentrate formulations to meet the needs of patients and strategic approaches set forth by the executive team.\nOversee daily laboratory activities for extraction and processing of cannabis concentrate products.\nAssess the product inventory requirements and coordinate with the post harvest processing team to ensure an adequate supply of cannabis is available to meet all facets of the company’s strategic approach.\nProvide weekly, monthly, annual reporting on production of distillate and concentrate products, projections, and compliance.\nManage vendor relationships for extraction equipment to ensure quality of equipment.\nCoordinate with state-approved laboratories to provide samples for regular testing of distillate and concentrates and ensure all results are documented in compliance with state regulations.\nEnsure that sanitation, safety and security protocols are strictly enforced throughout the extraction lab in accordance with the company’s standard operating procedures and state regulations.\nForecast and source in conjunction with the fulfillment department to ensure that concentrate products are produced in accordance with demand.\nManage extraction personnel, ensuring all standard operating procedures are strictly adhered.\nEnsure all extraction are fully trained on the company’s equipment, procedures and policies, and reinforced or updated as needed.\nDesign statistically grounded studies to optimize each individual piece of equipment and process to meet efficiency, efficacy, and quality targets set forth by the executive team.\nPerform other duties as assigned.\n\n*\nJob Requirements: *\n\n\n2+ years of experience working in a cannabis extraction lab with Hydrocarbon/Ethanol extraction experience (required) and solventless extraction experience (prefered)\n4+ years of experience in a related processing/manufacturing industry\nBachelor's degree or equivalent experience\nMust pass a pre-employment post-offer background check, per applicable requirements set by WholesomeCo and state statute\nStrong verbal and communication skills\nAbility to excel in executing operational strategy\nDemonstrated track record of success leading teams in a processing/manufacturing setting\nAbility to work independently (and as a team), exercise creativity, be attentive to detail, and maintain a positive attitude\nAbility to stand or sit for 8-12 hours daily\nAbility to lift up to 25 pounds, multiple times daily\nAbility to crawl, bend, and reach\n\n*\nBenefits: *\n\n\nEmployer-paid 80% of the total medical insurance premium\nEmployer-paid 75% of the total dental insurance premium\nEmployer-paid 75% of the total vision insurance premium\nHealth Savings Account option for eligible health plans with up to a $150 match\n401(k) with up to a 4% match\nPaid time off\n\nxlXuUeCX6b\n\n\nJob Type: Full-time\n\n\nPay: $60,000.00 - $80,000.00 per year\n","slug":"extraction-manager-7434e712-8531-4360-9781-fa04086d061d","benefits":["Health savings account","Dental insurance","Health insurance","401(k) matching","Paid time off"],"selectedSkills":["Manufacturing","Laboratory experience","Communication skills","Bachelor's degree","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=OpNwVD5QEhnppBM5S2o_i_oMobbqACCPrOfSi7nnPZx3O-QgI-HyMA"},{"position":"Microbiologist","labName":"US Cannalytics","location":"East Hanover, NJ","age":"2 days ago","type":"Full-time","salaryMin":"$39,000 ","salaryMax":" $49,000 a year","jobDescriptionCopy":"Microbiologist – 9AM-5PM Monday - Friday\n\n\nJob description\n\n\nUS Cannalytics is a multi-state testing lab with locations in NJ, PA and FL. We are in search of an Microbiologist in our PA location that seeks a challenging position in an independent testing laboratory serving the medical and adult-use cannabis industry in Pennsylvania. The anticipated schedule for this position will be 3PM-11PM Tuesday to Saturday.\n\n\nMICROBIOLOGIST RESPONSIBILITIES:\n\n\nThe microbiologist is responsible for the testing, quality control, and tracking of medical cannabis samples for microbiological assays - TAMC, TYMC, E.coli, and Salmonella - utilizing qPCR and traditional growth plate techniques.\n\n\nQUALIFICATIONS, must:\n\n\nHave a valid driver’s license\n(1) year experience using post-grad qPCR/PCR based platform\n(1) year experience utilizing post-grad culture-based microbiological analysis\n\nESSENTIAL DUTIES:\n\n\nFollow policies and procedures for the daily operations and fully comply with state medical marijuana regulations\nPrepare samples for mandated state testing utilizing qPCR and culture-based techniques\nProducing, tracking, and documenting QCs throughout process\nUse of aseptic technique to handle, prepare, and analyze samples\nResponsible for inventory of supplies and cannabis tracking and destruction\nResponsible for accurate weighing and recording all product weights\nWorks in a timely manner and strives to improve quality and maintain accuracy\nPerforms all other tasks and duties as assigned, which may include cannabis sampling, transport, and sample preparation\n\nJob Type: Full-time\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nOvertime\nWeekend availability\n\nWork Location: One location\n","slug":"microbiologist-856ba2e3-e810-41bb-b077-7a150579aee8","benefits":["Paid time off","Dental insurance","Health insurance","Vision insurance"],"selectedSkills":["Microbiology","Driver's License","PCR"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=E3cs_Sj0wxdyk0NSTWZ2i-dzMCBNt1JKAWNw2QURM1885FwZ2Z_YAw"},{"position":"Research and Development Supervisor - Hemp","labName":"Octopi Brewing / Untitled Art","location":"Waunakee, WI","age":"6 days ago","type":"Full-time","salaryMin":"$75,000 ","salaryMax":" $85,000 a year","jobDescriptionCopy":"Job Summary:\n\n\nThe R&D Supervisor will maintain inventory levels of CBD and cannabis-related product by emulsifying and perform laboratory testing on various hemp products. They will closely monitor quality of inbound product and finished beverages. This role is responsible for overseeing the R&D department as it grows. They will work with Packaging, Brewing, and Inventory departments at Octopi to optimize output and ensure quality beverages.\n\n\nPrimary Responsibilities:\n\n\nEnsure CBD/Hemp isolate is sourced from quality, GMP lab.\nEmulsification/post-extraction processing of CBD/Hemp on demand.\nMaintain inventory levels of product.\nFollow SOP for emulsification process and create new SOPs for procedures.\nMeasure, mix, and process in accordance with State/Federal standards.\nProduce consistent, quality product.\nR&D on new processes, ingredients, or technologies to expand our offerings and better our products.\nTest final product at 3rd party lab.\nTest brite tank product on gas chromatograph to ensure potency prior to packaging.\nPrepare and ship out beverage samples to clients.\nMaintain lab notebook of batches produced.\nDocument work performed for compliance purposes.\nEnsure traceability from sourced product to finished product.\nPerform research on new hemp-related products including Delta 8-9 and THC.\nStay up to date on trends and research in cannabis beverage industry and extraction processes.\nTrain technicians on use of laboratory equipment, as needed.\nSanitize and maintain laboratory equipment.\nCommunicate with external suppliers.\nMaintain clean and organized work environment.\nPerforms other related duties as assigned.\n\nRequired Skills/Abilities:\n\n\nStrong attention to detail and maintaining organization\nAbility to function well in a fast-paced environment\nAbility to lift 50lbs, ability to push heavier equipment on carts\nMaintain confidentiality with business related information\nProficiency with Microsoft Office programs\n\nEducation and Experience:\n\n\nHigh school diploma required\nAssociate's or Bachelor’s degree in science-related field, preferred\n3+ years in laboratory position\nPrior knowledge of analytical science of compounds\nUnderstanding of GMPs and beverage compliance\n\nAbout Our Team:\n\n\nAt Octopi, our mission is to support our clients in growing their brand. We are also looking for energetic candidates to grow with us at Octopi. As we complete our current expansion, we will increase the output of our state-of-the-art production and brewing facilities. We have plans to grow production over 400% in the next 3 years, while continuing to be on the leading edge of innovations in the beverage industry.\n\n\nQualified individuals are detail-oriented, collaborative, growth-focused, and self-motivated. Our team is a community; we are open, informal and laid back, but also hard working and respectful of others. You should be as well.\n\n\nQualified and interested individuals should please submit their letter of intention and resume.\n\n\nCompensation varies based on experience. Health insurance, dental, vision, paid time off, 401k and other extra perks.\n\n\nWe are an equal opportunity employer.\n\n\nOctopi requires that employees are vaccinated for COVID-19 (unless they have a medical/religious exemption).\n\n\nOffers of employment at Octopi are contingent upon clear results of a thorough background check. Background checks will be conducted on all final candidates, as deemed necessary.\n\n\nJob Type: Full-time\n\n\nPay: $75,000.00 - $85,000.00 per year\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nEmployee discount\nHealth insurance\nLife insurance\nPaid time off\nReferral program\nRetirement plan\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nMonday to Friday\n\nApplication Question(s):\n\n\nAre you comfortable with our COVID vaccination policy (unless exempt)?\n\nExperience:\n\n\nProject management: 1 year (Preferred)\nFDA regulations: 1 year (Preferred)\n\nWork Location: One location\n","slug":"research-and-development-supervisor-hemp-b7a36b97-9416-4c27-ac0f-9f36963b1060","benefits":["Dental insurance","Employee discount","Health insurance","401(k) matching","Paid time off"],"selectedSkills":["Project management","FDA regulations","Microsoft Office","Bachelor's degree","High school diploma or GED","Associate's degree","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=H33afgcU9wTC-ElspMfT9BrBlnbG1Q8Dwj3fL07aWnsoPIZvdmKa8Q"},{"position":"Product Manager","labName":"SC Laboratories","location":"Santa Cruz, CA","age":"7 days ago","type":"Full-time","salaryMin":"$90,000 ","salaryMax":" $125,000 a year","jobDescriptionCopy":"Company Profile\n\n\nSC Laboratories, listed by mg Magazine as one of America’s Top Cannabis Industry Employers for 2021, is an analytical laboratory based in Santa Cruz, California, specializing in safety and quality assurance testing for the Cannabis and Hemp industries. We are seeking to add to our collaborative team in Santa Cruz, CA or Denver, CO, and at this time are focused on hiring a full-time Product Manager, reporting directly to our COO.\n\n\nPosition Summary\n\n\nThe Head of Product Management is a product leader with deep domain experience in understanding the process of requirements gathering, from customers, the market, sales, marketing, and from subject matter experts within the business. The Product Manager is tasked to evaluate the overall market impact of those requirements and set the priorities for the business in delivering new products. New products for SC Laboratories are test methods. Cannabis and Hemp compliance and R&D tests are the services that the company delivers, or in this context, the “products.” The cannabis and hemp markets are dynamic. These markets are impacted by changing regulatory conditions and evolving customer product focus. To ensure SC Laboratories is the market leader in testing services, it is vital that the Company have this role so that R&D is focused on testing service development that delivers maximum impact.\n\n\nThe selected Product Manager will bring a demonstrated track record of identifying industry and customer needs; monitoring the market; developing competitive analysis and maintaining competitive intelligence; setting product pricing to meet revenue and profitability goals; developing product roadmaps; as well as leading the launch and servicing of all products.\n\n\nThe ideal candidate will be creative, analytical, and well organized, with a high level of attention to detail. The successful candidate is a strong communicator, highly organized, and able to build and maintain strong relationships both within and outside the organization.\n\n\nSpecific Duties/Responsibilities:\n\n\nAnalyze the market, buyers, trends, industry-specific challenges, and competitors to create strategic positioning that differentiates the Company in the cannabis testing space\nDevelop the internal processes to have a mature, actionable, and justified R&D method pipeline\nBe the expert in competition, customer requirements, and collaborating internally with regulatory experts to understand new regulatory testing requirements\nWork closely with R&D, sales, marketing, and finance across all activities\nCollaborate with demand generation teams to execute targeted campaigns that drive pipeline\nConduct market research, including buyer interviews to inform priorities\nEvaluate the ROI of test methods or “products”\n\nQualifications and Required Experience:\n\n\n8+ years of experience in a product management\nDemonstrated success managing products\nStrong problem-solving skills and willingness to roll up one’s sleeves to get the job done\nExperience in hemp, cannabis, science, healthcare, or pharma industries preferred\nCertification in Product or Project Management is preferred but not required\nJob is based in Santa Cruz, CA or Denver, CO\n\nKey Competencies:\n\n\nProblem Solving\nBusiness Acumen\nStrategic Thinking\nDrive for Results\nCustomer Focus\nIntegrity and Trust\n\nPersonal Characteristics; Style and Fit\n\n\nA ‘hands-on’ expert that fosters a low-bureaucracy, high-accountability environment.\nCapable and confident in making difficult decisions in a timely manner.\nAn analytical mindset with a rigorous data-driven approach to decision-making.\nPassion for the company’s value proposition and the future potential for the company.\nPro-active, self-motivated, team-oriented, driven.\nAbility to work effectively cross functionally with leadership and teams.\n\nJob Type: Full-time\n\n\nPay: $90,000.00 - $125,000.00 per year\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nHealth savings account\nPaid time off\nReferral program\nRetirement plan\nVision insurance\n\nSchedule:\n\n\n8 hour shift\n\nSupplemental Pay:\n\n\nBonus pay\n\nExperience:\n\n\nProduct management: 8 years (Preferred)\n\nWork Location: Multiple Locations\n","slug":"product-manager-707adfde-91f4-4736-b44e-1759f5dc1d0f","benefits":["Health savings account","Dental insurance","Health insurance","401(k) matching","Paid time off"],"selectedSkills":["Requirements gathering","Product management","Communication skills"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=RRLmqCz3u-Lg7kAYPvNOLEbRxxeHVXYypD7RGueuUziErgOm0nw2dw"},{"position":"Extraction Technician","labName":"Trulieve","location":"Holyoke, MA","age":"18 hours ago","type":"Full-time","jobDescriptionCopy":"Job Title: Extraction Technician\n\n\nDepartment: Processing\n\n\nReports to: Oil Supervisor or Team Lead\n\n\nFLSA Status: Regular-Non-Exempt\n\n\nShift: 5am-1:30pm Mon-Fri\n\n\nPlease apply directly at: https://careers.trulieve.com/job-invite/945/\n\n\nRole Summary:\n\n\nTrulieve is looking for an Extraction Technician to support our extraction and production operations. You should be very technically astute in mechanical, electrical, and computer operated systems utilized in production/manufacturing environments. You need to be proactive, quick thinking and innovative in your approach.\n\n\nKey Duties and Responsibilities:\n\n\nPreparation of equipment and plant materials for extraction\nExecution of extraction and processing in accordance with state and local standards\nOperation of sophisticated extraction equipment\nEnsure consistency and efficiency of product through quality control testing and procedures\nCleaning and maintenance of extraction equipment and manufacturing facility\nMaintaining strict inventory records of all plant materials, chemicals, and equipment used in the facility\nOversee day-to-day operations of the entire extraction space beginning with storing the raw cannabis through the extraction process and all the way to fulfillment of orders\nOperating, maintaining, and making adjustments and repairs to extraction equipment\nStoring supplies and equipment and disposal of waste according to guidelines\nComplete the cleaning and sanitization of all production equipment, work surfaces, and tools\nMaintaining inventory records of supplies, materials, and equipment and preparing requisitions as needed\nMaintaining material safety data sheets for all chemicals and products\nFollowing all standard operating procedures regarding product creation and lab safety\nAssist in packaging and labeling of finished products\nWorks with testing laboratory as defined by state guidelines\nAll other duties as assigned\n\nRequirements\n\n\nSKILLS AND QUALIFICATIONS:\n\n\nBachelor’s or Associate degree or its equivalent, from a recognized college or university, with a major in chemistry or biology preferred\nUnderstanding of state and local laws\nUnderstanding of proper and safe handling of hazardous materials\nFamiliarity with separations, isolations and fractionation\nKnowledge of solvent and non-solvent extraction methods\nStay current of practices and new developments in the cannabis extraction industry\nAbility to work quickly without compromising accuracy\nAbility to discern the quality of plant material and finished products\nStrong computer and social skills\n\nPHYSICAL REQUIREMENTS:\n\n\nMust be able to push, pull, move, and/or lift a minimum of 25lbs to a minimum height of 5 feet and able to push, pull, move, and/or carry such weight a minimum distance of 50 feet, with or without mechanical assistance\nMust be able to work seated/standing as appropriate at workstations for extended periods of time, maintain body equilibrium while climbing ladders, stairways, stopping, kneeling, crouching, and reaching, and use hands/fingers to hold, grasp, turn, pick, pinch frequently/constantly to complete tasks\nMust be able to handle organic matter daily, able to wear PPE as appropriate (eye, face, hand, arm, head, foot, body, fall protection), and able to be exposed to hot, cold, wet, humid, or windy conditions while wearing PPE (95 degrees or greater)\nMust have visual acuity with/without job aids to perform activities such as; reading, viewing a computer terminal, visual inspection involving small parts/details. Clarity of vision at 20 ft or more in day and night/dark conditions\nMust be able to speak and communicate verbally at conversation levels with co-workers, vendors, etc. (Moderate noise)\n\nWORK SCHEDULE:\n\n\n40+ hours weekly with flexible hours depending on department needs. Must be available to work occasional evenings, weekends, and holidays\n\nEqual Opportunity Employer l Trulieve Supports a Drug Free Workplace\n\n\nPlease apply directly at: https://careers.trulieve.com/job-invite/945/\n\n\nJob Type: Full-time\n\n\nPay: From $17.50 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\n\nApplication Question(s):\n\n\nAre you available to work 5am-1:30pm, Mon-Fri?\n\nExperience:\n\n\ncannabis industry: 1 year (Preferred)\nextraction: 1 year (Preferred)\nmachine operating: 1 year (Preferred)\n\nWork Location: One location\n","slug":"extraction-technician-a0ec66eb-823e-4566-aad8-3dd8185bc1b7","benefits":["Dental insurance","Flexible schedule","Health insurance","Vision insurance"],"selectedSkills":["Computer skills","Bachelor's degree","Associate's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=HgM4qIMPz7rujrbkAILUk2LZg9g93CJHKbXIeFZK3NxhxxwUJMN7lQ"},{"position":"Quality Assurance Manager - Testing Lab","labName":"RDP Development","location":"Las Vegas, NV","age":"1 day ago","type":"Full-time","salaryMin":"$45,000 ","salaryMax":" $60,000 a year","jobDescriptionCopy":"We are a Cannabis Testing Lab based in Las Vegas. Our goal is to protect patients and consumers by certifying that the product they are consuming have undergone the same level of stringent testing as other drug and food products.\n\n\nQuality Manager\n\n\nResponsibilities within the ISO 17025:2017 Quality Management System\nThe Quality Manager has defined responsibility and authority for ensuring that the quality management system related to quality in the laboratory is implemented and followed at all times. The Quality Manager has direct access to the highest level of management where decisions are made on laboratory policy or resources.\n\n\nThe Quality Manager maintains the master list identifying\nthe current revision status and distribution of documents in the QMS to prevent the use of obsolete documents.\n\n\nRequired Qualifications, Training & Skills\n\n\nMust be self-motivated, energetic and possess the ability to work in a diverse GLP laboratory environment under a QMS. Candidate must have deep understanding of analytical techniques with hands-on experience in method development leading to the creation of SOPs, LIMS interface and basic chemistry techniques e.g. HPLC, GC-MS, LC-MS.\n\n\nThis position requires the candidates to have adequate statistical analysis skills, good concept of quantification, accuracy/variation, and organizational skills. Candidates must have the ability to work independently with minimal supervision; have strong trouble-shooting, computer and record keeping skills and problem-solving skills.\n\n\nSpecifically\n\n\nServes as the focal point for the QMS\nOversees and provides secondary approval for all certificates of analyses published by lab\nApproves all controlled laboratory documentation\nOversees quality control data.\nEvaluates data objectively and performs assessments without managerial influence.\nMaintains ISO 17025 accreditation and compliance with State and local regulatory requirements, including quality checks and compliance of safety standards such as, but not limited to, OSHA, Fire Marshall and Police\nOversees the Quality Assurance and Control Program\nManages and maintains all laboratory controlled documentation\nPerforms internal audits, including both technical and quality systems and direct any necessary corrective action notifying management of deficiencies or opportunities for improvement\nDevelops and maintains laboratory policy and procedural manuals, quality procedures, SOPs, equipment requirements, and evaluating and implementing new procedures as necessary.\nPerforms, schedules, and records internal laboratory inspections as necessary\nOversees the LIMS and general records management.\nProvides oversight of human resources and any adherences required as an equal opportunity facility\nServes as the laboratory safety officer with oversight on all safety systems in adherence with ISO 17025, OSHA, NAC 453A, and any other laboratory safety organizations\nMaintains chemical/equipment traceability records and generating control charts.\nMaintains training records for all lab staff.\nGenerates training plans for all laboratory staff.\nCreates and maintains internal training processes for all laboratory staff including (but not limited to) any necessary retrainings, safety training, good laboratory practices, quality assurance programs, and continuing education\nSchedules proficiency testing for all analytes\nMonitors CAPAs, non-conformances, OOS, failed tests, repeat tests employee incidents, and client complaints for areas of improvement\nMay oversee and sign-off on any laboratory documentation as needed\nMay step in and perform any tasks assigned in the lab as needed\n\nDesired Skills\n\n\nDemonstrated expertise in sample chain of custody protocols, large dataset analysis, should be aware of emerging analytical techniques, experience using LIMS, familiar with cGMP and GLP requirements, as well as working under a Quality Management System are favored.\n\n\nRequired Education, Expertise & Experience\n\n\nA Bachelor’s Degree (BS) or greater in chemistry, biochemistry, microbiology or equivalent with 5 years of relevant experience is REQUIRED.\n\n\nExcellent written and oral communication skills, previously demonstrated successful managerial or supervisory experience and previously demonstrated successful ability to contribute in a team Quality Management System environment are essential.\n\n\nJob Type: Full-time\n\n\nPay: $45,000.00 - $60,000.00 per year\n\n\nBenefits:\n\n\nHealth insurance\nPaid time off\n\nSchedule:\n\n\nMonday to Friday\n\nAbility to commute/relocate:\n\n\nLas Vegas, NV 89102: Reliably commute or planning to relocate before starting work (Preferred)\n\nExperience:\n\n\nISO 9001: 1 year (Preferred)\n\nWork Location: One location\n","slug":"quality-assurance-manager-testing-lab-dd8c7fe8-08be-40c8-a1dc-23f2617dae0a","benefits":["Health insurance","Paid time off"],"selectedSkills":["Statistical analysis","ISO 9001","Computer skills","CGMP","Laboratory information management systems","Bachelor of Science","Bachelor's degree","US work authorization"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=EP8YI4sXFS1RjXkEP01Pxb_5Q8qd6elZTw0hDmOM0yoD2nAh122ppA"},{"position":"Kitchen Technicians","labName":"Oasis","location":"Chandler, AZ","age":"5 days ago","type":"Full-time","salaryMin":"$28,000 ","salaryMax":" $36,000 a year","jobDescriptionCopy":"ABOUT AYR WELLNESS\n\nWe’re a new kind of cannabis company, aiming higher in everything we do. We grow and sell the highest-quality cannabis products available anywhere, inspiring wellness and wonder in our customers, wherever they are on their cannabis journey. We operate with a sense of responsibility to our customers and patients, building stronger and more socially responsible communities everywhere we go.\n\nJOB DESCRIPTION\n\nThe Kitchen Technician is primarily responsible for the accurate creation, labeling, and packaging of all edibles.\n\nRESPONSIBILITIES\n\nTech I\n\n\nAdhere to SOP’s and Recipes to formulate edible cannabis products.\nPackage, sticker, and count cannabis products/finished goods\nConfirm batch and lot numbers on finished goods’ product labels are correct\nCoordinate third party Laboratory testing and transfers\nCoordinate and execute conversions and transfers\nCarefully manage inventory flow during busy order fulfillment periods\nAbility to multi-task repeatedly with attention to detail and minimal errors\nMaintain a clean and organized work environment\nRead, understand, and follow all CCB regulations relating to inventory control and chain of custody\nOther duties as assigned\nSKILLS/ABILITIES REQUIRED\n\n\nAttention to detail with excellent record keeping ability\nAbility to maintain a high level of cleanliness.\nWillingness to learn and improve each operation\nAbility to perform repetitive tasks for long periods of time\nAbility to work in a fast-paced environment and multi-task\nCommitment to arrive for scheduled shifts on time and maintain consistent attendance\nAvailability to work occasional weekends and holidays\nREQUIREMENTS/PREFERRED EXPERIENCE\n\n\nHigh school diploma or General Education Diploma (GED)\nMust have a clear understanding of weights and measures and ability to operate a scale\nAbility to work within a team and on an individual basis\nFamiliarity with kitchen procedures and cleanliness standards.\nAbility to work in a timely manner and drive to increase productivity\nExperience and knowledge and familiarity with Cannabis\nProficient in Microsoft Office (Word, Excel and Outlook)\nMust be 21 years of age or older, and be able to pass an extensive background check\nMust be authorized to work in the United States\nPHYSICAL REQUIREMENTS\n\n\nAbility to stand on feet or sit for extended periods of time\nAbility to use repetitive use of hands, wrists and forearms\nNormal vision or corrected by use of glasses and/or contacts for normal reading and viewing abilities to determine the accuracy, neatness, and thoroughness of the work assigned, or to make general observations of facilities or structures.\nRequires eye-hand coordination and manual dexterity sufficient to meet job and operate equipment requirements\nRequires normal range of hearing with the ability to perceive the nature of sounds at normal speaking levels with or without correction and having the ability to receive detailed information through oral communication and making fine discriminations in sound.\nAbility to twist, turn, bend, stand and walk as required to perform the duties associated with functioning as a dispensary manager.\nPushing/pulling/carrying, with the ability to lift up to 50 pounds occasionally\nRegular and on-time attendance (Hours may exceed 40 hours per week)\nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n\nWORK ENVIRONMENT:\nWork is performed in several locations that include a cannabis kitchen and production facility. The working area may be odorous at times and loud due to fans and filtration systems, fluctuating between cold and warm temperatures. Involves frequent contact with staff. Work may include dealing with law enforcement and occasional State inspectors.\n\nDISCLAIMER:\nAll the above duties and responsibilities are essential job functions subject to reasonable accommodation. All job requirements listed indicate the minimum level of knowledge, skills and/or ability deemed necessary to perform the job proficiently. Employees may be required to perform any other job-related instructions as requested by their supervisor, subject to reasonable accommodation. This document does not create an employment contract, implied or otherwise, other than an “at will” employment relationship\n\nBP Solutions, LLC is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, veteran status, or any other characteristic protected by federal, state or local law.","slug":"kitchen-technicians-487e6540-193c-4633-bf13-de93d9ddf13f","benefits":[],"selectedSkills":["Microsoft Outlook","Microsoft Excel","Microsoft Office","Microsoft Word","High school diploma or GED","Background check","21 years or older","US work authorization"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=Aiywn1PLbhFD08MgpEXNssP7-wck9qac1iwFBSWl_k8DTRh7oAn_rg"},{"position":"Inventory Technician","labName":"Ayr Wellness","location":"Phoenix, AZ","age":"5 days ago","type":"Full-time","salaryMin":"$32,000 ","salaryMax":" $42,000 a year","jobDescriptionCopy":"ABOUT AYR WELLNESS\n\nWe’re a new kind of cannabis company, aiming higher in everything we do. We grow and sell the highest-quality cannabis products available anywhere, inspiring wellness and wonder in our customers, wherever they are on their cannabis journey. We operate with a sense of responsibility to our customers and patients, building stronger and more socially responsible communities everywhere we go.\n\nJOB DESCRIPTION\n\nThe Packaging Technician primarily responsible for the accurate weighing, labeling, and packaging of all of our products prior to shipping.\n\nRESPONSIBILITIES\n\nTech I\n\nPackage, sticker, and count cannabis products/finished goods\nConfirm batch and lot numbers on finished goods’ product labels are correct\nCreate “Lots” of Bud, Smalls, Shake, and Live Resin in LeafLogix and Metrc as well as physically\nCoordinate third party Laboratory testing and transfers\nConfirm Harvest Batches’ Untrimmed Dry Weights (“Buck” weights) by reweighing and recording weights\nCoordinate and execute conversions and transfers to Extractions Department\nCarefully manage inventory flow during busy order fulfillment periods\nAbility to multi-task repeatedly with attention to detail and minimal errors\nMaintain a clean and organized work environment\nRead, understand, and follow all CCB regulations relating to inventory control and chain of custody\nAssist with supervision of Trim Technicians on trim machine and grinding machine on their workflow and duties\nDelegate cannabis products for processing and trimming\nOther duties as assigned\n\nTech II\n\nMeets all requirements of Tech I\nRegularly exceeds minimum productivity expectations\nMinimum of 1 year experience packaging experience\nAbility to work independently\nOffers mentorship to new employees\n\nTech III\n\nMeets all requirements of Tech II\nMinimum of 2 years packaging experience\nPoint of contact for new employees\nConducts new hire department training\nAble to perform duties of all departmental zones\n\nSKILLS/ABILITIES REQUIRED\n\nAttention to detail with excellent record keeping ability\nWillingness to learn and improve each operation\nAbility to perform repetitive tasks for long periods of time\nAbility to work in a fast-paced environment and multi-task\nCommitment to arrive for scheduled shifts on time and maintain consistent attendance\nAvailability to work occasional weekends and holidays\n\nREQUIREMENTS/PREFERRED EXPERIENCE\n\nHigh school diploma or General Education Diploma (GED)\nMust have a clear understanding of weights and measures and ability to operate a scale\nAbility to work within a team and on an individual basis\nFamiliarity with warehouse procedures\nAbility to work in a timely manner and drive to increase productivity\nExperience and knowledge and familiarity with Cannabis\nProficient in Microsoft Office (Word, Excel and Outlook)\nMust be 21 years of age or older, and be able to pass an extensive background check\nMust be authorized to work in the United States\n\nPHYSICAL REQUIREMENTS\n\nAbility to stand on feet or sit for extended periods of time\nAbility to have extended cannabis exposure, with no adverse physical reaction\nAbility to use repetitive use of hands, wrists and forearms\nFine visual acuity with the ability to adjust focus to inspect closely, ability to recognize different colors.\nNormal vision or corrected by use of glasses and/or contacts for normal reading and viewing abilities to determine the accuracy, neatness, and thoroughness of the work assigned, or to make general observations of facilities or structures.\nRequires eye-hand coordination and manual dexterity sufficient to meet job and operate equipment requirements\nRequires normal range of hearing with the ability to perceive the nature of sounds at normal speaking levels with or without correction and having the ability to receive detailed information through oral communication and making fine discriminations in sound.\nAbility to twist, turn, bend, stand and walk as required to perform the duties associated with functioning as a dispensary manager.\nPushing/pulling/carrying, with the ability to lift up to 50 pounds occasionally\nRegular and on-time attendance (Hours may exceed 40 hours per week)\n\nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n\nWORK ENVIRONMENT:\nWork is performed in several locations that include a cannabis cultivation and production facility. The working area may be odorous at times and loud due to fans and filtration systems, fluctuating between cold and warm temperatures. Involves frequent contact with staff. Work may include dealing with law enforcement and occasional State inspectors.\n\nDISCLAIMER\n\nAll the above duties and responsibilities are essential job functions subject to reasonable accommodation. All job requirements listed indicate the minimum level of knowledge, skills and/or ability deemed necessary to perform the job proficiently. Employees may be required to perform any other job-related instructions as requested by their supervisor, subject to reasonable accommodation. This document does not create an employment contract, implied or otherwise, other than an “at will” employment relationship.\n\nAyr Wellness is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, veteran status, or any other characteristic protected by federal, state or local law.","slug":"inventory-technician-8b00c821-1084-4dfc-8de2-baedf0687b66","benefits":[],"selectedSkills":["Warehouse experience","Microsoft Excel","Microsoft Outlook","Packaging","Microsoft Office","High school diploma or GED","21 years or older","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=5N1d3X9OijVnhihBR_JV3yQ58594vqf3mALHzUOziZi4gGK0dmpjEw"},{"position":"Field Technician","labName":"Viridis Laboratories","location":"Lansing, MI","age":"2 days ago","type":"Full-time","salaryMin":"$17.00 ","salaryMax":" $21.50 an hour","jobDescriptionCopy":"LOCATION: Lansing, MI\n\n\nREPORTS TO: Field Technician Supervisor\n\n\nThe mission of Viridis Laboratories is to ensure health and safety within the cannabis industry by testing cannabis products for potency and purity, and to report results of this testing to consumers, manufacturers and regulatory agencies. As a growing company, we are looking for a full-time Field Technician with cannabis industry experience or experience in random sampling protocols, sample intake, sample tracking and sample storage.\n\n\nESSENTIAL DUTIES AND RESPONSIBILITIES:\n\n\nSample collection, receipt, accessioning and storage.\nFamiliarity/compliance with the chain-of-custody process.\nFamiliarity/compliance with personal protective equipment and its use for safety and in the prevention of cross-contamination of collected samples.\nAssisting scientific staff with ensuring test results are reported through the laboratory information management system to clients, government agencies and other involved or mandated parties.\nAssisting with maintenance of laboratory records and documentation.\nAssisting clients, government agencies and other involved or mandated parties with requests related to laboratory testing or results.\nAssisting with meeting accreditation requirements.\nAssisting with research or inquiries as requested.\nOther duties as assigned.\n\nEDUCATION AND EXPERIENCE REQUIRED:\n\n\nMinimum of high school diploma or relative Military experience\nOne years’ experience in an analytical or academic laboratory setting and/or two years' experience in cannabis industry.\nFamiliarity with data entry and throughput.\nAttention to detail and excellent communication skills.\n\nCOMPENSATION AND BENEFITS PACKAGE:\n\n\nSalary negotiable and commensurate with experience and education (range $17.00 - $21.50/hour). This position is eligible for a matching 401K program and health care benefits.\n\n\nApplicant screening will include a background check. This position requires compliance with random drug testing and on-going random drug testing.\n\n\nApplicants must be at least 21-years-old to be eligible for employment within Michigan's Cannabis industry.'\n'\nWork Location:\n\n\nOne location\n\nWork Remotely\n\n\nNo\n\nJob Type: Full-time\n\n\nPay: $17.00 - $21.50 per hour\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nOvertime\nWeekend availability\n\nCOVID-19 considerations:\nCompany provided PPE\n\n\nWork Location: One location\n","slug":"field-technician-be7fa11d-482c-4b7a-9e3f-a2fbee956cd3","benefits":["Dental insurance","Health insurance","401(k) matching","Paid time off","401(k)"],"selectedSkills":["Military","Laboratory experience","Communication skills","Data entry","High school diploma or GED","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=3S7d4erLD32rh9-Dx9akEw1NyXV6KnX0J6Y53uMhCuhWGR-JBoSMbA"},{"position":"Part-Time Service Technician - Must be willing to travel","labName":"Hal Extraction","location":"Golden, CO","age":"6 days ago","type":"Part-time","jobDescriptionCopy":"Job Title: Service Technician\n\n\nLocation: 5902 McIntyre St. Golden, CO 80403\n\n\nTerms: Hourly\n\n\nSalary/rate: $20/hour\n\n\nRequirements: Travel availability between 5 and 10 days at a time, including weekends.\n\n\nAbout HAL:\n\n\nHAL Extraction provides the safest and most cost-effective modular CID1 and CID2 extraction solutions for plant oil extraction facilities.\n\n\nHAL was established in 2016 with the goal of designing and manufacturing products dedicated to set industry standards for safety in the plant oil extraction industry.\n\n\nWe maintain an industry-leading position in product listings and certifications by working side-by-side with organizations such as UL, a Nationally Recognized Testing Laboratory, and PSI (Pressure Safety Inspectors), the cannabis industry's leading engineering peer review organization. Our products are designed to meet applicable NFPA, NEC, and ICC codes as well as fire codes in CA, OR, AZ, and WA.\n\n\nJob Description:\n\n\nThe Service Technician is expected to be able to assemble and understand HAL Extraction equipment. Service Technicians field service calls, installations, and field verifications alongside with the Service Manager. Service Technicians will be present on installations and maintenance calls, helping with the process from unpacking to commission the product. Attention to detail and a good work ethic is required.\n\n\nResponsibilities:\n\n\n· Carefully unpack and inventory extraction booth components.\n\n\n· Assembly of sheet metal panels, making sure the structure is square and plumb.\n\n\n· Install door assemblies and hardware.\n\n\n· Installing conduit and pulling wire.\n\n\n· Wiring components. (Low voltage, no certification required.)\n\n\n· Maintaining traveling tool crate, organizing, and restocking consumables as needed.\n\n\nCandidate Requirements:\n\n\n· Ability to lift 50 pounds.\n\n\n· Ability to work with hands, sometimes in tight spaces.\n\n\n· High School Diploma or GED equivalent.\n\n\n· Ability to travel for 5-10 days at a time, including weekends.\n\n\n· Electrical experience preferred, not required.\n\n\n· Attention to detail.\n\n\nJob Type: Part-time\n\n\nPay: From $20.00 per hour\n\n\nBenefits:\n\n\nFlexible schedule\n\nSchedule:\n\n\n8 hour shift\n\nEducation:\n\n\nHigh school or equivalent (Preferred)\n\nLicense/Certification:\n\n\nDriver's License (Preferred)\n\nWork Location: On the road\n","slug":"parttime-service-technician-must-be-willing-to-travel-52880ab6-c047-4bd2-90ed-cd72cd12ba30","benefits":["Flexible schedule"],"selectedSkills":["Electrical experience","Driver's License","High school diploma or GED"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=vyXmUJ1ilolCwn7JCHt5ZFOVIN4LV2pNUYacVF0L_3OaBD_qTeCF3g"}]