[{"position":"Lab Technician - Wet Chemistry-1","labName":"Montrose Environmental Group, Inc.","location":"Houston, TX","age":"6 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Environmental Chemistry, a leading environmental laboratory company with 500 employees across 11 locations , focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnvironmental Chemistry Inc., is part of the larger organization, Enthalpy Analytical LLC, is comprised of 11 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Houston, TX facility located near NRG Stadium is currently seeking a Full-Time Laboratory Technician to join our Wet Chemistry Department.\n\nAs a key member of the laboratory team, this role will be responsible for a full range of activities including:\n\nAnalyze water and soil samples for alkalinity, conductivity (EC), pH, settlable solids, total dissolved solids (TDS), total suspended solids (TSS), and turbidity.\nAnalyze water and soil samples for Oil & grease, Oil & Grease with silica cleanup, cyanide, sulfides, BTU, corrosivity, Ferrous iron, Flash point, Ignitability, MBAS, Phenols, Ortho and total phosphates, Reactive Cyanide, Reactive Sulfide, Salinity.\nAnalyze water and soil samples for Ammonia, BOD, COD, Hexavalent Chromium, and TOCWB\nCleaning of laboratory glassware\nMaintaining clean laboratory areas\nMaintaining organized records of sample preparation and analysis\nOverhead projects designed to improve efficiency of, or accuracy of analyses\nAssisting the Group Leaders and analysts in acquiring and inventorying consumables, chemicals, and parts for instrumentation\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Lab Director\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\n\nBachelor's degree in Chemistry, Biology, Environmental Science, or related field preferred\n1 year of relevant lab experience allows direct advancement to Tech II (academic lab counts)\nPreferred Skills\n\nKnowledge of analytical method, analytical instruments, general lab practices and lab safety\nAbility to work independently and in a team\nGood organizational skills and strong communication skills\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"lab-technician-wet-chemistry1-f343286c-d5cf-439e-b672-b6b345d87789","benefits":["Disability insurance","Tuition reimbursement","401(k)","Parental leave"],"selectedSkills":["Laboratory experience","Communication skills","Organizational skills","Bachelor's degree"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-TX-Houston/Lab-Technician---Wet-Chemistry-1_R2237?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Prep Chemist","labName":"Montrose Environmental Group, Inc.","location":"El Dorado Hills, CA","age":"4 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 2,000 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 10 laboratories servicing air, water, soil, tobacco, cannabis, and toxicity testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur El Dorado Hills, CA facility is currently seeking a Full-Time Sample Prep Chemist to join our team.\n\nAs a key member of the laboratory team, this role will be responsible for a full range of activities including:\n\nPreparation, extraction, and clean-up of various environmental sample matrices\nPerform sample preparation where needed (i.e. homogenization, etc.)\nUse of centrifuge, analytical balance, and various evaporative systems with organic solvents\nDispose of laboratory waste in a safe manner following prescribed procedures\nMaintaining clean laboratory areas\nMaintaining organized records of sample preparation and analysis\nAssisting the Group Leaders and analysts in acquiring and inventorying consumables, chemicals, and parts for instrumentation\nDispose of laboratory waste in a safe manner following prescribed procedures\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Lab Director\nIndividuals will get scheduled on a Sunday - Wednesday shift or Wednesday - Saturday shift.\nOccasional unplanned overtime and weekend work may be required.\n\nPhysical Demands:\nStanding for long periods of time\nLifting or moving objects up to 50lbs\nRepetitive hand motions\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nBachelor's degree in the chemical, environmental, physical or biological sciences Skills\n\nPREFERRED SKILLS\n\nBasic understanding of laboratory techniques\nAbility to function both independently and in a team environment\nAbility to follow all standard operating procedures\nDetail-oriented and desire to produce high quality work - Perform at a high level under strict time\nPrior Laboratory experience preferred but not required as this is an entry level position\nKnowledge of analytical method, analytical instruments, general lab practices and lab safety\nGood organizational skills and strong communication skills\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"prep-chemist-1802e2e0-e1c2-49ed-b789-8612fa3c7d1a","benefits":["Disability insurance","Tuition reimbursement","401(k)","Parental leave"],"selectedSkills":["Laboratory experience","Laboratory techniques","Communication skills","Safety plans","Organizational skills","Bachelor's degree"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-CA-El-Dorado-Hills/Prep-Chemist_R2250?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Research Associate II, Cannabis & Environment","labName":"University of California San Francisco","location":"San Francisco, CA","age":"5 days ago","type":"Full-time","jobDescriptionCopy":"Schick Lab studies the health effects of air pollution, with a focus on secondhand tobacco and cannabis smoke. We go out to public places where people are using cannabis and collect data and samples of the air pollutants (field research). We also recruit healthy nonsmokers, expose them to air pollution and assess the health effects (clinical research). The Staff Research Associate II (SRA II) will perform field research, collecting air samples and observational data in public places in the greater San Francisco Bay area where people are consuming cannabis. In consultation with the Principal Investigator, Suzaynn F. Schick, the SRA II will identify appropriate events and locations for field research, and prepare air sampling media and instruments. In collaboration with the PI and other staff in the laboratory, the SRA II will transport sampling media and instruments to the field research sites, collect air samples, return them to the laboratory and prepare them for storage and analysis. S/he will record data and summary data from the experiments, assist with data analysis and help prepare reports on the field experiments and on specific chemical analyses.\n\nIn the laboratory, the SRA II will operate the secondhand/thirdhand cigarette smoke generation system, including operating the cigarette smoking machine, collecting smoke samples for chemical analysis and monitoring readouts of sampling and control devices. The SRA II will also assist others in the laboratory with their research projects in the laboratory, preparing sample containers and data sheets, and processing biosamples. The SRA II will perform basic laboratory tasks as needed including putting away shipments, sending packages, maintaining equipment, washing glassware and keeping the lab in good order.\n\nDepartment Description\n\nThe Department of Medicine, with annual revenues of $417 million, is the largest department in the UCSF School of Medicine. The mission of the Department is research (basic and clinical), teaching, patient care, and public service. The Department has a decentralized organizational structure across four sites (Parnassus, ZSFG, SFVAHCS, and Mt. Zion) and 41 divisions housing 613 faculty, 160 non-faculty academics, 382 residents/fellows, 92 post-docs, and 804 staff. Authority and accountability for the Department rest with the Department Chair who heads the Parnassus and Mt. Zion sites and also directs the Vice Chairs at the ZSFG and SFVAHCS sites.\n\nRequired Qualifications\n\nBA/BS in biology, chemistry, engineering or related science and one or more years of recent, directly related work experience, utilizing the techniques or methods required by the position; and/or equivalent experience/training.\nValid CA driver’s license (you will travel to field research sites)\nDetail oriented\nExcellent verbal and written communications and presentation skills; excellent organizational skills; and excellent interpersonal skills to work effectively in a diverse team.\nGood spoken and written English\nProficiency with Microsoft Word, Excel, PowerPoint, and Windows.\nExcellent analytical and problem-solving skills.\nAbility to work effectively in a fast-paced, team-based environment; project management and coordination skills; ability to prioritize tasks.\nAbility to establish cooperative working relationships with study participants, co-workers, & business owners and staff at field research sites\n\nPreferred Qualifications\n\nAt least 6 months experience with air quality testing\nAt least 6 months experience with handling biological samples\nUnderstanding of field research populations, ability to create rapport and relationships,\nAccurately identifying tobacco and cannabis product use behaviors that contribute to environmental emissions.\nComfortable attending events where cannabis is consumed\nUCSF and ZSFG laboratory experience\n\nLicense/Certification\n\nValid CA driver’s license (you will travel to field research sites)\n\nAbout UCSF\n\nThe University of California, San Francisco (UCSF) is a leading university dedicated to promoting health worldwide through advanced biomedical research, graduate-level education in the life sciences and health professions, and excellence in patient care. It is the only campus in the 10-campus UC system dedicated exclusively to the health sciences. We bring together the world’s leading experts in nearly every area of health. We are home to five Nobel laureates who have advanced the understanding of cancer, neurodegenerative diseases, aging and stem cells.\n\nPride Values\n\nUCSF is a diverse community made of people with many skills and talents. We seek candidates whose work experience or community service has prepared them to contribute to our commitment to professionalism, respect, integrity, diversity and excellence – also known as our PRIDE values.\n\nIn addition to our PRIDE values, UCSF is committed to equity – both in how we deliver care as well as our workforce. We are committed to building a broadly diverse community, nurturing a culture that is welcoming and supportive, and engaging diverse ideas for the provision of culturally competent education, discovery, and patient care. Additional information about UCSF is available at diversity.ucsf.edu\n\nJoin us to find a rewarding career contributing to improving healthcare worldwide.\n\nEqual Employment Opportunity\n\nThe University of California San Francisco is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, protected veteran or disabled status, or genetic information.\n\nOrganization\n\nCampus\n\nJob Code and Payroll Title\n\n009617 SRA 2 NEX\n\nJob Category\n\nResearch and Scientific\n\nBargaining Unit\n\nUniversity Professional Technical Employees – Research Support Professionals Unit (UPTE-RX)\n\nEmployee Class\n\nCareer\n\nPercentage\n\n100%\n\nLocation\n\nZuckerberg San Francisco General (ZSFG)\n\nShift\n\nDays\n\nShift Length\n\n8 Hours\n\nAdditional Shift Details\n\nM-F 8-5, plus afterhours and weekends as needed","slug":"research-associate-ii-cannabis-environment-fe1abd8c-11db-43e9-9777-289bd5eb40ca","benefits":[],"selectedSkills":["Project management","Microsoft Excel","Windows","Driver's License","Microsoft Powerpoint","Bachelor of Science","Bachelor's degree"],"jobType":"free","applyURL":"https://sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?partnerid=6495&siteid=5861&PageType=JobDetails&jobid=3293811&codes=IND"},{"position":"Extraction Technician - 2nd Shift","labName":"Trulieve","location":"Midway, FL","age":"4 days ago","type":"Full-time","salaryMin":"$23,000 ","salaryMax":" $32,000 a year","jobDescriptionCopy":"“Trulieve Grows One Patient at a Time”\n\nIf you have an interest in being part of one of the fastest growing industries in the nation in you may consider wanting to work for Trulieve! If you have a desire to help others in need through your efforts, this may be the role for you!\n\nAt Trulieve, we strive to bring our patients the relief they need in a product they can trust. Our plants are hand-grown in an environment specially designed to reduce unwanted chemicals and pests, keeping the process as natural as possible at every turn.\n\nOur products are designed to alleviate seizures, severe and persistent muscle spasms, pain, nausea, loss of appetite, and other symptoms associated with serious medical conditions such as cancer.\n\nOur specially trained staff works hand-in-hand with physicians to provide the right products and the correct dosage to ensure patients get the compassionate care they need.\n\nRequisition ID: 1463\n\nRemote Work Available: No\n\nJob Title: Extraction Technician\n\nDepartment: Production\n\nReports to: Extraction Team Lead\n\nFLSA Status: Regular- Non-Exempt\n\nJOB SUMMARY\n\nTrulieve is looking for an Extraction Technician to support our extraction and production operations. You should be very technically astute in mechanical, electrical, and computer operated systems utilized in production/manufacturing environments. You need to be proactive, quick thinking and innovative in your approach.\n\nKEY DUTIES AND RESPONSIBILITIES\n\nPreparation of equipment and plant materials for extraction.\nExecution of extraction and processing in accordance with state and local standards.\nOperation of sophisticated extraction equipment.\nEnsure consistency and efficiency of product through quality control testing and procedures.\nCleaning and maintenance of extraction equipment and manufacturing facility.\nMaintaining strict inventory records of all plant materials, chemicals, and equipment used in the facility.\nOversee day-to-day operations of the entire extraction space beginning with storing the raw cannabis through the extraction process and all the way to fulfillment of orders.\nOperating, maintaining, and making adjustments and repairs to extraction equipment.\nStoring supplies and equipment and disposal of waste according to guidelines.\nComplete the cleaning and sanitization of all production equipment, work surfaces, and tools.\nMaintaining inventory records of supplies, materials, and equipment and preparing requisitions as needed.\nMaintaining material safety data sheets for all chemicals and products.\nFollowing all standard operating procedures regarding product creation and lab safety.\nAssist in packaging and labeling of finished products.\nWorks with testing laboratory as defined by state guidelines.\nAll other duties as assigned.\n\nSKILLS AND QUALIFICATIONS\n\nBachelor’s or Associate degree or its equivalent, from a recognized college or university, with a major in chemistry or biology preferred.\nUnderstanding of state and local laws.\nUnderstanding of proper and safe handling of hazardous materials.\nFamiliarity with separations, isolations and fractionation.\nKnowledge of solvent and non-solvent extraction methods.\nStay current of practices and new developments in the cannabis extraction industry.\nAbility to work quickly without compromising accuracy.\nAbility to discern the quality of plant material and finished products.\nStrong computer and social skills.\n\nADDITIONAL MINIMUM QUALIFICATIONS\n\nHigh School Diploma or equivalent.\nMust be a minimum of 21 years of age.\nMust successfully complete a comprehensive background screening.\n\nPHYSICAL REQUIREMENTS\n\nMust be able to push, pull, move, and/or lift a minimum of 25lbs. to a minimum height of 5 feet and able to push, pull, move, and/or carry such weight a minimum distance of 50 feet, with or without mechanical assistance.\nMust be able to work seated/standing as appropriate at workstations for extended periods of time, maintain body equilibrium while climbing ladders, stairways, stooping, kneeling, crouching, and reaching, and use hands/fingers to hold, grasp, turn, pick, pinch frequently/constantly to complete tasks.\nMust be able to handle organic matter daily, able to wear PPE as appropriate (eye, face, hand, arm, head, foot, body, fall protection), and able to be exposed to hot, cold, wet, humid, or windy conditions while wearing PPE (95 degrees or greater).\nMust have visual acuity with/without job aids to perform activities such as; reading, viewing a computer terminal, and visual inspection involving small parts/details. Clarity of vision at 20 ft or more in day and night/dark conditions.\nMust be able to speak and communicate verbally at conversation levels with co-workers, vendors, etc. (Moderate noise).\n\nWORK SCHEDULE\n\n40+ hours weekly with flexible hours depending on department needs. Must be available to work evenings, weekends, and holidays.\n\nSalary will be commensurate with experience. A comprehensive benefits package including paid time off is offered with this position. This position will work an average of 40 hours per week and will be available “after hours” if an emergency situation should arise.\n\nTrulieve provides equal employment opportunities to all employees and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, pregnancy or any other characteristic protected by federal, state or local laws.","slug":"extraction-technician-2nd-shift-f66599cb-0611-447d-9c7a-387d2ac351d6","benefits":["Paid time off","Flexible schedule","Health insurance"],"selectedSkills":["Computer skills","Bachelor's degree","High school diploma or GED","Associate's degree","21 years or older"],"jobType":"free","applyURL":"https://careers.trulieve.com/job/Midway-Extraction-Technician-2nd-Shift-FL-32343/904146100/?feedId=364400&utm_source=Indeed&utm_campaign=Trulieve_Indeed"},{"position":"Extraction Technician 3rd Shift","labName":"Trulieve","location":"Hancock, MD","age":"3 days ago","type":"Full-time","salaryMin":"$32,000 ","salaryMax":" $44,000 a year","jobDescriptionCopy":"“Trulieve Grows One Patient at a Time”\n\nIf you have an interest in being part of one of the fastest growing industries in the nation in you may consider wanting to work for Trulieve! If you have a desire to help others in need through your efforts, this may be the role for you!\n\nAt Trulieve, we strive to bring our patients the relief they need in a product they can trust. Our plants are hand-grown in an environment specially designed to reduce unwanted chemicals and pests, keeping the process as natural as possible at every turn.\n\nOur products are designed to alleviate seizures, severe and persistent muscle spasms, pain, nausea, loss of appetite, and other symptoms associated with serious medical conditions such as cancer.\n\nOur specially trained staff works hand-in-hand with physicians to provide the right products and the correct dosage to ensure patients get the compassionate care they need.\n\nRequisition ID: 1773\n\nRemote Work Available: No\n\nJob Title: Extraction Technician\n\nDepartment: Manufacturing\n\nLocation: Hancock, MD\n\nShift: 3rd 10:00 PM - 6:30 AM\n\nRole Summary:\nTrulieve is looking for an Extraction Technician to support our extraction and production operations. You should be very technically astute in mechanical, electrical, and computer operated systems utilized in production/manufacturing environments. You need to be proactive, quick thinking and innovative in your approach.\n\nKey Duties and Responsibilities:\nPreparation of equipment and plant materials for extraction\nExecution of extraction and processing in accordance with state and local standards\nOperation of sophisticated extraction equipment\nEnsure consistency and efficiency of product through quality control testing and procedures\nCleaning and maintenance of extraction equipment and manufacturing facility\nMaintaining strict inventory records of all plant materials, chemicals, and equipment used in the facility\nOversee day-to-day operations of the entire extraction space beginning with storing the raw cannabis through the extraction process and all the way to fulfillment of orders\nOperating, maintaining, and making adjustments and repairs to extraction equipment\nStoring supplies and equipment and disposal of waste according to guidelines\nComplete the cleaning and sanitization of all production equipment, work surfaces, and tools\nMaintaining inventory records of supplies, materials, and equipment and preparing requisitions as needed\nMaintaining material safety data sheets for all chemicals and products\nFollowing all standard operating procedures regarding product creation and lab safety\nAssist in packaging and labeling of finished products\nWorks with testing laboratory as defined by state guidelines\nAll other duties as assigned\n\nRequirements\n\nSKILLS AND QUALIFICATIONS:\nBachelor’s or Associate degree or its equivalent, from a recognized college or university, with a major in chemistry or biology preferred\nUnderstanding of state and local laws\nUnderstanding of proper and safe handling of hazardous materials\nFamiliarity with separations, isolations and fractionation\nKnowledge of solvent and non-solvent extraction methods\nStay current of practices and new developments in the cannabis extraction industry\nAbility to work quickly without compromising accuracy\nAbility to discern the quality of plant material and finished products\nStrong computer and social skills\n\nPHYSICAL REQUIREMENTS:\nMust be able to push, pull, move, and/or lift a minimum of 25lbs to a minimum height of 5 feet and able to push, pull, move, and/or carry such weight a minimum distance of 50 feet, with or without mechanical assistance\nMust be able to work seated/standing as appropriate at workstations for extended periods of time, maintain body equilibrium while climbing ladders, stairways, stopping, kneeling, crouching, and reaching, and use hands/fingers to hold, grasp, turn, pick, pinch frequently/constantly to complete tasks\nMust be able to handle organic matter daily, able to wear PPE as appropriate (eye, face, hand, arm, head, foot, body, fall protection), and able to be exposed to hot, cold, wet, humid, or windy conditions while wearing PPE (95 degrees or greater)\nMust have visual acuity with/without job aids to perform activities such as; reading, viewing a computer terminal, visual inspection involving small parts/details. Clarity of vision at 20 ft or more in day and night/dark conditions\nMust be able to speak and communicate verbally at conversation levels with co-workers, vendors, etc. (Moderate noise)\n\nWORK SCHEDULE:\n40+ hours weekly with flexible hours depending on department needs. Must be available to work occasional evenings, weekends, and holidays\n\nEqual Opportunity Employer l Trulieve Supports a Drug Free Workplace\n\nSalary will be commensurate with experience. A comprehensive benefits package including paid time off is offered with this position. This position will work an average of 40 hours per week and will be available “after hours” if an emergency situation should arise.\n\nTrulieve provides equal employment opportunities to all employees and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, pregnancy or any other characteristic protected by federal, state or local laws.","slug":"extraction-technician-3rd-shift-703637d7-69c8-40f4-9a01-3592a0a89ff8","benefits":["Paid time off","Flexible schedule","Health insurance"],"selectedSkills":["Computer skills","Bachelor's degree","Associate's degree"],"jobType":"free","applyURL":"https://careers.trulieve.com/job/Hancock-Extraction-Technician-3rd-Shift-MD-21750/904679900/?feedId=364400&utm_source=Indeed&utm_campaign=Trulieve_Indeed"},{"position":"Group Leader","labName":"Montrose Environmental Group, Inc.","location":"Richmond, VA","age":"6 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Richmond, VA facility is currently seeking a Full-Time Group Leader (ICPMS).\n\nAs a key member of the laboratory team, Group Leaders equip and maintain a well-trained and informed staff to meet the expectations of our clients by efficiently and profitably generating defensible date on time. Our Group Leaders will be an analyst who is responsible for most aspects of an operating team within the lab. Additional duties are:\n\nPersonnel supervision, time management, and operational efficiency\nHiring, firing, and disciplinary actions\nConflict resolution, personnel skills development and team building\nAccurate and timely communication with internal and external clients\nProject scheduling\nAnalyze samples as needed by using various published methods\nDevelopment of analytical methods\nPreparation of data summaries for inclusion in client reports.\nSample and Standard Preparation as needed\nOccasional split shift and/or weekend duties\nInstrument calibration and maintenance\nTroubleshooting and problem solving\nWrite and assist the QAC with updating related SOPs\nMaintain adequate consumables and parts for analyses\nMaintaining organized records of sample preparation and analysis, and equipment maintenance\nCommunicate with client’s questions or concerns\nInitiate and address non-conformance issues\nOverhead projects designed to improve efficiency of, or accuracy of analyses\nComply with Enthalpy’s Quality Assurance Program and other policies\nOther duties as assigned by the Lab Supervisor or Lab Director\nEnsure staff comply with Enthalpy’s Health and Safety Plan\nOther duties and responsibilities as assigned\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nAssociate’s or Bachelor's degree in a scientific field\n3-4 years of experience working in a lab\nUnderstanding of physical and chemical principles underlying why procedures are specified the way they were for each method with which they work.\nGroup Leaders must be well versed in most of the methods run within their department\nThey must understand the underlying physical or chemical principles that underpin the assays being performed\nThey must have shown the ability to organize, communicate, and facilitate priorities to staff in an effective manner\nThey must be able to handle non-routine samples and be capable of managing an effective workflow in their department (this includes managing man-hours, machine time and logistics for numerous assays)\n\nPreferred Skills\n\nEffectiveness. Positive outcomes & results of communication skills\nConflict resolution skills: Removes/Breakdown organizational communication barriers\nAssertion Skills-Problem diagnosis, assess corrective action, not blame\nAbility to handle multiple tasks simultaneously and maintain composure during\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"group-leader-b95c5d84-248e-468a-896b-01df2ed8ba3f","benefits":["Disability insurance","Tuition reimbursement","401(k)","Parental leave"],"selectedSkills":["Conflict management","Laboratory experience","Assays","Communication skills","Project scheduling","Bachelor's degree","Associate's degree"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-VA-Richmond-East-Parham-Rd/Group-Leader_R2240?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Lab Technician - Aquatic Toxicology","labName":"Montrose Environmental Group, Inc.","location":"San Diego, CA","age":"3 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 2,500 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of 11 laboratories servicing air, water, soil, tobacco, cannabis, and toxicity testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur San Diego, CA is currently seeking a Full-Time Laboratory Technician to join our team.\n\nAs a key member of the laboratory team, this role will be responsible for a full range of activities including:\n\nPreparation of samples for analysis\nConduct of a variety of bioassays\nSample receipt and processing\nOrganism culture maintenance\nDetermining the target volume and mixture of samples\nCleaning of laboratory glassware\nMaintaining clean laboratory areas\nMaintaining organized records of sample preparation and analysis\nAssist with sample organization and disposal\nAssisting the Group Leaders and analysts in acquiring and inventorying consumables, chemicals, and parts for instrumentation\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Lab Director\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nBachelor's degree in Chemistry, Biology, Environmental Science, or related field preferred\n2 years of relevant lab experience allows direct advancement to Tech II (academic lab counts)\n\nPREFERRED SKILLS\n\nPrior Laboratory experience preferred but not required as this is an entry level position\nKnowledge of analytical method, analytical instruments, general lab practices and lab safety\nAbility to work independently and in a team\nGood organizational skills and strong communication skills\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"lab-technician-aquatic-toxicology-6c3ce3f2-eced-4dbf-a17f-b06ac6114248","benefits":["Disability insurance","Tuition reimbursement","401(k)","Parental leave"],"selectedSkills":["Laboratory experience","Communication skills","Organizational skills","Bachelor's degree"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-CA-San-Diego-Vandever-Avenue/Lab-Technician---Aquatic-Toxicology_R2253-1?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Laboratory Technician for Cannabis Testing Lab","labName":"Veda Scientific","location":"Lompoc, CA","age":"5 days ago","type":"Full-time | Part-time","salaryMin":"$22 ","salaryMax":" $25 an hour","jobDescriptionCopy":"Veda Scientific is a new, hemp and cannabis R&D and compliance testing laboratory located in Lompoc, CA. We combine the latest technology with the best talent to support our clients in our common mission to propel the industry forward and unlock the possibilities found in the cannabis plant. The company is composed of experts in the fields of cannabis testing, plant physiology and chemistry as well as business process, HR, marketing and finance.\n\n\nBASIC FUNCTION\n\n\nThe Laboratory Technician assists the Chemist and/or Microbiologist in performing chemical testing procedures and microbiological tests. Carries out sampling, weighing, pipetting, operation of lab equipment, recordkeeping, and analyzing data in cooperation with the scientific team. Must be able to drive to sampling sites, perform unbiased sampling procedures, follow laboratory protocols, and assist with the housekeeping operations of the laboratory. Supports laboratory staff by maintaining glassware, logs and record books, troubleshooting and resolving problems, and helping with special projects.\n\n\nRESPONSIBILITIES AND EXPECTATIONS\n\n\na. Maintain glassware by picking-up, cleaning, washing, sterilizing, storing and distributing\n\n\nb. Keep laboratory supplies ready by inventorying stock, requesting orders, and verifying receipt\n\n\nc. Perform laboratory tests including pre- and post-analytic phases\n\n\nd. Produce accurate and reliable data, as well as interpret results\n\n\ne. Follow prescribed methodologies in carrying out routine tasks\n\n\nf. Research relevant topics and gather scientific information\n\n\ng. Adhere to correct procedures, policies and health/safety guidelines\n\n\nh. Document all activities, record results and input/retrieve data\n\n\ni. Maintain work area and a safe environment\n\n\nj. Provide administrative assistance\n\n\nk. Attend and participate in group and project meetings\n\n\nl. Update job knowledge by participating in educational opportunities\n\n\nm. Enhance laboratory and organization reputation by accepting ownership for accomplishing tasks\n\n\nn. Explore opportunities to add value to job accomplishments\n\n\nQUALIFICATIONS\n\n\na. Education – College-level laboratory courses in Chemistry and/or Microbiology with a B grade or higher. B.S. or B.A. degree in Chemistry Microbiology or related field would be an additional qualification preferred.\n\n\nb. Experience – Hands-on experience in a research, testing or clinical laboratory is desired. Knowledge in a range of analytical techniques, experience with plant material and extraction procedures, and familiarity with laboratory equipment and software (Excel, ChemStation, Google Sheets) are preferred.\n\n\nc. Skills – Lab technicians provide technical support to enable the laboratory to function effectively, while adhering to correct procedures, as well as health and safety guidelines. We value both research and transferable skills including:\n\n\nAbility to follow protocol and perform tasks according to specifications\nComputer literacy and ability to learn quickly\nAccuracy and close attention to detail\nStrong analytical judgement and scientific integrity\nRecord keeping and organization skills\nEffective communication and presentation skills\nLaboratory techniques in chemistry and microbiology\nCreating a safe and effective laboratory environment\nEquipment operation and calibration\nBiohazard and chemical safety\nAdministrative procedures and teamwork\nSupply management\nSelf-development\n\nHours per week:\n\n\n30-39\n\nTypical end time:\n\n\n6PM\n\nTypical start time:\n\n\n8AM\n\nWork Remotely\n\n\nNo\n\nJob Types: Full-time, Part-time\n\n\nPay: $22.00 - $25.00 per hour\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n4 hour shift\n8 hour shift\nDay shift\nEvening shift\nMonday to Friday\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nLaboratory Experience: 1 year (Preferred)\n\nWork Location: One location\n","slug":"laboratory-technician-for-cannabis-testing-lab-8d7bc799-1ed4-44af-85fd-ed5ed7af8c96","benefits":["Dental insurance","Health insurance","401(k)","Paid time off","Vision insurance"],"selectedSkills":["Microsoft Excel","Clinical laboratory experience","Laboratory experience","Laboratory techniques","Communication skills","Bachelor of Science","Bachelor's degree","Bachelor of Arts"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&job=tUGE2otn_6lGXTnbtAETuJJPfFRfsMhPTxpsMcJ7XQk1yc_WQOsMEQ"},{"position":"Analytical Chemist - Cannabis Testing","labName":"CP Labs Ohio","location":"Columbus, OH","age":"6 days ago","type":"Full-time","salaryMin":"$23 ","salaryMax":" $28 an hour","jobDescriptionCopy":"CP Labs Ohio is currently seeking a talented Analytical Chemist to join our team and help build our recently state-approved cannabis testing laboratory. With cannabis industry expertise and a brand-new analytical facility, we are looking for an energetic, creative, team-oriented person with strong background in analytical chemistry, cannabis experience and excellent organizational and communications skills. We are looking for individuals with a few years of analytical lab experience including daily laboratory sample flow, method optimization/validation, QA/QC and more.\n\n\nPosition Summary: This is an analytical position responsible for advanced laboratory support functions to include calibration, standard preparation, instrument tuning, instrument and equipment maintenance, and analysis of data used for laboratory quality control. Daily work involves the use of various types of instrumentation (including HPLC, LCMS, ICPMS and GCMS) lab equipment and complex computer programs to perform tests, record data or findings and present information.\n\n\nEssential Duties:\n\n\nWorks with Scientific Director to ensure lab efficiencies for prioritization, workflow, and sample preparation, as well as the loading and running of instruments\nIdentifies opportunities for improvement; works with laboratory members to implement new and improved methods and processes\nAssists with the upkeep and improvement of the quality management system to include Standard Operating Procedures (SOP’s) and the employee training programs\nPrepares calibrations and verifies quality controls for laboratory instruments and methods; uses data to recognize and/or correct possible processing or instrument errors\nAcquires and analyzes data used to perform and report analytical laboratory testing of cannabis products\nAssists with the validation of test methods and with Research and Development (R&D) related activities\nImports data into LIMS and Seed-to-Sale systems; provides for the documentation and tracking of Continuing Calibration Verification (CCV) Standards for Quality Assurance\nPrepares reports related to cannabinoid potency, terpene potency, residual solvents, heavy metals, pesticides, microbiologic organisms, water activity and mycotoxins\nSubmits data reports and Certificates of Analysis (COA) for approval \nProvides guidance and support for all duties commonly assigned to Field Samplers and Lab Technicians\n\nPosition Requirements:\n\n\nGeneral Knowledge/Abilities\n\n\nAbility to fluently speak and read the English language along with understanding and following both written and verbal direction\nAbility to function independently, have personal integrity, flexibility and the ability to work effectively as a team member with fellow employees\nAnalytical and numerical skills: ability to perform mathematical calculations in different units of measurement\nBasic knowledge of modern office practices and use of Microsoft Office Suite for Word and Excel\nExperience in driving tasks and meeting deadlines; accountable for the completion of assigned goals and objectives\n\nEducation, Licenses/Certifications\n\n\nBachelor’s degree in Chemistry or a related field from an accredited college or university\n2 plus years non-academic experience in a real-world analytical laboratory\nRelevant industry related experience in Medical Cannabis is a plus\n\nJob Type: Full-time\n\n\nPay: $23.00 - $28.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\n\nAbility to commute/relocate:\n\n\nColumbus, OH 43228: Reliably commute or planning to relocate before starting work (Required)\n\nWork Location: One location\n","slug":"analytical-chemist-cannabis-testing-f06fb5fa-9257-465f-9b28-33b2f9bcea9f","benefits":["Dental insurance","Health insurance","Paid time off","Vision insurance"],"selectedSkills":["Analysis skills","Microsoft Excel","Laboratory experience","Analytical chemistry","Microsoft Office","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&job=ClPJ7nDjBAcOh2z8P2m1u1MdgEUmKRRBiOTpF7QjFHXQNZOH1ZYGDA"},{"position":"Cannabis Laboratory Sales","labName":"Therapeutic Health Choice","location":"Bay City, MI","age":"6 days ago","type":"Full-time","salaryMin":"$56,000 ","salaryMax":" $74,000 a year","jobDescriptionCopy":"Cannabis Laboratory Sales\n\n\nTherapeutic Health Choices, LLC\n\n\nBay City, MI, United States\n\n\nTherapeutic Health Choices, LLC (THC) is a cannabis safety testing laboratory. It provides analytical chemistry and microbiology testing services for cannabis cultivators and processors as mandated by the state of Michigan. THC is a small, privately held company that provides access to a healthcare and 401(k) plan. It offers an exceptional work environment and long-term growth opportunities in an expanding market. If you work smart, play hard, and want to use your technical skills in a rapidly expanding laboratory sector, we’d love to hear from you!\n\n\nReports to: Chief Business Development Officer\n\n\nPay Class: Exempt\n\n\nEssential function:\n\n\nStrategic within the business sales program, by securing new consumers, expanding opportunities within the current consumer base through advertising initiatives, and delivering new product offerings.\nAccomplish responsibilities within the sales department, by account management, operations and customer support.\nEvaluates the effectiveness of the sales initiatives with Chief Business Development Officer, making appropriate changes that encourage achievement of overall sales and business targets.\nBe self-motivated to implement the business’s development activities and corporate branding in order to increase revenue and gross profit.\nImplementation of appropriate strategies for each of the business’s verticals, sales channels, and services.\nImplement the business’s sales process, ranging from relationship development and contract finalization.\nConduct competitive analyses and communicate results with Chief Business Development Officer\nTrack and review target vs. actual sales results.\nForecasting and monitoring sales performance and business compliance.\nMaintain a stable knowledge base of the business’s industry, competitors, and regulatory activity\nConduct regular research, keep up with trends and best practices.\nEstablish relationships with key personnel within the business’s market.\nAttend numerous industry events and conferences.\nContinue all avenues of communication with supervisor, notifying them of all sales and testing arrangements.\nBuild and maintain up-to-date quality CRM data.\n\nJob Requirements\n\n\nProven negotiation skills.\nAbility to understand new issues quickly and make wise and independent decisions.\nAbility to work under pressure, plan personal workload effectively, and delegate.\nAbility to multi-task and work in a fast-paced, changing, and challenging environment.\nSuperior oral and written communication skills.\n\nCompetencies (“soft skills\", traits, behaviors):  \n\n\nLeadership, self-motivated, shows initiative, results oriented, creative thinker, detail oriented, focused on continuous development, effective time-management skills, ability to inspire confidence and create trust.\n\nEducation/Experience:  \n\n\n4-year Degree from accredited college/university in a relevant discipline.\n5+ years of sales experience, 1 year industry specific (Required)\n\nJob Type: Full-time\n\n\nSalary: (Depends on experience)\n\n\nLanguage: English (Required)\n\n\nWork authorization: United States (Required)\n\n\nJob Type: Full-time\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\nMonday to Friday\n\nAbility to commute/relocate:\n\n\nBay City, MI 48706: Reliably commute or planning to relocate before starting work (Required)\n\nLicense/Certification:\n\n\nDriver's License (Required)\n\nWork Location: One location\n","slug":"cannabis-laboratory-sales-9dd89efb-a949-42a8-843d-7b3a2d4893f9","benefits":["Dental insurance","Health insurance","Paid time off","401(k)","Vision insurance"],"selectedSkills":["Negotiation","Driver's License","Sales","Communication skills","Time management","Bachelor's degree","US work authorization"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&job=vL5pLnJP1o8d3HARwtETF7kSkKgta-UysacdSPae3B02uzMxMHpLjw"},{"position":"Analytical Cannabis Chemist (LC/MS)","labName":"Trusted Human Capital","location":"Adrian, MI","age":"4 days ago","type":"Full-time","jobDescriptionCopy":"Analytical Chemist – Cannabis Lab\n\n\nCompany summary: We are a state-licensed and ISO 17025 accredited laboratory testing facility serving the MI cannabis market. We provide analytical testing services to licensed producers of cannabis flower and cannabis products within the state. Our testing services include determination of cannabinoid potency, terpene profiling and screening for chemical and biological contaminants. We offer competitive pay and medical insurance benefits to all full-time employees. We encourage a positive work environment and equal opportunity for all.\n\n\nJob Summary: We are looking for an Analytical Chemist to conduct routine testing using GC-MS, especially LC-MS/MS. This position will also support further method development and validation efforts. This position will support a variety of analytical techniques, under the guidance of the Scientific Director and in collaboration with colleagues.\n\n\nSpecific Responsibilities:\n\n\nOperate and maintain analytical instrumentation (LCMS/MS, GC-MS, ICP-MS, etc.) for optimum performance according to laboratory SOPs, manufacturer recommendations and professional experience.\n\n\nWork with the Scientific Director to develop laboratory SOPs, forms, and other documentation related to chemical and instrumental analysis.\nPrepare customer samples for chemical analysis according to laboratory procedures using established analytical methods and quality control protocols.\nSupport method development and validation efforts by conducting analytical experiments at the direction of the Scientific Director and senior scientific scientist.\n\nLC/MS experience REQUIRED\n\n\nCannabis experience NOT required- accepting applicants\n\n\nShimadzu experience preferred\n\n\nJob Type: Full-time\n\n\nPay: Up to $80,000.00 per year\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nRetirement plan\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\n\nAbility to commute/relocate:\n\n\nAdrian, MI 49221: Reliably commute or planning to relocate before starting work (Required)\n\nApplication Question(s):\n\n\nIf not the Cannabis field, what related field do you currently work/have worked in?\n\nExperience:\n\n\nLaboratory experience: 1 year (Preferred)\nCannabis: 1 year (Preferred)\nShimadzu: 1 year (Preferred)\nLC/MS: 1 year (Required)\n\nWork Location: One location\n","slug":"analytical-cannabis-chemist-lcms-5a3f5f67-d8ee-4522-b0db-884289b18ea5","benefits":["Paid time off","Dental insurance","401(k)","Health insurance","Vision insurance"],"selectedSkills":["Laboratory experience"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=pT9wmh9gUZPQuJHPDMwW18-JaqhQloGwfp9zhp0JIbLYaZj00_nUvA"},{"position":"Microbiologist","labName":"Kaycha Labs","location":"Tempe, AZ","age":"4 days ago","type":"Full-time","salaryMin":"$55,000 ","salaryMax":" $71,000 a year","jobDescriptionCopy":"Job description:\n\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\n\nJob Purpose:\n\n\nThe Microbiologist will be responsible for performing, documenting, record checking, and troubleshooting qualitative and quantitative assays on samples using techniques that vary from the use of standard laboratory equipment to highly modern and automated instrumentation.\n\n\nEssential Duties & Responsibilities:\n\n\nAnalyze samples consisting of a variety of matrices and cross trained on various laboratory technologies including, but not limited to, bacterial and fungal plating and PCR.\nTrain incoming analysts and technicians on methodology.\nResponsible for troubleshooting instrumentation to ensure data integrity\nPrepare samples for analysis while displaying good laboratory technique to avoid cross contamination or misidentified samples.\nAccurately prepare quality control samples.\nInterpret and evaluate data in terms of accuracy, precision, trends, and quality control requirements.\nProvide scientific interpretation of results to supervisor, management, or customers as requested.\nMaintain a sterile work environment and undergo cleaning procedures as necessary, to ensure ongoing proper workflow. Report contamination issues to supervisor.\nPrioritize samples and provide guidance and support to the sample prep team for assigned analysis.\nPerform method validations, or verifications with minimal supervision as needed.\nTrack inventory of supplies and reagents to ensure no interruption of work-flow\nOversee root cause analysis for quality assurance.\nAssist in SOP edits as needed for assigned testing analysis and alert management when there is a change in procedure\nMay be able to perform method development to respond to changing client needs or regulations\nResearch new technologies and methodologies to improve laboratory processes and techniques and make recommendations to supervisors.\nOther duties and special projects as assigned.\n\nSkills, Abilities and Competencies:\n\n\nStrong understanding of standard laboratory protocol.\nMaintain high productivity, keen attention to detail, and consistent multi-tasking while yielding a low testing error rate.\nStrong agility, engagement, and flexibility in an ever-changing environment.\nDiligent commitment to logging, organizing, and analyzing data.\nExcellent communication skills and ability to effectively work, problem solve, and communicate with multiple levels of the organization.\nPromote a strong customer service culture while adhering to the highest safety and industry standards, including those that are outlined by the state regulatory body.\n\nEducation & Experience:\n\n\nMinimum BS/BA in Biology, Chemistry, Physics, Engineering or Environmental Sciences required.\nKnowledge of principles, terminology, practices, techniques, and instrumentation commonly used in a laboratory setting required.\nAt least 2 years of microbiology experience is preferred.\nFood science and/or environmental experience is a plus.\nExposure to the cannabis industry is a plus.\n\nOther:\n\n\nMust pass the required background check.\nMust be at least 21 years old.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision, 401k plan with company match and PTO.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.\n\nThe above is intended to describe the general content of and requirements for the performance of this job. It is not to be construed as an exhaustive statement of duties, responsibilities, or physical requirements.\n\n\nJob Type: Full-time\n\n\nCOVID-19 considerations:\nMask mandate for all employees and visitors.\n\n\nWork Remotely\n\n\nNo\n\nJob Type: Full-time\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nFlexible schedule\nFlexible spending account\nHealth insurance\nLife insurance\nPaid time off\nReferral program\nVision insurance\n\nSchedule:\n\n\n10 hour shift\n8 hour shift\nDay shift\nMonday to Friday\nNight shift\nWeekend availability\n\nEducation:\n\n\nBachelor's (Preferred)\n\nWork Location: One location\n","slug":"microbiologist-b8142117-c790-4456-838e-aed6268c8b8c","benefits":["Dental insurance","Health insurance","Flexible schedule","Referral program","401(k)"],"selectedSkills":["Communication skills","Microbiology","Root cause analysis","Bachelor of Science","Bachelor's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=xWx6kbToUwh_zjp5q0y35FYT8DHccxGYFi1nFEc8pDC4PIW0cwsc_g"},{"position":"Laboratory Production Manager","labName":"E1011 Labs","location":"Pasadena, CA","age":"6 days ago","type":"Full-time","salaryMin":"$41,000 ","salaryMax":" $58,000 a year","jobDescriptionCopy":"Job title\n\n\nProduction Manager\n\n\nReports to\n\n\nDirector of Operations\n\n\nFLSA Status\n\n\nExempt Non-Exempt\n\n\nE1011 Labs, based in Pasadena, California, has a mission to create and deliver the next generation of flower consumption with innovative design and cutting-edge technology. E1011 Labs is known for its exemplary customer service, unique product offering, competitive pricing, unparalleled educational resources, and market leadership. E1011 Labs is looking for a passionate and professional individual to fill the role of Production Manager. We are looking for an individual who will be working with a variety of Laboratory/production tasks. This individual must be able to multi-task, work quickly and efficiently, and be adaptable to change priorities and tasks as needed. We have a very fast- paced environment as we continue to grow and expand. Must be motivated, trustworthy, and a team player.\n\n\nAdditional responsibilities include: Carrying out laboratory production; intake raw material; enter and track material quantities in our internal system; create batch records a given process; troubleshooting and resolving problems; maintaining logs and record books; maintaining glassware; daily lab cleanup.\n\n\nDuties and responsibilities\n\n\nFollow Standard Operating Procedures (SOP)\nIntake and Process raw hemp material\nDocument information by creating and maintaining accurate batch records.\nKeep equipment operational by following operating instructions; troubleshooting breakdowns; performing preventive maintenance.\nKeep laboratory inventorying in stock; placing orders; verifying receipt.\nParticipate in planning personnel safety and warehouse protection activities.\nOperating, maintaining, and making adjustments and repairs to laboratory\nResolves problems by examining and evaluating data; selecting corrective steps.\nUpdates job knowledge by participating in educational opportunities; reading technical publications.\nEnhances laboratory and organization reputation by accepting ownership for accomplishing new and different requests; exploring opportunities to add value to job accomplishments.\nMaintains glassware by picking-up, cleaning, washing, sterilizing, and organizing.\n\nQualifications & Skills Required\n\n\nChemistry Techniques,\nLab Environment,\nCannabis Knowledge,\nChemical Properties of Cannabinoids,\nRecord Keeping,\nData Tracking, Safe\nLab Practices,\nEquipment Calibration and Maintenance,\nChemical Safety,\nSupply Management,\nSelf- Development.\nMust have reliable transportation.\n\nPhysical requirements\n\n\nWork is performed while standing, sitting and/or walking\nALL APPLICANTS MUST BE OVER THE AGE OF 21 YEARS TO BE ELIGIBLE FOR EMPLOYMENT\n\nBenefits/Perks\n\n\nCompetitive wage\nComprehensive medical & dental benefits coverage\nA highly innovative and enjoyable team culture\nFun and casual work environment, monthly lunches, and more\nWork hours 8 a.m. – 6 p.m. (one hour lunch)\n\nBy applying for this role I understand that if I’m offered a position with the company I will be required to submit to the pre-employment aptitude testing, and background screening as a condition of employment.\n\n\nE1011 Labs provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, disability or genetics. In addition to federal law requirements, E1011 Labs complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, transfer, leaves of absence, compensation and training.\n\n\nJob Type: Full-time\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nVision insurance\n\nSchedule:\n\n\n8 hour shift\n\nAbility to commute/relocate:\n\n\nPasadena, CA 91107: Reliably commute or planning to relocate before starting work (Required)\n\nExperience:\n\n\nLaboratory: 1 year (Preferred)\n\nWork Location: One location\n","slug":"laboratory-production-manager-ea90773b-2e2a-4032-8ba7-d07aa8a17ab7","benefits":["Dental insurance","Health insurance","Vision insurance"],"selectedSkills":["Laboratory experience","21 years or older","Reliable transportation"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=gmi9UMpXvbAo4zQoA_O9fm4J72PyQtbrhJJsuj8ComM7ftQDbyX-Ow"},{"position":"Lab Technologist","labName":"Nova Analytic Labs","location":"Portland, ME","age":"7 days ago","salaryMin":"$35,000 ","salaryMax":" $40,000 a year","jobDescriptionCopy":"Nova Analytic Labs is seeking a highly motivated entry level scientist to join our cannabis testing laboratory, located in Portland, ME.\n\nThe testing Nova Analytic Labs will perform is critical to the health and safety of recreational and medicinal cannabis and hemp products. Nova Analytic Labs will provide the highest quality and safety in testing to the community by combining advanced technology and innovative scientific methods. As a startup, we are particularly interested in individuals with well-rounded capabilities and an eager appetite to grow and build a successful enterprise.\n\nThis is an entry level job opportunity to assist with daily lab tasks, sample pickup, sample receipt, and testing. On the job training will be provided and the opportunity to grow into more experienced roles is highly encouraged. The ideal candidate will have a scientific background and an eye for continuous improvement. Flexibility and dedication are a must.\n\nThe Lab Technologist I works directly under Lab Manager and ensures all samples are received, extracted, analyzed and reported in compliance with company policies and procedures. Other duties may be assigned as necessary.\n\nDuties and Responsibilities\n\nResponsible for day to day pickup, receipt and analysis of samples\n\nResponsible for solution prep and tracking\n\nResponsible for maintaining equipment logs and maintenance\n\nPerform extractions and prepare samples for analysis on LC/MS, GC/MS and ICP/MS\n\nResponsible for data entry of samples in the lab\n\nResponsible for understanding and following all necessary SOPs\n\nProduce quality, mistake-free work in the lab\n\nEnsures resolution of errors before results are released to clients\n\nContinuously seeks out new and better ideas, driving best practices\n\nEnsure samples are received, requisitioned and extracted in a manner that is compliant with SOPs\n\nOther duties as assigned by management\n\nRequirements\nHold a bachelor degree in a science related field OR at least 2 years of college course work and 1 year of experience in a high complexity laboratory, food testing lab, or environmental testing lab.\n\nBenefits\nHealth care with vision & dental.\n\nProfit share\n\n3-5 weeks PTO\n\n\nHold a bachelor’s degree in one of the related sciences; or\nDemonstrate completion of at least 2 years of college coursework and at least 1 year of practical laboratory\nexperience.","slug":"lab-technologist-67c64bb9-776c-410e-a62f-7992c3cf53a2","benefits":["Paid time off","Dental insurance","On-the-job training","Health insurance","Vision insurance"],"selectedSkills":["Laboratory experience","Continuous improvement","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=F8fNABadvtWD_0IIJoCpgdOmxeidzQ3IHOx86pz9NHfExbh2SLsF0w"},{"position":"Lab Technician, Extraction","labName":"Kaycha Labs","location":"Gainesville, FL","age":"7 days ago","type":"Full-time","salaryMin":"$26,000 ","salaryMax":" $38,000 a year","jobDescriptionCopy":"Company Overview:\n\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\n\nJob Purpose:\n\n\nThe Lab Technician is responsible for working closely with our laboratory team to develop analytical skills and related experience. This position consists of many aspects from homogenizing, weighing and extracting samples, performing quality control checks, verifying various support equipment and properly disposing of all waste.\n\n\nEssential Duties & Responsibilities:\n\n\nExecute laboratory protocol and procedures under the supervision of the Lab Director.\nRegularly display good laboratory technique to avoid cross-contamination or misidentified samples.\nPerform sample preparation procedures including homogenization, weighing and liquid extraction.\nPerform QC duties as assigned, including LCS and matrix spikes.\nPerform qualitative and quantitative tests, as assigned.\nUtilize the LIMS system to create batches, enter sample prep information and maintain physical and electronic records.\nAdhere to ISO 17025 standards as well as state regulatory requirements.\nPromote a strong customer service culture while adhering to the highest safety and industry standards.\nOther duties and/or special projects as assigned.\n\nSkills, Abilities and Competencies:\n\n\nAbility to maintain an incredibly high degree of attention to detail and accuracy.\nStrong agility, engagement, and flexibility in an ever-changing environment.\nWorking knowledge of logging, organizing, and analyzing data.\nAbility to work in a dynamic, fast-paced deadline environment while successfully managing multiple tasks.\nStrong knowledge of Microsoft Office, including Excel, PowerPoint, and Word.\nWorking knowledge of standard laboratory protocol.\nExcellent communication skills and ability to effectively work, problem solve, and communicate with multiple levels of the organization.\n\nEducation & Experience:\n\n\nMinimum of Bachelor’s degree in chemistry, biochemistry or related field based on state requirements.\n0-1 year of lab experience.\nKnowledge of principles, terminology, practices, techniques commonly used in a laboratory setting preferred.\nExposure to the cannabis industry is a plus.\n\nOther:\n\n\nMust pass Level 2 background check.\nMust be at least 21 years old.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status\n\nJob Type: Full-time\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nEmployee assistance program\nFlexible spending account\nHealth insurance\nLife insurance\nPaid time off\nReferral program\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nMonday to Friday\nWeekend availability\n\nCOVID-19 considerations:\nFace masks required for non vaccinated employees.\n\n\nApplication Question(s):\n\n\nWhat is your desired compensation?\nWhat is the best phone # and email to reach you at?\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nLaboratory Experience: 1 year (Preferred)\n\nWork Location: One location\n","slug":"lab-technician-extraction-c43fb819-7bf0-439c-909d-3371bd47597b","benefits":["Dental insurance","Health insurance","Referral program","401(k)","Flexible spending account"],"selectedSkills":["Microsoft Excel","Microsoft Powerpoint","Laboratory experience","Communication skills","Microsoft Office","Bachelor's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=jPFvc4JguomvjyBFcr_f9Iv9sq-6k3YreLm8CDDL2Y0ATp-8FdrS_Q"},{"position":"Analytical Chemist","labName":"Adept Life Sciences","location":"Chandler, AZ","age":"6 days ago","type":"Full-time","jobDescriptionCopy":"We are excited to hire an Analytical Chemist to our growing team!\n\n\nWho are we:\n\n\nAdept Life Sciences is a leading contract manufacturer servicing the dietary supplement & personal care industries. We manufacturer solid dose (tablet, capsule), powder, liquid, and personal care products.\n\n\nWe recently build a state-of-the-art, ISO accredited, independent, third-party laboratory to perform testing of raw materials, finished goods, and soon to be cannabis. We are looking to add to our lab team with the addition of a Laboratory Chemist.\n\n\nCustomers are our focus butso are you! We have a fast-paced culture where we encourage the team to work hard and play hard. We have built our facilities with only best in class equipment and quality measures, but we also built it for YOU. We care and want you to love where you work. For this reason, we put great thought into the design, lighting, and amenities to support a positive, comfortable, and healthy work environment.\n\n\nEmployee Life. We built a beautiful lunch area with pocket doors that open to a patio where you will find the team soaking up some natural Vitamin D, eating healthy snacks we provide, or playing corn-hole with colleagues. Need a little caffeine boost? Head over to our open kitchen space where we have cold brew on tap and a multi-variety soda machine.\n\n\nWellness & Health is our business. Perhaps you might enjoy squeezing in workout during lunch with your free membership at Life Time™, the luxury athletic retreat with locations throughout Phoenix.\n\n\nOur Ideal Candidate:\n\n\n· A Positive Attitude\n\n\n· Meticulous Attention to Detail\n\n\n· Good Time Management Skills\n\n\n· Punctual and Dependable\n\n\n· Organized and Process Oriented\n\n\n· Excellent analytical and critical thinker\n\n\n· Communicates well, spoken and written.\n\n\n· Can work independently or with a team\n\n\n· Ability to multi-task and change priorities quickly\n\n\n· Enjoys a fast past environment\n\n\nExperience/Education Must Have List:\n\n\n· Bachelor’s Degree in Chemistry, Biology, or Science required\n\n\n· Good technology and computer skills\n\n\n· Excellent math, reading and writing skills\n\n\n· Familiar with cGMP\n\n\n· Familiar with ISO/IEC 17025:2005 (preferred)\n\n\n· Experience working with FTIR, UPLC, UPTLC, GCMS, IPCMS\n\n\n· Understands and follows laboratory safety and procedures\n\n\n· Laboratory Experience (1yr preferred, >3yr is a win)\n\n\n· Microbiology Experience (1yr preferred)\n\n\nJob duties to include but not limited to:\n\n\n· Prepare and conduct analytical tests for microbiology and chemical analysis.\n\n\n· Responsible for operating HPLC, UPLC, LC-MS/MS, GC-MS, and ICP-MS and other instruments following standard operating procedures.\n\n\n· Perform microbiological analysis using petrifilm\n\n\n· Compile, document, review, interpreting, and authorization of testing results.\n\n\n· Assist and/or design new Lab SOPs and keep current any changes to existing SOP’s\n\n\n· Assist and/or train lab personnel\n\n\n· Perform OOS investigations and report findings\n\n\n· Perform routine maintenance and troubleshooting of analytical instruments.\n\n\n· Supervise and perform environmental monitoring and water testing\n\n\n· Analyze and report data to include department KPI’s\n\n\n· Maintain lab inventory supplies\n\n\n· Assigned special project analysis and implementation with growth in equipment or department.\n\n\nJob Type: Full-time\n\n\nPay: From $50,000.00 per year\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\n\nApplication Question(s):\n\n\nWhat is your salary expectation for this position?\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nAnalytical Chemists: 1 year (Preferred)\n\nWork Location: One location\n","slug":"analytical-chemist-10dc677e-046c-4633-846f-4bb3638016bd","benefits":["Dental insurance","Health insurance","Paid time off"],"selectedSkills":["Writing skills","Computer skills","Laboratory experience","Microbiology","Math","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=B_9JJP2hmcpvfazfKpTJT1KvK7wzEGei8vYpkH2WION5cQcM7JISIw"},{"position":"Lab Technician","labName":"G.O.A.T Labs","location":"Vancouver, WA","age":"7 days ago","type":"Part-time","salaryMin":"$17 ","salaryMax":" $19 an hour","jobDescriptionCopy":"Genesis Organic Assurance Testing Laboratories is looking for an Analytical Laboratory Technician to join the team. If you are interested in being part of one of the fastest growing industries in Washington State, contact us at G.O.A.T. Labs. We are an I-502 state accredited cannabis testing laboratory.\n\n\nJob Description for Analytical Technician:\n\n\n-Perform sterile microbial preparation, plating, and interpretation of results\n\n\n-Daily checks of lab equipment, actively participating in the care and maintenance of laboratory instrumentation.\n\n\n-Perform extraction and dilution of samples for High Performance Liquid Chromatography (HPLC) and Gas Chromatography Mass Spectrometer (GCMS)\n\n\n-Maintain an accurate list of test specimens received into the lab and proper sample tracking throughout testing.\n\n\n-Follow the laboratory's Standard Operating Procedure (SOP) and Quality Assurance Manual.\n\n\n-Take routine inventory of laboratory consumables\n\n\n-This position requires additional administrative tasks which include: sample intake and prep for testing, data transfers between programs, occasionally answering company phone calls, and basic work area clean up duties.\n\n\n- Schedule is 3-4 work days during a M-F work week, with some flexibility. Weekdays off will be primarily Tuesdays and/or Wednesdays, based on business need. Part time is considered 20-30 hrs.\n\n\nMinimum Qualifications:\n\n\n-Bachelors Degree in Chemistry, Biology, or a closely related field\n\n\n-6 months - 2 years of relevant experience (laboratory experience outside of an academic setting). An exemplary academic record (GPA >/= 3.0) can take the place of relevant experience. Previous LC or GC experience a plus\n\n\n-Must be over 21\n\n\n-Basic computer skills (Excel, Word, Adobe, Google Drive)\n\n\n-Detail Oriented, Flexible, Communicative\n\n\nJob Type: Part-time\n\n\nPay: $17.00 - $19.00 per hour\n\n\nBenefits:\n\n\n401(k)\nFlexible schedule\nPaid time off\n\nSchedule:\n\n\nDay shift\nMonday to Friday\nNo nights\nNo weekends\n\nCOVID-19 considerations:\nWe continue to follow any State mandates regarding COVID-19.\n\n\nWork Location: One location\n","slug":"lab-technician-47b307a7-9063-4bbf-a76b-d6880460a386","benefits":["Paid time off","Flexible schedule","401(k)"],"selectedSkills":["Gas chromatography","Microsoft Excel","Computer skills","High-performance liquid chromatography","Laboratory experience","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=jJzb-hcVHIzdzLPSgs4pe3RFYy6LfIefzuNxxAMlkXx-2LBA60hc0g"},{"position":"Chemist","labName":"North Coast Testing Laboratories of Michigan","location":"Adrian, MI","age":"5 days ago","type":"Full-time","salaryMin":"$40,000 ","salaryMax":" $70,000 a year","jobDescriptionCopy":"North Coast Testing Laboratories of Michigan (NCTLM) is a licensed safety compliance facility serving Michigan’s regulated marijuana market. NCTLM analyzes a growing volume of cannabis flower and cannabis products for licensed producers in the state. Our team is looking for a chemist with LC and/or LCMS experience to work in a high-throughput laboratory environment.\n\n\nResponsibilities & Duties:\n\n\nFollow all internal laboratory SOPs and Michigan Regulatory Agency (MRA) regulations\nWork in a fast-paced production laboratory with high sample volume\nWork with inventory tracking software (METRC) and use NCTLM’s Laboratory Information Management System (LIMS) to report results obtained from various analyses\nWork cooperatively in a team environment\nDaily routine includes sample preparation, analysis, data interpretation, and laboratory support duties\n\nJob Requirements:\n\n\nProficiency with electronic applications including MS Word, MS Excel, etc.\nExcellent attention to detail\nPassion for science and/or the cannabis industry\nExperience working in a production lab, with demonstrated knowledge of laboratory techniques and procedures is preferred, but not required\nBachelor’s Degree from a four-year accredited college or university in the chemical, environmental, or biological sciences is required\nAbility to communicate effectively\nAbility to sit and/or stand for 100% of an 8 hour day\nDexterity in hands and fingers to operate computer and laboratory equipment\n\nJob Type: Full-time\n\n\nPay: $40,000.00 - $70,000.00 per year\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nParental leave\nRetirement plan\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\n\nAbility to commute/relocate:\n\n\nAdrian, MI 49221: Reliably commute or planning to relocate before starting work (Preferred)\n\nEducation:\n\n\nBachelor's (Required)\n\nWork Location: One location\n","slug":"chemist-7ec8f951-9515-4212-96f0-85d86c020d5e","benefits":["Dental insurance","Health insurance","Paid time off","Vision insurance","Retirement plan"],"selectedSkills":["Microsoft Excel","Laboratory experience","Laboratory techniques","Microsoft Word","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=w4EkixAPf17K7UwnLhs93DuKHg0UUUAFzDzPAMpiPoMAvERE85RCnA"},{"position":"Microbiology Scientist I","labName":"Nova Analytic Labs","location":"Portland, ME","age":"7 days ago","salaryMin":"$40,000 ","salaryMax":" $50,000 a year","jobDescriptionCopy":"Nova Analytic Labs is seeking a highly motivated and qualified scientist to join our cannabis testing laboratory startup, located in Portland, ME.\n\nThe testing Nova Analytic Labs will perform is critical to the health and safety of recreational and medicinal cannabis and hemp products. Nova Analytic Labs will provide the highest quality and safety in testing to the community by combining advanced technology and innovative scientific methods.\n\nAs a startup, we are particularly interested in individuals with well-rounded capabilities and an eager appetite to grow and build a successful enterprise. The ideal candidate will possess sound scientific knowledge, management skills, and an eye for continuous improvement. Flexibility and dedication are a must.\n\nThe Microbiology Scientist I works directly under Lab Manager and ensures all samples are received, extracted, analyzed and reported in compliance with company policies and procedures. Other duties may be assigned as necessary.\n\nDuties and Responsibilities\n\nResponsible for day to day receipt and analysis of samples\n\nResponsible for solution prep and tracking\n\nResponsible for maintaining equipment logs and maintenance\n\nPerform extractions and prepare samples for analysis on LC/MS, GC/MS and ICP/MS\n\nResponsible for data entry of samples in the lab\n\nResponsible for understanding and following all necessary SOPs\n\nProduce quality, mistake-free work in the lab\n\nEnsures resolution of errors before results are released to clients\n\nContinuously seeks out new and better ideas, driving best practices\n\nEnsure samples are received, requisitioned and extracted in a manner that is compliant with SOPs\n\nOther duties as assigned by management\n\nRequirements\nBachelor degree in a science related field or one year experience in a high complexity laboratory, food testing, or environmental testing laboratory\n\nHigh school diploma with at least 2 years experience in a high complexity laboratory, food testing, or environmental testing laboratory\n\nSome experience in a high complexity laboratory preferred\n\nSome experience with LC/MS, GC/MS and ICP/MS\n\nBenefits\nHealth care, Employee bonus/profit sharing","slug":"microbiology-scientist-i-edaf42b0-6e04-4309-8223-65f288d5e754","benefits":["Health insurance","Profit sharing"],"selectedSkills":["Gas chromatography","Laboratory experience","Continuous improvement","Bachelor's degree","High school diploma or GED"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=P2hdoOEGYqt_7drEJmlE_298nbY57emHylGpW1ebctNAh6kG3sFL3w"},{"position":"Scientific Director","labName":"G.O.A.T Labs","location":"Vancouver, WA","age":"7 days ago","type":"Full-time","salaryMin":"$25 ","salaryMax":" $29 an hour","jobDescriptionCopy":"Job description\n\n\nEstablished cannabis analytical laboratory is looking for a Scientific/Laboratory Director to join our team.\n\n\nWe are looking for a dedicated individual with a positive and friendly attitude. This position will require someone who is a team player, professional, and comfortable working around cannabis. The Scientific Director is responsible for overseeing the technical operations of our lab and lab staff to ensure accurate and timely test results to our clients. The Scientific Director will apply his or her experience working with GCMS (Gas Chromatography Mass Spectrometry) and LC (Liquid Chromatography) , microbiological analysis, and other chemistry methods to perform required tests while implementing and enforcing G.O.A.T. Labs standard operating procedures and quality assurance manual. The Scientific Director will meet regulatory and quality system requirements. Advises subordinates to meet schedules and/or resolve technical problems. Implements and improves quality management programs and procedures. The Scientific Director will be responsible for ensuring that results and data meet established protocols, reviewing documentation for completeness and accuracy, while maintaining the quality manual, and will have ownership of in-house SOPs (Standard Operating Procedure) and document control responsibilities.\n\n\nDuties and Responsibilities\n\n\nEssential Duties and Responsibilities shall include, but not be limited to, the following:\n\n\nCertify compliance with internal SOPs and quality systems\nVerify that test orders are completed in an accurate and in a timely manner\nReview and Release of finished client reports\nPerform internal audits of quality systems and SOPs\nDrive quality systems improvements by coordinating investigations and corrective actions with all applicable operating units\nImplement and develop quality control functions for all laboratory processes\nEvaluate current operational practices and recommend process improvements to ensure continued compliance to regulatory requirements and industry expectations\nAuthoring and revision of SOPs\nOwnership of training documentation and DOCs (Determination of Capability) for laboratory employees, Direct laboratory workflow and set priorities for daily functioning\nDirect the technical personnel and scientific methods of the laboratory\nDevelop analytical methods for chemistry-based, genetic, and microbiological and pesticide assays\nEnsure that the testing laboratory achieves, maintains, and improves as needed quality standards and appropriate laboratory accreditation.\nOffer consulting services as appropriate, including those for lab side hires\nEnsure that personnel are properly trained in quality procedures, operating procedures (SOP's) and instrumentation and equipment specific requirements.\nCompile and prepare reports and analyses setting forth progress, adverse trends, and appropriate recommendations or conclusions as requested by executive management\nMaintain instrumentation and equipment and supply inventory, recommend purchases.\nAssist in formulating and implementing the short and long-range goals for laboratory; set priorities, assign responsibilities, and establish timetables\nProject future needs and formulate strategies consistent with projections.\nPlan and schedule work for the group to ensure proper distribution of assignments as well as adequate manning, space, and facilities for subsequent performance of duties.\nRepresent the laboratory in technical interactions with the customer base and other labs\nConsult with clients and government regulators\nCoordinate with Administrative team to proactively respond to customer complaints and inquiries\nImplement solutions to quality problems through inspections, investigations, and audits\nMaintain quality checks on safety of laboratory, including biohazards and insure appropriate maintenance of the facility\nEncourage project/process designs that simplify compliance with quality requirements\nComply with record keeping requirements\nPerform other related duties incidental to the work described herein. The above statements describe the general nature and level of work being performed. This is not intended to be an exhaustive list of all responsibilities and duties\nFull understanding and ability to efficiently carry out production protocols for all lab processes\nUpdate and maintain the Lab Safety Plan/Manual and the MSDS Manual\nManage laboratory safety and ensures that the laboratory remains in compliance with all local, state and federal regulations\nEnsures all reagents and supplies are available when needed\nManage and update Chemical inventories and/or Risk Group Agent inventories\nCommunicate and enforce laboratory safety rules to all lab personnel\nMentor employees not following safety policies/procedures that have been established for the lab, and provide information to Administrative Director for corrective action implementation\nSchedule safety training for new lab users and retraining for lab users who need refresher training to include instrumentation and equipment training, safety training and/or lab safety plan reviews and ensure the training has been documented\nGuarantee that the laboratory is cleaned/sanitized and kept in an orderly manner\nConfirms all instrumentation and equipment is functioning properly and when Instrumentation and equipment is found to need maintenance/repair, the appropriate party shall be contacted for needed repair\n\nQUALIFICATIONS\n\n\nMinimum Requirements:\n\n\nBachelor's degree in the chemical or microbiological sciences from a college or university accredited by a national or regional certifying authority with a minimum of six years of post-education laboratory experience\nMaster's degree in the chemical or microbiological sciences from a college or university accredited by a national or regional certifying authority with a minimum of four years of post-education laboratory experience\nPHD in the chemical or microbiological sciences from a college or university accredited by a national or regional certifying authority with a minimum of two years of post-education laboratory experience\nExperience with the following instrumentation: HPLC, GCMS-Headspace\nMicrobiological experience (plating, e.coli, salmonella)\nMycotoxin experience (ELISA)\nFamiliar with the local regulatory requirements specific to the lab and ensures compliance within those standards\nBroad knowledge of cannabis\nDemonstrate leadership ability and excellent interpersonal skills\nAbility to lead and drive employees to meet demands\nExperience in evaluating/troubleshoot processes, instrumentation and/or equipment failures\nExcellent problem solving and critical thinking skills with demonstrated ability to gather information and develop solutions\nExperience with method development.\nExperience auditing and technical report writing\nExcellent verbal and written communication skills including technical writing· Detail-oriented\nAbility to clearly and concisely explain organizational goals and specific tasks to team members\nAbility to provide excellent customer service and collaborate with remote lab personnel\nAbility to work independently under limited supervision\nCannabis Industry experience a plus\nDemonstrate effective delegation of tasks\nAbility to develop key performance indicators of staff members\nEffectively manage changing priorities and remain calm under pressure\nStrong organizational and planning skills\nAbility to demonstrate professional, positive attitude toward assigned tasks, projects and colleagues\nAccredited laboratory environment requires strict adherence to safety and Quality Assurance protocols\nWorking Conditions and Physical Requirements: sufficient motor function to perform a variety of routine laboratory testing, move freely and safely from one location to another in the laboratory; sufficient upper body muscle coordination to collect appropriate clinical specimens safely and accurately; dexterity to manipulate tools, instruments, and small instrumentation and equipment, including keyboards or other data input tools in a manner consistent with standards of clinical laboratory practice; lift and move objects of at least 20 pounds.\nMay be required to work with a variety of hazardous materials.\nThis job may include some extended work hours or weekend work during harvest and other busy seasons.\nMay require long periods of standing.\nExperience in computer database and Microsoft Office applications\n\nCOMPENSATION Depending on Experience\n\n\nMUST BE OVER THE AGE OF 21 YEARS TO BE ELIGIBLE FOR EMPLOYMENT\n\n\nJob Type: Full Time\n\n\nPay: $25.00 - $29.00 per hour\n\n\n401k Benefits available\n\n\nJob Type: Full-time\n\n\nPay: $25.00 - $29.00 per hour\n\n\nBenefits:\n\n\n401(k)\nFlexible schedule\nPaid time off\n\nSchedule:\n\n\nDay shift\nMonday to Friday\nNo nights\nNo weekends\n\nCOVID-19 considerations:\nWe adhere to all Covid mandates as set forth by the State of Washington\n\n\nAbility to commute/relocate:\n\n\nVancouver, WA 98665: Reliably commute or planning to relocate before starting work (Required)\n\nEducation:\n\n\nBachelor's (Required)\n\nWork Location: One location\n","slug":"scientific-director-17659214-47fb-4274-93af-f20cc595e77f","benefits":["Flexible schedule","401(k)","Paid time off"],"selectedSkills":["Technical writing","High-performance liquid chromatography","Laboratory experience","ELISA","Communication skills","Bachelor's degree","Doctoral degree","Master's degree","Doctor of Philosophy","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=6kaWCKYhYJjs3Nv2EIqM6mF0TMv8DNMjJuksTHwVOhgSYf92BeWAlA"},{"position":"Lab Analyst I","labName":"Nova Analytic Labs","location":"Portland, ME","age":"7 days ago","salaryMin":"$50,000 a year","jobDescriptionCopy":"Nova Analytic Labs is seeking a highly motivated and qualified scientist to join our cannabis testing laboratory startup, located in Portland, ME.\n\nThe testing Nova Analytic Labs will perform is critical to the health and safety of recreational and medicinal cannabis and hemp products. Nova Analytic Labs will provide the highest quality and safety in testing to the community by combining advanced technology and innovative scientific methods.\n\nAs a startup, we are particularly interested in individuals with well-rounded capabilities and an eager appetite to grow and build a successful enterprise. The ideal candidate will possess sound scientific knowledge, management skills, and an eye for continuous improvement. Flexibility and dedication are a must.\n\nThe Lab Analyst I works directly under Lab Manager and ensures all samples are received, extracted, analyzed and reported in compliance with company policies and procedures. Other duties may be assigned as necessary.\n\nDuties and Responsibilities\n\nResponsible for day to day receipt and analysis of samples\n\nResponsible for solution prep and tracking\n\nResponsible for maintaining equipment logs and maintenance\n\nPerform extractions and prepare samples for analysis on LC/MS, GC/MS and ICP/MS\n\nResponsible for data entry of samples in the lab\n\nResponsible for understanding and following all necessary SOPs\n\nProduce quality, mistake-free work in the lab\n\nEnsures resolution of errors before results are released to clients\n\nContinuously seeks out new and better ideas, driving best practices\n\nEnsure samples are received, requisitioned and extracted in a manner that is compliant with SOPs\n\nOther duties as assigned by management\n\nRequirements\nBachelor degree in a science related field or one year experience in a high complexity laboratory, food testing, or environmental testing laboratory\n\nHigh school diploma with at least 2 years experience in a high complexity laboratory, food testing, or environmental testing laboratory\n\nSome experience in a high complexity laboratory preferred\n\nSome experience with LC/MS, GC/MS and ICP/MS\n\nBenefits\nHealth care, Employee bonus/profit sharing\n\nBachelor's with 1-3 years experience","slug":"lab-analyst-i-8cbfcd3c-d184-4d4f-9ad0-fcee9d7e0561","benefits":["Health insurance","Profit sharing"],"selectedSkills":["Gas chromatography","Laboratory experience","Continuous improvement","Bachelor's degree","High school diploma or GED"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=31b7NxkaZYQAReiMbYV9DJlSJrcUvz_qPCVm_7e-j1GaLKMkejgvVg"},{"position":"HVAC Technician","labName":"Parallel","location":"Franklin, MA","age":"6 days ago","type":"Full-time","salaryMin":"$27 ","salaryMax":" $30 an hour","jobDescriptionCopy":"Everyone is welcome here. Each of us is unique, and that’s what makes us amazing. We believe in inclusiveness and celebrating each person’s individuality, because there’s power in bringing people with different points of view and life experiences together. That’s why we provide equal employment opportunities (EEO). All applicants are considered regardless of race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, or sexual orientation.\n\nSo, bring yourself and your best ideas; when we feel safe and comfortable being ourselves, there’s no limit to what we can achieve.\n\nIN A NUTSHELL…\n\nThe Facilities HVAC Tech 2 provides support to the facilities operation during the initial set up phase and ongoing operation thereafter. They provide guidance to ensure the Facilities department is operating best in class.\n\nThis role is with NETA, one of the renowned retail brands under the Parallel umbrella. Parallel is one of the largest multi-state cannabis companies in the world, owning and operating in five markets; Florida (Surterra Wellness), Massachusetts (NETA), Pennsylvania (Goodblend), Nevada (The Apothecary Shoppe) and Texas (Goodblend). If you enjoy companies that are growing, moving fast, and constantly challenging themselves to achieve more, then Parallel is for you. We work hard, lean on each other, and are passionate about a pretty ambitious vision … pioneering a new paradigm of what well-being can be for all people, everywhere. For more information, visit www.liveparallel.com.\n\nWHAT YOU WILL BE DOING:\nRepair and maintain Industrial HVAC, plumbing and mechanical equipment in accordance with diagrams, sketches, operating manuals, manufacturers' specifications or supervisor s instructions, using hand and power tools, precision measuring or testing devices. Responsible for complete maintenance of area of assignment.\nRead blueprints; understand and read computerized HVAC, Electrical, plumbing system and building layouts.\nObserve and adjust a wide variety of equipment, machines and devices in operation to assure proper operation, including pumps, refrigerant recovery, engines, motors, compressors and laboratory equipment.\nDismantle machines and devices for servicing, repair, or replacement of parts.\nObserve Parallel Policies & Procedures for daily operations and fully complies with state medical marijuana regulations at all times.\nPerform preventative maintenance and maintains a scheduled maintenance program to ensure proper facilities upkeep, including all mechanical, electrical and plumbing infrastructure and equipment.\nEffectively using CMMS tracking systems to report receipt of maintenance needs and/or other issues.\nRespond to facility related failures or emergencies promptly and prioritizes work orders, while maintaining preventative tasks in accordance with facility needs.\nPerform routine maintenance tasks, preventative systems and repairs.\nComplete all required documentation for utility and facility management, follows up and evaluates effectiveness of all implemented actions to ensure that problem has been resolved effectively.\nEnsure safe work practices are implemented and consistently followed by department staff.\nWork with other departments in addressing and rectifying potentially unsafe work conditions or practices.\nEnsure compliance with applicable building codes, fire and emergency codes, regulatory and other required regulations.\nResponsive and professional in all response and interactions regarding service requests and facility needs.\nAble to work carefully and efficiently in a fast-paced environment.\nWork in coordination with the Supervisor and Manager to help upgrade all systems and streamline as needed to function in the most efficient and effective manner.\nAfter hours on call availability.\nPerform other job duties and tasks as assigned.\n\nEXPERIENCE AND SKILLS YOU’LL BRING:\nTechnical school graduate or equivalent industrial operations experience (Required).\nHVAC Certification and Refrigeration Recycle Recovery license (Required).\nDemonstrate competency in performing routine maintenance tasks, preventative systems and repairs.\nAbility to read blueprints; ability to understand and read computerized HVAC, Electrical, plumbing system and building layouts.\nMin 7 years of progressively responsible work-related experience and any combination of education and training which provides the required knowledge, skills and abilities to perform the essential functions of the job, combined with demonstrated professional growth and achievement.\nAge 21 or over (Required).\nHigh School Diploma or equivalent (Required).\nValid Government-Issued Photo ID (Required).\n\nYOU WILL BE SUCCESSFUL IF YOU…\nAre self-motivated; micro-managing isn’t fun for anyone.\nRoll your sleeves up and do the work; strategy is important, but so is getting stuff done.\nCan work fast and be flexible; our industry is always changing.\nPlay nice with others; we collaborate with each other a lot.\nThink creatively; sometimes, the “traditional” solution isn’t the best one.\n\nWHAT YOU GET:\nConsistent, reliable benefits; Full medical/vision/dental, 401k with a possible company match, access to company-sponsored well-being programs\nBalance and flexibility; paid time off, paid parental leave, flexible work arrangements.\nFinancial opportunity; an incentive program that provides opportunity to earn cash AND equity in a fast-growing company and industry\nEmployee discount.\nChance to make a difference; Employee Relief Fund, community volunteerism opportunities through Benevity.\n\nPHYSICAL REQUIREMENTS:\nThe person in this position frequently communicates with other employees/customers. Must be able to communicate accurate information in these situations.\nMust be able to travel up to 5%-10% of the time.\nMust be able to move around the production facilities up to 30% of the time.\nMust be able to work in an environment which is noisy and with temperature fluctuations from 60 degrees to 90 degrees.\nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\nConstantly operates a computer and other office productivity machinery.\n\nPARALLEL IS UNITED BY OUR VISION, MISSION, & VALUES:\nOur Vision – why we exist – is to pioneer well-being and improve the quality of life for humanity through the benefits of cannabinoids.\n\nOur Mission – how we will do this – is to build a leading, global well-being company through the best talent, our values, trusted and recognized brands, science and technology-based innovation, and a relentless focus on execution and continuous improvement.\n\nOur Values – Integrity | Collaboration | Alignment | Intentionality | Accountability | Agility\n\nWe are an Equal Opportunity Employer. We embrace and encourage our employees’ differences in age, color, disability, ethnicity, gender identity or expression, language, national origin, physical and mental ability, political affiliation, race, religion, sexual orientation, socioeconomic status, veteran status, and other characteristics that make our employees unique.","slug":"hvac-technician-87e2b878-9efe-4e63-bb9e-f34d7610b72a","benefits":["Dental insurance","Employee discount","Health insurance","401(k) matching","Paid time off"],"selectedSkills":["Precision measuring instruments","CMMS","EPA Refrigeration Certification","HVAC Certification","HVAC","High school diploma or GED","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=fCVWBu_cEaKAW1bPicglwfeWs-3AzZcs76JPlJcKGvnEf-EMZ7KWBg"}]