[{"position":"Laboratory Technician I","labName":"Montrose Environmental Group, Inc.","location":"Durham, NC","age":"6 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate about the environment and ready to join an inclusive work environment, committed to excellence, to new ideas, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you based in our Durham, NC lab. Who are we? We are Montrose, the premier environmental services provider.\n\nThe Laboratory Technician I will be responsible for various laboratory functions. You’ll need some basic knowledge of a lab environment and welcome the opportunity to make an impact from day one.\n\nWHAT WE CAN OFFER TO YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nCompetitive medical, dental, and vision insurance coverage\nMedical, Dependent Care and Transit Flexible Spending Accounts\nCompany paid Life and Disability Insurance and access to additional voluntary programs\n401k with a competitive employer match\nProgressive vacation policies and company holiday to ensure work/life balance for our people.\nA financial assistance program to help support peers in need.\nAccess to telemedicine and employee assistance programs\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicity testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nAs a key member of the Durham team, this role will be responsible for a full range of activities including:\n\nPreparation of samples for analysis\nPreparation of reagents for lab use and/or shipment\nSample extractions\nDetermining the volume of samples\nCleaning of laboratory glassware\nMaintaining clean laboratory areas\nMaintaining organized records of sample preparation and analysis\nOverhead projects designed to improve efficiency of, or accuracy of analyses\nAssisting the Group Leaders and analysts in acquiring and inventorying consumables, chemicals, and parts for instrumentation\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Lab Director\n\nQUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nBachelor's degree in Chemistry, Biology, Environmental Science, or related field preferred\n2 years of relevant lab experience allows direct advancement to Tech II (academic lab counts)\n\nPREFFERED SKILLS\n\nPrior Laboratory experience preferred but not required as this is an entry level position\nKnowledge of analytical method, analytical instruments, general lab practices and lab safety\nAbility to work independently and in a team\nGood organizational skills and strong communication skills","slug":"laboratory-technician-i-c09ba14d-5e99-4f6c-ae66-7a7a0810e27c","benefits":["Dental insurance","Health insurance","Employee assistance program","Disability insurance","401(k) matching"],"selectedSkills":["Laboratory experience","Communication skills","Organizational skills","Bachelor's degree"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-NC-Durham-Capitola-Drive/Laboratory-Technician-I_R2187?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Testing Lab Manager","labName":"Standard Wellness","location":"Gibsonburg, OH","age":"7 days ago","type":"Full-time","salaryMin":"$65,000 ","salaryMax":" $75,000 a year","jobDescriptionCopy":"Standard Wellness’s mission is to improve quality of life through safe and easy access to cannabis by providing consistent, high-quality product through innovation, vertical integration and aggressive regulatory reform. We aim to create a new standard in the medical cannabis industry for quality, care, innovation, and education while still maintaining a focus and conscious understanding of how our decisions within the role effect the social and environmental impact in our community and for our patients. We’re committed to a research-driven, patient-centric approach in all that we do, and we will work to have a lasting positive impact in our community.\n\nOur Core Values include:\nOne Team - We’re all in this together\n\nGrowth - Pride in growing our teams, footprint, patient base and ourselves\n\nEmpathy - Compassion for our people and patients leads to success\n\nAccountability - Do what we say we will do and stand behind our actions\n\nPosition Summary:\nThe Testing Laboratory Manager will be responsible for testing plant material and processed products, validate formulations, and assist in the research and development of new formulations. Will also be responsible for assisting in optimizing the drying and curing process. The Testing Laboratory Manager will oversee the daily operations of the testing lab, including staff and ensuring the lab operates in compliance with State of Ohio laws and regulations while maintaining quality standards of Standard Wellness.\n\nEssential Job Functions:\nPerforming tests on plant material and processed products to include but not limited to potency, microbials, terpene ratios, and moisture content\nPrepare test samples according to testing procedures and accurately track and record samples; communicate with external testing laboratories to ensure consistency and accuracy\nCollect and interpret data to monitor and adjust daily operations for maximum output and quality\nDevelop operations, quality, and troubleshooting procedures\nSet up, run, and troubleshoot HPLC, PCR, QPCR, and GC instrumentation\nMaintain laboratory equipment in good working order by establishing quality standards and performing regular maintenance, calibrations, and quality checks to ensure testing procedures meet quality standards set by Standard Wellness\nResponsible for arranging replacement, service, or repair of laboratory equipment\nResponsible for ordering and monitoring inventory of laboratory supplies\nDirect hiring, scheduling, training, development, performance reviews, discipline, promotion, or termination activities of the testing laboratory staff\nMaintain a safe, clean, and sanitary work environment\nOther duties as assigned by supervisor\n\nQualifications:\nRequired:\nMust be at least 21 years of age\nMust have a high school diploma, or the equivalent\nBachelor’s degree in Biology, Chemistry, or related scientific field; a combination of education and experience will be considered\n2 or more years’ supervisory experience in a regulated laboratory environment\nMust be able to pass all background checks and licensing requirements as set forth by the Department of Commerce\nMust be able to perform the essential functions of the job with or without a reasonable accommodation\nMust be able to read, write, speak, and understand the English language\n\nPreferred:\nExperience working in an ISO 17025 accredited laboratory\nAnalytical experience in the cannabis industry\n\nKnowledge, Skills, and Abilities:\nThis section outlines the knowledge, skills, and abilities necessary for the Testing Laboratory Manager to be successful in their role. It is not intended to be an all-inclusive list.\n\nKnowledge of quality control methods\nKnowledge of state and local cannabis policy and law\nKnowledge of seed to sale tracking systems, specifically METRC and Leaf Logix\nKnowledge of math, weights, and quantities\nKnowledge of Good Laboratory Practices\nStrong organizational skills\nDemonstrated leadership and interpersonal skills\nAccurate data-entry and recordkeeping skills\nAbility to prioritize assignments and ensure completion, accuracy, documentation, and communication of results in a timely manner\nStrong attention to detail with the ability to work in a fast-paced environment\nAbility to stand for long periods of time\nAbility to work evenings, nights, weekends, and holidays, if needed\nExcellent computer skills, specifically with Microsoft Office and Windows-based applications\nExcellent written and verbal communication skills\n\nBenefits: Health, dental, vision, 401(k) w/match, PTO","slug":"testing-lab-manager-22607f94-afb8-4a8d-a96e-04a7c0b535a6","benefits":["Dental insurance","Health insurance","401(k)","401(k) matching","Paid time off"],"selectedSkills":["Windows","GLP","Laboratory experience","Leadership","Communication skills","Bachelor's degree","High school diploma or GED","21 years or older"],"jobType":"free","applyURL":"https://secure2.entertimeonline.com/ta/EVSWC1005.careers?ShowJob=453165446"},{"position":"Technical Director","labName":"Montrose Environmental Group, Inc.","location":"Berkeley, CA","age":"8 hours ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, part of the larger organization, Montrose Environmental Group, is comprised of 10 laboratories performing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nThe Technical Director is the laboratory’s lead analytical and technical resource, responsible for improving procedures and implementing new technologies to meet quality standards and client requirements, reducing costs, and maximizing operating efficiencies by effectively managing and developing available technology solutions. They will also improve efficiencies by minimizing down-time and maximizing instrument through-put and assisting the Group Leaders in training staff to operate new and existing analytical equipment.\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nJob Responsibilities - This role will be responsible for a full range of activities including:\n\nMethod Development – understands methodology and instrumentation, including a software and hardware perspective, to make changes and improvements as needed. Demonstrate knowledge of different analytical columns, detectors, sample preparation, clean up techniques, etc.\nTroubleshooting – Strong ability to diagnose source of error at the bench; understanding how to optimize method parameters such as flow rates, gradients, solvent efficiency, chromatographic resolution, etc\nMethod Validation – write validation plans, interpret and evaluate data, write validation reports in a timely manner to meet deadlines collaborating with QA and Lab Management.\nStaff Development – provide technical and analytical training to analysts and technicians;\nQuality Assurance - Supervise and manage adherence to QA/QC, collaborate with lab management to develop and implement quality systems\nHands on expertise and thorough knowledge (beyond general preventative maintenance) of all instruments used in the laboratory.\nWhen necessary, prepare and analyze client samples, review data, to meet production deadlines.\nAssign and clearly communicate technical priorities; coordinate employee schedules with lab management to balance production needs and development needs\nAllocate lab resources to meet client schedule & requirements; Provide expertise to lab management when recommending new equipment to purchase\nAct as manager when lab manager or lab director are out\nProjecting staffing needs: hiring and firing staff; Assist with employee performance reviews\nAct as main point of contact, along with QA, during lab audits\nOther duties, as assigned by Laboratory Director\n\nMinimum Qualifications\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nBA/BS in Chemistry or related Science required.\nMinimum of 4 years of experience in a laboratory testing environment\nIn -depth understanding of at least two of the following: LC-MS/MS, GC-MS, ICP-MS, LC-DAD, GC-FID\nThe Technical Director must meet the requirements of the accrediting body(ies) of the laboratory\nStrong scientific writing and presentation skills\nAnalytical thinking to solve technical problems\nContract Research Organization (CRO) experience or background a plus\nScientific expertise or background in cannabis containing products is a plus\nMaster’s or PhD degree is a plus.\n\nPreferred Skills\n\nSuperior time management skills\nRespectful and effective communication skills – ensure positive interactions with the team to build professional relationships;\nEffective training - teach complex topics to team members of varying scientific backgrounds and ensuring their proficiency\nConflict resolution: Removes/Breakdown organizational communication or operational barriers\nAssertion Skills: Sets expectations, provides regular feedback, creates a positive work environment.\nManagement behavior shows serious thought and reliable actions; leads with integrity and honesty\nTeam player – Cooperative and collaborative, focused on the outcome of the group as a whole;\nTakes responsibility, diagnoses problems, assesses corrective action, and does not shift blame\nFlexible – able to shift priorities on short notice\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"technical-director-2b82de38-e6f3-4321-8e56-d3c1db9e144a","benefits":["Disability insurance","Tuition reimbursement","401(k)","Parental leave"],"selectedSkills":["Writing skills","Laboratory experience","Communication skills","Time management","Doctoral degree","Bachelor of Science","Bachelor's degree","Master's degree","Doctor of Philosophy"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-CA-Berkeley/Technical-Director_R2196?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Regional Compliance Manager (3880064)","labName":"State of Missouri","location":"Jefferson City, MO","age":"3 days ago","salaryMin":"$64,700 ","salaryMax":" $68,332 a year","jobDescriptionCopy":"Job Location: This position will be located at 3418 Knipp Dr., Jefferson City, MO 65109.\n\nWhy you’ll love this position:\nAssists the Manager of the Medical Marijuana Compliance with the planning and administration of a statewide compliance team. The Facility License & Compliance team oversees 390+ licensed and certified medical marijuana testing, cultivation, manufacturing, dispensary, and transportation facilities. The position will assist the Manager with oversight/direction regarding the compliance of facilities, investigation of complaints against facilities, monitoring of the statewide track and trace system, making recommendations on violations, issuing corrective action plans, and drafting and revising section policies and procedures. The Regional Compliance Manager will oversee the work of a team of Compliance Officers and is responsible for the work and outcomes of that region.\n\nWhat you’ll do:\nAssist the Manager of Medical Marijuana Compliance team with the development and implementation of compliance standards and scope of compliance activities as they apply to Article XIV and 19 CSR 30-95, including but not limited to, inspections, facility requests, investigations, and enforcement actions.\nAssist the Manager of Medical Marijuana Compliance team with interpretation of Article XIV and 19 CSR 30-95 and other Department authority as related to the compliance of licensed and certified medical marijuana facilities. Provide staff guidance on the statute, laws, and rules and regulations relating to medical marijuana.\nMonitor compliance of medical marijuana facility activities related to inventory control through the statewide track and trace system.\nManage and supervise remote compliance staff. Ensure staff are trained, that they are adhering to established protocols consistent throughout the state; ensure staff are completing tasks in a timely manner; evaluate staff performance and provide mentoring and coaching for a successful team.\nCoordinate and review the work of the region’s compliance officers which may include coordinating work, reviewing work product, processes and procedures and provides recommendations and support for claims to the Compliance Manager.\nEnsure documentation and reports support the department actions in claims under Article XIV and rules so as to be fully defensible in court and under Administrative Hearing Commission review.\nCooperate with other agencies, law enforcement entities, the Office of the Attorney General, prosecuting attorneys’ offices and Administrative Hearing Commission in directing investigations and presenting cases.\nExercise considerable initiative and judgment in planning and carrying out assignments; receives general administrative direction; work is reviewed through conferences, reports, and evaluation of operational results.\nProvide consultation to facilities, law enforcement, and other agencies linked with medical marijuana for the safe and effective delivery of marijuana to patients. Serve as a liaison to assigned medical marijuana facilities and organizations within the State of Missouri. Attend meetings and provide information to the community about the Department's role in medical marijuana.\nDevelop and train compliance staff on a wide variety of skills and knowledge that addresses Medical Marijuana facility needs, including but not limited to, manufacturing practices, agricultural practices, environmental control, food manufacturing and safety, laboratory testing, retail of regulated goods, inspection and investigation techniques and computer software that tracks a highly regulated industry.\nIn-depth auditing and reviewing of facility plans and documents, including facility wide standard operating procedures, physical and security site plans, etc., for compliance with 19 CSR 30-95.\n\nAll you need for success:\nMinimum Qualifications\n\nA Bachelor’s degree from an accredited college or university with a minimum of 15 earned credit hours in one or a combination of the following: Criminal Justice, Law Enforcement, Criminology, Business Administration, Social Sciences, Environmental Sciences, or a closely related field.\nFour or more years of regulatory compliance, including civil, administrative, or criminal investigative (non-clerical) experience (e.g., tax fraud, licensing, environmental, client care, public assistance, insurance, or military); or experience as a law enforcement officer with responsibility for conducting investigations.\nExcellent skills in using and mining data systems for the purposes of compliance and investigative needs.\nA proven track record of successfully managing and supervising a highly technical team of employees.\nExcellent written and verbal communication is a must.\nA high level of initiative and problem solving skills in areas of responsibility.\nAble to adapt to constant program development, change and improvement.\n\nIf you have questions about this position please contact:\nbrittany.kirkweg@health.mo.gov\n\nThe State of Missouri is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.","slug":"regional-compliance-manager-3880064-cc54da26-fede-4099-9fcd-afbac97afd0e","benefits":[],"selectedSkills":["Fraud","Communication skills","Military","Clerical experience","Law enforcement","Bachelor's degree"],"jobType":"free","applyURL":"https://hiretrue-prod.com/hiretrue/ce3/job-board/5effe9b2-4b89-494b-ac76-c45e25190768/d4b9f79e-73a6-460d-b24a-613c5bc643b8"},{"position":"Extraction Technician","labName":"Trulieve","location":"United States","age":"1 day ago","salaryMin":"$28,000 ","salaryMax":" $35,000 a year","jobDescriptionCopy":"“Trulieve Grows One Patient at a Time”\n\nIf you have an interest in being part of one of the fastest growing industries in the nation in you may consider wanting to work for Trulieve! If you have a desire to help others in need through your efforts, this may be the role for you!\n\nAt Trulieve, we strive to bring our patients the relief they need in a product they can trust. Our plants are hand-grown in an environment specially designed to reduce unwanted chemicals and pests, keeping the process as natural as possible at every turn.\n\nOur products are designed to alleviate seizures, severe and persistent muscle spasms, pain, nausea, loss of appetite, and other symptoms associated with serious medical conditions such as cancer.\n\nOur specially trained staff works hand-in-hand with physicians to provide the right products and the correct dosage to ensure patients get the compassionate care they need.\n\nRequisition ID: 1452\n\nRemote Work Available: No\n\nTrulieve is looking for an Extraction Technician to support our extraction and production operations. You should be very technically astute in mechanical, electrical, and computer operated systems utilized in production/manufacturing environments. You need to be proactive, quick thinking and innovative in your approach.\n\nKey Duties and Responsibilities:\nPreparation of equipment and plant materials for extraction\nExecution of extraction and processing in accordance with state and local standards\nOperation of sophisticated extraction equipment\nEnsure consistency and efficiency of product through quality control testing and procedures\nCleaning and maintenance of extraction equipment and manufacturing facility\nMaintaining strict inventory records of all plant materials, chemicals, and equipment used in the facility\nOversee day-to-day operations of the entire extraction space beginning with storing the raw cannabis through the extraction process and all the way to fulfillment of orders\nOperating, maintaining, and making adjustments and repairs to extraction equipment\nStoring supplies and equipment and disposal of waste according to guidelines\nComplete the cleaning and sanitization of all production equipment, work surfaces, and tools\nMaintaining inventory records of supplies, materials, and equipment and preparing requisitions as needed\nMaintaining material safety data sheets for all chemicals and products\nFollowing all standard operating procedures regarding product creation and lab safety\nAssist in packaging and labeling of finished products\nWorks with testing laboratory as defined by state guidelines\nFour 10 hour work days and weekends.\nAll other duties as assigned\n\nRequirements\n\nSKILLS AND QUALIFICATIONS:\nBachelor’s or Associate degree or its equivalent, from a recognized college or university, with a major in chemistry or biology preferred\nUnderstanding of state and local laws\nUnderstanding of proper and safe handling of hazardous materials\nFamiliarity with separations, isolations and fractionation\nKnowledge of solvent and non-solvent extraction methods\nStay current of practices and new developments in the cannabis extraction industry\nAbility to work quickly without compromising accuracy\nAbility to discern the quality of plant material and finished products\nStrong computer and social skills\n\nPHYSICAL REQUIREMENTS:\nMust be able to push, pull, move, and/or lift a minimum of 25lbs to a minimum height of 5 feet and able to push, pull, move, and/or carry such weight a minimum distance of 50 feet, with or without mechanical assistance\nMust be able to work seated/standing as appropriate at workstations for extended periods of time, maintain body equilibrium while climbing ladders, stairways, stopping, kneeling, crouching, and reaching, and use hands/fingers to hold, grasp, turn, pick, pinch frequently/constantly to complete tasks\nMust be able to handle organic matter daily, able to wear PPE as appropriate (eye, face, hand, arm, head, foot, body, fall protection), and able to be exposed to hot, cold, wet, humid, or windy conditions while wearing PPE (95 degrees or greater)\nMust have visual acuity with/without job aids to perform activities such as; reading, viewing a computer terminal, visual inspection involving small parts/details. Clarity of vision at 20 ft or more in day and night/dark conditions\nMust be able to speak and communicate verbally at conversation levels with co-workers, vendors, etc. (Moderate noise)\n\nSalary will be commensurate with experience. A comprehensive benefits package including paid time off is offered with this position. This position will work an average of 40 hours per week and will be available “after hours” if an emergency situation should arise.\n\nTrulieve provides equal employment opportunities to all employees and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, pregnancy or any other characteristic protected by federal, state or local laws.","slug":"extraction-technician-00032fb3-857c-4f7a-8584-3faa48cac5d1","benefits":["Paid time off","Health insurance"],"selectedSkills":["Computer skills","Bachelor's degree","Associate's degree"],"jobType":"free","applyURL":"https://careers.trulieve.com/job/Extraction-Technician/898292500/?feedId=364400&utm_source=Indeed&utm_campaign=Trulieve_Indeed"},{"position":"Manufacturing Supervisor","labName":"Trulieve","location":"Midway, FL","age":"2 days ago","salaryMin":"$56,000 ","salaryMax":" $72,000 a year","jobDescriptionCopy":"“Trulieve Grows One Patient at a Time”\n\nIf you have an interest in being part of one of the fastest growing industries in the nation in you may consider wanting to work for Trulieve! If you have a desire to help others in need through your efforts, this may be the role for you!\n\nAt Trulieve, we strive to bring our patients the relief they need in a product they can trust. Our plants are hand-grown in an environment specially designed to reduce unwanted chemicals and pests, keeping the process as natural as possible at every turn.\n\nOur products are designed to alleviate seizures, severe and persistent muscle spasms, pain, nausea, loss of appetite, and other symptoms associated with serious medical conditions such as cancer.\n\nOur specially trained staff works hand-in-hand with physicians to provide the right products and the correct dosage to ensure patients get the compassionate care they need.\n\nRequisition ID: 1399\n\nRemote Work Available: No\n\nTrulieve is looking for an Manufacturing Supervisor to support our extraction and production operations night shift. You should be very technically astute in mechanical, electrical, and computer operated systems utilized in production/manufacturing environments. You need to be proactive, quick thinking and innovative in your approach.\n\nEssential functions:\n\nEnsure that team members are properly communicated the goals of the shift, week, and month.\nTraining new team members on concentrate equipment and procedures.\nEnsuring policy and procedure compliance across all processes within the department.\nAchieves and reports 5S standards for equipment and manufacturing area\nChampions incident investigation process and corrective actions\nFacilitates appropriate training for all safety related activities\nEstablish and maintain compliance to current GMP, safety programs\nCommunicate any safety or product issues from the shift\nMonitoring and reporting on employee attendance and performance.\nOversee equipment cleaning and maintenance policies, ensuring equipment is well maintained.\nMaintaining strict inventory records of all concentrates, chemicals, and equipment used in the facility, assisting in improving records when needed\nOversee process flow throughout department, making changes in allocation of resources to meet demand\nOperating, maintaining, and making adjustments and repairs to concentrate equipment\nEnsuring team members store supplies and equipment and disposal of waste according to guidelines\nWorks with testing laboratory as defined by state guidelines\nQualifications:\n\nBachelor’s or Associate degree or its equivalent, from a recognized college or university, with a major in chemistry or biology preferred\nUnderstanding of state and local laws\nUnderstanding of proper and safe handling of hazardous materials\nFamiliarity with separations, isolations and fractionation\nKnowledge of solvent and solvent free extraction methods\nStay current of practices and new developments in the cannabis extraction industry\nAbility to prioritize tasks in order of importance while managing multiple projects, both long term and short term\nAbility to discern the quality of plant material and finished products\nStrong computer and social skills\nVast cannabis knowledge including specifically Ethyl extraction\nStrong leadership skills\nStrong communication skills\nManufacturing experience preferred\n3+ years of management experience\nAdditional Requirements:\n\nPer state law, Must be at least 21 years of age.\nMust successfully complete a comprehensive background check.\nOther Duties\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.\nHourly wage will be commensurate with experience. A comprehensive benefits package including paid time off is offered with this position. This position will work an average of 40 hours per week and will be available “after hours” if an emergency situation should arise.\nWe are an EOE company\n\nSalary will be commensurate with experience. A comprehensive benefits package including paid time off is offered with this position. This position will work an average of 40 hours per week and will be available “after hours” if an emergency situation should arise.\n\nTrulieve provides equal employment opportunities to all employees and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, pregnancy or any other characteristic protected by federal, state or local laws.","slug":"manufacturing-supervisor-799777bc-f3ce-4ed1-b302-e97877fd76a6","benefits":["Health insurance","Paid time off"],"selectedSkills":["Manufacturing","Computer skills","Leadership","Communication skills","Management","Bachelor's degree","Associate's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://careers.trulieve.com/job/Midway-Manufacturing-Supervisor-FL-32343/897507500/?feedId=364400&utm_source=Indeed&utm_campaign=Trulieve_Indeed"},{"position":"Laboratory GM (Cannabis Testing)","labName":"Cannabis Employment Professionals","location":"Las Vegas, NV","age":"4 days ago","type":"Full-time","salaryMin":"$90,000 ","salaryMax":" $110,000 a year","jobDescriptionCopy":"Overview:\n\n\nRapidly growing cannabis testing laboratory located in Nevada is seeking a Laboratory General Manager. This individual will be overseeing all laboratory operations and developing safe and effective cannabis-based products by supervising production and implementing standard operating procedures (SOPs). The successful candidate will be able to oversee testing formulated products, generate quality assurance/quality control (QA/QC) reports, oversee general laboratory day-to-day operations, and assist with marketing, networking, and bringing in new clients to use our testing services.\n\n\nPay: $90,000-$110,000 annually\n\n\nLocation: Las Vegas, NV (Onsite)\n\n\nDuties:\n\n\nAdhere to protocols and laboratory SOPs\nOversee and help assist with sales\nConsider and address any deficiencies found in other areas, such as facility administration; proficiency testing; and general, pre-analytic, analytic, and post-analytic systems\nProblem-solving skills and troubleshooting of products and equipment\nManage laboratory operations and ensure the safety of employees\nOversee all Lab staff and assist with hiring new employees\nImplement lab equipment troubleshooting procedures, training and usage compliance.\nWork with Laboratory Technicians and Laboratory Analysts to ensure turnaround times are met\n\nQualifications:\n\n\nBachelor’s degree required (preferred degree in business management, chemistry, engineering, or biology/microbiology)\nPrior sales and management experience of at least 1 year required\nLaboratory experience is a plus but not required\nExperience with analytical testing (HPLC) and microbiology including working in aseptic conditions is a plus\n\nJob Type: Full-time\n\n\nPay: $90,000.00 - $110,000.00 per year\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\n\nApplication Question(s):\n\n\nAre you willing to commute or relocate to Las Vegas, NV? (Onsite positions)\n\nExperience:\n\n\nLaboratory management: 4 years (Preferred)\ncannabis testing: 2 years (Preferred)\nanalytical testing (HPLC) and microbiology: 4 years (Preferred)\naseptic conditions: 3 years (Preferred)\n\nWork Location: Multiple Locations\n","slug":"laboratory-gm-cannabis-testing-d265b8fd-2e00-488e-b495-44b4b5901d4b","benefits":["Dental insurance","Health insurance","Paid time off","Vision insurance"],"selectedSkills":["Sales","High-performance liquid chromatography","Laboratory experience","Laboratory management","Management","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&job=-cBslBd8LatcXreUwijENfCwIIBEc0PUgz0D0N8Tl5CCX20dCfEFKA"},{"position":"Cannabis Testing Laboratory Director","labName":"CDS","location":"Los Angeles, CA","age":"2 days ago","type":"Full-time","jobDescriptionCopy":"We are a Licensed Cannabis Testing Laboratory in Los Angeles working on DCC and ISO certification requirements including but not limited to:\n\n\nFinal validation and correspondence with DCC policy\nLIMS selection and implementation\n\nCandidates should have already successfully led one or more Cannabis Testing Laboratories through City, State and ISO 17025 certification processes.\n\n\nCandidates have extensive working knowledge and experience in DCC and ISO certification processes.\n\n\nQualifications:\n\n\nBachelors of Science or greater\n\n\nCA Cannabis Laboratory Management experience of 3+ years\n\n\nLIMS knowledge and experience\n\n\nExperience in Metrix, Accela and Microsoft business tools\n\n\nManagerial experience in ALL aspects of a California Cannabis Testing Laboratory\n\n\nJob Responsibilities include:\n\n\nMethod development\n\n\nProcess creation and process flow development and optimization\n\n\nPolicy Development and optimization\n\n\nSOP creation, development and editing per FDA/ISO standards\n\n\nValidation processes per DCC requirements\n\n\nLearn, run, optimize, trouble shoot and train employees on all necessary aspects of LCMS, ICP-MS, GCMS and HPLC equipment for Perkin Elmer\n\n\nLearn, run, optimize and train employees on Agilent PCR machine\n\n\nManaging, supervising and optimizing laboratory personal and vendors\n\n\nPurchasing of all laboratory supplies and equipment as needed\n\n\nResponsible for oversight of all building maintenance issues and reporting these to the Executive Team\n\n\nEnsure all equipment and applications are in clean, well-maintained and in good working order\n\n\nEnsuring compliance with laboratory policies, procedures and state regulations\n\n\nCandidates should have already successfully led one or more Cannabis Testing Laboratories through City, State and ISO 17025 certification processes.\n\n\nCandidates have extensive working knowledge and experience in DCC and ISO certification processes.\n\n\nQualifications:\n\n\nBachelors of Science or greater\n\n\nCA Cannabis Laboratory Management experience of 3+ years\n\n\nLIMS knowledge and experience\n\n\nExperience in Metrix, Accela and Microsoft business tools\n\n\nManagerial experience in ALL aspects of a California Cannabis Testing Laboratory\n\n\nJob Responsibilities include:\n\n\nMethod development\n\n\nProcess creation and process flow development and optimization\n\n\nPolicy Development and optimization\n\n\nSOP creation, development and editing per FDA/ISO standards\n\n\nValidation processes per DCC requirements\n\n\nLearn, run, optimize, trouble shoot and train employees on all necessary aspects of LCMS, ICP-MS, GCMS and HPLC equipment for Perkin Elmer\n\n\nLearn, run, optimize and train employees on Agilent PCR machine\n\n\nManaging, supervising and optimizing laboratory personal and vendors\n\n\nPurchasing of all laboratory supplies and equipment as needed\n\n\nResponsible for oversight of all building maintenance issues and reporting these to the Executive Team\n\n\nEnsure all equipment and applications are in clean, well-maintained and in good working order\n\n\nEnsuring compliance with laboratory policies, procedures and state regulations\n\n\nJob Type: Full-time\n\n\nPay: From $100,000.00 per year\n\n\nSchedule:\n\n\n10 hour shift\n8 hour shift\nMonday to Friday\n\nAbility to commute/relocate:\n\n\nLos Angeles, CA 90021: Reliably commute or planning to relocate before starting work (Preferred)\n\nEducation:\n\n\nDoctorate (Preferred)\n\nExperience:\n\n\nResearch: 1 year (Preferred)\n\nLicense/Certification:\n\n\nASCP Certification (Preferred)\n\nWork Location: One location\n","slug":"cannabis-testing-laboratory-director-b64b42b4-0057-4e7b-a006-7a76ccdf38b4","benefits":[],"selectedSkills":["Research","ASCP Certification","FDA regulations","Laboratory information management systems","Laboratory management","Doctoral degree","Bachelor of Science","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&job=IH_7sXcximd09MaH9rfIhmtV6PPmyRF3dt-YzTkuRx2GJ0YQe21uyA"},{"position":"Laboratory Supervisor","labName":"Holistic Industries","location":"Kansas City, MO","age":"1 day ago","type":"Full-time","salaryMin":"$49,000 ","salaryMax":" $71,000 a year","jobDescriptionCopy":"About Us:\nAt Holistic Industries we are building a great place to work, shop and invest in cannabis. Our mission is to provide patients and customers with the highest quality, safest cannabis medicine possible. As our name suggests, we care for the whole person. Scaling from a seed of inspiration in 2011, Holistic Industries is now one of the largest and fastest growing private MSOs (Multi-State Operators) in the country. We're able to deliver consistent value to employees, patients, and investors because of the values that drive our work - how we do business and why. We have one of the most seasoned teams in the industry, a budding \"Greenhouse of Brands\" and a meaningful model of doing well by doing good. Our company develops and offers a wide range of proprietary strains that increase desired cannabinoids such as CBD. These high CBD strains have become our foundation for growing, packaging, and selling the best cannabis in our markets. We are committed to harvesting and crafting industry-leading strains, consumer brands, and medical-grade products based on the most progressive science in the space. Holistic Industries has a unique model and approach that enables it to win licenses, scale operations and introduce national brands successfully in highly regulated markets. The company has proven to be responsible stewards of capital since its inception by sourcing licenses on merit rather than simply acquiring them on the open market. A \"GREENHOUSE OF BRANDS\" beginning with our flagship retail and wholesale brand, Liberty Cannabis, we continue to prove our ability to launch new brands from scratch and attract noteworthy partners.\nWe are deeply and actively committed to the communities we serve; our efforts under Liberty Cannabis Cares are focused on four pillars: Social Equity, Diversity, Community, and Cannabis Literacy.\nOur team includes the nation’s most knowledgeable experts in cultivation and medical dispensing, along with professionals who are top of their fields in medical professions, security, agriculture, real estate, and the legal distribution of other highly controlled substances. We are a team of best-in-class executives and staff from within and outside the industry who share a passion for advancing cannabis products and retail experience at scale.\nOur well-established company is growing rapidly and adding to our team of professionals and specialists. Our employees receive PTO, paid Sick Leave, medical, dental, vision and other leave benefits as part of our highly competitive compensation package. Join us as we build a great place to work, shop, and invest.\nHolistic Industries is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.\n\nAbout the Job:\nThe Laboratory Supervisor acts as an assistant to the Processing Manager. This position will work to organize and maintain laboratory operations and procedures, handle daily operations with a focus on efficiency and time management, maintain intra-office/lab communication protocols, streamline administrative procedures, inventory control, and task delegation.\nAssist Processing Manager in management of day-to-day laboratory operations\nSupervise and assign daily tasks of laboratory technicians, packaging supervisor and packaging laborers\nAssist with production scheduling to ensure turnaround times are maintained, coordinated and communicated among laboratory, sales and administrative personnel\nResponsible for ensuring adherence to all laboratory scheduling including, but not limited to: production, equipment maintenance, sanitation SOPs, annual personnel training and safety inspections\nEnsure the lab is well organized, workflows are streamlined, and hold regular meetings with laboratory staff to set work priorities\nAssist Processing Manager to identify and implement procedural and policy changes to improve lab operational efficiency\nOversees Quality Assurance of all batch records and data collection for laboratory and packaging processes\nMaintains laboratory and packaging reports, records and files\nEnsure personnel are trained on SOPs\nMaintain laboratory consumables inventory and manages ordering\nPerforms data and inventory audits to ensure accuracy and adherence to corporate and state mandated regulations\nCoordinate workflow and work schedules from sampler dispatch through testing and reporting of data to customers\nWork with 3rd party laboratories to submit samples and interpret data results\nRequired to maintain strict adherence to safety and Quality Assurance protocols\nPhysical Demands: VERY LABOR INTENSIVE. Must be able to lift, carry and balance up to 75 pounds (125 pounds with assistance), may include walking or standing for extended periods of time, as well as stooping, bending over and/or crouching. Moderate to loud exposure to noise level.\n\nAbout You:\nGeneral\nRegulations require that incumbent be able to obtain and maintain state marijuana work credentials.\nHolistic Industries hires at least 21 years of age and up.\n\nEducation/Experience:\nBachelor’s Degree in a related field required\nPrevious marijuana industry experience preferred with priority given to candidates with experience in licensed facilities\n3+ yrs experience in laboratory operations\n1+ yrs management experience preferred\n\nTechnological Skills:\nAbility to use standard office equipment, computer equipment and software including word processing, database management, spreadsheet applications and email\n\nRequired Knowledge and Skills:\nExcellent management skills with demonstrated ability to manage complex projects and technical team\nHighly detail oriented and organized, critical eye for optimizing workflows\nExcellent communication skills with ability to clearly and succinctly explain organizational goals and specific tasks\nAbility to inspire and motivate employees; encourage productivity, teamwork, and a collaborative environment\nDemonstrate effective delegation of tasks\nAbility to manage and develop key performance indicators of staff members\nExcellent problem solving and critical thinking skills with demonstrated ability to gather information and develop solutions\nEffectively manage changing priorities and remain calm under pressure\nStrong organizational and planning skills\nDemonstrate responsibility, accountability, and dependability toward assigned tasks and duties\nDisplays professionalism and positive attitude toward assigned tasks, projects and colleagues\nStrong ethics and sound judgment\nMust be able to successfully pass a thorough internal and external background check.","slug":"laboratory-supervisor-8101d88c-3abf-4e4d-8f0c-75e7785129b8","benefits":["Dental insurance","Health insurance","Paid time off","Paid sick time","Vision insurance"],"selectedSkills":["Database management","Laboratory procedures","Data collection","Laboratory experience","Communication skills","Bachelor's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&job=c747zW3Tlu6OlSOhP-xKGBpCsbDjqjwXadCGHc1eu-DwAA7FOv20sw"},{"position":"Lab Technician (cannabis lab)","labName":"rhino labs","location":"Norman, OK","age":"18 hours ago","type":"Full-time | Part-time","jobDescriptionCopy":"APPLICANTS MUST currently live within a reasonable commute of business location. OUT OF AREA candidates and/or those requiring a relocation will NOT be considered.\n\n\nPOSITION SUMMARY: This is a technical position responsible for the collection and testing of samples of various chemical compounds and biological specimens. Daily work involves the routine and repetitive use of various types of machinery, lab equipment and programs to perform tests, record data or findings and present information.\n\n\nESSENTIAL FUNCTIONS:\n\n\nPrepares and weighs product samples; performs repetitive/routine testing activities to include accessioning and pipetting\nDocuments results pertaining to strength, stability, purity, chemical content, and other characteristics\nAssembles data and other pertinent information into groups, charts, graphs, reports, and the like for others to evaluate\nHelps to set up laboratory equipment and instrumentation required for testing activities under the supervision of team analysts\nUtilizes problem-solving skills to help to determine when an apparatus may need to be recalibrated or requires servicing\nRestocks inventory supplies used in various testing activities; provides for the weekly cleaning of glassware\nRecords and verifies log entries for various pieces of equipment/apparatus including balances, incubator, refrigerator/freezer, etc.\nComplies with all established safety, health, and environmental rules and regulations designed to ensure a safe work environment\nExpected to perform other job-related duties as assigned\n\nJob Types: Full-time, Part-time\n\n\nPay: From $15.00 per hour\n\n\nSchedule:\n\n\n4 hour shift\n8 hour shift\n\nAbility to commute/relocate:\n\n\nNorman, OK: Reliably commute or planning to relocate before starting work (Required)\n\nWork Location: One location\n","slug":"lab-technician-cannabis-lab-de31c48e-2971-4eb6-a0f3-398054486a08","benefits":[],"selectedSkills":[],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&job=xd7er-qX0eEbEaHAldUezQAFqirlMDF3Lyt8TLoY-QaKWFzjNhnE7w"},{"position":"Level I Microbiologist for Cannabis Lab","labName":"Keystone State Testing","location":"Harrisburg, PA","age":"19 hours ago","type":"Full-time","salaryMin":"$40,000 ","salaryMax":" $75,000 a year","jobDescriptionCopy":"Patients, Growers and Physicians rely on our analytical testing, information and services to help them make better decisions. These are often serious decisions with far reaching consequences, and require sensitivity, tact and a clear dedication to service. It's about providing clarity and hope.\n\n\nAs a team member you will work for the world leader in the industry, with a career where you can expand your skills and knowledge. You'll have a role where you can act with professionalism, you can inspire colleagues, and you can care about the work we do and the people we serve.\n\n\nAt KST, Our team members play an essential role in our success and in the services we provide. As a career, we offer a unique opportunity to develop your career with the #1 testing Lab in the US. We are tech driven, and we're creating the lab of the future - an environment where you can deliver cutting edge analytics and help us drive new discoveries and breakthroughs.\n\n\nBasic Purpose:\n\n\nThe Microbiologist position is a level I position for an individual with prior laboratory experience. The individual will perform routine and limited non-routine functions to aid in the preparation of and testing of samples.\n\n\nMUST'S:\n\n\nAbility to follow Instruction (If you are not exceptional at following instruction, this is not for you)\nAbility to travel / relocate as needed\nPass a full FBI background check\n\nDO NOT APPLY IF:\n\n\nYou can not follow instructions\nIf you are not willing to interview in person (We are not holding phone interviews at this time)\nAre not willing to relocate if needed (assistance will be provided)\n\nResponsibilities include, but are not limited to, the following:\n\n\nPrepare samples for analysis using various methods in accordance with ISO standard operating procedures.\nData handling and report preparation.\nEquipment familiarity preferred but not required (QPCR, LC-MS/MS)\nPerform various microbiological tests for MMJ products such as total plate count, yeast and mold count, ecoli, salmonella, etc.\nPerform various tests for pharmaceutical grade products such as Microbiological Examination of Non Sterile Products, Antimicrobial Effectiveness, Stability, Sterility Test, Environmental Monitoring, etc.\nWork in fast paced, dynamic environment.\nVisit client facilities to perform sampling.\nEvaluate data\n\nAn ideal candidate would possess:\n\n\nAt Minimum a B.S in Bio-Physics, Bio-Chemistry, Micro-Bio, or Chemistry\nAt least 2 years of laboratory experience in a relevant field\nCandidates with strong science backgrounds are encouraged to apply. Bio-Physics/ Chemistry/ Micro-Bio or General Lab experience is preferred.\nMust be fluent with Microsoft Office, specifically Excel and Word.\nFamiliarization with a wide range of analysis methods, sampling equipment and instrumentation a plus.\nSelf-motivated, responsible individual with good communication skills and willingness to learn and progress over time through consistent dedication and training. The position requires the individual to multi-task, be independent/self-sufficient, and be flexible and participate in a team environment.\nQuality Control experience.\nHigh attention to detail.\nAbility to work quickly and efficiently in a high pressure environment, while maintaining the highest level of quality.\nConscientious and responsible.\n\nWe Offer :\n\n\nOpportunity for fast growth and advancement\n\n\nJob Type: Full-time\n\n\nPay: $40,000.00 - $75,000.00 per year\n\n\nBenefits:\n\n\nDental insurance\nFlexible schedule\nHealth insurance\nHealth savings account\nPaid time off\nParental leave\nRelocation assistance\nVision insurance\n\nSchedule:\n\n\n8 hour shift\n\nSupplemental Pay:\n\n\nBonus pay\n\nWork Location: Multiple Locations\n","slug":"level-i-microbiologist-for-cannabis-lab-ef444b84-f51f-4c40-9435-297b00b27fb6","benefits":["Health savings account","Dental insurance","Health insurance","Paid time off","Opportunities for advancement"],"selectedSkills":["Microsoft Excel","Laboratory experience","Communication skills","Quality control","Microsoft Office","Bachelor of Science","Bachelor's degree","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=66mbuTgvrwrUw805MKqbks6PtNF3peUNK4-MC_Lqb0VzTHVwtJD1nA"},{"position":"Post Harvest Manager","labName":"JARS Cannabis","location":"Kingman, AZ","age":"1 day ago","type":"Full-time","jobDescriptionCopy":"Mohave Farms LLC\n\n\nWe are looking for an experienced, well organized, and highly skilled Post-Harvest Manager to help blossom our cultivation efforts. This role is for self-starters, and those who are not fazed by a large challenge in front of them. Previous management experience, extensive knowledge of cannabis cultivation, and a strong work ethic are required, as is a ‘by any means possible’ attitude towards achieving goals set forth in front of them. Additionally, specialized experience in the post-harvest side of production is required, as is advanced knowledge of drying and curing techniques. Experience with large scale (50,000 square feet and more) cultivation operations preferred. If you check all these boxes and are excited about the prospect of growing a company with tremendous potential from its early inception stages, this role might be for you; please read on, below.\n\n\nJob Title: Post Harvest Manager\n\n\nRate: Salaried - $65,000/Year, DOE\n\n\nLocation: Kingman, Arizona\n\n\nHours: 50+ hours/week, available to work six days (if needed)\n\n\nReports to: General Manager\n\n\nOverview\n\n\nThe Post-Harvest Manager plays a vital role in ensuring that our flower is dried, cured, trimmed, and packaged to the highest degree. Months of hard work will all land on your plate, and the final steps of the process – drying and curing – will ultimately determine the quality of our flower. Careful and meticulous attention to detail is integral, as is ensuring proper moisture content, terpene preservation, trichome preservation, and overall bag appeal. The Post-Harvest Manager will coordinate directly with the Greenhouse Manager, and General Manager, to ensure that intakes of harvests are happening on schedule, and that flower is preserved at the highest quality possible. You must have careful attention to detail as it relates to environmental controls of the drying room, and constantly monitor, assess, and adjust to changes around you. A scientific, analytic, and constantly improving mindset should converge with years of personal experience and all lend itself to a Post-Harvest Manager who can successfully reward the operation with the fruits of all our collective labor.\n\n\nYou will be directly responsible for managing, planning, organizing, and executing the goals set forth by management to ensure the overall workflow, and success, of all post-harvest operations, from intake through to packaging. The Post-Harvest Manager will report directly to the General Manager, and together will create a plan of action to meet the goals of upper management.\n\n\nTo best succeed the Post-Harvest Manager should be the type of person who can work in high stress situations while maintaining grace and composure. You are the type of person who can effectively plan, organize, prioritize, lead, and execute a plan from start to finish. Each day will bring its own set of challenges and priorities, and those who can efficiently manage a team under them, solve problems proactively, and hit quotas will thrive in this role. A Post Harvest Manager should have the hard skills of managing a large-scale greenhouse cultivation operation, as well as the soft skills to lead and manage a team of workers under them. Those who are natural born leaders and who can simultaneously teach, motivate, and empower employees are best suited for this role.\n\n\nPersonnel Duties & Responsibilities\n\n\nResponsible for overseeing the day-to-day post-harvest activities and adjusting workflow and procedures to increase yields, efficiency, and overall performance. Oversee proper techniques related to drying and curing, bucking, and trimming, as well as packaging and storing\nLead and manage four supervisors under you, including the Drying Zone Supervisor, the Processing Zone Supervisor, the Trimming Zone Supervisor, and the Curing Zone Supervisor\nMaintain the cleanliness of the facility, ensuring the drying, curing, bucking, trimming, and packaging rooms are cleaned to the highest standards daily (cleanliness is next to godliness)\nEnsure that the optimal temperature, humidity, air movement, etc. are achieved in the drying and curing rooms, and that the environment is carefully monitored, recorded, and maintained on a constant basis.\nCreate an ongoing maintenance schedule to look after HVAC equipment needed in the drying, curing, and storage rooms as well as for other tools and machinery used in the post-harvest production process\nEnsure cultivars are bucked and trimmed according to each plants unique structure, and cater workflow and operation to make sure that we have the highest quality flower possible, period.\nCreate, maintain, and update SOPs as related to ongoing post-harvest efforts, and enforce strict adherence throughout the facility\nOrganize workflow to meet specifications and deadline required by upper management and the needs of our dispensaries. Develop daily, weekly, and monthly plans, and create reports with production completion forecasts, yields, loss, etc. for upper management\nEnsure proper labeling, tagging, and general traceability of plants including plants counts (both physically and in LeafLogix), as well as taking corrective measures to account for plant inventory discrepancies. Ensure strains, and batches, are accounted for and well organized, weights are taken, and all compliance, both AZDHS and in house, is followed\nCoordinate and schedule with state testing laboratories to ensure proper testing is done on a batch basis and that any remediation efforts, if at all needed, are taken. Testing should be organized in a way to minimize the time our product sits at our facility\nAssist with calculating production yields and have a continuous improvement mindset to incrementally get more efficient as we grow in operations\nMonitor stock of post-harvest supplies, equipment, infrastructure, etc. and work with the General Manager and/or Procurement Manager to order supplies, and to make sure we always have the tools needed on hand\nProvide job responsibility, HR management, and task management, as well as work directly with the General Manager on reporting\nAble to lead teams in a way that inspires organizational growth and empowers, nurtures, and cares for employees\nAvailable to work 50+ hours a week, six days per week if needed\n\nIn addition to the above general, and expanded, job descriptions, this position might include other possible work depending on the needs of the facility, taking into account the current workload. Other duties as assigned.\n\n\nJob Requirements & Qualifications\n\n\nMinimum of 21 years of age, must possess a valid drives license or state ID card, and is authorized to work in the U.S.\n\n\nIn addition to the above requirements, one must be able to:\n\n\n- Sit or stand while performing repetitive motions for long periods of time\n\n\n- Work at a fast pace for prolonged periods, with high, sustained energy\n\n\n- Be able to lift at least 45 pounds\n\n\n- Work in hot, sunny, environments for long periods of time\n\n\n- Pass state mandated (ADHS) background check\n\n\nCompensation\n\n\nThis is a salaried position starting at $65,000 per year, depending on experience. Performance reviews will be conducted six months after the date of hire, and any increases in pay and/or bonuses are subject to both the performance of the employee, as well as the overall success of the operations, and are under the discretion of management. In addition to the above, our company provides the option for dental, medical, and vision health insurance, as well as life insurance.\n\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n\nI understand this job description and know that violating any of the requirements is grounds for immediate termination. I also realize that these criteria will be used to assess my suitability for employment, promotions, and raises. All staff are at-will employees, and new hires will have a thirty day ‘trial’ period whereby performance will be evaluated after the first thirty days of employment and a decision to maintain or terminate employment will be decided after said trial period ends.\n\n\nNo cannabis, or other substance use (including, but not limited to, tobacco and alcohol) will be tolerated during work hours, or while on site at our premises. Any indication of use can and will be used as grounds for immediate termination.\n\n\nManagement reserves the right to increase, or decrease, hours based on performance or operational needs.\n\n\nJob Type: Full-time\n\n\nPay: From $65,000.00 per year\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nVision insurance\n\nSchedule:\n\n\n10 hour shift\n12 hour shift\n8 hour shift\n\nAbility to commute/relocate:\n\n\nKingman, AZ 86401: Reliably commute or planning to relocate before starting work (Preferred)\n\nWork Location: One location\n","slug":"post-harvest-manager-1d843755-6ee8-49e7-ba5b-d49d7eaaa1d9","benefits":["Dental insurance","Health insurance","Vision insurance","Life insurance"],"selectedSkills":["Management","21 years or older","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=VC5jO_xZkL66JrigrBWMybLPlIlehX27gctR_S2TxyynHVFEMkgtUg"},{"position":"Microbiologist","labName":"Pain and Wellness of Oklahoma","location":"Poteau, OK","age":"13 hours ago","type":"Full-time","jobDescriptionCopy":"Strong leadership, troubleshooting instrumentation, work with vendors, take direction from management, be organized and prepared, understand and meet timelines. Data management reporting and ability to follow standard operating procedures a must. Chemical extraction, sample preparation and analysis for cannabis using qPCR. Willingness to follow internal quality system requirements. Ensuring SOP's are written or up-to-date for laboratory processes. Familiar with Oklahoma State regulation for cannabis a plus. Implements and maintains appropriate quality control processes and procedures to guarantee accuracy of analysis and quality of results. Performs review of reported data and associated quality control and preparing reports for delivery to client. Responsibilities may include general instrument troubleshooting. Responsible for ensuring that inventory is properly maintained and ordered on time to meet production demands.\n\n\nMust have laboratory experience and be familiar with ISO 17025 requirements. Must have a history of working in a laboratory and an understanding of meeting deadlines. Must understand calculating workflow, turnaround times, and streamlined approaches. Must be able to prioritize and multi-task. MUST HAVE: Minimum Bachelor's Degree applicable to a laboratory testing environment, with a minimum of two (2) years of experience.\n\n\nJob Type: Full-time\n\n\nPay: From $54,000.00 per year\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\n\nSupplemental Pay:\n\n\nBonus pay\n\nWork Location: One location\n","slug":"microbiologist-f018dc32-907a-441f-a53d-d5d921d68be8","benefits":["Paid time off","Dental insurance","Health insurance","Vision insurance"],"selectedSkills":["Laboratory experience","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=JxhzUgXsriBzTdsm1ZCMPn-9oGj8CZ0TTf4LXlhWvPz29Nzu6gpS6Q"},{"position":"Cannabis Testing Facility - Lab Technician","labName":"Quality Laboratories","location":"Edmond, OK","age":"12 hours ago","type":"Full-time","salaryMin":"$35,000 ","salaryMax":" $47,000 a year","jobDescriptionCopy":"Responsibilities:\n\n\nThe Lab Technician position will be responsible for daily tasks inside the lab including sample intake, sample preparation, analysis of samples, data analysis and entry, cleaning and maintaining laboratory equipment, etc.\n\n\nThe Lab Technician will report directly to the Lab Director.\n\n\nRequirements:\n\n\nBachelor's degree in relevant scientific field (Chemistry, Biology, Microbiology, etc.)\n\n\nProfessional or academic experience working in an analytical laboratory\n\n\nStrong attention to detail and highly proficient in analytical lab techniques\n\n\nExperience with HPLC, GC-MS, LC-MS/MS instruments\n\n\nExperience with microbiological analysis\n\n\nJob Type: Full-time\n\n\nBenefits:\n\n\nHealth insurance\nPaid time off\n\nSchedule:\n\n\n8 hour shift\n\nEducation:\n\n\nBachelor's (Preferred)\n\nExperience:\n\n\nAnalytical testing: 1 year (Preferred)\n\nWork Location: One location\n","slug":"cannabis-testing-facility-lab-technician-e207e63d-6f36-4c12-85d2-a723f7650f4d","benefits":["Paid time off","Health insurance"],"selectedSkills":["Gas chromatography","Laboratory experience","Microbiology","High-performance liquid chromatography","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=5BCzQ9RamzYIbWbPY4Wf8MuvSW4Y21BA8qurGYCrHNiOuka7jppXtA"},{"position":"Microbiologist","labName":"Green Leaf Lab","location":"Sacramento, CA","age":"14 hours ago","type":"Full-time","salaryMin":"$25 an hour","jobDescriptionCopy":"THE COMPANY: Green Leaf Lab is the nation's first licensed and accredited cannabis analytical laboratory. We are a full-service, production oriented, cannabis and hemp laboratory using cutting-edge technology to characterize the chemical, physical, biological, and microbial properties of a wide range of samples submitted for regulatory compliance and operational purposes. We are team oriented and focused on excellent service. We are looking for a Microbiologist to join our team.\n\n\nJOB SUMMARY: The Microbiologist is a key collaborative member that supports Green Leaf Labs philosophy and organizational goals. This position will be responsible for running, troubleshooting, and analyzing cannabis and hemp samples for microbiological pathogens utilizing PCR, ELISA and Microscopy utilizing standardized and in-house methodology; writing and reviewing standard operating procedures (SOP’s); and performing basic and complex laboratory operations. This position will also assist with method development as required.\n\n\nESSENTIAL DUTIES/KEY RESPONSIBILITIES:\n\n\n· Responsible for the analysis of cannabis and hemp samples utilizing PCR.\n\n\n· Responsible for media preparation, data entry, reporting for microbiological samples.\n\n\n· Responsible for maintaining validated ISO 17025 standards of performance for microbiological testing.\n\n\n· Responsible for maintaining aseptic techniques in the laboratory.\n\n\n· Responsible for daily sample preparation and data analysis to ensure laboratory runs smoothly and meets required turnaround times.\n\n\n· Responsible for ensuring compliance with internal Standard Operating Procedures (SOPs) and quality systems.\n\n\n· Responsible for Developing procedures for documenting results from data collected.\n\n\n· Responsible for ensuring test equipment is clean, maintained and in good working order.\n\n\n· Responsible for maintaining a safe, clean, and sanitary work area.\n\n\n· Responsible for maintaining an accurate notebook, logbook, and other required documentation protocols.\n\n\n· Responsible for following all safety procedures and documents.\n\n\n· Responsible for ensuring high quality standards are met through performing calibrations, quality checks and proficiency programs.\n\n\n· Responsible for maintaining inventory tracking as required.\n\n\nQUALIFICATIONS:\n\n\n· Bachelor’s degree in biological, chemical, agricultural, environmental, or related sciences from an accredited college or university.\n\n\n· Minimum 2 years microbiological laboratory experience with hands on experience with instrument maintenance and troubleshooting.\n\n\n· Ability to perform effective pipette technique.\n\n\n· Experience with data analysis and Laboratory Information Management Systems (LIMS).\n\n\n· Experience with Problem solving with ability to see whole picture and impact to data.\n\n\n· Experience with method development and method optimization.\n\n\n· Experience importing, validating, and exporting electronic data in a variety of formats.\n\n\n· Experience monitoring consumable inventory and ordering supplies.\n\n\n· Experience with working under ISO 17025 Standard.\n\n\n· Excellent analytical skills and attention to detail.\n\n\n· Excellent leadership ability and interpersonal skills.\n\n\n· Excellent organizational and problem-solving skills.\n\n\n· Ability to formulate and clearly communicate ideas, both verbally and in writing.\n\n\n· Ability to work independently with little guidance, as well as provide support and training for others in a team environment.\n\n\n· Ability to adapt to a fast-changing work environment.\n\n\n· Ability to be flexible and change as business grows and changes.\n\n\n· Ability to work collaboratively as a team.\n\n\n· Ability to prioritize and meet deadlines.\n\n\n· Ability to stand for prolonged periods.\n\n\n· Ability to lift 40-60lbs.\n\n\n· Ability to pass a background check.\n\n\n· Knowledge of routine microbiological methods for the analysis of environmental, agricultural and food samples, including AOAC, FDA, BAM, ISO.\n\n\n· Proficiency with Microsoft Word, Excel, and Outlook.\n\n\n· Problem Solving, solution oriented and production driven.\n\n\nEDUCATION:\n\n\n· Bachelor’s degree in biological, chemical, agricultural, environmental, or related sciences from an accredited college or university.\n\n\nEXPERIENCE:\n\n\n· Microbiological laboratory: 2 years (Required)\n\n\nJOB TYPE: Full-time, Non-exempt.\n\n\nBENEFITS:\n\n\n· Dental insurance.\n\n\n· Health insurance.\n\n\n· Paid time off.\n\n\n· Vision insurance.\n\n\nSCHEDULE:\n\n\n· Tuesday-Saturday.\n\n\n· Additional evening and weekend work as needed.\n\n\nWORK LOCATION:\n\n\n· Sacramento.\n\n\nCOMPENSATION: $25 HR\n\n\nJob Type: Full-time\n\n\nPay: $25.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nWeekend availability\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nMicrobiological Laboratory: 2 years (Required)\n\nWork Location: One location\n","slug":"microbiologist-90a6b32b-a098-46e7-88c7-0ab7b7b30ca4","benefits":["Dental insurance","Health insurance","Paid time off","Vision insurance"],"selectedSkills":["Writing skills","Analysis skills","Microsoft Excel","Microsoft Outlook","Laboratory experience","Bachelor's degree","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=oCx8ScUbP1dyyp7ld65P9v0Kr9HyEeVl5wAEKtoXfCFggSPd2Wp5SA"},{"position":"Laboratory Manager","labName":"Adept Life Sciences","location":"Chandler, AZ","age":"1 day ago","type":"Full-time","jobDescriptionCopy":"We're looking for a Laboratory Manager to start up our new state of the art specialized chemistry and microbiology testing solution for the Nutraceutical, Food & Beverage, and Cannabis industries. They will be responsible for the overall operation and administration of the laboratory, including the employment of personnel who are competent to perform test procedures, record and report test results promptly, accurately and proficiently, and for assuring compliance with the applicable regulations.\n\n\nThe ideal candidate will have experience with ISO: 17025, Method development, Performance Tracking, Executive Leadership, Project Management, Regulatory Compliance, Laboratory Design, Operations Management and be a highly motivated self-starter comfortable working independently and with a team.\n\n\nRequired Skills and Experience:\n\n\n· Familiar with the following instrumentation: HPLC/UPLC, LC-MS/MS, GC-FID, GC-MS/MS, ICP-MS, HTPLC,\n\n\n· Validation methods for the above testing.\n· Familiar with LIMS for implementation and data entry and database management Ability to read and interpret documents such as safety rules.\n\n\n· Ground-up development and implementation of lab's required SOPs.\n\n\n· Implementation, management, and monitoring of lab equipment for quality assurance.\n\n\n· Interview, hire and train initial workforce with the intent to conduct 500 samples per month\n· Write SOPs to ensure strict adherence to GLP standards to obtain ISO 17025:2017 accreditation.\n\n\n· Deliver a roadmap for Potency Testing (PT) to upper management to achieve ISO 17025:2017 for select analyses.\n\n\n· Experience working in a heavily regulated industry preferred; Accredited laboratory environment requires strict adherence to safety and Quality Assurance protocols.\n\n\n· Proficiency with Microsoft Office suite required\n\n\n· Background check required\n\n\n· Benefits: Vacation, Paid Sick Leave, Health Benefits, Paid Holidays,\n\n\nJob Type: Full-time\n\n\nPay: From $75,000.00 per year\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\n\nSchedule:\n\n\n8 hour shift\n\nApplication Question(s):\n\n\nWhat is your desired salary?\n\nEducation:\n\n\nBachelor's (Required)\n\nWork Location: One location\n","slug":"laboratory-manager-88b55543-c97c-42be-8f53-47890114bdd2","benefits":["Paid time off","Dental insurance","Paid sick time","Health insurance"],"selectedSkills":["Microsoft Office","Bachelor's degree","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=rNIibFKaeY9Jw5VSfhJH0VuRdgC5F7g8bnrsmWqLfvewAT4tQXbCPg"},{"position":"Cannabis Chemist Technician","labName":"California Ag Labs","location":"Marysville, CA","age":"7 days ago","type":"Full-time","salaryMin":"$45,000 ","salaryMax":" $65,000 a year","jobDescriptionCopy":"Job Descriptions Updated: 1/3/22\n\n\nChemist Technician\n\n\nThe Chemist Technician will receive the client samples from the Sampling Technician and complete all sample login and receipt protocols following laboratory SOP’s. The Chemist Technician will ensure compliance of day-to-day laboratory operations and report to management any issues.\n\n\nQualifications\n\n\nThe Chemist Technician must meet applicable DCC requirements for Quality Manager and State Licensing qualifications where applicable:\n\n\nA bachelor’s or master’s degree in biological, chemical, agricultural, environmental, or related sciences from an accredited college or university; OR\n\n\nCompleted 2 years of college or university education that included coursework in biological, chemical, agricultural, environmental, or related sciences from an accredited college or university PLUS 3-years full time experience.\n\n\nJob Duties and Responsibilities\n\n\nLog in client samples to the laboratory information management system (LIMS)\nSchedule sample workflow for preparation and analysis by due date, hold time and turnaround time requirements.\nPrepare and record standards, calibration curves and QC samples.\nCan identify lot numbers and use them accordingly.\nKeep track of expirations dates for all standards.\nPrepare and analyze samples following laboratory methods.\nPerform all initial and continuing calibration requirements for sample analysis.\nMaintain and troubleshoot analytical instrumentation and other laboratory equipment.\nOrder supplies as needed, liaison with clients regarding analytical results and any technical issues.\nAny other functions as deemed necessary.\n\nPhysical Demands\n\n\n· The ability to stand for intervals of up to 8 hours while working.\n\n\n· Able to speak English and hear clearly, while communicating with co-workers and managers, in person and over the phone.\n\n\n· Dexterity in hands and fingers to operate equipment and handle glassware.\n\n\n· Must have average vision and able to see to read reports and operate equipment\n\n\n.\n\n\nABOUT CALIFORNIA AG LABS\n\n\nCalifornia Ag Lab is your number one source for agricultural testing in California's booming cannabis industry. Established in 2019 by a team of experts in medical toxicology, biochemistry, cultivation, public relations, and information technology, California Ag Labs has developed into a high-caliber laboratory, dedicated to providing accurate, transparent and consistent testing results. Our passion is driven by honest and transparent laboratory practices designed to prevent public health dangers in agricultural development. By providing an optimized testing experience for cannabis growers, retailers and distributors, we can help ensure the quality of your products while saving you time and money\n\n\nJob Type: Full-time\n\n\nSchedule:\n\n\n10 hour shift\n8 hour shift\nMonday to Friday\n\nWork Location: One location\n","slug":"cannabis-chemist-technician-663b6346-c740-462d-a2f0-0c12edb91cb6","benefits":[],"selectedSkills":["Bachelor's degree","Master's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=b4SwoAqww8k0C0SsO5a7MBaJG7hqauGR7hGPoW08JgEddJ7DgN8KrQ"},{"position":"Lab Technician - Cannabis Industry","labName":"Oklahoma","location":"Oklahoma City, OK","age":"4 days ago","type":"Full-time","salaryMin":"$35,000 ","salaryMax":" $47,000 a year","jobDescriptionCopy":"Job Title: Lab Technician\n\nReports To: Processing Manager\n\nDepartment: Processing\n\nFLSA Status: Non-Exempt\n\nSupervisory Responsibility: NA\n\nPosition Summary:\nThe Lab Tech will execute a variety of laboratory and manufacturing tasks under the direction and supervision of our Lab Director. The Lab Technician will be responsible for assisting in product processing and formulation. The Lab Technician completes tasks assigned by the Lab Manager to operate lab equipment, monitor and maintain cleanliness and efficiency, and drives quality control while always being compliant. This individual must be able to multitask, work quickly and efficiently, and be adaptable to changing priorities and tasks as needed.\n\nFurthermore, the successful candidate will be expected to interact with managers and supervisors to set manufacturing schedules and ensure proper execution of workflow tasks by other employees. We have a very fast- paced environment as we continue to grow and expand. The individual must be motivated, trustworthy, and able to operate both independently and within a team environment.\n\nEssential Functions:\nOperate laboratory, extraction, and manufacturing equipment\nFollow all company policies and procedures to ensure product integrity and quality control\nAssist with testing and calibrating lab equipment in preparation for specific tasks\nPerform quality control tests on ingredients, completed products, and product samples\nWork closely with logistics team to deliver the highest quality products, on-time, accurately, and compliantly\nMaintain accurate inventory of all products\nProvide feedback to Lab Director and fellow team members in support of our continuous improvement operating priority\nRecognize and report any issues, large or small\nPerform all tasks as directed by the Lab Director\n\nManufacturing\n\nResponsible for the preparation and execution of Cure s extraction and processing of product in accordance with the company s Standard Operating Procedures\nEnsures consistency and efficacy of product through close attention to detail\nPerform lab bench work and product filtrations\nAssist in packaging department as needed\nCreate distilled, high purity concentrate medical marijuana for use in a variety of products including vape, edibles, topicals, and tinctures\nExecute the preparation and production of extracted products\nExecute proper labeling and storage of extracted products\nComplete all orders for extracted products in an efficient and timely manner, meeting all necessary deadlines\nCoordinate equipment maintenance, purchases, and repairs with the Lab Director as needed\nExecute and enforce compliance of all local and state regulations\nFollow weekly schedules to ensure there is proper coverage based on the business needs\n\nFacility Cleaning\n\nPerform all assigned duties required to ensure a clean and safe production facility\nEnsure personal hygiene is acceptable under standards set by Cure before performing any production activities by washing hands, wearing a hair net, changing clothes\nComplete the sanitation of all production equipment and tools including workspace, lab equipment, containers, and appliances.\nMonitor, clean, and maintain all equipment and operate all equipment safely in its intended manner\nEnsure compliance at all times with all sanitation regulations and safety standards in the production of all products\nPerform duties as needed outlined in the daily, weekly, and monthly cleaning schedules\n\nRequirements\n\nPast experience in a highly regulated field producing pharmaceutical or nutraceutical products preferred\nEffective time-management skills and ability to multi-task\nAbility to work in a fast-paced, changing and challenging environment\nProficiency in windows-based software and Metrc experience a plus\n\nCompetencies:\nTechnically focused\nIntegrity and trust\nAttention to detail\nApproachability\nCommunication skills\n\nWorking Conditions:\nWhile performing the duties of this job, the employee is regularly required to perform grasping, talking, hearing, seeing and other repetitive motions.\n\nThe employee is frequently is required to stand for long periods of time, use hands for detailed work.\n\nSpecific vision abilities required by this job include close vision, distance vision, peripheral vision, depth perception and ability to adjust focus. This position requires the ability to occasionally lift products and supplies, up to 75 pounds (or more with assistance). Strong odors and varying room temperatures will occur on a daily basis. This position setting is in a general Lab setting.\n\nPosition Type/Expected Hours of Work\n\nThis is a full-time position, and hours of work and days will vary due to business needs. Some holidays and overtime maybe required.\n\nTravel\n\nNone.\n\nEEO\n\nOur organization does not discriminate against our employees or applicants because of race, color, religion, sex, pregnancy, national origin, ancestry, age, marital status, sexual orientation, veteran status, physical or mental disability, medical condition, or any other status or classification protected by applicable federal, state, and/or local laws. Equal employment opportunity will be extended to all persons in all aspects of the employer-associate relationships, including recruitment, hiring, advancement, compensation, benefits, training, promotion, transfer, discipline, layoff, recall and termination. Every reasonable accommodation will be made for qualified disabled employees/applicants.\n\nOther Duties\n\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.\n\nBy signing this job description, I acknowledge that I am able to perform the scope of duties listed with or without reasonable accommodation.","slug":"lab-technician-cannabis-industry-44286b99-618a-42be-ae83-65c284b19466","benefits":[],"selectedSkills":["Communication skills","Windows","Time management"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=QUgM6MJEX1QQnkPDKK2dOQeuZfKRnOZLG6UvQfur6efidpaLfu9vhQ"},{"position":"Scientist 1","labName":"Green Leaf Lab","location":"Sacramento, CA","age":"1 day ago","type":"Full-time","salaryMin":"$25 an hour","jobDescriptionCopy":"THE COMPANY: Green Leaf Lab is the nation's first licensed and accredited cannabis analytical laboratory. We are a full-service, production oriented, cannabis and hemp laboratory using cutting-edge technology to characterize the chemical, physical, biological, and microbial properties of a wide range of samples submitted for regulatory compliance and operational purposes. We are team oriented and focused on excellent service. We are looking for a Scientist 1 to join our team.\n\n\nJOB SUMMARY:  The California Scientist 1 is a key collaborative member that supports Green Leaf Labs philosophy and organizational goals. This position will be responsible for running, troubleshooting and analyzing samples with a GC, GCMS, LCMSMS, HPLC, and/or ICP system utilizing standardized and in-house lab methodology; writing and reviewing standard operating procedures (SOP’s); and performing basic and complex laboratory operations including sampling, chromatographic and material assays. This position will also assist with method development as required.\n\n\nESSENTIAL DUTIES/KEY RESPONSIBILITIES:\n\n\n· Responsible for the setup, running and troubleshooting of GC (GCMS, GCMSMS etc.), LCMSMS and ICP systems.\n\n\n· Responsible for maintaining validated ISO 17025 standards of performance for analytical chemical testing.\n\n\n· Responsible for daily sample preparation and data analysis to ensure laboratory runs smoothly and meets required turnaround times.\n\n\n· Responsible for ensuring compliance with internal Standard Operating Procedures (SOPs) and quality systems.\n\n\n· Responsible for Developing procedures for documenting results from data collected.\n\n\n· Responsible for ensuring test equipment is clean, maintained and in good working order.\n\n\n· Responsible for maintaining a safe, clean and sanitary work area.\n\n\n· Responsible for maintaining an accurate notebook, logbook and other required documentation protocols.\n\n\n· Responsible for following all safety procedures and documents.\n\n\n· Responsible for ensuring high quality standard are met through performing calibrations, quality checks and proficiency programs.\n\n\n· Responsible for maintaining inventory tracking as required.\n\n\nQUALIFICATIONS:\n\n\n· Bachelor’s degree in biological, chemical, agricultural, environmental, or related sciences from an accredited college or university.\n\n\n· Minimum 2 years analytical laboratory experience with hands on experience with instrument maintenance and troubleshooting.\n\n\n· Experience with data analysis and Laboratory Information Management Systems (LIMS).\n\n\n· Experience with the following instrumentation: HPLC, GCMS, LC-MS/MS, GC-MS/MS, ICP\n\n\n· Experience with Problem solving with ability to see whole picture and impact to data.\n\n\n· Experience with method development and method optimization.\n\n\n· Experience importing, validating, and exporting electronic data in a variety of formats.\n\n\n· Experience monitoring consumable inventory and ordering supplies.\n\n\n· Experience with working under ISO 17025 Standard.\n\n\n· Excellent analytical skills and attention to detail.\n\n\n· Excellent leadership ability and interpersonal skills.\n\n\n· Excellent organizational and problem-solving skills.\n\n\n· Ability to formulate and clearly communicate ideas, both verbally and in writing.\n\n\n· Ability to work independently with little guidance, as well as provide support and training for others in a team environment.\n\n\n· Ability to adapt to a fast-changing work environment.\n\n\n· Ability to be flexible and change as business grows and changes.\n\n\n· Ability to work collaboratively as a team.\n\n\n· Ability to prioritize and meet deadlines.\n\n\n· Ability to stand for long periods.\n\n\n· Ability to lift 40-60lbs.\n\n\n· Ability to pass a background check.\n\n\n· Proficiency with Microsoft Word, Excel and Outlook.\n\n\n· Problem Solving, solution oriented and production driven.\n\n\nEDUCATION:\n\n\n· Bachelor’s degree in biological, chemical, agricultural, environmental, or related sciences from an accredited college or university.\n\n\nEXPERIENCE:\n\n\n· Analytical laboratory: 2 years (Required)\n\n\nJOB TYPE: Full-time, Non-exempt.\n\n\nBENEFITS:\n\n\n· Dental insurance.\n\n\n· Health insurance.\n\n\n· Paid time off.\n\n\n· Vision insurance.\n\n\nSCHEDULE:\n\n\n· Tuesday-Saturday.\n\n\n· Additional evening and weekend work as needed.\n\n\nWORK LOCATION:\n\n\n· Sacramento.\n\n\nCOMPENSATION: $25 HR\n\n\nJob Type: Full-time\n\n\nPay: $25.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nWeekend availability\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nAnalytical Laboratory: 2 years (Required)\ndata analysis: 2 years (Preferred)\nLaboratory Intake Management System: 2 years (Preferred)\n\nWork Location: One location\n","slug":"scientist-1-463cdea6-0d06-4a8d-8aef-a96677c0ee2a","benefits":["Dental insurance","Health insurance","Paid time off","Vision insurance"],"selectedSkills":["Writing skills","Analysis skills","Microsoft Excel","High-performance liquid chromatography","Microsoft Outlook","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=M8Tb4WrtUoMOXvnHcDK3c41Pzt4o1oD_QMvDkwwAXFwKnE_dUJn1jA"},{"position":"Customer Support and Intake Specialist","labName":"Agricor","location":"Denver, CO","age":"1 day ago","type":"Full-time","salaryMin":"$18 an hour","jobDescriptionCopy":"Customer Support and Intake Specialist\n\n\nCompany Profile\n\n\nAgricor and our sister hemp testing lab, Botanacor, have joined forces with SC Laboratories, Inc. based in Santa Cruz, CA, to provide cannabis and hemp brands with access to the most comprehensive, industry-forward testing solutions in North America.\n\n\nThe combination brings together three of the longest standing and most respected cannabis and hemp testing organizations in the U.S. and forms the foundation of a national testing network. The combination will bring value to both the hemp and cannabis industries, ranging from access to a broader range of testing resources, improved data delivery, innovative science, instrument redundancy and increased testing capacity, and improved operations to accelerate turnaround times.\n\n\nAgricor is seeking a full time Customer Support and Intake Specialist to join the team.\n\n\nPosition Summary\n\n\nThe Customer Support and Intake Specialist’s primary responsibilities will include but are not limited to screening all persons prior to entry, greeting and checking-in qualified patients and caregivers, conducting the patient intake process, entering patient data and collaborating with Lab Analysts to work on getting what our customers need and want.\n\n\nSpecific Duties/Responsibilities:\n\n\nManage outstanding phone and in-person customer service skills.\nBe first point of contact for employees, patrons, visitors, deliveries, and inspectors\nReceive and inspect samples as they come into facility to ensure proper packaging, no leaks, damages, etc.\nDaily duties include opening packages from customers regularly and will be required to utilize proper PPE if necessary.\nBe able to follow proper intake processes on all samples in accordance with Standard Operating Procedures.\nWork closely with sales team to assist with any customer inquiries or questions.\nAnswer general and technical questions from customers involving due date of sample(s), status of sample(s) in testing, etc.\nMaintain sample storage in compliance with State law\nHelp to maintain a clean, safe, welcoming environment inside and outside the facility\nDaily duties require proficiency in Microsoft Word, Excel, internet; comfortable learning/using new software.\nComplete additional projects assigned by the Manager.\n\nQualifications and Required Experience:\n\n\nHigh school diploma or equivalent required; 2+ years post-secondary education in a related field preferred.\nMust have strong communications skills; excellent customer service skills; proficiency using Google applications including Drive and Docs; advanced knowledge of Microsoft Office applications and email.\nMust be able to communicate clearly, calmly and in a positive, helpful manner, adapt to a varied clientele, ability to multi task, prioritize and manage time effectively, ability to work in a fast-paced environment, ability to work well with others, ability to read, write, and speak English.\nOther Characteristics: Comfortable working in the cannabis industry.\nMust have 1-2 years of experience in a customer service role; client-service intensive industry (hospitality, retail, medical) preferred.\nRequires extended time standing, walking, bending and reaching.\n\nCompensation: $18 /HR\n\n\nAll employment offers will be contingent upon successful completion of a background check.\n\n\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.\n\n\nSC Laboratories provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.\n\n\nThis policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.\n\n\nJob Type: Full-time\n\n\nPay: $18.00 per hour\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\nDay shift\nMonday to Friday\n\nAbility to commute/relocate:\n\n\nDenver, CO 80223: Reliably commute or planning to relocate before starting work (Required)\n\nWork Location: One location\n","slug":"customer-support-and-intake-specialist-0ecfa4da-cdf5-47c9-871a-e60541897654","benefits":["Dental insurance","Health insurance","Paid time off","401(k)","Vision insurance"],"selectedSkills":["Customer service","Microsoft Excel","Google Docs","Microsoft Office","Microsoft Word","High school diploma or GED","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=znSnH-fK4QHG98BxGrQgu_Jz6wN9YW53Xl40OFu24yn-zH5rGlXABQ"},{"position":"Chemist","labName":"SafeTiva Labs","location":"Westfield, MA","age":"3 days ago","type":"Full-time","jobDescriptionCopy":"Position: Chemist\n\n\nSafeTiva Labs is looking for an experienced chemist to join the lab team and perform cannabis testing operations.\n\n\nCompany Overview\n\n\nSafeTiva Labs is an analytical testing and research laboratory comprised of dedicated scientists working on cutting-edge analysis methods. SafeTiva follows Cannabis Control Commission regulations, ISO 17025 standards, and maintains high ethical standards. Joining our team means being part of an exciting start-up culture on the front lines of the fast-paced cannabis industry. Our team prides itself on maintaining a collaborative environment where each member is valued. We are a small group of talented people who are driven and dedicated to science, innovation, and work ethic. Our team is our most important asset and we aim to create an environment that makes employees love coming to work. This is an opportunity to join a growing company and help define what makes it great!\n\n\nDetailed Responsibilities:\n\n\n· Analyze samples for cannabinoids, heavy metals, pesticides, residual solvents, mycotoxins, and terpenes using HPLC, GC-MS, LC-MS, and ICP-MS\n\n\n· Perform cannabis sample preparation and destruction as needed\n\n\n· Follow laboratory policies and SOPs, state regulations, and ISO-17025 quality management system\n\n\n· Review, record, and organize data in the LIMS\n\n\n· Maintain lab equipment in good operating condition and troubleshoot malfunctions as needed\n\n\n· Identify and improve workflow efficiencies\n\n\n· Maintain familiarity with all analytical protocols and be able to train new technicians\n\n\n· Prepare chemical solutions and various tasks to keep the laboratory clean and functioning\n\n\n· Evaluate system performance and perform proficiency testing\n\n\n· Monitor inventory levels and order supplies\n\n\n· Perform related duties as assigned\n\n\n· Will report to Lab Director\n\n\nSkills and Competencies\n\n\n· Strong aptitude for instrument operation and maintenance for HPLC, GC-MS, LC-MS, and ICP-MS\n\n\n· Attention to detail while performing repetitive tasks\n\n\n· Efficient workload management and able to oversee high throughput testing when samples are arriving at varying times\n\n\n· Enthusiastic team player with ability to work independently\n\n\n· Able to multitask in a fast-paced, ever-changing environment\n\n\n· Effective oral and written communicator\n\n\n· Strong work ethic\n\n\n· Maintain the highest standards of personal, professional, and ethical conduct\n\n\n· Support SafeTiva’s goals for a diverse and culturally aware workforce\n\n\n· Strong computer and data management skills, with preference for MS Office and LIMS programs\n\n\n· Experience with Chromeloen, Qtegra, and METRC is a plus.\n\n\nEducation and Experience\n\n\n· Bachelor’s Degree in chemistry or related sciences\n\n\n· 1-3 years of experience working in a testing laboratory, with cannabis experience preferred\n\n\n· ISO-17025 experience preferred\n\n\nRequirements\n\n\nAt least 21 years of age\nAble to pass a background check, drug test, and must not have been convicted of an excluded felony offense as defined in 105 CRM 725.030\nAble to perform grasping, talking, hearing, seeing and repetitive motions\n8 hour shift, days and times may change and occasional night and weekend work may be required\n\nBenefits:\n\n\nCompensation will be commensurate with experience and skillset, and structured with incentives for meeting outlined goals\n\n\nSafeTiva is pleased to offer a comprehensive benefits package.\n\n\nSafeTiva Labs celebrates diversity and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, gender, gender identity or expression, religion, sexual orientation, national origin, disability, age, or veteran status.\n\n\nJob Type: Full-time\n\n\nPay: From $47,000.00 per year\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nPaid time off\n\nSchedule:\n\n\n8 hour shift\n\nCOVID-19 considerations:\nAll employees are required to be fully vaccinated for Covid-19.\n\n\nExperience:\n\n\nLaboratory experience: 1 year (Preferred)\n\nWork Location: One location\n","slug":"chemist-c67d3ce9-a176-44da-925f-5b120c01753b","benefits":["Health insurance","401(k) matching","Paid time off","401(k)"],"selectedSkills":["Computer skills","Laboratory experience","Communication skills","Data management","Microsoft Office","Bachelor's degree","Pass drug screening","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=MHnUEZwIj1wGI0XwcwhQuUyYIcggVi4dJ8owXG4oekyA8cBgeiqB-g"},{"position":"Analytical Chemist","labName":"US Cannabis Laboratories, Inc.","location":"Needles, CA","age":"1 day ago","type":"Full-time","salaryMin":"$60,000 a year","jobDescriptionCopy":"About us\n\n\nUS Cannabis Laboratories, Inc. is a start up company. We are in process of validation and will provide training. Our goal is to Provide honest cannabis testing results .\n\n\nOur work environment includes:\n\n\nFlexible working hours\nLively atmosphere\nRelaxed atmosphere\nResponsible for ensuring that the laboratory achieves and maintains a laboratory quality assurance program as required by state regulations.\nEnsures ISO 17025 practices are followed at all times.\nManages multiple analytical projects related to the development, qualification and/or troubleshooting of sensitive, efficient, and reliable assays for a wide class of molecules simultaneously.\nPrepares, reviews, and edits method transfer, qualification, and validation protocols, analytical technical reports, and regulatory documentation.\nMaintains equipment and instruments in good operating condition, recognizes any malfunctions and troubleshoots as needed.\nEnsures compliance with all regulatory agency requirements through documentation, audits, and corrective action.\nParticipates in the development of new SOPs, new validations tests.\nPerforms quality control procedures to ensure accuracy of clinical data.\nParticipates in the updating of departmental standard operating procedures and databases to accurately reflect the current practices in the laboratory.\n\nJob Qualifications & Requirements: Knowledge/Skills/Abilities\n\n\nHands-on experience with analytical instruments used in cannabis labs, HPLC, LC-MS, GC, GCMS & ICP-MS & common laboratory equipment.\nExperience in a certified lab and regulated environment, including such things as GLP/GMP, ISO 17025, state or federally licensed laboratories. Examples:\n\no Certified cannabis testing\no Pharmaceutical\no Food chemistry, food testing o Environmental\n\n\nExtensive knowledge and experience with qualitative and quantitative analytical chemistry techniques and principles.\nExperience in following and explaining methods, SOPs, operating principles.\nExperience with preparation of standards, solutions, use of specialty chemicals.\nSkilled at analytical technique troubleshooting.\nLaboratory and instrument maintenance.\n\nCompetencies\n\n\nDemonstrates strong leadership abilities and excellent interpersonal skills.\nSuperior oral and written communication skills.\nExcellent critical thinking skills and detail-oriented.\nMust be flexible and adaptable to shifting priorities.\nProficiency with Microsoft Word, Excel and Outlook.\nProven organizational and problem-solving abilities.\nAbility to work independently and with little guidance.\nAble to stand for long periods of time.\n\nEducation/Experience\n\n\nThe Analytical Chemist must have, at a minimum, a master’s or a bachelor’s degree in biological, chemical, agricultural, environmental or related sciences from an accredited college or university, plus at least two years of full-time practical analytical laboratory experience.\nMust complete a background check. New hires will be subject to a 9-month probationary period with evaluations conducted every 90 days to monitor performance and suitability for continued employment. Training on how to operate laboratory instruments will be conducted at the start of employment.\n\n\nJob Type: Full-time\n\n\nPay: $60,000.00 per year\n\n\nSchedule:\n\n\nMonday to Friday\n\nWork Location: One location\n","slug":"analytical-chemist-656bd49a-b3b3-42ef-aa4f-5f286b30d1fe","benefits":["Flexible schedule"],"selectedSkills":["Microsoft Excel","Microsoft Outlook","Laboratory experience","Communication skills","Analytical chemistry","Bachelor's degree","Master's degree","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=k0wxk5-cdY7r9t9BHbhvVyOkSAH6zkOYTE4nfN-S3M5Q39vlxeASLA"},{"position":"Analytical Chemist","labName":"Kaycha Labs","location":"Tempe, AZ","age":"6 days ago","type":"Full-time","salaryMin":"$42,000 ","salaryMax":" $57,000 a year","jobDescriptionCopy":"Company Overview:\n\n\nKaycha Group, LLC is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\n\nJob Purpose:\n\n\nThe Lab Analyst, Level I will be responsible for performing, documenting, record checking, and basic troubleshooting of qualitative and quantitative assays on samples using techniques that vary from the use of standard laboratory equipment to highly modern and automated instrumentation.\n\n\nEssential Duties & Responsibilities:\n\n\nAnalyze samples consisting of a variety of matrices using traditional laboratory technologies including, but not limited to, HPLC, GC/MS, LC/MS, and ICP/MS.\nPrepare samples for analysis while displaying good laboratory technique to avoid cross-contamination or misidentified samples.\nAccurately prepare calibration curves and quality control samples.\nInterpret and evaluate data in terms of accuracy, precision, trends, and quality control requirements.\nMaintain laboratory equipment by cleaning, and otherwise ensuring ongoing proper working order. Report equipment issues to supervisor\nCollaborate with the laboratory team to meet reporting deadlines.\nAble to perform method validations, or verifications as needed.\nManage inventory supplies and alert supervisor in advance when materials must be ordered\nMay participate in root cause analysis for quality assurance.\nAssist with training incoming analysts and technicians on methodology.\nParticipate in the development or updating of departmental SOP’s.\nOther duties and special projects as assigned.\n\nEducation & Experience:\n\n\nMinimum BS/BA in Chemistry, Biology, Physics, Engineering or Environmental Sciences required or based on state requirements.\nKnowledge of principles, terminology, practices, techniques, and instrumentation commonly used in a laboratory setting required.\nAt least 1 year of laboratory experience.\nExperience with GC/MS is highly preferred.\nDemonstrated proficiency in at least one analytical instrument preferred.\nFood science and/or environmental experience is a plus.\nExposure to the cannabis industry is a plus.\n\nSkills, Abilities and Competencies:\n\n\nBasic understanding of standard laboratory protocol.\nMaintain high productivity, keen attention to detail, and consistent multi-tasking while yielding a low testing error rate.\nStrong agility, engagement, and flexibility in an ever-changing environment.\nDiligent commitment to logging, organizing, and analyzing data.\nExcellent communication skills and ability to effectively work, problem solve, and communicate with multiple levels of the organization.\nPromote a strong customer service culture while adhering to the highest safety and industry standards, including those that are outlined by the state regulatory body.\n\nOther:\n\n\nMust pass the required background check.\nMust be at least 21 years old.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.\n\nEssential Functions:\n\n\nThe physical demands described here are representative of those that an employee must meet to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nWhile performing the duties of this job the employee is frequently required to stand, handle or feel, to speak, and to hear. The employee is occasionally required to walk, sit, reach with hands and arms, bend, kneel, crouch, or crawl. The employee must frequently lift and/or move up to thirty-five (35) pounds.\n\n\nSpecific vision abilities required for this job include close (proximity) vision, depth perception, and the ability to adjust focus.\n\n\nWork Environment:\n\n\nThe work environment described here is representative of that which an employee may encounter while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nThe standard analytical laboratory environment is one in which potential health hazards do exist. Administrative, operations, technical, and professional staff are expected to safely operate in accordance with applicable and appropriate health and safety policies and procedures, as prescribed by the applicable Kaycha manuals and policies and/or federal, state, or local standards.\n\n\nLaboratory staff can be expected to work in areas where hazards associated are with, but not limited to, airborne pathogens. Biological materials, hazardous substances, and radioactive material exist and are handled. Appropriate training is provided regarding these hazards and staff are expected to adhere to all health and safety policies at all times, whether they are in writing or verbalized by a supervisor.\n\n\nThe above is intended to describe the general content of and requirements for the performance of this job. It is not to be construed as an exhaustive statement of duties, responsibilities, or physical requirements. Nothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions\n\n\nJob Type: Full-time\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nEmployee discount\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nReferral program\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\nWeekend availability\n\nApplication Question(s):\n\n\nWhat is your desired compensation?\nPlease list the best email address and phone number to reach you.\nAre you open to working weekends and/or evenings when needed?\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nGCMS: 1 year (Required)\n\nWork Location: One location\n","slug":"analytical-chemist-874350d9-3c60-4b50-be66-2c4f87be16bc","benefits":["Health savings account","Dental insurance","Employee discount","Health insurance","Referral program"],"selectedSkills":["Laboratory experience","Communication skills","Gas chromatography","Root cause analysis","Bachelor of Science","Bachelor's degree","Master's degree","21 years or older","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=gWsJJMpzCMu4mTDj5Lexy_pPp8iN7XA1fQhptpAa4-AkiByUoSpUng"},{"position":"Chemist II","labName":"Green Leaf Lab","location":"Portland, OR","age":"1 day ago","type":"Full-time","salaryMin":"$22.50 an hour","jobDescriptionCopy":"THE COMPANY: Green Leaf Lab is the nation's first licensed and accredited cannabis analytical laboratory. We are a full-service, production oriented, cannabis and hemp laboratory using cutting-edge technology to characterize the chemical, physical, biological, and microbial properties of a wide range of samples submitted for regulatory compliance and operational purposes. We are team oriented and focused on excellent service. We are looking for a Chemist II to join our team.\n\n\nJOB SUMMARY: The Chemist II is a key collaborative member that supports Green Leaf Labs philosophy and organizational goals. This position will be responsible for running, troubleshooting and analyzing samples with a GC, GCMS, LCMSMS, HPLC and/or ICPMS system utilizing standardized and in-house lab methodology; writing and reviewing standard operating procedures (SOP’s); and performing basic and complex laboratory operations including sampling, chromatographic and material assays. This position will also assist with method development as required.\n\n\nESSENTIAL DUTIES/KEY RESPONSIBILITIES:\n\n\n· Responsible for the setup, running and troubleshooting of GC (GCMS, GCMSMS etc.), LCMSMS, HPLC systems.\n\n\n· Responsible for maintaining validated NELAC TNI 2016 and ISO 17025 standards of performance for analytical chemical testing.\n\n\n· Responsible for daily sample preparation and data analysis to ensure laboratory runs smoothly and meets required turnaround times.\n\n\n· Responsible for ensuring compliance with internal Standard Operating Procedures (SOPs) and quality systems.\n\n\n· Responsible for Developing procedures for documenting results from data collected.\n\n\n· Responsible for ensuring test equipment is clean, maintained and in good working order.\n\n\n· Responsible for maintaining a safe, clean and sanitary work area.\n\n\n· Responsible for maintaining an accurate notebook, logbook and other required documentation protocols.\n\n\n· Responsible for following all safety procedures and documents.\n\n\n· Responsible for ensuring high quality standard are met through performing calibrations, quality checks and proficiency programs.\n\n\n· Responsible for maintaining inventory tracking as required.\n\n\nQUALIFICATIONS:\n\n\n· Bachelor’s degree in biological, chemical, agricultural, environmental, or related sciences from an accredited college or university.\n\n\n· Minimum 2 years analytical laboratory experience with hands on experience with instrument maintenance and troubleshooting.\n\n\n· Experience with data analysis and Laboratory Information Management Systems (LIMS).\n\n\n· Experience with the following instrumentation: HPLC, GCMS, LC-MS/MS, GC-MS/MS, ICP\n\n\n· Experience with Problem solving with ability to see whole picture and impact to data.\n\n\n· Experience with method development and method optimization.\n\n\n· Experience importing, validating, and exporting electronic data in a variety of formats.\n\n\n· Experience monitoring consumable inventory and ordering supplies.\n\n\n· Experience with working under NELAC TNI 2016 and ISO 17025 Standard.\n\n\n· Excellent analytical skills and attention to detail.\n\n\n· Excellent leadership ability and interpersonal skills.\n\n\n· Excellent organizational and problem-solving skills.\n\n\n· Ability to formulate and clearly communicate ideas, both verbally and in writing.\n\n\n· Ability to work independently with little guidance, as well as provide support and training for others in a team environment.\n\n\n· Ability to adapt to a fast-changing work environment.\n\n\n· Ability to be flexible and change as business grows and changes.\n\n\n· Ability to work collaboratively as a team.\n\n\n· Ability to prioritize and meet deadlines.\n\n\n· Ability to stand for long periods.\n\n\n· Ability to lift 40-60lbs.\n\n\n· Ability to pass a background check.\n\n\n· Proficiency with Microsoft Word, Excel and Outlook.\n\n\n· Problem Solving, solution oriented and production driven.\n\n\nEDUCATION:\n\n\n· Bachelor’s degree in biological, chemical, agricultural, environmental, or related sciences from an accredited college or university.\n\n\nEXPERIENCE:\n\n\n· Analytical laboratory: 2 years (Required)\n\n\nJOB TYPE: Full-time, Non-exempt.\n\n\nBENEFITS:\n\n\n· Dental insurance.\n\n\n· Health insurance.\n\n\n· Paid time off.\n\n\n· Vision insurance.\n\n\nSCHEDULE:\n\n\n· Tuesday-Saturday.\n\n\n· Additional evening and weekend work as needed.\n\n\nWORK LOCATION:\n\n\n· Portland\n\n\nCOMPENSATION: $22.50 HR\n\n\nJob Type: Full-time\n\n\nPay: $22.50 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nWeekend availability\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nAnalytical Laboratory: 2 years (Preferred)\n\nWork Location: One location\n","slug":"chemist-ii-d944ee51-4868-441d-9ed4-b1830b15084f","benefits":["Dental insurance","Health insurance","Paid time off","Vision insurance"],"selectedSkills":["Writing skills","Analysis skills","Microsoft Excel","High-performance liquid chromatography","Microsoft Outlook","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=qp1AoGL-CnaLYi9qlDellcRJeUtJ5dyUQ5QMIk2xRjAzvo5cxnvVgA"},{"position":"Isolation (Crystallization) Supervisor","labName":"Cannvital, LLC","location":"Las Vegas, NV","age":"3 days ago","type":"Full-time","salaryMin":"$50,000 a year","jobDescriptionCopy":"Isolation Chemist Supervisor- Pharmaceutical (on-site) \n\n\nJob Location:  Las Vegas NV (on-site only) \n\n\nCannvital NV LLC is a global hemp-based CBD extraction and refinement company with its headquarters and production facility located in Las Vegas, NV. Cannvital is seeking several Isolation Supervisor to bring on to our expanding team. \n\n\nCannvital is looking to fill a position for our production team. The preferred candidate will have had at least 1 year of experience with cannabis or hemp extraction within a professional and/or commercial environment and familiar with current cannabis and hemp extraction techniques. Personality, skillset, and professionalism all play a large part in our selection. You will be joining a small, multi-tasked, tight-knit team that operates in close quarters. \n\n\nReliable transportation to and from the facility. \n\n\nJob Duties include but are not limited to:  \n\n\n- Preparing equipment and distillate for isolation (crystallization). \n\n\n- Operating Isolation equipment \n\n\n- Work with the Production Manager to facilitate optimum production and to meet facility sales demands and forecasts \n\n\n- Regular cleaning and maintenance of lab equipment and facility. \n\n\n- Weigh extract, prepare samples and precipitation for isolation and testing. \n\n\n- Promote programs and automation to produce in a cost-effective manner, employing economy while maintaining an acceptable level of quality \n\n\n- Inventory and record keeping of lab equipment. Maintain inventory records of supplies, materials, and temperatures of machinery. \n\n\n- Assist laboratory and equipment cleanup. Wash and sterilize lab surfaces and glassware. \n\n\n- General routine maintenance on lab equipment. Troubleshooting, preventative maintenance and regular data logging. \n\n\n- Maintain and log all data sheets for chemicals and products. \n\n\n- Assure 100 % legal compliance with all applicable laws and regulations regarding packaging, processing and inventory-tracking procedures \n\n\n \n\n\nApplicant must be able to stand for long periods of time, lift up to 50 lbs, bend, stoop, and have full physical range of motion in order to perform this job. \n\n\nExperience:\n\n\n2+ years experience in a professional or commercial lab space  \n2+ Years operating a Reactor System\n1+ Years Operating a Wiped Film Evaporator\n\nEducation: High school or above or equivalent  \n\n\nJob Type: Full Time \n\n\nCompensation: TBD (based on Experience) \n\n\nWork Location: Las Vegas Nevada\n\n\nJob Type: Full-time\n\n\nPay: $50,000.00 per year\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nRelocation assistance\nVision insurance\n\nSchedule:\n\n\n8 hour shift\n\nLicense/Certification:\n\n\nDriver's License (Preferred)\n\nWork Location: One location\n","slug":"isolation-crystallization-supervisor-eb72b77c-36b3-4af6-a270-a55cf8c0ca61","benefits":["Paid time off","Dental insurance","Health insurance","Vision insurance","Relocation assistance"],"selectedSkills":["Laboratory experience","Driver's License","High school diploma or GED","Reliable transportation"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=oXtGULLHQNj6TC4M4LGNy-8z0Jsxfrz8BQ0vPsiNaWIFJ7XI-1SXyQ"},{"position":"Molecular Biologist","labName":"SafeTiva Labs","location":"Westfield, MA","age":"5 days ago","type":"Full-time","jobDescriptionCopy":"Position: Molecular Biologist\n\n\nSafeTiva Labs is looking for an experienced molecular biologist to join the lab team and perform cannabis testing operations.\n\n\nCompany Overview\n\n\nSafeTiva Labs is an analytical testing and research laboratory comprised of dedicated scientists working on cutting-edge analysis methods. SafeTiva follows Cannabis Control Commission regulations, ISO 17025 standards, and maintains high ethical standards. Joining our team means being part of an exciting start-up culture on the front lines of the fast-paced cannabis industry. Our team prides itself on maintaining a collaborative environment where each member is valued. We are a small group of talented people who are driven and dedicated to science, innovation, and work ethic. Our team is our most important asset and we aim to create an environment that makes employees love coming to work. This is an opportunity to join a growing company and help define what makes it great!\n\n\nDetailed Responsibilities:\n\n\n· Analyze samples for bacteria, yeast, and mold using a PCR/microarray platform\n\n\n· Cannabis sample preparation and destruction\n\n\n· Follow laboratory policies and SOPs, state regulations, and ISO-17025 quality management system\n\n\n· Review, record, and organize data in the LIMS\n\n\n· Maintain lab equipment in good operating condition and troubleshoot malfunctions as needed\n\n\n· Identify and improve workflow efficiencies\n\n\n· Maintain familiarity with all microbiological protocols and be able to train new technicians\n\n\n· Prepare chemical solutions and various tasks to keep the laboratory clean and functioning, including washing glassware and sterilizing workspaces\n\n\n· Maintain an organized and sterile microbiological lab\n\n\n· Evaluate system performance and perform proficiency testing\n\n\n· Perform proper sample and waste disposal\n\n\n· Monitor inventory levels and order supplies\n\n\n· Perform related duties as assigned\n\n\n· Will report to Lab Director\n\n\nSkills and Competencies\n\n\n· Independence with PCR and molecular biology lab techniques\n\n\n· Strong understanding of standardized test methods for microbiology (AOAC, BAM, USDA, FDA, EPA, etc)\n\n\n· Strong aptitude for identifying microbial species based on observations, experience, and functional expertise\n\n\n· Excellent aseptic technique and pipetting skills\n\n\n· Attention to detail while performing repetitive tasks\n\n\n· Efficient workload management and able to oversee high throughput testing when samples are arriving at varying times\n\n\n· Enthusiastic team player with ability to work independently\n\n\n· Able to multitask in a fast-paced, ever-changing environment\n\n\n· Effective oral and written communicator\n\n\n· Strong work ethic\n\n\n· Maintain the highest standards of personal, professional, and ethical conduct\n\n\n· Support SafeTiva’s goals for a diverse and culturally aware workforce\n\n\n· Strong computer and data management skills, with preference for MS Office and LIMS programs\n\n\nEducation and Experience\n\n\n· Bachelor’s Degree in molecular biology or microbiology\n\n\n· 3 years of experience working in a professional microbiology or molecular biology wet lab, and at least a year of experience in both fields\n\n\n· Experience in a commercial testing lab, with cannabis testing preferred\n\n\n· ISO-17025 experience preferred\n\n\nRequirements\n\n\nAt least 21 years of age\nAble to pass a background check, drug test, and must not have been convicted of an excluded felony offense as defined in 105 CRM 725.030\nAble to perform grasping, talking, hearing, seeing and repetitive motions\n8 hour shift, days and times may change and occasional night and weekend work may be required\n\nBenefits:\n\n\nCompensation will be commensurate with experience and skillset, and structured with incentives for meeting outlined goals\n\n\nSafeTiva is pleased to offer a comprehensive benefits package.\n\n\nSafeTiva Labs celebrates diversity and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, gender, gender identity or expression, religion, sexual orientation, national origin, disability, age, or veteran status.\n\n\nJob Type: Full-time\n\n\nPay: From $47,000.00 per year\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nPaid time off\n\nSchedule:\n\n\n8 hour shift\n\nCOVID-19 considerations:\nAll employees are required to be fully vaccinated for Covid-19.\n\n\nApplication Question(s):\n\n\nPlease submit a cover letter in the supplemental documents section and answer this question with your favorite junk food.\n\nExperience:\n\n\nMolecular biology: 1 year (Required)\nmicrobiology: 1 year (Required)\n\nWork Location: One location\n","slug":"molecular-biologist-c70393b6-c51b-408a-980a-7d91ac9f4eaa","benefits":["Health insurance","401(k) matching","Paid time off","401(k)"],"selectedSkills":["Computer skills","Laboratory experience","Molecular biology","Communication skills","Microbiology","Bachelor's degree","Pass drug screening","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=yFqPCedbTjh4_eFIfj8fsy-ajKTWHMOy5kKdt5mwmhqMxUxGm4D0nw"},{"position":"Analytical Laboratory Technician","labName":"Aromatic Plant Research Center","location":"Lehi, UT","age":"6 days ago","type":"Full-time","salaryMin":"$16 ","salaryMax":" $18 an hour","jobDescriptionCopy":"Analytical laboratory technician\n\n\nJob description\n\n\nWe are seeking a full-time laboratory technician to join our analytical laboratory team, performing routine analysis of essential oils and cannabis products. You will be provided with training and mentorship designed to foster technical skills and given the opportunity to deliver impactful results.\n\n\nMajor duties and responsibilities\n\n\nPerform test procedures on essential oils and cannabis-containing products using various instruments. Write reports to document results and convey results to clients.\n\n\nPerform physical and chemical testing on all samples received by our laboratory.\nAccurately execute testing per applicable written procedures and methods, such as HPLC, GC-MS, and PCR.\nFill out laboratory documentation accurately and document work in a timely, clear, and organized manner.\nOperate and calibrate laboratory equipment to ensure accurate analysis and results.\nBecome proficient with all instrumental, analytical, and data analysis software.\nDevelop and write SOPs for laboratory procedures.\n\nDocument test results, prepare and review testing reports.\n\n\nRecord test results and generate reports.\nAid in reviewing and filing reports.\nAid in reviewing data and laboratory notebooks prior to data release.\n\nSupport laboratory equipment maintenance.\n\n\nAid in maintaining laboratory equipment as required by calibration and maintenance schedule.\nAid in troubleshooting laboratory equipment as needed.\nAid in maintaining a safe and clean working environment.\n\nPreferred qualification, knowledge, and skills\n\n\nAn associate or BS degree in physical or life sciences with an emphasis in analytical chemistry, biology, biochemistry, or related disciplines.\nStrong background in quantitative analytical techniques.\nExperience with microbiology and sterile technique.\nKnowledge of laboratory software applications.\nAttention to detail and demonstrated organizational skills.\nExcellent communication skills both written and oral.\nAbility to work independently and in a team environment to support business needs.\nMust be 21 years of age and able to pass a government background check.\nMust be able to work in a work environment with a strong aroma.\n\n1\n\n\nJob Type: Full-time\n\n\nPay: $16.00 - $18.00 per hour\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nFlexible spending account\nHealth insurance\nHealth savings account\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nMonday to Friday\n\nAbility to commute/relocate:\n\n\nLehi, UT 84043: Reliably commute or planning to relocate before starting work (Required)\n\nExperience:\n\n\nLaboratory experience: 1 year (Preferred)\n\nWork Location: One location\n","slug":"analytical-laboratory-technician-27337a03-0e9e-4a73-9d29-0a55c6e70e78","benefits":["Health savings account","Dental insurance","Health insurance","Paid time off","401(k)"],"selectedSkills":["Laboratory experience","Communication skills","Microbiology","Organizational skills","Bachelor of Science","Bachelor's degree","Associate's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=p8Syp2-GI9dI13M09Ud4VCJZ0U4Gx2Vf7d1BQlMiqogDwhXBbcdndA"},{"position":"Packaging Technician","labName":"CannaPunch","location":"Las Vegas, NV","age":"7 days ago","type":"Full-time","salaryMin":"$27,000 ","salaryMax":" $37,000 a year","jobDescriptionCopy":"ABOUT AYR WELLNESS\n\nWe’re a new kind of cannabis company, aiming higher in everything we do. We grow and sell the highest-quality cannabis products available anywhere, inspiring wellness and wonder in our customers, wherever they are on their cannabis journey. We operate with a sense of responsibility to our customers and patients, building stronger and more socially responsible communities everywhere we go.\n\nJOB DESCRIPTION\n\nThe Packaging Technician primarily responsible for the accurate weighing, labeling, and packaging of all of our products prior to shipping.\n\nRESPONSIBILITIES\n\nTech I\n\nPackage, sticker, and count cannabis products/finished goods\nConfirm batch and lot numbers on finished goods’ product labels are correct\nCreate “Lots” of Bud, Smalls, Shake, and Live Resin in LeafLogix and Metrc as well as physically\nCoordinate third party Laboratory testing and transfers\nConfirm Harvest Batches’ Untrimmed Dry Weights (“Buck” weights) by reweighing and recording weights\nCoordinate and execute conversions and transfers to Extractions Department\nCarefully manage inventory flow during busy order fulfillment periods\nAbility to multi-task repeatedly with attention to detail and minimal errors\nMaintain a clean and organized work environment\nRead, understand, and follow all CCB regulations relating to inventory control and chain of custody\nAssist with supervision of Trim Technicians on trim machine and grinding machine on their workflow and duties\nDelegate cannabis products for processing and trimming\nOther duties as assigned\n\nSKILLS/ABILITIES REQUIRED\n\nAttention to detail with excellent record keeping ability\nWillingness to learn and improve each operation\nAbility to perform repetitive tasks for long periods of time\nAbility to work in a fast-paced environment and multi-task\nCommitment to arrive for scheduled shifts on time and maintain consistent attendance\nAvailability to work occasional weekends and holidays\n\nREQUIREMENTS/PREFERRED EXPERIENCE\n\nHigh school diploma or General Education Diploma (GED)\nMust have a clear understanding of weights and measures and ability to operate a scale\nAbility to work within a team and on an individual basis\nFamiliarity with warehouse procedures\nAbility to work in a timely manner and drive to increase productivity\nExperience and knowledge and familiarity with Cannabis\nProficient in Microsoft Office (Word, Excel and Outlook)\nMust be 21 years of age or older, and be able to pass an extensive background check\nMust be authorized to work in the United States\n\nPHYSICAL REQUIREMENTS\n\nAbility to stand on feet or sit for extended periods of time\nAbility to have extended cannabis exposure, with no adverse physical reaction\nAbility to use repetitive use of hands, wrists and forearms\nFine visual acuity with the ability to adjust focus to inspect closely, ability to recognize different colors.\nNormal vision or corrected by use of glasses and/or contacts for normal reading and viewing abilities to determine the accuracy, neatness, and thoroughness of the work assigned, or to make general observations of facilities or structures.\nRequires eye-hand coordination and manual dexterity sufficient to meet job and operate equipment requirements\nRequires normal range of hearing with the ability to perceive the nature of sounds at normal speaking levels with or without correction and having the ability to receive detailed information through oral communication and making fine discriminations in sound.\nAbility to twist, turn, bend, stand and walk as required to perform the duties associated with functioning as a dispensary manager.\nPushing/pulling/carrying, with the ability to lift up to 50 pounds occasionally\nRegular and on-time attendance (Hours may exceed 40 hours per week)\n\nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n\nWORK ENVIRONMENT:\nWork is performed in several locations that include a cannabis cultivation and production facility. The working area may be odorous at times and loud due to fans and filtration systems, fluctuating between cold and warm temperatures. Involves frequent contact with staff. Work may include dealing with law enforcement and occasional State inspectors.\n\nDISCLAIMER\n\nAll the above duties and responsibilities are essential job functions subject to reasonable accommodation. All job requirements listed indicate the minimum level of knowledge, skills and/or ability deemed necessary to perform the job proficiently. Employees may be required to perform any other job-related instructions as requested by their supervisor, subject to reasonable accommodation. This document does not create an employment contract, implied or otherwise, other than an “at will” employment relationship.\n\nAyr Wellness is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, veteran status, or any other characteristic protected by federal, state or local law.","slug":"packaging-technician-02833c1e-54db-49b6-bc07-f054a0565f6c","benefits":[],"selectedSkills":["Microsoft Outlook","Warehouse experience","Microsoft Excel","Microsoft Office","Microsoft Word","High school diploma or GED","Background check","21 years or older","US work authorization"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=aWd4tdZG7KYi0TJ9IIs7Wd_gDSe0pRjApGWSGwtaz7cROBQQ6hOiLA"},{"position":"R&D Technician, Product Development","labName":"Open Book Extracts","location":"Roxboro, NC","age":"7 days ago","type":"Full-time","salaryMin":"$45,000 ","salaryMax":" $61,000 a year","jobDescriptionCopy":"THE COMPANY\n\nHeadquartered in Roxboro, N.C., Open Book Extracts is a cGMP-certified manufacturer of premium plant-based cannabinoid products, aiming to be the industry's true north by delivering premium products, exceptional service, and industry-leading transparency. With control of the entire supply chain, a state-of-the-art extraction campus near North Carolina's Research Triangle, proprietary refinement and conversion methods backed by a growing IP portfolio, and a team of PhD chemists and seasoned business leaders, OBX is positioned to be the trusted partner for global brands seeking to enter the marketplace. OBX Asia, with its headquarters in Hong Kong, provides strategic guidance and on-the-ground support for our Asia customers.\n\nTHE POSITION\n\nWe are seeking an entry level R&D Technician who will be responsible for assisting the development of new products from concept to commercialization that support company growth. Position will also assist enhancement and improvement upon current products. Serves as a technical aid that supports product development and improvements, quality improvements, and customer requests. Assist the R&D team with the activities and operations required to complete the functions of the research and development department. Study and comprehend all policies, procedures and operational guidelines set by the management team. Is responsible for generation of representative pilot samples and production batches for internal and external customer evaluations through the use of appropriate scale-down process models. Other duties include assisting process optimization and product enhancement activities.\n\nRESPONSIBILITIES\n\nAssists new product process from development to commercialization, within defined company, industry, and regulatory parameters*\nExecutes lab scale and small batch experimentation to support all levels of formulation, analytics, and processing for multiple cannabis-based research.\nAssists in new research and development procedures and techniques under the supervision of the Senior Formulation Scientists\nExecutes individual project goals and follows outlined priorities for research and development endeavors.\nRecords and aids maintenance of technical documents, databases, and reports.\nFollows SOPs, formulation spreadsheets, inventories, traceability logs, tracking logs, etc.\nAids in the maintenance of inventories for research and developments raw materials, chemicals, and equipment.\nFollows complex instructions and formulations in the preparation of cannabis extract, concentrates, and infused products.\nFollows guidelines for acceptance and testing of chemical raw-materials in finished blends\nOperates within company's Quality Management System\nParticipates in team driven activities to facilitate on- going production improvements or new product development projects.\nFamiliarity with scientific principles and research and development laboratory experience. Can follow written direction and maintain a laboratory notebook.\nPractices highly sterile laboratory cleaning procedures throughout the facility with focus and personal contributions towards a clean and organized assigned work area at the end of the assigned shift.\nCapability of troubleshooting, fixing, and services a wide range of equipment and software with little to no assistance.\nPromotes a positive can-do attitude\nCommunicates effectively and consistently in writing and verbally with all levels of staff\nCollaborates in cross functional teams to meet research and development schedules.\nUnderstands and meets daily goals, expectations, and deadlines.\nConsistently enforces all company policies & procedures.\nConducts stability studies on formulations\nWrites necessary documents for manufacturing feasibility\nPrepares product registration documentation and product chemistry packages to meet regulatory requirements.\nResponsible for batch production from pilot scale to process validation.\nPerforms additional special projects as assigned.\n\nEXPERIENCE\n\nBachelor's degree preferred or equivalent experience in research and development, chemical or pharmaceutical manufacturing\nExperience with HPLC testing and other stability testing methods.\nProven problem-solving skills and track record of successful technical accomplishments\nAbility to establish and maintain effective working relationships with all employees.\nAbility to take direction and initiative.\nSkills in intermediate math.\nExcellent verbal and written communication skills with coworkers and management.\nEnthusiasm for research and formulating/improving product formulations.\nAbility to be detail oriented, multi-task and produce results.\nSuperior organizational skills.\nStrong understanding of cGMP guidelines and FDA regulations related to the pharmaceutical industry *\nProficient using MS Office applications.*\nExperience with FDA and other regulatory agency requirements\n\nOTHER DETAILS\n\nThis is a full-time position based out of Roxboro, NC or Raleigh/Durham, NC.\nCompensation commensurate with experience.\nBackground and reference checks required.\nPeriodically required to be available to virtually meet with international clients during non-traditional business hours.\n\nPHYSICAL DEMANDS AND WORKING ENVIRONMENT:\nMust be able to lift, carry and balance up to 50 pounds\nWhile performing the duties of this job, the employee is regularly required to perform grasping, talking, hearing, seeing and repetitive motions.\nAbility to walk and stand for long periods of time (4-6 hours) with frequent kneeling and bending.\nWorking in limited climate-controlled facilities and may experience extreme heat or cold\nWork with heavy fumes, plants, airborne particles and chemicals\nMust be comfortable working with and around heavy machinery\nMay experience moderately high noise levels\n\nEQUAL EMPLOYMENT OPPORTUNITY STATEMENT\n\nOpen Book Extracts is proud to be an equal opportunity employer. We embrace diversity and are committed to building a team that represents a variety of backgrounds, perspectives, and skills. The more inclusive we are, the better our work will be.","slug":"rd-technician-product-development-61b92267-2911-4028-9f15-030ccf5cfc26","benefits":[],"selectedSkills":["Manufacturing","Research","CGMP","High-performance liquid chromatography","FDA regulations","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=vPH5yju703NtwpQLGzSubfyXWTxXWzSPKwoL94tz0hVdS1c0m6NM1g"},{"position":"Distillation Supervisor","labName":"Cannvital, LLC","location":"Las Vegas, NV","age":"3 days ago","type":"Full-time","salaryMin":"$50,000 a year","jobDescriptionCopy":"Distillation Chemist Supervisor- Pharmaceutical (on-site) \n\n\nJob Location:  Las Vegas NV (on-site only) \n\n\nCannvital NV LLC is a global hemp-based CBD extraction and refinement company with its headquarters and production facility located in Las Vegas, NV. Cannvital is seeking several Distillation Supervisor to bring on to our expanding team. \n\n\nCannvital is looking to fill a position for our production team. The preferred candidate will have had at least 1 year of experience with cannabis or hemp extraction within a professional and/or commercial environment and familiar with current cannabis and hemp extraction techniques. Personality, skillset, and professionalism all play a large part in our selection. You will be joining a small, tight-knit team that operates in close quarters. \n\n\nReliable transportation to and from the facility. \n\n\nJob Duties include but are not limited to:  \n\n\n- Preparing equipment and crude oil for distillation. \n\n\n- Operating Distillation equipment \n\n\n- Work with the Production Manager to facilitate optimum production and to meet facility sales demands and forecasts \n\n\n- Regular cleaning and maintenance of lab equipment and facility. \n\n\n- Weigh extract, prepare samples and precipitation for isolation and testing. \n\n\n- Promote programs and automation to produce in a cost-effective manner, employing economy while maintaining an acceptable level of quality \n\n\n- Inventory and record keeping of lab equipment. Maintain inventory records of supplies, materials, and temperatures of machinery. \n\n\n- Assist laboratory and equipment cleanup. Wash and sterilize lab surfaces and glassware. \n\n\n- General routine maintenance on lab equipment. Troubleshooting, preventative maintenance and regular data logging. \n\n\n- Maintain and log all data sheets for chemicals and products. \n\n\n- Assure 100 % legal compliance with all applicable laws and regulations regarding packaging, processing and inventory-tracking procedures \n\n\n \n\n\nApplicant must be able to stand for long periods of time, lift up to 50 lbs, bend, stoop, and have full physical range of motion in order to perform this job. \n\n\nExperience:\n\n\n2+ years experience in a professional or commercial lab space \n2+ Years operating a Wiped Film Evaporator\nUnderstanding of Short Path Distillation\n\nEducation: High school or above or equivalent  \n\n\nJob Type: Full Time \n\n\nCompensation: TBD (based on Experience) \n\n\nWork Location: Las Vegas Nevada\n\n\nJob Type: Full-time\n\n\nPay: $50,000.00 per year\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nRelocation assistance\nVision insurance\n\nSchedule:\n\n\n8 hour shift\n\nWork Location: One location\n","slug":"distillation-supervisor-2589d283-76a8-4006-9b9d-23387f18f08e","benefits":["Paid time off","Dental insurance","Health insurance","Vision insurance","Relocation assistance"],"selectedSkills":["Laboratory experience","High school diploma or GED","US work authorization","Reliable transportation"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=JpTZJtZhEGZcyoRmQW0ah9QC7_oMXMKIfU_pnz4UI1ANX63_zqrMbg"},{"position":"Operations Assistant","labName":"Confidence Analytics","location":"Redmond, WA","age":"6 days ago","type":"Full-time","salaryMin":"$19 an hour","jobDescriptionCopy":"An industry leading analytical laboratory is seeking a tech-savvy and professional Operations Assistant to support their office. This role manages the front desk and plays a pivotal role as a face and voice of the company. The ideal candidate will be process-driven, task-oriented, and able to establish positive working relationships with internal and external partners.\n\n\nThis is an entry level position assisting with office tasks, customer service, sample prep, and filling in as a driver when needed. Must be available to start at 8am when requested and part time weekend availability when needed. Flexible scheduling is available. Must have reliable transportation and vehicle available for errands and occasional sample pick up. You would be working in a small laboratory office. The ideal candidate would have the ambition and ability to grow with the company. This is not the type of workplace where you will end up always working in the same “box.” Creative thinkers and problem solvers of all types can find their place here.\n\n\nIf you have a customer-service mindset, strong technical skills, and thrive on supporting a team, this might be the position for you!\n\n\nResponsibilities\n- Manage the front desk and maintain organization of company documents\n- Greet guests, sign transportation manifests, take payments\n- Answer customer phone calls, provide basic customer service, take messages, escalate calls as necessary\n- Calendar management and scheduling\n- Assist with catering and maintain inventory of office supplies\n- Respond to customer email inquiries, forward customer emails to appropriate personnel\n- Assist with driver dispatch and route scheduling\n- Filing various paperwork\n- Receive samples into lab computer system\n- Record payments into QuickBooks\n- Create and send invoices to customers\n- Assist with collections on delinquent accounts\n- Assist in planning and executing special client and staff events\n- Demonstrate exceptional customer service with every interaction\n- Support staff and assist with projects and other administrative tasks as assigned\n- Assist with sample prep (photographing, weighing, etc) as needed\n- Drive to client locations and pick up samples as needed\n\n\nRequired knowledge/skills/abilities:\n- Excellent customer service skills\n- Self motivated, able to work independently\n- Ability to prioritize, organize, and multitask with minimal supervision\n- Provide top-notch customer service to internal and external clients and work well on teams\n\n\n- Exceptional communication and interpersonal skills\n- Must be comfortable interacting with a diverse audience\n- Good tenure and job stability in previous roles\n- High School diploma or equivalent required; College degree preferred\n- Strong organizational skills\n- Attention to detail\n- Ability to follow instructions and operation procedures\n- Must be 21+ to apply\n\n\nPreferred/Desirable knowledge/skills/abilities:\n\\*\\*Will train for the right candidate\\*\\*\n\n\n- Experience with LIMS/ERP/MRP or similar systems\n- QuickBooks Online experience\n- Previous experience with accounts receivable/invoicing/collections\n- MS Office/Google Docs working knowledge\n- Prior coursework applicable to laboratory or office operations\n- Working knowledge of Washington State geography and highway system\n- Previous experience working in an environment where traceability and quality management was required (such as ISO9001 certified companies or aerospace)\n- Previous laboratory experience\n\n\nLocation, Pay, and Benefits\n- Location: Redmond, WA 98052\n- Hours: Full-time, 32 hours per week\n- Schedule: highly flexible\n- Must be available at 8am at least 3 days per week\n- Hourly Wage: $19.00 per hour\n- Position type: hire\n- Full time employees are eligible for paid time off, heath/dental insurance\n\n\nIf you think you are the right candidate for the job, please apply and include your resume and a cover letter. Include in your cover letter why you want to take on this position and why you want to work for this company in particular. Please take some time to review our website before applying https://www.conflabs.com\n\n\nConfidence Analytics is an industry leader in the field of cannabis quality assurance testing. We are a full-service chemical analytical and microbiology laboratory serving the i502 regulated marketplace. We lead the industry in both market share and analytical capability and we are on the cutting edge of development and standardization of testing methodologies. EEO Employer:\nRace, Religion, Color, National Origin, Citizenship, Sex, Sexual Orientation, Gender Identity, Age, Disability, Ancestry, Veteran Status, Genetic Information, Service in the Uniformed Services or any other classification protected by law.\n\n\nJob Type: Full-time\n\n\nPay: $19.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nFlexible schedule\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nOvertime\nWeekend availability\n\nCOVID-19 considerations:\nAll employees are required to wear a mask at all times while in the building if they are not fully vaccinated.\n\n\nAbility to commute/relocate:\n\n\nRedmond, WA 98052: Reliably commute or planning to relocate before starting work (Preferred)\n\nWork Location: One location\n","slug":"operations-assistant-49b39a6f-085e-4382-b177-26b1886eacef","benefits":["Dental insurance","Health insurance","Flexible schedule","Paid time off","Vision insurance"],"selectedSkills":["ERP systems","Laboratory experience","Communication skills","MRP","Microsoft Office","Bachelor's degree","High school diploma or GED","Reliable transportation","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=J-ivRKT22ZHos8uCPai5l1PeLvLo3a9StL0y0CHgzTk3fV1jrNHw2Q"},{"position":"Fill Technician III","labName":"Curaleaf","location":"Ravena, NY","age":"6 days ago","salaryMin":"$35,000 ","salaryMax":" $44,000 a year","jobDescriptionCopy":"Curaleaf Holdings, Inc. (CSE: CURA) (OTCQX: CURLF) (\"Curaleaf\") is a leading international provider of consumer products in cannabis, with a mission to improve lives by providing clarity around cannabis and confidence around consumption. As a high-growth cannabis company known for quality, expertise, and reliability, the company and its brands, including Curaleaf and Select provide industry-leading service, product selection, and accessibility across the medical and adult-use markets. In the United States, Curaleaf currently operates in 23 states with 130 dispensaries, 25 cultivation sites, and over 30 processing sites, and employs over 5,000 team members. Curaleaf International is the leading vertically integrated cannabis company in Europe with a unique supply and distribution network throughout the European market, bringing together pioneering science and research with cutting-edge cultivation, extraction, and production. Home | Curaleaf | Cannabis with Confidence\n\nOur corporate social responsibility is Rooted In Good Diversity, Equity, Inclusion + Social Equity + Sustainability Social Responsibility | Curaleaf | Cannabis with Confidence We believe in taking corporate and social responsibility very seriously, from our educational outreach to national partnerships, state-wide initiatives and local causes. Giving back to the communities where we operate is important to us, and helps to change old attitudes by showing the positive impact of cannabis in creating jobs, changing lives, and helping local communities.\n\nWe educate. We advocate. We give.\n\nWe are seeking a Fill Line/Packaging Technician III will be responsible for operating the pharmaceutical capsule and vial filling lines as well as primary and secondary packaging of finished goods. The Fill Technician will also be responsible for equipment sanitation and sterilization, as well as maintaining facilities cleanliness.\n\nLevel 3 – Crew Lead\nCrew Lead Responsibilities\n\nTraining Lead – Ensure all training activities by Level 2 to Level 1 and Post-Harvest Techs are adequate and junior level team members can demonstrate proficiency. This includes adherence to cGMPs and SOPs.\nProduction Metrics – Responsible for ensuring the team meets set manufacturing KPIs and, in the absence of management, delegates tasks accordingly.\nTesting Samples – Responsible for ensuring lab testing schedule is adhered to and samples are ready and accurate.\nBatch Record oversight – Ensure MBRs per Lot adhere to company guidelines and are accurate. Also, signs-off on first piece check before a run commences and QC line checks throughout.\nLine Clearance – Responsible for ensuring all end of day and end of run paperwork is completed and accurate and follows all GDPs.\nInventory Accuracy & Auditing – Ensures precise and correct counts, BioTrack Inventory accuracy, label accuracy, and assists in audits and investigations as needed.\nResearch & Development – Will assist in the design, creation, and development of new products, SOPs, equipment, and/or processes to improve the operation.\nBase Responsibilities:\n\nFilling and packaging of all flower-based and oil-based products throughout the operation\nResponsible for organizing work areas and performing daily tasks such as preparing and sterilizing components and filling assemblies\nLaying out, fabricating and assembling containers of finished goods\nPerforming aseptic fills of measured substances into finished product containers\nAssemble secondary packaging and final product\nFollow all QA and QC guidelines to ensure rectifying of all non-conformances on the line\nMaintaining precise counts and following department verifications as required to ensure inventory accuracy\nStrict adherence to procedures and practices according to SOPs, cGMPs, Facility Rules, and NYS regulations\nStrong emphasis on documentation according to company and state policies\nAdhere to departmental, site and corporate safety practices\nResponsible for facility and equipment cleaning to maintain cGMP aseptic standards\nSanitization and sterilization of laboratory equipment such as glassware\nResponsible for set up and maintenance of equipment throughout the processing environment\nAccurately enter data in all company forms, the EBR, and BioTrack\nFollow standard operating procedures (SOPs) and create and update as necessary\nKeep good records of all practices implemented and data collected as pertaining to role\nStore supplies and equipment, disposal of waste per guidelines, and keeping laboratory, storerooms and working areas immaculate\nPerform clerical work related to laboratory activities such as word processing, record keeping, and filing\nMaintain material safety data sheets for all department chemicals and products\nPerform any other job-related tasks or duties as assigned by management\nCompliance:\n\nEnsure processing operation is fully compliant with state regulations and federal and state law.\nAssure that all operations adhere to business and industry license requirements.\nMaintaining strict inventory records of all plant materials, chemicals and equipment used in the laboratory and document production by completing forms, reports, logs and records as required.\nJob Qualification Requirements:\n\nHigh school diploma or GED required\nMust be at least 21 years of age\nMust have valid NYS license with reliable transportation\nMust be able to work weekends and holidays as required\nSubject to background check per state cannabis regulations\nJob Skills and Abilities:\n\nAbility to accurately fill out documentation\nStrong interpersonal skills with the ability to interact with personnel at all levels in a team environment\nPossess Basic Math skills such as addition, subtraction, division and multiplication\nAbility to gown and work in an aseptic/clean room environment.\nHealth and safety practices and precautions applicable to a biopharmaceutical laboratory\nProper and safe handling and disposal of harmful chemicals, substances, and hazardous wastes\nExcellent time-management skills and ability to effectively plan and prioritize\nAbility to maintain confidentiality\nAbility to work with regulated material in a fast-paced environment\nAbility to focus & attention to detail\nAbility to communicate both verbally and written\nPossess basic computer skills and be able to enter and maintain data accurately\nWork with Microsoft Office including Excel, Word, and Outlook\nWork with BioTrack THC and other inventory management software systems\nPhysical Requirements:\n\nMust be able to stand for long periods of time, along with frequent bending and reaching\nClose visual focus required (clear vision at 20 inches or less)\nManual dexterity sufficient to reach/handle items, work with fingers to manipulate small objects\nAbility to lift and carry up to 50 pounds and push up to 100 pounds with assistance\nCuraleaf NY is an Equal Employment Opportunity Employer.\n\nCuraleaf is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.","slug":"fill-technician-iii-98a983ed-0589-4694-937c-0ed9fbc718d2","benefits":[],"selectedSkills":["Cleanroom","Microsoft Excel","Basic math","Computer skills","Computer literacy","High school diploma or GED","21 years or older","Background check","Reliable transportation"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=F0RaIRoIvTdprUGT8k0yk0XX6qgaJCAAABYpKOkj5vLKDgxx03-FoQ"},{"position":"Delivery Driver","labName":"Main Street Health Ohio","location":"Dayton, OH","age":"3 days ago","type":"Part-time","jobDescriptionCopy":"Company Overview\n\n\nWe are a science-based company working to bring compassion, community engagement, and pharmaceutical industry precision to the production of medical cannabis.\n\n\nInspired by a firsthand connection with patient and caretaker communities and driven by the opportunity to make a difference, our mission is to produce safe, reliable, and effective cannabis-based therapies that deliver pharmaceutical-grade quality and consistency. Our portfolio of products offers one of the industry’s widest ranges of delivery methods and provides formulation varieties to meet the unique needs of each individual patient.\n\n\nWe have passion for building a new kind of company – a company poised to take a leading role in delivering better alternative medicines to help patients and their families achieve wellness.\n\n\nPosition Overview\n\n\nThe Delivery Driver will safely and efficiently deliver products and materials to dispensaries and testing laboratories in a timely and professional manner. The Delivery Driver will accurately complete required logs and reports. The Delivery Driver must be comfortable with and supportive of the Ohio Medical Marijuana Control Program. This position is part time to start with the possibility of full time employment in the future.\n\n\nPosition Responsibilities\n\n\nAssists in the planning and execution of an efficient delivery route for each day.\nAccurately updates and completes transportation manifest throughout delivery process.\nVisually inspects delivery vehicle prior to, and following, the day’s assigned route.\nAssists in loading of delivery vehicle with products scheduled for delivery.\nDelivers products to correct location: obtaining signatures and completing log entries.\nMaintains all required transportation records.\nDelivers documentation to appropriate staff when delivery route is complete.\nObserves safety regulations and State laws regarding vehicle operation.\nHandles cash in keeping with company policy and State law.\nRepresents the company in a positive light; communicating positively with clients and maintaining a tidy and hygienic appearance.\nEnsures that delivery vehicle receives basic service according to maintenance schedule; reports larger service needs and mechanical issues to supervisor.\nEnsures routine maintenance on vehicles, including adding gasoline, checking oil and coolant levels, and checking tire pressure, is performed outside of delivery hours.\nReports facts concerning accidents or emergencies to supervisor and/or law enforcement officials in accordance with company policy.\nAssists in general warehouse duties when delivery route is completed.\nPerforms other related duties as assigned.\n\nPosition Requirements\n\n\nThe Delivery Driver must possess a valid driver’s license and clean driving record. The Delivery Driver must have strong interpersonal and customer service skills with the ability to speak professionally and courteously with customers and staff at delivery points.\n\n\nSignificant daily travel within Ohio is required.\nMust be able to pass FBI background check.\nMust be 21 years of age or older to apply.\n\n\nJob Type: Part-time\n\n\nPay: From $14.00 per hour\n\n\nSchedule:\n\n\nDay shift\nMonday to Friday\n\nApplication Question(s):\n\n\nAre you willing to undergo a background check, in accordance with local law/regulations?\nWhat about the role excites you and motivated you to apply? Please describe your interest in working with us.\n\nExperience:\n\n\nDriving: 1 year (Preferred)\n\nLicense/Certification:\n\n\nDriver's License (Required)\n\nWork Location: On the road\n","slug":"delivery-driver-f1aadcff-c99a-44f1-b5cb-782dfeb7e789","benefits":[],"selectedSkills":["Customer service","Driving","Driver's License","Delivery driver experience","Background check","21 years or older","Clean driving record"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=Xu8RXQ0Mmk2KxaXOPRIqojevV6dlfgKcMdTV1bBHbwmNlaOYgm5m9Q"},{"position":"Business Development Specialist","labName":"HighRes Labs, Inc.","location":"Oklahoma City, OK","age":"1 day ago","type":"Full-time | Part-time | Contract","salaryMin":"$10 ","salaryMax":" $20 an hour","jobDescriptionCopy":"Job description\n\n\nHighRes Labs has an opening for a team player in the dynamic new industry of medical marijuana testing in Oklahoma. Position yourself as a business professional in the fast paced field of cannabis quality control by leading the sales and marketing for a successful testing laboratory in Edmond, Oklahoma.\n\n\nHighRes Labs is an ISO-17025 accredited testing laboratory licensed by the Oklahoma State Department of Health and Oklahoma Medical Marijuana Authority. You bring your business development interests, chemistry intrigue, and team player mentality and we will train you in the field of MMJ testing.\n\n\nResponsibilities:\n\n\nThe Business Development Specialist will manage marketing initiatives, sales strategies, and business development operations. Honesty and ethics are paramount for this position. This role will be directly responsible for driving revenue through customer acquisition, sales execution and customer relationship management.\n\n\nRequirements:\n\n\nProven sales leadership experience and success selling B2B\nAbility to work independently with little oversight\nA valid driver’s license and clean driving record\nPersonal transportation to visit existing and potential customers\nExcellent verbal and interpersonal communication skills\nClean criminal history\n\nJob Duties:\n\n\nDevelop and establish key customer relationships with Medical Cannabis growers, processors, and dispensaries.\nTravel as necessary within Oklahoma for in-person meetings with customers and prospects to develop key relationships.\nMake recommendations for sales strategy within the Oklahoma territory in order to maximize sales productivity.\nDesign, implement and manage sales forecasting, planning, and budgeting processes to establish high levels of quality, accuracy, and process consistency.\nMaintain a CRM of the target customers in Oklahoma.\n\nAdditional Preferences:\n\n\n1+ years in a similar sales role within the cannabis industry.\nAssociate degree.\nExperience creating and operating a sales pipeline management system.\nRecent sales experience in Oklahoma with existing Medical Cannabis growers, processors and dispensaries will be a plus.\nDirect, no-nonsense communication style that emphasizes transparency and integrity.\n\nWhat we offer:\n\n\nCompensation: Salary $10/hr ~ $20/hr + commissions.\n\n\nCommissions ranging from 5% to 10% or more depending on the base salary, prior experience and working performance.\n\n\nAnd untapped opportunity to develop cannabis testing sales in Oklahoma.\n\n\nThe candidate will be hired on a probationary basis for three months.\n\n\nJob Type: Full-time\n\n\nJob Types: Full-time, Part-time, Contract\n\n\nPay: $10.00 - $20.00 per hour\n\n\nBenefits:\n\n\nHealth insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nMonday to Friday\n\nSupplemental Pay:\n\n\nBonus pay\nCommission pay\n\nAbility to commute/relocate:\n\n\nOklahoma City, OK: Reliably commute or planning to relocate before starting work (Required)\n\nExperience:\n\n\nBusiness development: 1 year (Preferred)\n\nWork Location: One location\n","slug":"business-development-specialist-2eb03e1f-213e-4dbe-9153-40489da4011b","benefits":["Health insurance"],"selectedSkills":["Driver's License","Sales","Customer relationship management","Business development","Sales pipeline","Associate's degree","Clean driving record"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=O7oV4chbM0ZQP9o7KPu5BYNna74dD4bVg8U4_blVO1KekplQdiUbYw"},{"position":"HVAC Technician","labName":"Parallel","location":"Franklin, MA","age":"3 days ago","type":"Full-time","salaryMin":"$27 ","salaryMax":" $30 an hour","jobDescriptionCopy":"Everyone is welcome here. Each of us is unique, and that’s what makes us amazing. We believe in inclusiveness and celebrating each person’s individuality, because there’s power in bringing people with different points of view and life experiences together. That’s why we provide equal employment opportunities (EEO). All applicants are considered regardless of race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, or sexual orientation.\n\nSo, bring yourself and your best ideas; when we feel safe and comfortable being ourselves, there’s no limit to what we can achieve.\n\nIN A NUTSHELL…\n\nThe Facilities HVAC Tech 2 provides support to the facilities operation during the initial set up phase and ongoing operation thereafter. They provide guidance to ensure the Facilities department is operating best in class.\n\nThis role is with NETA, one of the renowned retail brands under the Parallel umbrella. Parallel is one of the largest multi-state cannabis companies in the world, owning and operating in five markets; Florida (Surterra Wellness), Massachusetts (NETA), Pennsylvania (Goodblend), Nevada (The Apothecary Shoppe) and Texas (Goodblend). If you enjoy companies that are growing, moving fast, and constantly challenging themselves to achieve more, then Parallel is for you. We work hard, lean on each other, and are passionate about a pretty ambitious vision … pioneering a new paradigm of what well-being can be for all people, everywhere. For more information, visit www.liveparallel.com.\n\nWHAT YOU WILL BE DOING:\nRepair and maintain Industrial HVAC, plumbing and mechanical equipment in accordance with diagrams, sketches, operating manuals, manufacturers' specifications or supervisor s instructions, using hand and power tools, precision measuring or testing devices. Responsible for complete maintenance of area of assignment.\nRead blueprints; understand and read computerized HVAC, Electrical, plumbing system and building layouts.\nObserve and adjust a wide variety of equipment, machines and devices in operation to assure proper operation, including pumps, refrigerant recovery, engines, motors, compressors and laboratory equipment.\nDismantle machines and devices for servicing, repair, or replacement of parts.\nObserve Parallel Policies & Procedures for daily operations and fully complies with state medical marijuana regulations at all times.\nPerform preventative maintenance and maintains a scheduled maintenance program to ensure proper facilities upkeep, including all mechanical, electrical and plumbing infrastructure and equipment.\nEffectively using CMMS tracking systems to report receipt of maintenance needs and/or other issues.\nRespond to facility related failures or emergencies promptly and prioritizes work orders, while maintaining preventative tasks in accordance with facility needs.\nPerform routine maintenance tasks, preventative systems and repairs.\nComplete all required documentation for utility and facility management, follows up and evaluates effectiveness of all implemented actions to ensure that problem has been resolved effectively.\nEnsure safe work practices are implemented and consistently followed by department staff.\nWork with other departments in addressing and rectifying potentially unsafe work conditions or practices.\nEnsure compliance with applicable building codes, fire and emergency codes, regulatory and other required regulations.\nResponsive and professional in all response and interactions regarding service requests and facility needs.\nAble to work carefully and efficiently in a fast-paced environment.\nWork in coordination with the Supervisor and Manager to help upgrade all systems and streamline as needed to function in the most efficient and effective manner.\nAfter hours on call availability.\nPerform other job duties and tasks as assigned.\n\nEXPERIENCE AND SKILLS YOU’LL BRING:\nTechnical school graduate or equivalent industrial operations experience (Required).\nHVAC Certification and Refrigeration Recycle Recovery license (Required).\nDemonstrate competency in performing routine maintenance tasks, preventative systems and repairs.\nAbility to read blueprints; ability to understand and read computerized HVAC, Electrical, plumbing system and building layouts.\nMin 7 years of progressively responsible work-related experience and any combination of education and training which provides the required knowledge, skills and abilities to perform the essential functions of the job, combined with demonstrated professional growth and achievement.\nAge 21 or over (Required).\nHigh School Diploma or equivalent (Required).\nValid Government-Issued Photo ID (Required).\n\nYOU WILL BE SUCCESSFUL IF YOU…\nAre self-motivated; micro-managing isn’t fun for anyone.\nRoll your sleeves up and do the work; strategy is important, but so is getting stuff done.\nCan work fast and be flexible; our industry is always changing.\nPlay nice with others; we collaborate with each other a lot.\nThink creatively; sometimes, the “traditional” solution isn’t the best one.\n\nWHAT YOU GET:\nConsistent, reliable benefits; Full medical/vision/dental, 401k with a possible company match, access to company-sponsored well-being programs\nBalance and flexibility; paid time off, paid parental leave, flexible work arrangements.\nFinancial opportunity; an incentive program that provides opportunity to earn cash AND equity in a fast-growing company and industry\nEmployee discount.\nChance to make a difference; Employee Relief Fund, community volunteerism opportunities through Benevity.\n\nPHYSICAL REQUIREMENTS:\nThe person in this position frequently communicates with other employees/customers. Must be able to communicate accurate information in these situations.\nMust be able to travel up to 5%-10% of the time.\nMust be able to move around the production facilities up to 30% of the time.\nMust be able to work in an environment which is noisy and with temperature fluctuations from 60 degrees to 90 degrees.\nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\nConstantly operates a computer and other office productivity machinery.\n\nPARALLEL IS UNITED BY OUR VISION, MISSION, & VALUES:\nOur Vision – why we exist – is to pioneer well-being and improve the quality of life for humanity through the benefits of cannabinoids.\n\nOur Mission – how we will do this – is to build a leading, global well-being company through the best talent, our values, trusted and recognized brands, science and technology-based innovation, and a relentless focus on execution and continuous improvement.\n\nOur Values – Integrity | Collaboration | Alignment | Intentionality | Accountability | Agility\n\nWe are an Equal Opportunity Employer. We embrace and encourage our employees’ differences in age, color, disability, ethnicity, gender identity or expression, language, national origin, physical and mental ability, political affiliation, race, religion, sexual orientation, socioeconomic status, veteran status, and other characteristics that make our employees unique.","slug":"hvac-technician-c63c28f7-d70e-4a21-ba30-37d1ec1b1274","benefits":["Dental insurance","Employee discount","Health insurance","401(k) matching","Paid time off"],"selectedSkills":["Precision measuring instruments","CMMS","EPA Refrigeration Certification","HVAC Certification","HVAC","High school diploma or GED","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=tF14LqUXlvhPwJ8hzk-a7zrbtt_3z_b_C10T5S7cEyv9bCA-pLZyXw"}]