[{"position":"Director of Testing","labName":"Cannabis Control Commission","location":"Worcester, MA","age":"2 days ago","type":"Full-time","salaryMin":"$105,000 ","salaryMax":" $115,000 a year","jobDescriptionCopy":"PURPOSE OF THE JOB\nThe Director of Testing, under the direction of the Chief of Investigations and Enforcement, is responsible for the overall operation and administration of the Independent Testing Laboratories (ITLs), including assisting the Investigations and Enforcement Department staff in ensuring that licensed Marijuana Establishments (ME) and Medical Treatment Centers (MTC) operate safely and securely throughout the Commonwealth and abide by Commission regulations. The Director of Testing will manage the Testing staff within the department and lead the Commission’s efforts to monitor, evaluate and analyze the current status of testing, cultivation, manufacturing, including the protocols and capacity of ITLs.\n\nESSENTIAL FUNCTIONS AND RESPONSIBILITIES\n\nManages Testing staff in partnering with the rest of the Investigations and Enforcement staff to identify regulatory concerns and modify procedures for licensing, inspecting, and investigating ITLs;\nSupervise and participate in the collection of data from the seed-to-sale tracking system and licensing database to identify testing parameters and related results;\nConduct site visits at ITLs to evaluate their standard operating procedures, observe testing methodologies, and inspect the licensed premises to determine compliance with state regulations;\nIn cooperation with Investigations and Enforcement staff, monitor and track the status of ITL licenses, certifications, and mandatory requirements;\nLead efforts in implementing state of the art techniques and approaches for collecting and analyzing testing and research related data by ensuring that ITLs are using a quality system approach to laboratory testing that provides accurate and reliable test results;\nAssist Investigations and Enforcement staff in developing enforcement approach for testing protocols and procedures to ensure that MEs and MTCs, are in compliance with state laws and regulations;\nAssist the Commission with regulations, protocols, and methodologies regarding marijuana testing, which includes, but is not limited to the following: potency, pesticides, residual solvents, heavy metals, microbial, terpenes, water content, and vape products.\nOTHER DUTIES AND RESPONSIBILITIES\n\nMaintain the highest standards of personal, professional, and ethical conduct and support the Commission’s goals for a diverse and culturally aware workforce;\nCollaborate with other state agencies, including, but not limited to, the Department of Agricultural Resources and the Department of Public Health to develop inspection and evaluation protocols.\nStay current with emerging practices and information related to best practices for marijuana testing; and\nPerforms related duties as assigned.\nSUPERVISORY RESPONSIBILITIES\n\nThe Director of Testing will oversee the work of the Laboratory and Testing staff.\nThe safety of our employees, both current and future, is the Commission’s highest priority. At this time, our employees are working remotely.\n\nBenefits Package:\nThe Commission is pleased to offer a comprehensive benefits package to its employees. The specific components and eligibility may vary based upon position classification, hours worked per week and other variables. Therefore, specific benefits for this position may be discussed as part of the interview and offer process. This position is non-civil service. This position is an exempt position.\n\nThe overall benefits available include: paid vacation, sick and personal leave time, health, dental and vision insurance through the Commonwealth’s Group Insurance, and optional pre-tax Health Savings Account plans. In addition, the Commission provides employees the opportunity to elect life insurance, long-term disability insurance, deferred compensation savings, tuition remission and pre-tax commuter account plans, along with other programs. The Commission employees also participate in the Commonwealth’s State Retirement Plan, which can become a defined benefit plan for those that both vest and subsequently retire from State service. Follow this link for additional retirement information: http://www.mass.gov/treasury/retirement/state-board-of-retire/.\n\nCommitment to Diversity:\nThe Commission is committed to building a diverse staff across its entire agency and at all levels. The Commission is an equal opportunity/affirmative action employer.\n\nApplication Process and Deadline:\nThe Commission encourages interested candidates that meet the minimum requirements for experience and skills to apply for this position. Interested candidates should submit a cover letter and resume by e-mail no later than July 8, 2022.\n\nThe application package should be submitted to: careers@cccmass.com.\n\nPlease include the position title in the subject line: CCC – Director of Testing.\n\nSubmissions are due by 5:00 pm (e-mail) on July 8, 2022; late submissions may be considered solely at the discretion of the Commission.\n\nNotice of Required Background Check – Including Tax Compliance:\n\nThe Commission requires a background check on all prospective employees as a condition of employment.\n\nCandidates should be aware of this requirement but should also know that such background check is not initiated until:\n\n1. A candidate is invited to a second or subsequent interview, and\n2. The candidate has signed the Background Check Authorization Form and related releases.\n\nThis background check includes a Criminal Offender Record Information (CORI) check, Federal IRS and Department of Revenue state tax compliance on all prospective employees as a condition of their employment.\n\nCandidates with advanced degrees and professional licenses may have these credentials verified. Individuals other than those references provided by a candidate may be contacted while completing a full background and qualification check.\n\nThose candidates invited to interview will be contacted by the Commission. Unfortunately, due to the anticipated high volume of applicants for this vacancy, we are unable to provide status updates to specific individuals.\n\nQualifications\n\nKNOWLEDGE AND SKILLS\n\nExcellent quantitative statistical knowledge;\nAdvanced experience with at least one high-level statistical software program (R, SAS, Stata, SPSS etc.);\nExperience with SQL;\nAbility to write concisely to express thoughts clearly and to develop ideas in logical sequence;\nAdept at presenting information in an accurate and concise format;\nAbility to think critically and strategically;\nComfortable working independently, as well as with teams;\nAbility to seek opportunities to resolve problems, achieve goals, or otherwise advance the Commission’s mission;\nAbility to operate a motor vehicle and possesses a valid Driver’s License from Massachusetts or another state;\nAbility to work in and travel to the Commissions headquarters in Worcester, along with other locations across the state; and\nApproximately 50% of the time is spent in the field, out of the office.\nEDUCATION AND EXPERIENCE\n\nMaster’s degree in Environmental Science, Chemistry, Biochemistry, Toxicology, Biology, Data Science, or related field from an accredited institution of higher education required;\nMinimum of 7-10 years of related work/graduate experience in Environmental Science, Biochemistry, Toxicology, or related field;\nExperience or familiarity in the cannabis regulatory environment and/or research; and\nSolid background in laboratory informational technology and quantitative data analysis;\nDemonstrated experience at least 3-4 years managing projects and teams; and\nStrong experience using Microsoft Office, case management systems and statistical software.\nOfficial Title: Director, CNB\nPrimary Location: United States-Massachusetts-Worcester-2 Washington Square\nJob: Laboratory Services\nAgency: Cannabis Control Commission\nSchedule: Full-time\nShift: Day\nJob Posting: Jun 17, 2022, 9:24:48 AM\nNumber of Openings: 1\nSalary: 105,000.00 - 115,000.00 Yearly\nIf you have Diversity, Affirmative Action or Equal Employment Opportunity questions or need a Reasonable Accommodation, please contact Diversity Officer / ADA Coordinator: Erika White - 7744150200","slug":"director-of-testing-e7340528-741d-4ffb-96f6-070b4f05b35f","benefits":["Health savings account","Dental insurance","Health insurance","Disability insurance","Paid time off"],"selectedSkills":["SQL","SAS","Laboratory experience","R","Biochemistry","Master's degree","Background check"],"jobType":"free","applyURL":"https://massanf.taleo.net/careersection/ex/jobdetail.ftl?job=220007FL&tz=GMT-05%3A00&tzname=America%2FChicago&src=JB-10080"},{"position":"Regional Compliance Manager (3880064)","labName":"State of Missouri","location":"Jefferson City, MO","age":"6 days ago","salaryMin":"$64,700 ","salaryMax":" $68,332 a year","jobDescriptionCopy":"Job Location: This position will be located at 3418 Knipp Dr., Jefferson City, MO 65109.\n\nWhy you’ll love this position:\nAssists the Manager of the Medical Marijuana Compliance with the planning and administration of a statewide compliance team. The Facility License & Compliance team oversees 390+ licensed and certified medical marijuana testing, cultivation, manufacturing, dispensary, and transportation facilities. The position will assist the Manager with oversight/direction regarding the compliance of facilities, investigation of complaints against facilities, monitoring of the statewide track and trace system, making recommendations on violations, issuing corrective action plans, and drafting and revising section policies and procedures. The Regional Compliance Manager will oversee the work of a team of Compliance Officers and is responsible for the work and outcomes of that region.\n\nWhat you’ll do:\nAssist the Manager of Medical Marijuana Compliance team with the development and implementation of compliance standards and scope of compliance activities as they apply to Article XIV and 19 CSR 30-95, including but not limited to, inspections, facility requests, investigations, and enforcement actions.\nAssist the Manager of Medical Marijuana Compliance team with interpretation of Article XIV and 19 CSR 30-95 and other Department authority as related to the compliance of licensed and certified medical marijuana facilities. Provide staff guidance on the statute, laws, and rules and regulations relating to medical marijuana.\nMonitor compliance of medical marijuana facility activities related to inventory control through the statewide track and trace system.\nManage and supervise remote compliance staff. Ensure staff are trained, that they are adhering to established protocols consistent throughout the state; ensure staff are completing tasks in a timely manner; evaluate staff performance and provide mentoring and coaching for a successful team.\nCoordinate and review the work of the region’s compliance officers which may include coordinating work, reviewing work product, processes and procedures and provides recommendations and support for claims to the Compliance Manager.\nEnsure documentation and reports support the department actions in claims under Article XIV and rules so as to be fully defensible in court and under Administrative Hearing Commission review.\nCooperate with other agencies, law enforcement entities, the Office of the Attorney General, prosecuting attorneys’ offices and Administrative Hearing Commission in directing investigations and presenting cases.\nExercise considerable initiative and judgment in planning and carrying out assignments; receives general administrative direction; work is reviewed through conferences, reports, and evaluation of operational results.\nProvide consultation to facilities, law enforcement, and other agencies linked with medical marijuana for the safe and effective delivery of marijuana to patients. Serve as a liaison to assigned medical marijuana facilities and organizations within the State of Missouri. Attend meetings and provide information to the community about the Department's role in medical marijuana.\nDevelop and train compliance staff on a wide variety of skills and knowledge that addresses Medical Marijuana facility needs, including but not limited to, manufacturing practices, agricultural practices, environmental control, food manufacturing and safety, laboratory testing, retail of regulated goods, inspection and investigation techniques and computer software that tracks a highly regulated industry.\nIn-depth auditing and reviewing of facility plans and documents, including facility wide standard operating procedures, physical and security site plans, etc., for compliance with 19 CSR 30-95.\n\nAll you need for success:\nMinimum Qualifications\n\nA Bachelor’s degree from an accredited college or university with a minimum of 15 earned credit hours in one or a combination of the following: Criminal Justice, Law Enforcement, Criminology, Business Administration, Social Sciences, Environmental Sciences, or a closely related field.\nFour or more years of regulatory compliance, including civil, administrative, or criminal investigative (non-clerical) experience (e.g., tax fraud, licensing, environmental, client care, public assistance, insurance, or military); or experience as a law enforcement officer with responsibility for conducting investigations.\nExcellent skills in using and mining data systems for the purposes of compliance and investigative needs.\nA proven track record of successfully managing and supervising a highly technical team of employees.\nExcellent written and verbal communication is a must.\nA high level of initiative and problem solving skills in areas of responsibility.\nAble to adapt to constant program development, change and improvement.\n\nIf you have questions about this position please contact:\nbrittany.kirkweg@health.mo.gov\n\nThe State of Missouri is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.","slug":"regional-compliance-manager-3880064-361dfcf2-b0ac-4497-9d3a-c3dcb2c5a47c","benefits":[],"selectedSkills":["Fraud","Communication skills","Military","Clerical experience","Law enforcement","Bachelor's degree"],"jobType":"free","applyURL":"https://hiretrue-prod.com/hiretrue/ce3/job-board/5effe9b2-4b89-494b-ac76-c45e25190768/d4b9f79e-73a6-460d-b24a-613c5bc643b8"},{"position":"Technical Director","labName":"Montrose Environmental Group, Inc.","location":"Berkeley, CA","age":"2 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, part of the larger organization, Montrose Environmental Group, is comprised of 10 laboratories performing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nThe Technical Director is the laboratory’s lead analytical and technical resource, responsible for improving procedures and implementing new technologies to meet quality standards and client requirements, reducing costs, and maximizing operating efficiencies by effectively managing and developing available technology solutions. They will also improve efficiencies by minimizing down-time and maximizing instrument through-put and assisting the Group Leaders in training staff to operate new and existing analytical equipment.\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nJob Responsibilities - This role will be responsible for a full range of activities including:\n\nMethod Development – understands methodology and instrumentation, including a software and hardware perspective, to make changes and improvements as needed. Demonstrate knowledge of different analytical columns, detectors, sample preparation, clean up techniques, etc.\nTroubleshooting – Strong ability to diagnose source of error at the bench; understanding how to optimize method parameters such as flow rates, gradients, solvent efficiency, chromatographic resolution, etc\nMethod Validation – write validation plans, interpret and evaluate data, write validation reports in a timely manner to meet deadlines collaborating with QA and Lab Management.\nStaff Development – provide technical and analytical training to analysts and technicians;\nQuality Assurance - Supervise and manage adherence to QA/QC, collaborate with lab management to develop and implement quality systems\nHands on expertise and thorough knowledge (beyond general preventative maintenance) of all instruments used in the laboratory.\nWhen necessary, prepare and analyze client samples, review data, to meet production deadlines.\nAssign and clearly communicate technical priorities; coordinate employee schedules with lab management to balance production needs and development needs\nAllocate lab resources to meet client schedule & requirements; Provide expertise to lab management when recommending new equipment to purchase\nAct as manager when lab manager or lab director are out\nProjecting staffing needs: hiring and firing staff; Assist with employee performance reviews\nAct as main point of contact, along with QA, during lab audits\nOther duties, as assigned by Laboratory Director\n\nMinimum Qualifications\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nBA/BS in Chemistry or related Science required.\nMinimum of 4 years of experience in a laboratory testing environment\nIn -depth understanding of at least two of the following: LC-MS/MS, GC-MS, ICP-MS, LC-DAD, GC-FID\nThe Technical Director must meet the requirements of the accrediting body(ies) of the laboratory\nStrong scientific writing and presentation skills\nAnalytical thinking to solve technical problems\nContract Research Organization (CRO) experience or background a plus\nScientific expertise or background in cannabis containing products is a plus\nMaster’s or PhD degree is a plus.\n\nPreferred Skills\n\nSuperior time management skills\nRespectful and effective communication skills – ensure positive interactions with the team to build professional relationships;\nEffective training - teach complex topics to team members of varying scientific backgrounds and ensuring their proficiency\nConflict resolution: Removes/Breakdown organizational communication or operational barriers\nAssertion Skills: Sets expectations, provides regular feedback, creates a positive work environment.\nManagement behavior shows serious thought and reliable actions; leads with integrity and honesty\nTeam player – Cooperative and collaborative, focused on the outcome of the group as a whole;\nTakes responsibility, diagnoses problems, assesses corrective action, and does not shift blame\nFlexible – able to shift priorities on short notice\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"technical-director-a2df7238-cac8-41ff-b6eb-1cdb198c3019","benefits":["Disability insurance","Tuition reimbursement","401(k)","Parental leave"],"selectedSkills":["Writing skills","Laboratory experience","Communication skills","Time management","Doctoral degree","Bachelor of Science","Bachelor's degree","Master's degree","Doctor of Philosophy"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-CA-Berkeley/Technical-Director_R2196?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Extraction Technician","labName":"Trulieve","location":"United States","age":"3 days ago","salaryMin":"$28,000 ","salaryMax":" $35,000 a year","jobDescriptionCopy":"“Trulieve Grows One Patient at a Time”\n\nIf you have an interest in being part of one of the fastest growing industries in the nation in you may consider wanting to work for Trulieve! If you have a desire to help others in need through your efforts, this may be the role for you!\n\nAt Trulieve, we strive to bring our patients the relief they need in a product they can trust. Our plants are hand-grown in an environment specially designed to reduce unwanted chemicals and pests, keeping the process as natural as possible at every turn.\n\nOur products are designed to alleviate seizures, severe and persistent muscle spasms, pain, nausea, loss of appetite, and other symptoms associated with serious medical conditions such as cancer.\n\nOur specially trained staff works hand-in-hand with physicians to provide the right products and the correct dosage to ensure patients get the compassionate care they need.\n\nRequisition ID: 1452\n\nRemote Work Available: No\n\nTrulieve is looking for an Extraction Technician to support our extraction and production operations. You should be very technically astute in mechanical, electrical, and computer operated systems utilized in production/manufacturing environments. You need to be proactive, quick thinking and innovative in your approach.\n\nKey Duties and Responsibilities:\nPreparation of equipment and plant materials for extraction\nExecution of extraction and processing in accordance with state and local standards\nOperation of sophisticated extraction equipment\nEnsure consistency and efficiency of product through quality control testing and procedures\nCleaning and maintenance of extraction equipment and manufacturing facility\nMaintaining strict inventory records of all plant materials, chemicals, and equipment used in the facility\nOversee day-to-day operations of the entire extraction space beginning with storing the raw cannabis through the extraction process and all the way to fulfillment of orders\nOperating, maintaining, and making adjustments and repairs to extraction equipment\nStoring supplies and equipment and disposal of waste according to guidelines\nComplete the cleaning and sanitization of all production equipment, work surfaces, and tools\nMaintaining inventory records of supplies, materials, and equipment and preparing requisitions as needed\nMaintaining material safety data sheets for all chemicals and products\nFollowing all standard operating procedures regarding product creation and lab safety\nAssist in packaging and labeling of finished products\nWorks with testing laboratory as defined by state guidelines\nFour 10 hour work days and weekends.\nAll other duties as assigned\n\nRequirements\n\nSKILLS AND QUALIFICATIONS:\nBachelor’s or Associate degree or its equivalent, from a recognized college or university, with a major in chemistry or biology preferred\nUnderstanding of state and local laws\nUnderstanding of proper and safe handling of hazardous materials\nFamiliarity with separations, isolations and fractionation\nKnowledge of solvent and non-solvent extraction methods\nStay current of practices and new developments in the cannabis extraction industry\nAbility to work quickly without compromising accuracy\nAbility to discern the quality of plant material and finished products\nStrong computer and social skills\n\nPHYSICAL REQUIREMENTS:\nMust be able to push, pull, move, and/or lift a minimum of 25lbs to a minimum height of 5 feet and able to push, pull, move, and/or carry such weight a minimum distance of 50 feet, with or without mechanical assistance\nMust be able to work seated/standing as appropriate at workstations for extended periods of time, maintain body equilibrium while climbing ladders, stairways, stopping, kneeling, crouching, and reaching, and use hands/fingers to hold, grasp, turn, pick, pinch frequently/constantly to complete tasks\nMust be able to handle organic matter daily, able to wear PPE as appropriate (eye, face, hand, arm, head, foot, body, fall protection), and able to be exposed to hot, cold, wet, humid, or windy conditions while wearing PPE (95 degrees or greater)\nMust have visual acuity with/without job aids to perform activities such as; reading, viewing a computer terminal, visual inspection involving small parts/details. Clarity of vision at 20 ft or more in day and night/dark conditions\nMust be able to speak and communicate verbally at conversation levels with co-workers, vendors, etc. (Moderate noise)\n\nSalary will be commensurate with experience. A comprehensive benefits package including paid time off is offered with this position. This position will work an average of 40 hours per week and will be available “after hours” if an emergency situation should arise.\n\nTrulieve provides equal employment opportunities to all employees and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, pregnancy or any other characteristic protected by federal, state or local laws.","slug":"extraction-technician-8e44fb4e-75e5-47ed-afe8-9678019b8344","benefits":["Paid time off","Health insurance"],"selectedSkills":["Computer skills","Bachelor's degree","Associate's degree"],"jobType":"free","applyURL":"https://careers.trulieve.com/job/Extraction-Technician/898292500/?feedId=364400&utm_source=Indeed&utm_campaign=Trulieve_Indeed"},{"position":"Manufacturing Supervisor","labName":"Trulieve","location":"Midway, FL","age":"5 days ago","salaryMin":"$56,000 ","salaryMax":" $72,000 a year","jobDescriptionCopy":"“Trulieve Grows One Patient at a Time”\n\nIf you have an interest in being part of one of the fastest growing industries in the nation in you may consider wanting to work for Trulieve! If you have a desire to help others in need through your efforts, this may be the role for you!\n\nAt Trulieve, we strive to bring our patients the relief they need in a product they can trust. Our plants are hand-grown in an environment specially designed to reduce unwanted chemicals and pests, keeping the process as natural as possible at every turn.\n\nOur products are designed to alleviate seizures, severe and persistent muscle spasms, pain, nausea, loss of appetite, and other symptoms associated with serious medical conditions such as cancer.\n\nOur specially trained staff works hand-in-hand with physicians to provide the right products and the correct dosage to ensure patients get the compassionate care they need.\n\nRequisition ID: 1399\n\nRemote Work Available: No\n\nTrulieve is looking for an Manufacturing Supervisor to support our extraction and production operations night shift. You should be very technically astute in mechanical, electrical, and computer operated systems utilized in production/manufacturing environments. You need to be proactive, quick thinking and innovative in your approach.\n\nEssential functions:\n\nEnsure that team members are properly communicated the goals of the shift, week, and month.\nTraining new team members on concentrate equipment and procedures.\nEnsuring policy and procedure compliance across all processes within the department.\nAchieves and reports 5S standards for equipment and manufacturing area\nChampions incident investigation process and corrective actions\nFacilitates appropriate training for all safety related activities\nEstablish and maintain compliance to current GMP, safety programs\nCommunicate any safety or product issues from the shift\nMonitoring and reporting on employee attendance and performance.\nOversee equipment cleaning and maintenance policies, ensuring equipment is well maintained.\nMaintaining strict inventory records of all concentrates, chemicals, and equipment used in the facility, assisting in improving records when needed\nOversee process flow throughout department, making changes in allocation of resources to meet demand\nOperating, maintaining, and making adjustments and repairs to concentrate equipment\nEnsuring team members store supplies and equipment and disposal of waste according to guidelines\nWorks with testing laboratory as defined by state guidelines\nQualifications:\n\nBachelor’s or Associate degree or its equivalent, from a recognized college or university, with a major in chemistry or biology preferred\nUnderstanding of state and local laws\nUnderstanding of proper and safe handling of hazardous materials\nFamiliarity with separations, isolations and fractionation\nKnowledge of solvent and solvent free extraction methods\nStay current of practices and new developments in the cannabis extraction industry\nAbility to prioritize tasks in order of importance while managing multiple projects, both long term and short term\nAbility to discern the quality of plant material and finished products\nStrong computer and social skills\nVast cannabis knowledge including specifically Ethyl extraction\nStrong leadership skills\nStrong communication skills\nManufacturing experience preferred\n3+ years of management experience\nAdditional Requirements:\n\nPer state law, Must be at least 21 years of age.\nMust successfully complete a comprehensive background check.\nOther Duties\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.\nHourly wage will be commensurate with experience. A comprehensive benefits package including paid time off is offered with this position. This position will work an average of 40 hours per week and will be available “after hours” if an emergency situation should arise.\nWe are an EOE company\n\nSalary will be commensurate with experience. A comprehensive benefits package including paid time off is offered with this position. This position will work an average of 40 hours per week and will be available “after hours” if an emergency situation should arise.\n\nTrulieve provides equal employment opportunities to all employees and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, pregnancy or any other characteristic protected by federal, state or local laws.","slug":"manufacturing-supervisor-9d528464-f281-4dd9-b1b9-15d0f18e627a","benefits":["Health insurance","Paid time off"],"selectedSkills":["Manufacturing","Computer skills","Leadership","Communication skills","Management","Bachelor's degree","Associate's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://careers.trulieve.com/job/Midway-Manufacturing-Supervisor-FL-32343/897507500/?feedId=364400&utm_source=Indeed&utm_campaign=Trulieve_Indeed"},{"position":"Laboratory GM (Cannabis Testing)","labName":"Cannabis Employment Professionals","location":"Las Vegas, NV","age":"6 days ago","type":"Full-time","salaryMin":"$90,000 ","salaryMax":" $110,000 a year","jobDescriptionCopy":"Overview:\n\n\nRapidly growing cannabis testing laboratory located in Nevada is seeking a Laboratory General Manager. This individual will be overseeing all laboratory operations and developing safe and effective cannabis-based products by supervising production and implementing standard operating procedures (SOPs). The successful candidate will be able to oversee testing formulated products, generate quality assurance/quality control (QA/QC) reports, oversee general laboratory day-to-day operations, and assist with marketing, networking, and bringing in new clients to use our testing services.\n\n\nPay: $90,000-$110,000 annually\n\n\nLocation: Las Vegas, NV (Onsite)\n\n\nDuties:\n\n\nAdhere to protocols and laboratory SOPs\nOversee and help assist with sales\nConsider and address any deficiencies found in other areas, such as facility administration; proficiency testing; and general, pre-analytic, analytic, and post-analytic systems\nProblem-solving skills and troubleshooting of products and equipment\nManage laboratory operations and ensure the safety of employees\nOversee all Lab staff and assist with hiring new employees\nImplement lab equipment troubleshooting procedures, training and usage compliance.\nWork with Laboratory Technicians and Laboratory Analysts to ensure turnaround times are met\n\nQualifications:\n\n\nBachelor’s degree required (preferred degree in business management, chemistry, engineering, or biology/microbiology)\nPrior sales and management experience of at least 1 year required\nLaboratory experience is a plus but not required\nExperience with analytical testing (HPLC) and microbiology including working in aseptic conditions is a plus\n\nJob Type: Full-time\n\n\nPay: $90,000.00 - $110,000.00 per year\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\n\nApplication Question(s):\n\n\nAre you willing to commute or relocate to Las Vegas, NV? (Onsite positions)\n\nExperience:\n\n\nLaboratory management: 4 years (Preferred)\ncannabis testing: 2 years (Preferred)\nanalytical testing (HPLC) and microbiology: 4 years (Preferred)\naseptic conditions: 3 years (Preferred)\n\nWork Location: Multiple Locations\n","slug":"laboratory-gm-cannabis-testing-604e904f-14ec-475f-889c-17a1d6f0b842","benefits":["Dental insurance","Health insurance","Paid time off","Vision insurance"],"selectedSkills":["Sales","High-performance liquid chromatography","Laboratory experience","Laboratory management","Management","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&job=-cBslBd8LatcXreUwijENfCwIIBEc0PUgz0D0N8Tl5CCX20dCfEFKA"},{"position":"Cannabis Testing Laboratory Director","labName":"CDS","location":"Los Angeles, CA","age":"5 days ago","type":"Full-time","jobDescriptionCopy":"We are a Licensed Cannabis Testing Laboratory in Los Angeles working on DCC and ISO certification requirements including but not limited to:\n\n\nFinal validation and correspondence with DCC policy\nLIMS selection and implementation\n\nCandidates should have already successfully led one or more Cannabis Testing Laboratories through City, State and ISO 17025 certification processes.\n\n\nCandidates have extensive working knowledge and experience in DCC and ISO certification processes.\n\n\nQualifications:\n\n\nBachelors of Science or greater\n\n\nCA Cannabis Laboratory Management experience of 3+ years\n\n\nLIMS knowledge and experience\n\n\nExperience in Metrix, Accela and Microsoft business tools\n\n\nManagerial experience in ALL aspects of a California Cannabis Testing Laboratory\n\n\nJob Responsibilities include:\n\n\nMethod development\n\n\nProcess creation and process flow development and optimization\n\n\nPolicy Development and optimization\n\n\nSOP creation, development and editing per FDA/ISO standards\n\n\nValidation processes per DCC requirements\n\n\nLearn, run, optimize, trouble shoot and train employees on all necessary aspects of LCMS, ICP-MS, GCMS and HPLC equipment for Perkin Elmer\n\n\nLearn, run, optimize and train employees on Agilent PCR machine\n\n\nManaging, supervising and optimizing laboratory personal and vendors\n\n\nPurchasing of all laboratory supplies and equipment as needed\n\n\nResponsible for oversight of all building maintenance issues and reporting these to the Executive Team\n\n\nEnsure all equipment and applications are in clean, well-maintained and in good working order\n\n\nEnsuring compliance with laboratory policies, procedures and state regulations\n\n\nCandidates should have already successfully led one or more Cannabis Testing Laboratories through City, State and ISO 17025 certification processes.\n\n\nCandidates have extensive working knowledge and experience in DCC and ISO certification processes.\n\n\nQualifications:\n\n\nBachelors of Science or greater\n\n\nCA Cannabis Laboratory Management experience of 3+ years\n\n\nLIMS knowledge and experience\n\n\nExperience in Metrix, Accela and Microsoft business tools\n\n\nManagerial experience in ALL aspects of a California Cannabis Testing Laboratory\n\n\nJob Responsibilities include:\n\n\nMethod development\n\n\nProcess creation and process flow development and optimization\n\n\nPolicy Development and optimization\n\n\nSOP creation, development and editing per FDA/ISO standards\n\n\nValidation processes per DCC requirements\n\n\nLearn, run, optimize, trouble shoot and train employees on all necessary aspects of LCMS, ICP-MS, GCMS and HPLC equipment for Perkin Elmer\n\n\nLearn, run, optimize and train employees on Agilent PCR machine\n\n\nManaging, supervising and optimizing laboratory personal and vendors\n\n\nPurchasing of all laboratory supplies and equipment as needed\n\n\nResponsible for oversight of all building maintenance issues and reporting these to the Executive Team\n\n\nEnsure all equipment and applications are in clean, well-maintained and in good working order\n\n\nEnsuring compliance with laboratory policies, procedures and state regulations\n\n\nJob Type: Full-time\n\n\nPay: From $100,000.00 per year\n\n\nSchedule:\n\n\n10 hour shift\n8 hour shift\nMonday to Friday\n\nAbility to commute/relocate:\n\n\nLos Angeles, CA 90021: Reliably commute or planning to relocate before starting work (Preferred)\n\nEducation:\n\n\nDoctorate (Preferred)\n\nExperience:\n\n\nResearch: 1 year (Preferred)\n\nLicense/Certification:\n\n\nASCP Certification (Preferred)\n\nWork Location: One location\n","slug":"cannabis-testing-laboratory-director-07baca41-7730-4b97-af56-28b516e67a1c","benefits":[],"selectedSkills":["Research","ASCP Certification","FDA regulations","Laboratory information management systems","Laboratory management","Doctoral degree","Bachelor of Science","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&job=IH_7sXcximd09MaH9rfIhmtV6PPmyRF3dt-YzTkuRx2GJ0YQe21uyA"},{"position":"Lab Technician (cannabis lab)","labName":"rhino labs","location":"Norman, OK","age":"3 days ago","type":"Full-time | Part-time","jobDescriptionCopy":"APPLICANTS MUST currently live within a reasonable commute of business location. OUT OF AREA candidates and/or those requiring a relocation will NOT be considered.\n\n\nPOSITION SUMMARY: This is a technical position responsible for the collection and testing of samples of various chemical compounds and biological specimens. Daily work involves the routine and repetitive use of various types of machinery, lab equipment and programs to perform tests, record data or findings and present information.\n\n\nESSENTIAL FUNCTIONS:\n\n\nPrepares and weighs product samples; performs repetitive/routine testing activities to include accessioning and pipetting\nDocuments results pertaining to strength, stability, purity, chemical content, and other characteristics\nAssembles data and other pertinent information into groups, charts, graphs, reports, and the like for others to evaluate\nHelps to set up laboratory equipment and instrumentation required for testing activities under the supervision of team analysts\nUtilizes problem-solving skills to help to determine when an apparatus may need to be recalibrated or requires servicing\nRestocks inventory supplies used in various testing activities; provides for the weekly cleaning of glassware\nRecords and verifies log entries for various pieces of equipment/apparatus including balances, incubator, refrigerator/freezer, etc.\nComplies with all established safety, health, and environmental rules and regulations designed to ensure a safe work environment\nExpected to perform other job-related duties as assigned\n\nJob Types: Full-time, Part-time\n\n\nPay: From $15.00 per hour\n\n\nSchedule:\n\n\n4 hour shift\n8 hour shift\n\nAbility to commute/relocate:\n\n\nNorman, OK: Reliably commute or planning to relocate before starting work (Required)\n\nWork Location: One location\n","slug":"lab-technician-cannabis-lab-1d6cc8e2-8fb6-4dfa-86f4-7d5c29fddb5e","benefits":[],"selectedSkills":[],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&job=xd7er-qX0eEbEaHAldUezQAFqirlMDF3Lyt8TLoY-QaKWFzjNhnE7w"},{"position":"Level II Biochemist for cannabis lab","labName":"Keystone State Testing","location":"Harrisburg, PA","age":"3 days ago","type":"Full-time","salaryMin":"$55,000 ","salaryMax":" $80,000 a year","jobDescriptionCopy":"Patients, Growers and Physicians rely on our analytical testing, information and services to help them make better decisions. These are often serious decisions with far reaching consequences, and require sensitivity, tact and a clear dedication to service. It's about providing clarity and hope.\n\n\nAs a team member you will work for the world leader in the industry, with a career where you can expand your skills and knowledge. You'll have a role where you can act with professionalism, you can inspire colleagues, and you can care about the work we do and the people we serve.\n\n\nAt KST, Our team members play an essential role in our success and in the services we provide. As a career, we offer a unique opportunity to develop your career with the #1 testing Lab in the US. We are tech driven, and we're creating the lab of the future - an environment where you can deliver cutting edge analytics and help us drive new discoveries and breakthroughs.\n\n\nBasic Purpose:\n\n\nThe Biochemist position is a level II position for an individual with prior laboratory experience. The individual will perform routine and limited non-routine functions to aid in the preparation of and testing of samples.\n\n\nMUST'S:\n\n\nAbility to follow Instruction (If you are not exceptional at following instruction, this is not for you)\nAbility to travel / relocate as needed\nPass a full FBI background check\n\nDO NOT APPLY IF:\n\n\nYou can not follow instructions\nIf you are not willing to interview in person (We are not holding phone interviews at this time)\nyou can not relocate (we will provide assistance)\n\nResponsibilities include, but are not limited to, the following:\n\n\nPrepare samples for analysis using various methods in accordance with ISO standard operating procedures.\nData handling and report preparation.\nEquipment familiarity preferred but not required (HPLC, LC-MS/MS, GC-MS/MS, ICPMS/MS)\nPerform various microbiological tests for MMJ products such as total plate count, yeast and mold count, ecoli, salmonella, etc.\nPerform various tests for pharmaceutical grade products such as Microbiological Examination of Non Sterile Products, Antimicrobial Effectiveness, Stability, Sterility Test, Environmental Monitoring, etc.\nWork in fast paced, dynamic environment.\nVisit client facilities to perform sampling.\nEvaluate data\n\nAn ideal candidate would possess:\n\n\nAt Minimum a B.S in Bio-Physics, Bio-Chemistry, Micro-Bio, or Chemistry\nAt least 2 years of laboratory experience in a relevant field\nCandidates with strong science backgrounds are encouraged to apply. Bio-Physics/ Chemistry/ Micro-Bio or General Lab experience is preferred.\nMust be fluent with Microsoft Office, specifically Excel and Word.\nFamiliarization with a wide range of analysis methods, sampling equipment and instrumentation a plus.\nSelf-motivated, responsible individual with good communication skills and willingness to learn and progress over time through consistent dedication and training. The position requires the individual to multi-task, be independent/self-sufficient, and be flexible and participate in a team environment.\nQuality Control experience.\nHigh attention to detail.\nAbility to work quickly and efficiently in a high pressure environment, while maintaining the highest level of quality.\nConscientious and responsible.\n\nWe Offer :\n\n\nOpportunity for fast growth and advancement\n\n\nJob Type: Full-time\n\n\nPay: $55,000.00 - $80,000.00 per year\n\n\nBenefits:\n\n\nDental insurance\nFlexible schedule\nFlexible spending account\nHealth insurance\nPaid time off\nParental leave\nRelocation assistance\nVision insurance\n\nSchedule:\n\n\n10 hour shift\n8 hour shift\n\nSupplemental Pay:\n\n\nCommission pay\n\nAbility to commute/relocate:\n\n\nHarrisburg, PA 17109: Reliably commute or planning to relocate before starting work (Required)\n\nExperience:\n\n\nBiochemistry: 1 year (Preferred)\nLaboratory experience: 1 year (Preferred)\n\nWillingness to travel:\n\n\n25% (Preferred)\n\nWork Location: One location\n","slug":"level-ii-biochemist-for-cannabis-lab-3cc373fd-cd17-4534-8203-224fbfa34c32","benefits":["Dental insurance","Health insurance","Flexible schedule","Flexible spending account","Paid time off"],"selectedSkills":["Microsoft Excel","Laboratory experience","Communication skills","Biochemistry","Quality control","Bachelor of Science","Bachelor's degree","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&job=U2k8_PthxbHYmxuLa1iS4GWfNkvBkhF_tvPm71NliAbDH6pZpbsbMQ"},{"position":"Level I Microbiologist for Cannabis Lab","labName":"Keystone State Testing","location":"Harrisburg, PA","age":"3 days ago","type":"Full-time","salaryMin":"$40,000 ","salaryMax":" $75,000 a year","jobDescriptionCopy":"Patients, Growers and Physicians rely on our analytical testing, information and services to help them make better decisions. These are often serious decisions with far reaching consequences, and require sensitivity, tact and a clear dedication to service. It's about providing clarity and hope.\n\n\nAs a team member you will work for the world leader in the industry, with a career where you can expand your skills and knowledge. You'll have a role where you can act with professionalism, you can inspire colleagues, and you can care about the work we do and the people we serve.\n\n\nAt KST, Our team members play an essential role in our success and in the services we provide. As a career, we offer a unique opportunity to develop your career with the #1 testing Lab in the US. We are tech driven, and we're creating the lab of the future - an environment where you can deliver cutting edge analytics and help us drive new discoveries and breakthroughs.\n\n\nBasic Purpose:\n\n\nThe Microbiologist position is a level I position for an individual with prior laboratory experience. The individual will perform routine and limited non-routine functions to aid in the preparation of and testing of samples.\n\n\nMUST'S:\n\n\nAbility to follow Instruction (If you are not exceptional at following instruction, this is not for you)\nAbility to travel / relocate as needed\nPass a full FBI background check\n\nDO NOT APPLY IF:\n\n\nYou can not follow instructions\nIf you are not willing to interview in person (We are not holding phone interviews at this time)\nAre not willing to relocate if needed (assistance will be provided)\n\nResponsibilities include, but are not limited to, the following:\n\n\nPrepare samples for analysis using various methods in accordance with ISO standard operating procedures.\nData handling and report preparation.\nEquipment familiarity preferred but not required (QPCR, LC-MS/MS)\nPerform various microbiological tests for MMJ products such as total plate count, yeast and mold count, ecoli, salmonella, etc.\nPerform various tests for pharmaceutical grade products such as Microbiological Examination of Non Sterile Products, Antimicrobial Effectiveness, Stability, Sterility Test, Environmental Monitoring, etc.\nWork in fast paced, dynamic environment.\nVisit client facilities to perform sampling.\nEvaluate data\n\nAn ideal candidate would possess:\n\n\nAt Minimum a B.S in Bio-Physics, Bio-Chemistry, Micro-Bio, or Chemistry\nAt least 2 years of laboratory experience in a relevant field\nCandidates with strong science backgrounds are encouraged to apply. Bio-Physics/ Chemistry/ Micro-Bio or General Lab experience is preferred.\nMust be fluent with Microsoft Office, specifically Excel and Word.\nFamiliarization with a wide range of analysis methods, sampling equipment and instrumentation a plus.\nSelf-motivated, responsible individual with good communication skills and willingness to learn and progress over time through consistent dedication and training. The position requires the individual to multi-task, be independent/self-sufficient, and be flexible and participate in a team environment.\nQuality Control experience.\nHigh attention to detail.\nAbility to work quickly and efficiently in a high pressure environment, while maintaining the highest level of quality.\nConscientious and responsible.\n\nWe Offer :\n\n\nOpportunity for fast growth and advancement\n\n\nJob Type: Full-time\n\n\nPay: $40,000.00 - $75,000.00 per year\n\n\nBenefits:\n\n\nDental insurance\nFlexible schedule\nHealth insurance\nHealth savings account\nPaid time off\nParental leave\nRelocation assistance\nVision insurance\n\nSchedule:\n\n\n8 hour shift\n\nSupplemental Pay:\n\n\nBonus pay\n\nWork Location: Multiple Locations\n","slug":"level-i-microbiologist-for-cannabis-lab-05083b6f-2b36-441d-a69e-34a710b5e9ac","benefits":["Health savings account","Dental insurance","Health insurance","Paid time off","Opportunities for advancement"],"selectedSkills":["Microsoft Excel","Laboratory experience","Communication skills","Quality control","Microsoft Office","Bachelor of Science","Bachelor's degree","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&job=66mbuTgvrwrUw805MKqbks6PtNF3peUNK4-MC_Lqb0VzTHVwtJD1nA"},{"position":"Laboratory Manager","labName":"Adept Life Sciences","location":"Chandler, AZ","age":"4 days ago","type":"Full-time","jobDescriptionCopy":"We're looking for a Laboratory Manager to start up our new state of the art specialized chemistry and microbiology testing solution for the Nutraceutical, Food & Beverage, and Cannabis industries. They will be responsible for the overall operation and administration of the laboratory, including the employment of personnel who are competent to perform test procedures, record and report test results promptly, accurately and proficiently, and for assuring compliance with the applicable regulations.\n\n\nThe ideal candidate will have experience with ISO: 17025, Method development, Performance Tracking, Executive Leadership, Project Management, Regulatory Compliance, Laboratory Design, Operations Management and be a highly motivated self-starter comfortable working independently and with a team.\n\n\nRequired Skills and Experience:\n\n\n· Familiar with the following instrumentation: HPLC/UPLC, LC-MS/MS, GC-FID, GC-MS/MS, ICP-MS, HTPLC,\n\n\n· Validation methods for the above testing.\n· Familiar with LIMS for implementation and data entry and database management Ability to read and interpret documents such as safety rules.\n\n\n· Ground-up development and implementation of lab's required SOPs.\n\n\n· Implementation, management, and monitoring of lab equipment for quality assurance.\n\n\n· Interview, hire and train initial workforce with the intent to conduct 500 samples per month\n· Write SOPs to ensure strict adherence to GLP standards to obtain ISO 17025:2017 accreditation.\n\n\n· Deliver a roadmap for Potency Testing (PT) to upper management to achieve ISO 17025:2017 for select analyses.\n\n\n· Experience working in a heavily regulated industry preferred; Accredited laboratory environment requires strict adherence to safety and Quality Assurance protocols.\n\n\n· Proficiency with Microsoft Office suite required\n\n\n· Background check required\n\n\n· Benefits: Vacation, Paid Sick Leave, Health Benefits, Paid Holidays,\n\n\nJob Type: Full-time\n\n\nPay: From $75,000.00 per year\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\n\nSchedule:\n\n\n8 hour shift\n\nApplication Question(s):\n\n\nWhat is your desired salary?\n\nEducation:\n\n\nBachelor's (Required)\n\nWork Location: One location\n","slug":"laboratory-manager-d5dfdbd2-3f9f-41ba-84a9-022852bd2db0","benefits":["Paid time off","Dental insurance","Paid sick time","Health insurance"],"selectedSkills":["Microsoft Office","Bachelor's degree","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=rNIibFKaeY9Jw5VSfhJH0VuRdgC5F7g8bnrsmWqLfvewAT4tQXbCPg"},{"position":"Post Harvest Manager","labName":"JARS Cannabis","location":"Kingman, AZ","age":"4 days ago","type":"Full-time","jobDescriptionCopy":"Mohave Farms LLC\n\n\nWe are looking for an experienced, well organized, and highly skilled Post-Harvest Manager to help blossom our cultivation efforts. This role is for self-starters, and those who are not fazed by a large challenge in front of them. Previous management experience, extensive knowledge of cannabis cultivation, and a strong work ethic are required, as is a ‘by any means possible’ attitude towards achieving goals set forth in front of them. Additionally, specialized experience in the post-harvest side of production is required, as is advanced knowledge of drying and curing techniques. Experience with large scale (50,000 square feet and more) cultivation operations preferred. If you check all these boxes and are excited about the prospect of growing a company with tremendous potential from its early inception stages, this role might be for you; please read on, below.\n\n\nJob Title: Post Harvest Manager\n\n\nRate: Salaried - $65,000/Year, DOE\n\n\nLocation: Kingman, Arizona\n\n\nHours: 50+ hours/week, available to work six days (if needed)\n\n\nReports to: General Manager\n\n\nOverview\n\n\nThe Post-Harvest Manager plays a vital role in ensuring that our flower is dried, cured, trimmed, and packaged to the highest degree. Months of hard work will all land on your plate, and the final steps of the process – drying and curing – will ultimately determine the quality of our flower. Careful and meticulous attention to detail is integral, as is ensuring proper moisture content, terpene preservation, trichome preservation, and overall bag appeal. The Post-Harvest Manager will coordinate directly with the Greenhouse Manager, and General Manager, to ensure that intakes of harvests are happening on schedule, and that flower is preserved at the highest quality possible. You must have careful attention to detail as it relates to environmental controls of the drying room, and constantly monitor, assess, and adjust to changes around you. A scientific, analytic, and constantly improving mindset should converge with years of personal experience and all lend itself to a Post-Harvest Manager who can successfully reward the operation with the fruits of all our collective labor.\n\n\nYou will be directly responsible for managing, planning, organizing, and executing the goals set forth by management to ensure the overall workflow, and success, of all post-harvest operations, from intake through to packaging. The Post-Harvest Manager will report directly to the General Manager, and together will create a plan of action to meet the goals of upper management.\n\n\nTo best succeed the Post-Harvest Manager should be the type of person who can work in high stress situations while maintaining grace and composure. You are the type of person who can effectively plan, organize, prioritize, lead, and execute a plan from start to finish. Each day will bring its own set of challenges and priorities, and those who can efficiently manage a team under them, solve problems proactively, and hit quotas will thrive in this role. A Post Harvest Manager should have the hard skills of managing a large-scale greenhouse cultivation operation, as well as the soft skills to lead and manage a team of workers under them. Those who are natural born leaders and who can simultaneously teach, motivate, and empower employees are best suited for this role.\n\n\nPersonnel Duties & Responsibilities\n\n\nResponsible for overseeing the day-to-day post-harvest activities and adjusting workflow and procedures to increase yields, efficiency, and overall performance. Oversee proper techniques related to drying and curing, bucking, and trimming, as well as packaging and storing\nLead and manage four supervisors under you, including the Drying Zone Supervisor, the Processing Zone Supervisor, the Trimming Zone Supervisor, and the Curing Zone Supervisor\nMaintain the cleanliness of the facility, ensuring the drying, curing, bucking, trimming, and packaging rooms are cleaned to the highest standards daily (cleanliness is next to godliness)\nEnsure that the optimal temperature, humidity, air movement, etc. are achieved in the drying and curing rooms, and that the environment is carefully monitored, recorded, and maintained on a constant basis.\nCreate an ongoing maintenance schedule to look after HVAC equipment needed in the drying, curing, and storage rooms as well as for other tools and machinery used in the post-harvest production process\nEnsure cultivars are bucked and trimmed according to each plants unique structure, and cater workflow and operation to make sure that we have the highest quality flower possible, period.\nCreate, maintain, and update SOPs as related to ongoing post-harvest efforts, and enforce strict adherence throughout the facility\nOrganize workflow to meet specifications and deadline required by upper management and the needs of our dispensaries. Develop daily, weekly, and monthly plans, and create reports with production completion forecasts, yields, loss, etc. for upper management\nEnsure proper labeling, tagging, and general traceability of plants including plants counts (both physically and in LeafLogix), as well as taking corrective measures to account for plant inventory discrepancies. Ensure strains, and batches, are accounted for and well organized, weights are taken, and all compliance, both AZDHS and in house, is followed\nCoordinate and schedule with state testing laboratories to ensure proper testing is done on a batch basis and that any remediation efforts, if at all needed, are taken. Testing should be organized in a way to minimize the time our product sits at our facility\nAssist with calculating production yields and have a continuous improvement mindset to incrementally get more efficient as we grow in operations\nMonitor stock of post-harvest supplies, equipment, infrastructure, etc. and work with the General Manager and/or Procurement Manager to order supplies, and to make sure we always have the tools needed on hand\nProvide job responsibility, HR management, and task management, as well as work directly with the General Manager on reporting\nAble to lead teams in a way that inspires organizational growth and empowers, nurtures, and cares for employees\nAvailable to work 50+ hours a week, six days per week if needed\n\nIn addition to the above general, and expanded, job descriptions, this position might include other possible work depending on the needs of the facility, taking into account the current workload. Other duties as assigned.\n\n\nJob Requirements & Qualifications\n\n\nMinimum of 21 years of age, must possess a valid drives license or state ID card, and is authorized to work in the U.S.\n\n\nIn addition to the above requirements, one must be able to:\n\n\n- Sit or stand while performing repetitive motions for long periods of time\n\n\n- Work at a fast pace for prolonged periods, with high, sustained energy\n\n\n- Be able to lift at least 45 pounds\n\n\n- Work in hot, sunny, environments for long periods of time\n\n\n- Pass state mandated (ADHS) background check\n\n\nCompensation\n\n\nThis is a salaried position starting at $65,000 per year, depending on experience. Performance reviews will be conducted six months after the date of hire, and any increases in pay and/or bonuses are subject to both the performance of the employee, as well as the overall success of the operations, and are under the discretion of management. In addition to the above, our company provides the option for dental, medical, and vision health insurance, as well as life insurance.\n\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n\nI understand this job description and know that violating any of the requirements is grounds for immediate termination. I also realize that these criteria will be used to assess my suitability for employment, promotions, and raises. All staff are at-will employees, and new hires will have a thirty day ‘trial’ period whereby performance will be evaluated after the first thirty days of employment and a decision to maintain or terminate employment will be decided after said trial period ends.\n\n\nNo cannabis, or other substance use (including, but not limited to, tobacco and alcohol) will be tolerated during work hours, or while on site at our premises. Any indication of use can and will be used as grounds for immediate termination.\n\n\nManagement reserves the right to increase, or decrease, hours based on performance or operational needs.\n\n\nJob Type: Full-time\n\n\nPay: From $65,000.00 per year\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nVision insurance\n\nSchedule:\n\n\n10 hour shift\n12 hour shift\n8 hour shift\n\nAbility to commute/relocate:\n\n\nKingman, AZ 86401: Reliably commute or planning to relocate before starting work (Preferred)\n\nWork Location: One location\n","slug":"post-harvest-manager-c316e893-181e-4ce9-842b-33d0d0d83264","benefits":["Dental insurance","Health insurance","Vision insurance","Life insurance"],"selectedSkills":["Management","21 years or older","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=VC5jO_xZkL66JrigrBWMybLPlIlehX27gctR_S2TxyynHVFEMkgtUg"},{"position":"Microbiologist","labName":"Green Leaf Lab","location":"Sacramento, CA","age":"3 days ago","type":"Full-time","salaryMin":"$25 an hour","jobDescriptionCopy":"THE COMPANY: Green Leaf Lab is the nation's first licensed and accredited cannabis analytical laboratory. We are a full-service, production oriented, cannabis and hemp laboratory using cutting-edge technology to characterize the chemical, physical, biological, and microbial properties of a wide range of samples submitted for regulatory compliance and operational purposes. We are team oriented and focused on excellent service. We are looking for a Microbiologist to join our team.\n\n\nJOB SUMMARY: The Microbiologist is a key collaborative member that supports Green Leaf Labs philosophy and organizational goals. This position will be responsible for running, troubleshooting, and analyzing cannabis and hemp samples for microbiological pathogens utilizing PCR, ELISA and Microscopy utilizing standardized and in-house methodology; writing and reviewing standard operating procedures (SOP’s); and performing basic and complex laboratory operations. This position will also assist with method development as required.\n\n\nESSENTIAL DUTIES/KEY RESPONSIBILITIES:\n\n\n· Responsible for the analysis of cannabis and hemp samples utilizing PCR.\n\n\n· Responsible for media preparation, data entry, reporting for microbiological samples.\n\n\n· Responsible for maintaining validated ISO 17025 standards of performance for microbiological testing.\n\n\n· Responsible for maintaining aseptic techniques in the laboratory.\n\n\n· Responsible for daily sample preparation and data analysis to ensure laboratory runs smoothly and meets required turnaround times.\n\n\n· Responsible for ensuring compliance with internal Standard Operating Procedures (SOPs) and quality systems.\n\n\n· Responsible for Developing procedures for documenting results from data collected.\n\n\n· Responsible for ensuring test equipment is clean, maintained and in good working order.\n\n\n· Responsible for maintaining a safe, clean, and sanitary work area.\n\n\n· Responsible for maintaining an accurate notebook, logbook, and other required documentation protocols.\n\n\n· Responsible for following all safety procedures and documents.\n\n\n· Responsible for ensuring high quality standards are met through performing calibrations, quality checks and proficiency programs.\n\n\n· Responsible for maintaining inventory tracking as required.\n\n\nQUALIFICATIONS:\n\n\n· Bachelor’s degree in biological, chemical, agricultural, environmental, or related sciences from an accredited college or university.\n\n\n· Minimum 2 years microbiological laboratory experience with hands on experience with instrument maintenance and troubleshooting.\n\n\n· Ability to perform effective pipette technique.\n\n\n· Experience with data analysis and Laboratory Information Management Systems (LIMS).\n\n\n· Experience with Problem solving with ability to see whole picture and impact to data.\n\n\n· Experience with method development and method optimization.\n\n\n· Experience importing, validating, and exporting electronic data in a variety of formats.\n\n\n· Experience monitoring consumable inventory and ordering supplies.\n\n\n· Experience with working under ISO 17025 Standard.\n\n\n· Excellent analytical skills and attention to detail.\n\n\n· Excellent leadership ability and interpersonal skills.\n\n\n· Excellent organizational and problem-solving skills.\n\n\n· Ability to formulate and clearly communicate ideas, both verbally and in writing.\n\n\n· Ability to work independently with little guidance, as well as provide support and training for others in a team environment.\n\n\n· Ability to adapt to a fast-changing work environment.\n\n\n· Ability to be flexible and change as business grows and changes.\n\n\n· Ability to work collaboratively as a team.\n\n\n· Ability to prioritize and meet deadlines.\n\n\n· Ability to stand for prolonged periods.\n\n\n· Ability to lift 40-60lbs.\n\n\n· Ability to pass a background check.\n\n\n· Knowledge of routine microbiological methods for the analysis of environmental, agricultural and food samples, including AOAC, FDA, BAM, ISO.\n\n\n· Proficiency with Microsoft Word, Excel, and Outlook.\n\n\n· Problem Solving, solution oriented and production driven.\n\n\nEDUCATION:\n\n\n· Bachelor’s degree in biological, chemical, agricultural, environmental, or related sciences from an accredited college or university.\n\n\nEXPERIENCE:\n\n\n· Microbiological laboratory: 2 years (Required)\n\n\nJOB TYPE: Full-time, Non-exempt.\n\n\nBENEFITS:\n\n\n· Dental insurance.\n\n\n· Health insurance.\n\n\n· Paid time off.\n\n\n· Vision insurance.\n\n\nSCHEDULE:\n\n\n· Tuesday-Saturday.\n\n\n· Additional evening and weekend work as needed.\n\n\nWORK LOCATION:\n\n\n· Sacramento.\n\n\nCOMPENSATION: $25 HR\n\n\nJob Type: Full-time\n\n\nPay: $25.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nWeekend availability\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nMicrobiological Laboratory: 2 years (Required)\n\nWork Location: One location\n","slug":"microbiologist-7a01d35c-7265-4b74-a3e9-ac7cee74432e","benefits":["Dental insurance","Health insurance","Paid time off","Vision insurance"],"selectedSkills":["Writing skills","Analysis skills","Microsoft Excel","Microsoft Outlook","Laboratory experience","Bachelor's degree","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=oCx8ScUbP1dyyp7ld65P9v0Kr9HyEeVl5wAEKtoXfCFggSPd2Wp5SA"},{"position":"Customer Support and Intake Specialist","labName":"Agricor","location":"Denver, CO","age":"3 days ago","type":"Full-time","salaryMin":"$18 an hour","jobDescriptionCopy":"Customer Support and Intake Specialist\n\n\nCompany Profile\n\n\nAgricor and our sister hemp testing lab, Botanacor, have joined forces with SC Laboratories, Inc. based in Santa Cruz, CA, to provide cannabis and hemp brands with access to the most comprehensive, industry-forward testing solutions in North America.\n\n\nThe combination brings together three of the longest standing and most respected cannabis and hemp testing organizations in the U.S. and forms the foundation of a national testing network. The combination will bring value to both the hemp and cannabis industries, ranging from access to a broader range of testing resources, improved data delivery, innovative science, instrument redundancy and increased testing capacity, and improved operations to accelerate turnaround times.\n\n\nAgricor is seeking a full time Customer Support and Intake Specialist to join the team.\n\n\nPosition Summary\n\n\nThe Customer Support and Intake Specialist’s primary responsibilities will include but are not limited to screening all persons prior to entry, greeting and checking-in qualified patients and caregivers, conducting the patient intake process, entering patient data and collaborating with Lab Analysts to work on getting what our customers need and want.\n\n\nSpecific Duties/Responsibilities:\n\n\nManage outstanding phone and in-person customer service skills.\nBe first point of contact for employees, patrons, visitors, deliveries, and inspectors\nReceive and inspect samples as they come into facility to ensure proper packaging, no leaks, damages, etc.\nDaily duties include opening packages from customers regularly and will be required to utilize proper PPE if necessary.\nBe able to follow proper intake processes on all samples in accordance with Standard Operating Procedures.\nWork closely with sales team to assist with any customer inquiries or questions.\nAnswer general and technical questions from customers involving due date of sample(s), status of sample(s) in testing, etc.\nMaintain sample storage in compliance with State law\nHelp to maintain a clean, safe, welcoming environment inside and outside the facility\nDaily duties require proficiency in Microsoft Word, Excel, internet; comfortable learning/using new software.\nComplete additional projects assigned by the Manager.\n\nQualifications and Required Experience:\n\n\nHigh school diploma or equivalent required; 2+ years post-secondary education in a related field preferred.\nMust have strong communications skills; excellent customer service skills; proficiency using Google applications including Drive and Docs; advanced knowledge of Microsoft Office applications and email.\nMust be able to communicate clearly, calmly and in a positive, helpful manner, adapt to a varied clientele, ability to multi task, prioritize and manage time effectively, ability to work in a fast-paced environment, ability to work well with others, ability to read, write, and speak English.\nOther Characteristics: Comfortable working in the cannabis industry.\nMust have 1-2 years of experience in a customer service role; client-service intensive industry (hospitality, retail, medical) preferred.\nRequires extended time standing, walking, bending and reaching.\n\nCompensation: $18 /HR\n\n\nAll employment offers will be contingent upon successful completion of a background check.\n\n\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.\n\n\nSC Laboratories provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.\n\n\nThis policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.\n\n\nJob Type: Full-time\n\n\nPay: $18.00 per hour\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\nDay shift\nMonday to Friday\n\nAbility to commute/relocate:\n\n\nDenver, CO 80223: Reliably commute or planning to relocate before starting work (Required)\n\nWork Location: One location\n","slug":"customer-support-and-intake-specialist-04a6ae11-5a09-421d-95c1-d5ca7c25f571","benefits":["Dental insurance","Health insurance","Paid time off","401(k)","Vision insurance"],"selectedSkills":["Customer service","Microsoft Excel","Google Docs","Microsoft Office","Microsoft Word","High school diploma or GED","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=znSnH-fK4QHG98BxGrQgu_Jz6wN9YW53Xl40OFu24yn-zH5rGlXABQ"},{"position":"Lab Technician - Cannabis Industry","labName":"Oklahoma","location":"Oklahoma City, OK","age":"7 days ago","type":"Full-time","salaryMin":"$35,000 ","salaryMax":" $47,000 a year","jobDescriptionCopy":"Job Title: Lab Technician\n\nReports To: Processing Manager\n\nDepartment: Processing\n\nFLSA Status: Non-Exempt\n\nSupervisory Responsibility: NA\n\nPosition Summary:\nThe Lab Tech will execute a variety of laboratory and manufacturing tasks under the direction and supervision of our Lab Director. The Lab Technician will be responsible for assisting in product processing and formulation. The Lab Technician completes tasks assigned by the Lab Manager to operate lab equipment, monitor and maintain cleanliness and efficiency, and drives quality control while always being compliant. This individual must be able to multitask, work quickly and efficiently, and be adaptable to changing priorities and tasks as needed.\n\nFurthermore, the successful candidate will be expected to interact with managers and supervisors to set manufacturing schedules and ensure proper execution of workflow tasks by other employees. We have a very fast- paced environment as we continue to grow and expand. The individual must be motivated, trustworthy, and able to operate both independently and within a team environment.\n\nEssential Functions:\nOperate laboratory, extraction, and manufacturing equipment\nFollow all company policies and procedures to ensure product integrity and quality control\nAssist with testing and calibrating lab equipment in preparation for specific tasks\nPerform quality control tests on ingredients, completed products, and product samples\nWork closely with logistics team to deliver the highest quality products, on-time, accurately, and compliantly\nMaintain accurate inventory of all products\nProvide feedback to Lab Director and fellow team members in support of our continuous improvement operating priority\nRecognize and report any issues, large or small\nPerform all tasks as directed by the Lab Director\n\nManufacturing\n\nResponsible for the preparation and execution of Cure s extraction and processing of product in accordance with the company s Standard Operating Procedures\nEnsures consistency and efficacy of product through close attention to detail\nPerform lab bench work and product filtrations\nAssist in packaging department as needed\nCreate distilled, high purity concentrate medical marijuana for use in a variety of products including vape, edibles, topicals, and tinctures\nExecute the preparation and production of extracted products\nExecute proper labeling and storage of extracted products\nComplete all orders for extracted products in an efficient and timely manner, meeting all necessary deadlines\nCoordinate equipment maintenance, purchases, and repairs with the Lab Director as needed\nExecute and enforce compliance of all local and state regulations\nFollow weekly schedules to ensure there is proper coverage based on the business needs\n\nFacility Cleaning\n\nPerform all assigned duties required to ensure a clean and safe production facility\nEnsure personal hygiene is acceptable under standards set by Cure before performing any production activities by washing hands, wearing a hair net, changing clothes\nComplete the sanitation of all production equipment and tools including workspace, lab equipment, containers, and appliances.\nMonitor, clean, and maintain all equipment and operate all equipment safely in its intended manner\nEnsure compliance at all times with all sanitation regulations and safety standards in the production of all products\nPerform duties as needed outlined in the daily, weekly, and monthly cleaning schedules\n\nRequirements\n\nPast experience in a highly regulated field producing pharmaceutical or nutraceutical products preferred\nEffective time-management skills and ability to multi-task\nAbility to work in a fast-paced, changing and challenging environment\nProficiency in windows-based software and Metrc experience a plus\n\nCompetencies:\nTechnically focused\nIntegrity and trust\nAttention to detail\nApproachability\nCommunication skills\n\nWorking Conditions:\nWhile performing the duties of this job, the employee is regularly required to perform grasping, talking, hearing, seeing and other repetitive motions.\n\nThe employee is frequently is required to stand for long periods of time, use hands for detailed work.\n\nSpecific vision abilities required by this job include close vision, distance vision, peripheral vision, depth perception and ability to adjust focus. This position requires the ability to occasionally lift products and supplies, up to 75 pounds (or more with assistance). Strong odors and varying room temperatures will occur on a daily basis. This position setting is in a general Lab setting.\n\nPosition Type/Expected Hours of Work\n\nThis is a full-time position, and hours of work and days will vary due to business needs. Some holidays and overtime maybe required.\n\nTravel\n\nNone.\n\nEEO\n\nOur organization does not discriminate against our employees or applicants because of race, color, religion, sex, pregnancy, national origin, ancestry, age, marital status, sexual orientation, veteran status, physical or mental disability, medical condition, or any other status or classification protected by applicable federal, state, and/or local laws. Equal employment opportunity will be extended to all persons in all aspects of the employer-associate relationships, including recruitment, hiring, advancement, compensation, benefits, training, promotion, transfer, discipline, layoff, recall and termination. Every reasonable accommodation will be made for qualified disabled employees/applicants.\n\nOther Duties\n\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.\n\nBy signing this job description, I acknowledge that I am able to perform the scope of duties listed with or without reasonable accommodation.","slug":"lab-technician-cannabis-industry-d143ccd2-6dbd-42b6-b601-d94c8b7180fe","benefits":[],"selectedSkills":["Communication skills","Windows","Time management"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=QUgM6MJEX1QQnkPDKK2dOQeuZfKRnOZLG6UvQfur6efidpaLfu9vhQ"},{"position":"Chemist","labName":"SafeTiva Labs","location":"Westfield, MA","age":"6 days ago","type":"Full-time","jobDescriptionCopy":"Position: Chemist\n\n\nSafeTiva Labs is looking for an experienced chemist to join the lab team and perform cannabis testing operations.\n\n\nCompany Overview\n\n\nSafeTiva Labs is an analytical testing and research laboratory comprised of dedicated scientists working on cutting-edge analysis methods. SafeTiva follows Cannabis Control Commission regulations, ISO 17025 standards, and maintains high ethical standards. Joining our team means being part of an exciting start-up culture on the front lines of the fast-paced cannabis industry. Our team prides itself on maintaining a collaborative environment where each member is valued. We are a small group of talented people who are driven and dedicated to science, innovation, and work ethic. Our team is our most important asset and we aim to create an environment that makes employees love coming to work. This is an opportunity to join a growing company and help define what makes it great!\n\n\nDetailed Responsibilities:\n\n\n· Analyze samples for cannabinoids, heavy metals, pesticides, residual solvents, mycotoxins, and terpenes using HPLC, GC-MS, LC-MS, and ICP-MS\n\n\n· Perform cannabis sample preparation and destruction as needed\n\n\n· Follow laboratory policies and SOPs, state regulations, and ISO-17025 quality management system\n\n\n· Review, record, and organize data in the LIMS\n\n\n· Maintain lab equipment in good operating condition and troubleshoot malfunctions as needed\n\n\n· Identify and improve workflow efficiencies\n\n\n· Maintain familiarity with all analytical protocols and be able to train new technicians\n\n\n· Prepare chemical solutions and various tasks to keep the laboratory clean and functioning\n\n\n· Evaluate system performance and perform proficiency testing\n\n\n· Monitor inventory levels and order supplies\n\n\n· Perform related duties as assigned\n\n\n· Will report to Lab Director\n\n\nSkills and Competencies\n\n\n· Strong aptitude for instrument operation and maintenance for HPLC, GC-MS, LC-MS, and ICP-MS\n\n\n· Attention to detail while performing repetitive tasks\n\n\n· Efficient workload management and able to oversee high throughput testing when samples are arriving at varying times\n\n\n· Enthusiastic team player with ability to work independently\n\n\n· Able to multitask in a fast-paced, ever-changing environment\n\n\n· Effective oral and written communicator\n\n\n· Strong work ethic\n\n\n· Maintain the highest standards of personal, professional, and ethical conduct\n\n\n· Support SafeTiva’s goals for a diverse and culturally aware workforce\n\n\n· Strong computer and data management skills, with preference for MS Office and LIMS programs\n\n\n· Experience with Chromeloen, Qtegra, and METRC is a plus.\n\n\nEducation and Experience\n\n\n· Bachelor’s Degree in chemistry or related sciences\n\n\n· 1-3 years of experience working in a testing laboratory, with cannabis experience preferred\n\n\n· ISO-17025 experience preferred\n\n\nRequirements\n\n\nAt least 21 years of age\nAble to pass a background check, drug test, and must not have been convicted of an excluded felony offense as defined in 105 CRM 725.030\nAble to perform grasping, talking, hearing, seeing and repetitive motions\n8 hour shift, days and times may change and occasional night and weekend work may be required\n\nBenefits:\n\n\nCompensation will be commensurate with experience and skillset, and structured with incentives for meeting outlined goals\n\n\nSafeTiva is pleased to offer a comprehensive benefits package.\n\n\nSafeTiva Labs celebrates diversity and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, gender, gender identity or expression, religion, sexual orientation, national origin, disability, age, or veteran status.\n\n\nJob Type: Full-time\n\n\nPay: From $47,000.00 per year\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nPaid time off\n\nSchedule:\n\n\n8 hour shift\n\nCOVID-19 considerations:\nAll employees are required to be fully vaccinated for Covid-19.\n\n\nExperience:\n\n\nLaboratory experience: 1 year (Preferred)\n\nWork Location: One location\n","slug":"chemist-9b141bd5-1b30-4a20-a4d0-825d92f2ac2b","benefits":["Health insurance","401(k) matching","Paid time off","401(k)"],"selectedSkills":["Computer skills","Laboratory experience","Communication skills","Data management","Microsoft Office","Bachelor's degree","Pass drug screening","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=MHnUEZwIj1wGI0XwcwhQuUyYIcggVi4dJ8owXG4oekyA8cBgeiqB-g"},{"position":"Chemist II","labName":"Green Leaf Lab","location":"Portland, OR","age":"3 days ago","type":"Full-time","salaryMin":"$22.50 an hour","jobDescriptionCopy":"THE COMPANY: Green Leaf Lab is the nation's first licensed and accredited cannabis analytical laboratory. We are a full-service, production oriented, cannabis and hemp laboratory using cutting-edge technology to characterize the chemical, physical, biological, and microbial properties of a wide range of samples submitted for regulatory compliance and operational purposes. We are team oriented and focused on excellent service. We are looking for a Chemist II to join our team.\n\n\nJOB SUMMARY: The Chemist II is a key collaborative member that supports Green Leaf Labs philosophy and organizational goals. This position will be responsible for running, troubleshooting and analyzing samples with a GC, GCMS, LCMSMS, HPLC and/or ICPMS system utilizing standardized and in-house lab methodology; writing and reviewing standard operating procedures (SOP’s); and performing basic and complex laboratory operations including sampling, chromatographic and material assays. This position will also assist with method development as required.\n\n\nESSENTIAL DUTIES/KEY RESPONSIBILITIES:\n\n\n· Responsible for the setup, running and troubleshooting of GC (GCMS, GCMSMS etc.), LCMSMS, HPLC systems.\n\n\n· Responsible for maintaining validated NELAC TNI 2016 and ISO 17025 standards of performance for analytical chemical testing.\n\n\n· Responsible for daily sample preparation and data analysis to ensure laboratory runs smoothly and meets required turnaround times.\n\n\n· Responsible for ensuring compliance with internal Standard Operating Procedures (SOPs) and quality systems.\n\n\n· Responsible for Developing procedures for documenting results from data collected.\n\n\n· Responsible for ensuring test equipment is clean, maintained and in good working order.\n\n\n· Responsible for maintaining a safe, clean and sanitary work area.\n\n\n· Responsible for maintaining an accurate notebook, logbook and other required documentation protocols.\n\n\n· Responsible for following all safety procedures and documents.\n\n\n· Responsible for ensuring high quality standard are met through performing calibrations, quality checks and proficiency programs.\n\n\n· Responsible for maintaining inventory tracking as required.\n\n\nQUALIFICATIONS:\n\n\n· Bachelor’s degree in biological, chemical, agricultural, environmental, or related sciences from an accredited college or university.\n\n\n· Minimum 2 years analytical laboratory experience with hands on experience with instrument maintenance and troubleshooting.\n\n\n· Experience with data analysis and Laboratory Information Management Systems (LIMS).\n\n\n· Experience with the following instrumentation: HPLC, GCMS, LC-MS/MS, GC-MS/MS, ICP\n\n\n· Experience with Problem solving with ability to see whole picture and impact to data.\n\n\n· Experience with method development and method optimization.\n\n\n· Experience importing, validating, and exporting electronic data in a variety of formats.\n\n\n· Experience monitoring consumable inventory and ordering supplies.\n\n\n· Experience with working under NELAC TNI 2016 and ISO 17025 Standard.\n\n\n· Excellent analytical skills and attention to detail.\n\n\n· Excellent leadership ability and interpersonal skills.\n\n\n· Excellent organizational and problem-solving skills.\n\n\n· Ability to formulate and clearly communicate ideas, both verbally and in writing.\n\n\n· Ability to work independently with little guidance, as well as provide support and training for others in a team environment.\n\n\n· Ability to adapt to a fast-changing work environment.\n\n\n· Ability to be flexible and change as business grows and changes.\n\n\n· Ability to work collaboratively as a team.\n\n\n· Ability to prioritize and meet deadlines.\n\n\n· Ability to stand for long periods.\n\n\n· Ability to lift 40-60lbs.\n\n\n· Ability to pass a background check.\n\n\n· Proficiency with Microsoft Word, Excel and Outlook.\n\n\n· Problem Solving, solution oriented and production driven.\n\n\nEDUCATION:\n\n\n· Bachelor’s degree in biological, chemical, agricultural, environmental, or related sciences from an accredited college or university.\n\n\nEXPERIENCE:\n\n\n· Analytical laboratory: 2 years (Required)\n\n\nJOB TYPE: Full-time, Non-exempt.\n\n\nBENEFITS:\n\n\n· Dental insurance.\n\n\n· Health insurance.\n\n\n· Paid time off.\n\n\n· Vision insurance.\n\n\nSCHEDULE:\n\n\n· Tuesday-Saturday.\n\n\n· Additional evening and weekend work as needed.\n\n\nWORK LOCATION:\n\n\n· Portland\n\n\nCOMPENSATION: $22.50 HR\n\n\nJob Type: Full-time\n\n\nPay: $22.50 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nWeekend availability\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nAnalytical Laboratory: 2 years (Preferred)\n\nWork Location: One location\n","slug":"chemist-ii-b0348b72-66d6-4f70-8424-04c0acbc1935","benefits":["Dental insurance","Health insurance","Paid time off","Vision insurance"],"selectedSkills":["Writing skills","Analysis skills","Microsoft Excel","High-performance liquid chromatography","Microsoft Outlook","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=qp1AoGL-CnaLYi9qlDellcRJeUtJ5dyUQ5QMIk2xRjAzvo5cxnvVgA"},{"position":"Isolation (Crystallization) Supervisor","labName":"Cannvital, LLC","location":"Las Vegas, NV","age":"6 days ago","type":"Full-time","salaryMin":"$50,000 a year","jobDescriptionCopy":"Isolation Chemist Supervisor- Pharmaceutical (on-site) \n\n\nJob Location:  Las Vegas NV (on-site only) \n\n\nCannvital NV LLC is a global hemp-based CBD extraction and refinement company with its headquarters and production facility located in Las Vegas, NV. Cannvital is seeking several Isolation Supervisor to bring on to our expanding team. \n\n\nCannvital is looking to fill a position for our production team. The preferred candidate will have had at least 1 year of experience with cannabis or hemp extraction within a professional and/or commercial environment and familiar with current cannabis and hemp extraction techniques. Personality, skillset, and professionalism all play a large part in our selection. You will be joining a small, multi-tasked, tight-knit team that operates in close quarters. \n\n\nReliable transportation to and from the facility. \n\n\nJob Duties include but are not limited to:  \n\n\n- Preparing equipment and distillate for isolation (crystallization). \n\n\n- Operating Isolation equipment \n\n\n- Work with the Production Manager to facilitate optimum production and to meet facility sales demands and forecasts \n\n\n- Regular cleaning and maintenance of lab equipment and facility. \n\n\n- Weigh extract, prepare samples and precipitation for isolation and testing. \n\n\n- Promote programs and automation to produce in a cost-effective manner, employing economy while maintaining an acceptable level of quality \n\n\n- Inventory and record keeping of lab equipment. Maintain inventory records of supplies, materials, and temperatures of machinery. \n\n\n- Assist laboratory and equipment cleanup. Wash and sterilize lab surfaces and glassware. \n\n\n- General routine maintenance on lab equipment. Troubleshooting, preventative maintenance and regular data logging. \n\n\n- Maintain and log all data sheets for chemicals and products. \n\n\n- Assure 100 % legal compliance with all applicable laws and regulations regarding packaging, processing and inventory-tracking procedures \n\n\n \n\n\nApplicant must be able to stand for long periods of time, lift up to 50 lbs, bend, stoop, and have full physical range of motion in order to perform this job. \n\n\nExperience:\n\n\n2+ years experience in a professional or commercial lab space  \n2+ Years operating a Reactor System\n1+ Years Operating a Wiped Film Evaporator\n\nEducation: High school or above or equivalent  \n\n\nJob Type: Full Time \n\n\nCompensation: TBD (based on Experience) \n\n\nWork Location: Las Vegas Nevada\n\n\nJob Type: Full-time\n\n\nPay: $50,000.00 per year\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nRelocation assistance\nVision insurance\n\nSchedule:\n\n\n8 hour shift\n\nLicense/Certification:\n\n\nDriver's License (Preferred)\n\nWork Location: One location\n","slug":"isolation-crystallization-supervisor-c5b10974-ecb7-429f-9bb8-13e65c601b7c","benefits":["Paid time off","Dental insurance","Health insurance","Vision insurance","Relocation assistance"],"selectedSkills":["Laboratory experience","Driver's License","High school diploma or GED","Reliable transportation"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=oXtGULLHQNj6TC4M4LGNy-8z0Jsxfrz8BQ0vPsiNaWIFJ7XI-1SXyQ"},{"position":"Scientist 1","labName":"Green Leaf Lab","location":"Sacramento, CA","age":"4 days ago","type":"Full-time","salaryMin":"$25 an hour","jobDescriptionCopy":"THE COMPANY: Green Leaf Lab is the nation's first licensed and accredited cannabis analytical laboratory. We are a full-service, production oriented, cannabis and hemp laboratory using cutting-edge technology to characterize the chemical, physical, biological, and microbial properties of a wide range of samples submitted for regulatory compliance and operational purposes. We are team oriented and focused on excellent service. We are looking for a Scientist 1 to join our team.\n\n\nJOB SUMMARY:  The California Scientist 1 is a key collaborative member that supports Green Leaf Labs philosophy and organizational goals. This position will be responsible for running, troubleshooting and analyzing samples with a GC, GCMS, LCMSMS, HPLC, and/or ICP system utilizing standardized and in-house lab methodology; writing and reviewing standard operating procedures (SOP’s); and performing basic and complex laboratory operations including sampling, chromatographic and material assays. This position will also assist with method development as required.\n\n\nESSENTIAL DUTIES/KEY RESPONSIBILITIES:\n\n\n· Responsible for the setup, running and troubleshooting of GC (GCMS, GCMSMS etc.), LCMSMS and ICP systems.\n\n\n· Responsible for maintaining validated ISO 17025 standards of performance for analytical chemical testing.\n\n\n· Responsible for daily sample preparation and data analysis to ensure laboratory runs smoothly and meets required turnaround times.\n\n\n· Responsible for ensuring compliance with internal Standard Operating Procedures (SOPs) and quality systems.\n\n\n· Responsible for Developing procedures for documenting results from data collected.\n\n\n· Responsible for ensuring test equipment is clean, maintained and in good working order.\n\n\n· Responsible for maintaining a safe, clean and sanitary work area.\n\n\n· Responsible for maintaining an accurate notebook, logbook and other required documentation protocols.\n\n\n· Responsible for following all safety procedures and documents.\n\n\n· Responsible for ensuring high quality standard are met through performing calibrations, quality checks and proficiency programs.\n\n\n· Responsible for maintaining inventory tracking as required.\n\n\nQUALIFICATIONS:\n\n\n· Bachelor’s degree in biological, chemical, agricultural, environmental, or related sciences from an accredited college or university.\n\n\n· Minimum 2 years analytical laboratory experience with hands on experience with instrument maintenance and troubleshooting.\n\n\n· Experience with data analysis and Laboratory Information Management Systems (LIMS).\n\n\n· Experience with the following instrumentation: HPLC, GCMS, LC-MS/MS, GC-MS/MS, ICP\n\n\n· Experience with Problem solving with ability to see whole picture and impact to data.\n\n\n· Experience with method development and method optimization.\n\n\n· Experience importing, validating, and exporting electronic data in a variety of formats.\n\n\n· Experience monitoring consumable inventory and ordering supplies.\n\n\n· Experience with working under ISO 17025 Standard.\n\n\n· Excellent analytical skills and attention to detail.\n\n\n· Excellent leadership ability and interpersonal skills.\n\n\n· Excellent organizational and problem-solving skills.\n\n\n· Ability to formulate and clearly communicate ideas, both verbally and in writing.\n\n\n· Ability to work independently with little guidance, as well as provide support and training for others in a team environment.\n\n\n· Ability to adapt to a fast-changing work environment.\n\n\n· Ability to be flexible and change as business grows and changes.\n\n\n· Ability to work collaboratively as a team.\n\n\n· Ability to prioritize and meet deadlines.\n\n\n· Ability to stand for long periods.\n\n\n· Ability to lift 40-60lbs.\n\n\n· Ability to pass a background check.\n\n\n· Proficiency with Microsoft Word, Excel and Outlook.\n\n\n· Problem Solving, solution oriented and production driven.\n\n\nEDUCATION:\n\n\n· Bachelor’s degree in biological, chemical, agricultural, environmental, or related sciences from an accredited college or university.\n\n\nEXPERIENCE:\n\n\n· Analytical laboratory: 2 years (Required)\n\n\nJOB TYPE: Full-time, Non-exempt.\n\n\nBENEFITS:\n\n\n· Dental insurance.\n\n\n· Health insurance.\n\n\n· Paid time off.\n\n\n· Vision insurance.\n\n\nSCHEDULE:\n\n\n· Tuesday-Saturday.\n\n\n· Additional evening and weekend work as needed.\n\n\nWORK LOCATION:\n\n\n· Sacramento.\n\n\nCOMPENSATION: $25 HR\n\n\nJob Type: Full-time\n\n\nPay: $25.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nWeekend availability\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nAnalytical Laboratory: 2 years (Required)\ndata analysis: 2 years (Preferred)\nLaboratory Intake Management System: 2 years (Preferred)\n\nWork Location: One location\n","slug":"scientist-1-5413f5c8-96a9-4e5c-8d95-21cf6b107746","benefits":["Dental insurance","Health insurance","Paid time off","Vision insurance"],"selectedSkills":["Writing skills","Analysis skills","Microsoft Excel","High-performance liquid chromatography","Microsoft Outlook","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=M8Tb4WrtUoMOXvnHcDK3c41Pzt4o1oD_QMvDkwwAXFwKnE_dUJn1jA"},{"position":"Cannabis Lab Formulation Tech","labName":"Abstrax Tech, Inc.","location":"Long Beach, CA","age":"2 days ago","type":"Full-time","jobDescriptionCopy":"JOB SUMMARY\n\n\nThe Formulation Tech is responsible for the blending of weighed raw materials to make a finished product with the highest quality and done in a timely manner. This position will work in conjunction with other departments, such as Operations and R&D to ensure we process and execute all orders in timely fashion. Duties include weighing microgram to kilograms quantities of individual raw materials, calibrating equipment, following safety policies and procedures, operating milling equipment, performing sterile filtration, and any other tasks required to complete cell culture media manufacturing.\n\n\nCOMPLIANCE\n\n\nAssure that operation adheres to all business and industry license requirements\nMaintain strict inventory records of all plant materials, chemicals, and equipment used in the laboratory and documents production by completing forms, reports, logs, and records\n\nESSENTIAL FUNCTIONS\n\n\nDuties may include, but are not limited to:\n\n\nAssist with creating and reviewing production schedule\nDocument formulation specifications and calculate requirements\nAssemble and accurately weigh materials and supplies\nConduct QA/QC analytical testing for quality, consistency, and data review\nOperate highly sophisticated equipment and process concentrates\nFollow all SOP's and enter data into systems daily\nWork with Operations Managers to maintain proper inventory levels\nClean and maintain equipment and laboratory facility following current good manufacturing practices (cGMP) and standard operating procedures; comply with legal regulations and monitor environment\nPerforms cleaning, inspection, calibration and assists in the maintenance of equipment: pumps, balances, centrifuges, and other laboratory equipment\nMaintain inventory records of supplies, materials, and equipment\nMaintain and stock supplies and equipment, dispose of waste according to guidelines, and keep laboratory, storerooms, and working areas immaculate\nWash and sterilize laboratory glassware\nHelp create SOPs, training records, and related documentation\nWork with packaging team to help meet deadlines when necessary\nMaintain material safety data sheets for all department chemicals and products\nEnsures weights, measures and raw materials are managed appropriately to assure batches manufactured contain proper ingredients and quantities\nMaintain a log of raw isolate inventory\nEnsure weights, measures and raw materials are managed appropriately to assure batches manufactured contain proper ingredients and quantities\nMixing/blending of isolates to make a finished product with tight error margins\nAdjust machine settings to ensure that the product quality will be within specifications\nMolecularly distill terpenes to further increase purity\nCheck the purity of molecularly distilled terpenes via GC-FID\nContinuously inspect product quality and make sure that all products being packed is within the company’s standard. Reports product deviation greater than 0.5% to supervisor for corrective action\nSanitation of equipment and removal of all leftover flavor/fragrance isolates\nPractice Good manufacturing and Housekeeping\nMaintain a safe work environment\nReview completed production documentation (batch records, logbooks, etc.) for quality and compliance\nMaintain records and a clean environment to comply with regulatory requirements\nPrepare batches for following shifts\nWork cooperatively with co-workers and Supervisors\nMaintain regular and punctual attendance at work\n\nADDITIONAL QUALIFICATIONS\n\n\nMinimum Formulation experience\n3-5 years of laboratory or manufacturing experience\nEquivalent combination of education, training, and relevant work experience maybe considered\nAcumatica ERP systems knowledge or similar\ncGMP and ISO experience required\nDeep knowledge of production management\nBasic math skills and mechanical aptitude\nStrong attention to detail and accuracy\nGood verbal and written communication skills\n\nEDUCATIONAL REQUIREMENTS\n\n\nBS in Chemistry, Biochemistry, Analytical Chemistry, or related field/equivalent work preferred\n1+ years Formulation or related experience\n\nADDITIONAL REQUIREMENTS\n\n\nUS work authorization (Required)\nSuccessfully complete a background check\n\nJob Type: Full-time\n\n\nPay: From $20.00 per hour\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\nNight shift\nWeekend availability\n\nCOVID-19 considerations:\nWe comply with guidelines provided by the CDC, CDPH, and Cal OSHA.\n\n\nAbility to commute/relocate:\n\n\nLong Beach, CA 90813: Reliably commute or planning to relocate before starting work (Required)\n\nApplication Question(s):\n\n\nPlease share one interesting or fun fact about yourself.\n\nEducation:\n\n\nBachelor's (Preferred)\n\nExperience:\n\n\nLaboratory: 1 year (Preferred)\nCannabis Industry: 1 year (Preferred)\n\nWork Location: One location\n","slug":"cannabis-lab-formulation-tech-6da6e2cf-227d-4419-af14-e29c9022424a","benefits":["Dental insurance","Health insurance","Paid time off","401(k)","Vision insurance"],"selectedSkills":["Manufacturing","Basic math","CGMP","Mechanical knowledge","Production management","Bachelor of Science","Bachelor's degree","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=6UFf_6pHHU1JNeRsQWvM5FCvuca3K8MCGBhjOSQwQpwTlv9Rp6FceA"},{"position":"Microbiologist","labName":"Greenleaf Labs","location":"Poteau, OK","age":"3 days ago","type":"Full-time","jobDescriptionCopy":"Strong leadership, troubleshooting instrumentation, work with vendors, take direction from management, be organized and prepared, understand and meet timelines. Data management reporting and ability to follow standard operating procedures a must. Chemical extraction, sample preparation and analysis for cannabis using qPCR. Willingness to follow internal quality system requirements. Ensuring SOP's are written or up-to-date for laboratory processes. Familiar with Oklahoma State regulation for cannabis a plus. Implements and maintains appropriate quality control processes and procedures to guarantee accuracy of analysis and quality of results. Performs review of reported data and associated quality control and preparing reports for delivery to client. Responsibilities may include general instrument troubleshooting. Responsible for ensuring that inventory is properly maintained and ordered on time to meet production demands.\n\n\nMust have laboratory experience and be familiar with ISO 17025 requirements. Must have a history of working in a laboratory and an understanding of meeting deadlines. Must understand calculating workflow, turnaround times, and streamlined approaches. Must be able to prioritize and multi-task. MUST HAVE: Minimum Bachelor's Degree applicable to a laboratory testing environment, with a minimum of two (2) years of experience.\n\n\nJob Type: Full-time\n\n\nPay: From $54,000.00 per year\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\n\nSupplemental Pay:\n\n\nBonus pay\n\nWork Location: One location\n","slug":"microbiologist-62a20140-4281-4beb-bc11-6348be7f0d15","benefits":["Paid time off","Dental insurance","Health insurance","Vision insurance"],"selectedSkills":["Laboratory experience","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=JxhzUgXsriBzTdsm1ZCMPn-9oGj8CZ0TTf4LXlhWvPz29Nzu6gpS6Q"},{"position":"Quality Assurance Lead","labName":"Cannabis Testing Lab","location":"Sylmar, CA","age":"3 days ago","type":"Full-time","salaryMin":"$55,000 ","salaryMax":" $75,000 a year","jobDescriptionCopy":"Job Description\n\n\nThe Quality Assurance Lead develops, implements, and coordinates the company’s quality assurance program in accordance with ISO17025 guidelines and the California Department of Cannabis Control regulations.\n\n\nJob Duties\n\n\nJob duties and responsibilities will include, but not be limited to:\n\n\nResponsible for integrity of the quality management system\nManage CAPA system\nImprove upon the QA management system and ensure adherence with ISO17025 requirements and California Department of Cannabis Control regulations\nWork with outside auditors to renew annual ISO17025 accreditation\nMaintain staff training records\nEnsure laboratory logs are up to date\nAudit data packages and ensure they are completed in a timely manner\nDevelop and manage quality measurements for performance improvement\nConduct annual internal audit of laboratory\nRespond to outside audits via email and participate in on-site audits\nPrepare monthly quality reports for Laboratory Director\nManage the proficiency testing system\nUpdate company SOPs\nOther duties as assigned\n\nPreferred qualifications\n\n\nBachelor’s degree or advanced degree in chemistry, biology, or engineering\nExperience in an ISO17025 accredited testing laboratory, preferably a cannabis testing laboratory\nExperience in a quality assurance role\nAudit experience\nStrong verbal and written communications skills\nExperience with Microsoft Office Suite, including Excel and Word\nExperience with LIMS systems and Quality Management software\n\nJob Type: Full-time\n\n\nPay: $55,000.00 - $75,000.00 per year\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nVision insurance\n\nSchedule:\n\n\n8 hour shift\n\nAbility to commute/relocate:\n\n\nSylmar, CA 91342: Reliably commute or planning to relocate before starting work (Required)\n\nExperience:\n\n\nAuditing: 1 year (Preferred)\nISO 17025: 1 year (Preferred)\n\nWork Location: One location\n","slug":"quality-assurance-lead-c7626617-3554-4bb0-ae93-777301640640","benefits":["Dental insurance","Health insurance","Vision insurance"],"selectedSkills":["Quality management","Microsoft Excel","Laboratory information management systems","Laboratory experience","Quality assurance","Bachelor's degree","US work authorization"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=lHIpWCsjjlYO0UHQ2eWh-NXlD0B6KbWJSLLcjxPE87BNtXt-qRGbug"},{"position":"Analytical Chemist","labName":"US Cannabis Laboratories, Inc.","location":"Needles, CA","age":"4 days ago","type":"Full-time","salaryMin":"$60,000 a year","jobDescriptionCopy":"About us\n\n\nUS Cannabis Laboratories, Inc. is a start up company. We are in process of validation and will provide training. Our goal is to Provide honest cannabis testing results .\n\n\nOur work environment includes:\n\n\nFlexible working hours\nLively atmosphere\nRelaxed atmosphere\nResponsible for ensuring that the laboratory achieves and maintains a laboratory quality assurance program as required by state regulations.\nEnsures ISO 17025 practices are followed at all times.\nManages multiple analytical projects related to the development, qualification and/or troubleshooting of sensitive, efficient, and reliable assays for a wide class of molecules simultaneously.\nPrepares, reviews, and edits method transfer, qualification, and validation protocols, analytical technical reports, and regulatory documentation.\nMaintains equipment and instruments in good operating condition, recognizes any malfunctions and troubleshoots as needed.\nEnsures compliance with all regulatory agency requirements through documentation, audits, and corrective action.\nParticipates in the development of new SOPs, new validations tests.\nPerforms quality control procedures to ensure accuracy of clinical data.\nParticipates in the updating of departmental standard operating procedures and databases to accurately reflect the current practices in the laboratory.\n\nJob Qualifications & Requirements: Knowledge/Skills/Abilities\n\n\nHands-on experience with analytical instruments used in cannabis labs, HPLC, LC-MS, GC, GCMS & ICP-MS & common laboratory equipment.\nExperience in a certified lab and regulated environment, including such things as GLP/GMP, ISO 17025, state or federally licensed laboratories. Examples:\n\no Certified cannabis testing\no Pharmaceutical\no Food chemistry, food testing o Environmental\n\n\nExtensive knowledge and experience with qualitative and quantitative analytical chemistry techniques and principles.\nExperience in following and explaining methods, SOPs, operating principles.\nExperience with preparation of standards, solutions, use of specialty chemicals.\nSkilled at analytical technique troubleshooting.\nLaboratory and instrument maintenance.\n\nCompetencies\n\n\nDemonstrates strong leadership abilities and excellent interpersonal skills.\nSuperior oral and written communication skills.\nExcellent critical thinking skills and detail-oriented.\nMust be flexible and adaptable to shifting priorities.\nProficiency with Microsoft Word, Excel and Outlook.\nProven organizational and problem-solving abilities.\nAbility to work independently and with little guidance.\nAble to stand for long periods of time.\n\nEducation/Experience\n\n\nThe Analytical Chemist must have, at a minimum, a master’s or a bachelor’s degree in biological, chemical, agricultural, environmental or related sciences from an accredited college or university, plus at least two years of full-time practical analytical laboratory experience.\nMust complete a background check. New hires will be subject to a 9-month probationary period with evaluations conducted every 90 days to monitor performance and suitability for continued employment. Training on how to operate laboratory instruments will be conducted at the start of employment.\n\n\nJob Type: Full-time\n\n\nPay: $60,000.00 per year\n\n\nSchedule:\n\n\nMonday to Friday\n\nWork Location: One location\n","slug":"analytical-chemist-210f11bb-b3ec-4a9b-bfaa-c3f56027abdf","benefits":["Flexible schedule"],"selectedSkills":["Microsoft Excel","Microsoft Outlook","Laboratory experience","Communication skills","Analytical chemistry","Bachelor's degree","Master's degree","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=k0wxk5-cdY7r9t9BHbhvVyOkSAH6zkOYTE4nfN-S3M5Q39vlxeASLA"},{"position":"Distillation Supervisor","labName":"Cannvital, LLC","location":"Las Vegas, NV","age":"6 days ago","type":"Full-time","salaryMin":"$50,000 a year","jobDescriptionCopy":"Distillation Chemist Supervisor- Pharmaceutical (on-site) \n\n\nJob Location:  Las Vegas NV (on-site only) \n\n\nCannvital NV LLC is a global hemp-based CBD extraction and refinement company with its headquarters and production facility located in Las Vegas, NV. Cannvital is seeking several Distillation Supervisor to bring on to our expanding team. \n\n\nCannvital is looking to fill a position for our production team. The preferred candidate will have had at least 1 year of experience with cannabis or hemp extraction within a professional and/or commercial environment and familiar with current cannabis and hemp extraction techniques. Personality, skillset, and professionalism all play a large part in our selection. You will be joining a small, tight-knit team that operates in close quarters. \n\n\nReliable transportation to and from the facility. \n\n\nJob Duties include but are not limited to:  \n\n\n- Preparing equipment and crude oil for distillation. \n\n\n- Operating Distillation equipment \n\n\n- Work with the Production Manager to facilitate optimum production and to meet facility sales demands and forecasts \n\n\n- Regular cleaning and maintenance of lab equipment and facility. \n\n\n- Weigh extract, prepare samples and precipitation for isolation and testing. \n\n\n- Promote programs and automation to produce in a cost-effective manner, employing economy while maintaining an acceptable level of quality \n\n\n- Inventory and record keeping of lab equipment. Maintain inventory records of supplies, materials, and temperatures of machinery. \n\n\n- Assist laboratory and equipment cleanup. Wash and sterilize lab surfaces and glassware. \n\n\n- General routine maintenance on lab equipment. Troubleshooting, preventative maintenance and regular data logging. \n\n\n- Maintain and log all data sheets for chemicals and products. \n\n\n- Assure 100 % legal compliance with all applicable laws and regulations regarding packaging, processing and inventory-tracking procedures \n\n\n \n\n\nApplicant must be able to stand for long periods of time, lift up to 50 lbs, bend, stoop, and have full physical range of motion in order to perform this job. \n\n\nExperience:\n\n\n2+ years experience in a professional or commercial lab space \n2+ Years operating a Wiped Film Evaporator\nUnderstanding of Short Path Distillation\n\nEducation: High school or above or equivalent  \n\n\nJob Type: Full Time \n\n\nCompensation: TBD (based on Experience) \n\n\nWork Location: Las Vegas Nevada\n\n\nJob Type: Full-time\n\n\nPay: $50,000.00 per year\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nRelocation assistance\nVision insurance\n\nSchedule:\n\n\n8 hour shift\n\nWork Location: One location\n","slug":"distillation-supervisor-4d1df764-d058-4e3a-bc2e-1aaa1cd62680","benefits":["Paid time off","Dental insurance","Health insurance","Vision insurance","Relocation assistance"],"selectedSkills":["Laboratory experience","High school diploma or GED","US work authorization","Reliable transportation"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=JpTZJtZhEGZcyoRmQW0ah9QC7_oMXMKIfU_pnz4UI1ANX63_zqrMbg"},{"position":"Molecular Biologist","labName":"SafeTiva Labs","location":"Westfield, MA","age":"7 days ago","type":"Full-time","jobDescriptionCopy":"Position: Molecular Biologist\n\n\nSafeTiva Labs is looking for an experienced molecular biologist to join the lab team and perform cannabis testing operations.\n\n\nCompany Overview\n\n\nSafeTiva Labs is an analytical testing and research laboratory comprised of dedicated scientists working on cutting-edge analysis methods. SafeTiva follows Cannabis Control Commission regulations, ISO 17025 standards, and maintains high ethical standards. Joining our team means being part of an exciting start-up culture on the front lines of the fast-paced cannabis industry. Our team prides itself on maintaining a collaborative environment where each member is valued. We are a small group of talented people who are driven and dedicated to science, innovation, and work ethic. Our team is our most important asset and we aim to create an environment that makes employees love coming to work. This is an opportunity to join a growing company and help define what makes it great!\n\n\nDetailed Responsibilities:\n\n\n· Analyze samples for bacteria, yeast, and mold using a PCR/microarray platform\n\n\n· Cannabis sample preparation and destruction\n\n\n· Follow laboratory policies and SOPs, state regulations, and ISO-17025 quality management system\n\n\n· Review, record, and organize data in the LIMS\n\n\n· Maintain lab equipment in good operating condition and troubleshoot malfunctions as needed\n\n\n· Identify and improve workflow efficiencies\n\n\n· Maintain familiarity with all microbiological protocols and be able to train new technicians\n\n\n· Prepare chemical solutions and various tasks to keep the laboratory clean and functioning, including washing glassware and sterilizing workspaces\n\n\n· Maintain an organized and sterile microbiological lab\n\n\n· Evaluate system performance and perform proficiency testing\n\n\n· Perform proper sample and waste disposal\n\n\n· Monitor inventory levels and order supplies\n\n\n· Perform related duties as assigned\n\n\n· Will report to Lab Director\n\n\nSkills and Competencies\n\n\n· Independence with PCR and molecular biology lab techniques\n\n\n· Strong understanding of standardized test methods for microbiology (AOAC, BAM, USDA, FDA, EPA, etc)\n\n\n· Strong aptitude for identifying microbial species based on observations, experience, and functional expertise\n\n\n· Excellent aseptic technique and pipetting skills\n\n\n· Attention to detail while performing repetitive tasks\n\n\n· Efficient workload management and able to oversee high throughput testing when samples are arriving at varying times\n\n\n· Enthusiastic team player with ability to work independently\n\n\n· Able to multitask in a fast-paced, ever-changing environment\n\n\n· Effective oral and written communicator\n\n\n· Strong work ethic\n\n\n· Maintain the highest standards of personal, professional, and ethical conduct\n\n\n· Support SafeTiva’s goals for a diverse and culturally aware workforce\n\n\n· Strong computer and data management skills, with preference for MS Office and LIMS programs\n\n\nEducation and Experience\n\n\n· Bachelor’s Degree in molecular biology or microbiology\n\n\n· 3 years of experience working in a professional microbiology or molecular biology wet lab, and at least a year of experience in both fields\n\n\n· Experience in a commercial testing lab, with cannabis testing preferred\n\n\n· ISO-17025 experience preferred\n\n\nRequirements\n\n\nAt least 21 years of age\nAble to pass a background check, drug test, and must not have been convicted of an excluded felony offense as defined in 105 CRM 725.030\nAble to perform grasping, talking, hearing, seeing and repetitive motions\n8 hour shift, days and times may change and occasional night and weekend work may be required\n\nBenefits:\n\n\nCompensation will be commensurate with experience and skillset, and structured with incentives for meeting outlined goals\n\n\nSafeTiva is pleased to offer a comprehensive benefits package.\n\n\nSafeTiva Labs celebrates diversity and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, gender, gender identity or expression, religion, sexual orientation, national origin, disability, age, or veteran status.\n\n\nJob Type: Full-time\n\n\nPay: From $47,000.00 per year\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nPaid time off\n\nSchedule:\n\n\n8 hour shift\n\nCOVID-19 considerations:\nAll employees are required to be fully vaccinated for Covid-19.\n\n\nApplication Question(s):\n\n\nPlease submit a cover letter in the supplemental documents section and answer this question with your favorite junk food.\n\nExperience:\n\n\nMolecular biology: 1 year (Required)\nmicrobiology: 1 year (Required)\n\nWork Location: One location\n","slug":"molecular-biologist-b21add1b-267f-43ba-9383-fa3f9f0959fc","benefits":["Health insurance","401(k) matching","Paid time off","401(k)"],"selectedSkills":["Computer skills","Laboratory experience","Molecular biology","Communication skills","Microbiology","Bachelor's degree","Pass drug screening","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=yFqPCedbTjh4_eFIfj8fsy-ajKTWHMOy5kKdt5mwmhqMxUxGm4D0nw"},{"position":"Operations Associate","labName":"E1011 Labs","location":"Pasadena, CA","age":"2 days ago","type":"Full-time","jobDescriptionCopy":"Job title\n\n\nOperations Associate\n\n\nReports to\n\n\nDirector of Operations\n\n\nFLSA Status\n\n\nExempt Non-Exempt\n\n\nE1011 Labs, based in Pasadena, California, has a mission to create and deliver the next generation of flower consumption with innovative design and cutting-edge technology. E1011 Labs is known for its exemplary customer service, unique product offering, competitive pricing, unparalleled educational resources, and market leadership. E1011 Labs is looking for a passionate and professional individual to fill the role of Operations Associate. We are looking for an individual who will be working with a variety of Laboratory/production tasks. This individual must be able to multi-task, work quickly and efficiently, and be adaptable to change priorities and tasks as needed. We have a very fast- paced environment as we continue to grow and expand. Must be motivated, trustworthy, and a team player.\n\n\nAdditional responsibilities include: Carrying out laboratory production; intake raw material; enter and track material quantities in our internal system; create batch records a given process; troubleshooting and resolving problems; maintaining logs and record books; maintaining glassware; daily lab cleanup.\n\n\nDuties and responsibilities\n\n\nFollow Standard Operating Procedures (SOP)\nIntake and Process raw hemp material\nDocument information by creating and maintaining accurate batch records.\nKeep equipment operational by following operating instructions; troubleshooting breakdowns; performing preventive maintenance.\nKeep laboratory inventorying in stock; placing orders; verifying receipt.\nParticipate in planning personnel safety and warehouse protection activities.\nOperating, maintaining, and making adjustments and repairs to laboratory\nResolves problems by examining and evaluating data; selecting corrective steps.\nUpdates job knowledge by participating in educational opportunities; reading technical publications.\nEnhances laboratory and organization reputation by accepting ownership for accomplishing new and different requests; exploring opportunities to add value to job accomplishments.\nMaintains glassware by picking-up, cleaning, washing, sterilizing, and organizing.\n\nQualifications & Skills Required\n\n\nChemistry Techniques,\nLab Environment,\nCannabis Knowledge,\nChemical Properties of Cannabinoids,\nRecord Keeping,\nData Tracking, Safe\nLab Practices,\nEquipment Calibration and Maintenance,\nChemical Safety,\nSupply Management,\nSelf- Development.\nMust have reliable transportation.\n\nPhysical requirements\n\n\nWork is performed while standing, sitting and/or walking\nALL APPLICANTS MUST BE OVER THE AGE OF 21 YEARS TO BE ELIGIBLE FOR EMPLOYMENT\n\nBenefits/Perks\n\n\nCompetitive wage\nComprehensive medical & dental benefits coverage\nA highly innovative and enjoyable team culture\nFun and casual work environment, monthly lunches, and more\nWork hours 8 a.m. – 5 p.m. or 9 a.m. – 6 p.m. (one hour lunch)\n\nBy applying for this role I understand that if I’m offered a position with the company I will be required to submit to the pre-employment aptitude testing, and background screening as a condition of employment.\n\n\nE1011 Labs provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, disability or genetics. In addition to federal law requirements, E1011 Labs complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, transfer, leaves of absence, compensation and training.\n\n\nJob Type: Full-time\n\n\nPay: From $15.00 per hour\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nHealth insurance\n\nSchedule:\n\n\n10 hour shift\n12 hour shift\n8 hour shift\nDay shift\nEvening shift\nMonday to Friday\nNight shift\nOvernight shift\nWeekend availability\n\nAbility to commute/relocate:\n\n\nPasadena, CA 91107: Reliably commute or planning to relocate before starting work (Required)\n\nWork Location: One location\n","slug":"operations-associate-b1c982d5-3c83-4340-9828-4f451b6343ec","benefits":["Dental insurance","Health insurance","401(k)"],"selectedSkills":["21 years or older","Reliable transportation"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=WZYuOn41gwRPaMdRfZ8PU8kKA97dK2d3tvmUMLazZqphljMxSGXzQg"},{"position":"HVAC Technician","labName":"Parallel","location":"Franklin, MA","age":"5 days ago","type":"Full-time","salaryMin":"$27 ","salaryMax":" $30 an hour","jobDescriptionCopy":"Everyone is welcome here. Each of us is unique, and that’s what makes us amazing. We believe in inclusiveness and celebrating each person’s individuality, because there’s power in bringing people with different points of view and life experiences together. That’s why we provide equal employment opportunities (EEO). All applicants are considered regardless of race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, or sexual orientation.\n\nSo, bring yourself and your best ideas; when we feel safe and comfortable being ourselves, there’s no limit to what we can achieve.\n\nIN A NUTSHELL…\n\nThe Facilities HVAC Tech 2 provides support to the facilities operation during the initial set up phase and ongoing operation thereafter. They provide guidance to ensure the Facilities department is operating best in class.\n\nThis role is with NETA, one of the renowned retail brands under the Parallel umbrella. Parallel is one of the largest multi-state cannabis companies in the world, owning and operating in five markets; Florida (Surterra Wellness), Massachusetts (NETA), Pennsylvania (Goodblend), Nevada (The Apothecary Shoppe) and Texas (Goodblend). If you enjoy companies that are growing, moving fast, and constantly challenging themselves to achieve more, then Parallel is for you. We work hard, lean on each other, and are passionate about a pretty ambitious vision … pioneering a new paradigm of what well-being can be for all people, everywhere. For more information, visit www.liveparallel.com.\n\nWHAT YOU WILL BE DOING:\nRepair and maintain Industrial HVAC, plumbing and mechanical equipment in accordance with diagrams, sketches, operating manuals, manufacturers' specifications or supervisor s instructions, using hand and power tools, precision measuring or testing devices. Responsible for complete maintenance of area of assignment.\nRead blueprints; understand and read computerized HVAC, Electrical, plumbing system and building layouts.\nObserve and adjust a wide variety of equipment, machines and devices in operation to assure proper operation, including pumps, refrigerant recovery, engines, motors, compressors and laboratory equipment.\nDismantle machines and devices for servicing, repair, or replacement of parts.\nObserve Parallel Policies & Procedures for daily operations and fully complies with state medical marijuana regulations at all times.\nPerform preventative maintenance and maintains a scheduled maintenance program to ensure proper facilities upkeep, including all mechanical, electrical and plumbing infrastructure and equipment.\nEffectively using CMMS tracking systems to report receipt of maintenance needs and/or other issues.\nRespond to facility related failures or emergencies promptly and prioritizes work orders, while maintaining preventative tasks in accordance with facility needs.\nPerform routine maintenance tasks, preventative systems and repairs.\nComplete all required documentation for utility and facility management, follows up and evaluates effectiveness of all implemented actions to ensure that problem has been resolved effectively.\nEnsure safe work practices are implemented and consistently followed by department staff.\nWork with other departments in addressing and rectifying potentially unsafe work conditions or practices.\nEnsure compliance with applicable building codes, fire and emergency codes, regulatory and other required regulations.\nResponsive and professional in all response and interactions regarding service requests and facility needs.\nAble to work carefully and efficiently in a fast-paced environment.\nWork in coordination with the Supervisor and Manager to help upgrade all systems and streamline as needed to function in the most efficient and effective manner.\nAfter hours on call availability.\nPerform other job duties and tasks as assigned.\n\nEXPERIENCE AND SKILLS YOU’LL BRING:\nTechnical school graduate or equivalent industrial operations experience (Required).\nHVAC Certification and Refrigeration Recycle Recovery license (Required).\nDemonstrate competency in performing routine maintenance tasks, preventative systems and repairs.\nAbility to read blueprints; ability to understand and read computerized HVAC, Electrical, plumbing system and building layouts.\nMin 7 years of progressively responsible work-related experience and any combination of education and training which provides the required knowledge, skills and abilities to perform the essential functions of the job, combined with demonstrated professional growth and achievement.\nAge 21 or over (Required).\nHigh School Diploma or equivalent (Required).\nValid Government-Issued Photo ID (Required).\n\nYOU WILL BE SUCCESSFUL IF YOU…\nAre self-motivated; micro-managing isn’t fun for anyone.\nRoll your sleeves up and do the work; strategy is important, but so is getting stuff done.\nCan work fast and be flexible; our industry is always changing.\nPlay nice with others; we collaborate with each other a lot.\nThink creatively; sometimes, the “traditional” solution isn’t the best one.\n\nWHAT YOU GET:\nConsistent, reliable benefits; Full medical/vision/dental, 401k with a possible company match, access to company-sponsored well-being programs\nBalance and flexibility; paid time off, paid parental leave, flexible work arrangements.\nFinancial opportunity; an incentive program that provides opportunity to earn cash AND equity in a fast-growing company and industry\nEmployee discount.\nChance to make a difference; Employee Relief Fund, community volunteerism opportunities through Benevity.\n\nPHYSICAL REQUIREMENTS:\nThe person in this position frequently communicates with other employees/customers. Must be able to communicate accurate information in these situations.\nMust be able to travel up to 5%-10% of the time.\nMust be able to move around the production facilities up to 30% of the time.\nMust be able to work in an environment which is noisy and with temperature fluctuations from 60 degrees to 90 degrees.\nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\nConstantly operates a computer and other office productivity machinery.\n\nPARALLEL IS UNITED BY OUR VISION, MISSION, & VALUES:\nOur Vision – why we exist – is to pioneer well-being and improve the quality of life for humanity through the benefits of cannabinoids.\n\nOur Mission – how we will do this – is to build a leading, global well-being company through the best talent, our values, trusted and recognized brands, science and technology-based innovation, and a relentless focus on execution and continuous improvement.\n\nOur Values – Integrity | Collaboration | Alignment | Intentionality | Accountability | Agility\n\nWe are an Equal Opportunity Employer. We embrace and encourage our employees’ differences in age, color, disability, ethnicity, gender identity or expression, language, national origin, physical and mental ability, political affiliation, race, religion, sexual orientation, socioeconomic status, veteran status, and other characteristics that make our employees unique.","slug":"hvac-technician-59656d74-1327-479a-a3d8-e855aba6fbeb","benefits":["Dental insurance","Employee discount","Health insurance","401(k) matching","Paid time off"],"selectedSkills":["Precision measuring instruments","CMMS","EPA Refrigeration Certification","HVAC Certification","HVAC","High school diploma or GED","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=tF14LqUXlvhPwJ8hzk-a7zrbtt_3z_b_C10T5S7cEyv9bCA-pLZyXw"},{"position":"Business Development Specialist","labName":"HighRes Labs, Inc.","location":"Oklahoma City, OK","age":"3 days ago","type":"Full-time | Part-time | Contract","salaryMin":"$10 ","salaryMax":" $20 an hour","jobDescriptionCopy":"Job description\n\n\nHighRes Labs has an opening for a team player in the dynamic new industry of medical marijuana testing in Oklahoma. Position yourself as a business professional in the fast paced field of cannabis quality control by leading the sales and marketing for a successful testing laboratory in Edmond, Oklahoma.\n\n\nHighRes Labs is an ISO-17025 accredited testing laboratory licensed by the Oklahoma State Department of Health and Oklahoma Medical Marijuana Authority. You bring your business development interests, chemistry intrigue, and team player mentality and we will train you in the field of MMJ testing.\n\n\nResponsibilities:\n\n\nThe Business Development Specialist will manage marketing initiatives, sales strategies, and business development operations. Honesty and ethics are paramount for this position. This role will be directly responsible for driving revenue through customer acquisition, sales execution and customer relationship management.\n\n\nRequirements:\n\n\nProven sales leadership experience and success selling B2B\nAbility to work independently with little oversight\nA valid driver’s license and clean driving record\nPersonal transportation to visit existing and potential customers\nExcellent verbal and interpersonal communication skills\nClean criminal history\n\nJob Duties:\n\n\nDevelop and establish key customer relationships with Medical Cannabis growers, processors, and dispensaries.\nTravel as necessary within Oklahoma for in-person meetings with customers and prospects to develop key relationships.\nMake recommendations for sales strategy within the Oklahoma territory in order to maximize sales productivity.\nDesign, implement and manage sales forecasting, planning, and budgeting processes to establish high levels of quality, accuracy, and process consistency.\nMaintain a CRM of the target customers in Oklahoma.\n\nAdditional Preferences:\n\n\n1+ years in a similar sales role within the cannabis industry.\nAssociate degree.\nExperience creating and operating a sales pipeline management system.\nRecent sales experience in Oklahoma with existing Medical Cannabis growers, processors and dispensaries will be a plus.\nDirect, no-nonsense communication style that emphasizes transparency and integrity.\n\nWhat we offer:\n\n\nCompensation: Salary $10/hr ~ $20/hr + commissions.\n\n\nCommissions ranging from 5% to 10% or more depending on the base salary, prior experience and working performance.\n\n\nAnd untapped opportunity to develop cannabis testing sales in Oklahoma.\n\n\nThe candidate will be hired on a probationary basis for three months.\n\n\nJob Type: Full-time\n\n\nJob Types: Full-time, Part-time, Contract\n\n\nPay: $10.00 - $20.00 per hour\n\n\nBenefits:\n\n\nHealth insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nMonday to Friday\n\nSupplemental Pay:\n\n\nBonus pay\nCommission pay\n\nAbility to commute/relocate:\n\n\nOklahoma City, OK: Reliably commute or planning to relocate before starting work (Required)\n\nExperience:\n\n\nBusiness development: 1 year (Preferred)\n\nWork Location: One location\n","slug":"business-development-specialist-771982e6-ed89-4947-9a9e-32cfaca260ec","benefits":["Health insurance"],"selectedSkills":["Driver's License","Sales","Customer relationship management","Business development","Sales pipeline","Associate's degree","Clean driving record"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=O7oV4chbM0ZQP9o7KPu5BYNna74dD4bVg8U4_blVO1KekplQdiUbYw"}]