[{"position":"Laboratory Technician I","labName":"Montrose Environmental Group, Inc.","location":"Richmond, VA","age":"2 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:Competitive compensation packages\n\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Richmond, VA facility is currently seeking a Full-Time Technician I (Toxicology).\n\nA Toxicology Laboratory Technician I is responsible for conducting aerosol exposure studies and analyzing data collected. The ideal candidate will have experience in working under possibly hazardous conditions (e.g. pathogens or chemicals). He/She will be well-trained to maintain safety conditions and will be passionate for doing work that makes things move forward.\n\nHelp conduct aerosol exposure studies for determining potential mutagenic, genotoxic and cytotoxic activity of complex mixtures or experimental test articles from various sources.\nAnalyze data collected in real time data and assess experimental progress\nFollow study protocols and methods based on published scientific articles and technical reports.\nWork with and without supervision to setup up instruments used in aerosol exposure studies and document experimental setups and results.\nOperate, maintain and troubleshoot laboratory equipment and instruments\nConduct laboratory day-to-day duties, such as preparation of laboratory materials and solutions as well as housekeeping and ordering responsibilities\nAssist in data compilation, review and interpretation.\nPrepare summary of findings and observation\nWork in a GLP compliant environment\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Lab Director\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nBS degree in the sciences, engineering, or related field with laboratory experience.\nAerosol knowledge and experience is a plus.\n\nPreferred Skills:\nDetail oriented, reliable, highly motivated, and will interact well in a team environment.\nWorking knowledge of fluid/aerosol flow and pressure.\nGood organizational skills, a high energy level, a sense of commitment to assure that obligations and quality are met\nCapable of handling multiple assignments concurrently\nWorking knowledge of basic computer skills, especially MS Office.\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"laboratory-technician-i-06000a22-dddd-4cf1-ad4e-88e5a227d6d1","benefits":["Disability insurance","Tuition reimbursement","401(k)","Parental leave"],"selectedSkills":["Computer skills","Laboratory experience","Computer literacy","Microsoft Office","Organizational skills","Bachelor of Science","Bachelor's degree"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-VA-Richmond-East-Parham-Rd/Laboratory-Technician-I_R2208?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Analyst - Metals","labName":"Montrose Environmental Group, Inc.","location":"Orange, CA","age":"1 day ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Orange, CA facility is currently seeking a Full-Time Analyst to join our Metals Department.\n\nAs a key member of the laboratory team, this role will be responsible for a full range of activities including:\n\nDaily monitoring of sample scheduling to ensure that samples are analyzed within EPA's and methods’ holding time\nSchedule workload in order to report data within clients expected due dates\nRoutine sample preparation and analysis according to Standard Methods 846 and EPA methods\nPerforms analyst's review of data and QC\nReviews of QA/QC criteria for batch acceptance\nAdheres to Standard Operating Procedures and follow safe work practices\nParticipates in instruments' preventative maintenance and trouble shooting\nParticipates in focus teams to improve efficiency\nBe flexible in work schedule including overtime when needed\nReact to change productively and handle other essential tasks as assigned\nPerforming other duties and responsibilities as prescribed by the Company\nCompliance with Enthalpy's Quality Assurance Program and other policies\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nBachelor's degree in Chemistry, Biology, Environmental Science, or related field\nMinimum 2-4 years of lab experience preferred\nKnowledge of analytical method, analytical instruments, general lab practices and lab safety\nExperience in ICP, ICPMS or IC is a plus\n\nPreferred Skills\n\nKnowledge of analytical method, analytical instruments, general lab practices and lab safety\nMust be flexible in work schedule (including Saturday) and able to work overtime\nWell organized and have an attention to detail\nAble to multi-task\nAbility to work independently and make sound decisions\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"analyst-metals-6e4cf488-b6eb-4680-8580-2ffad3b0a890","benefits":["401(k)","Disability insurance","Parental leave","Tuition reimbursement"],"selectedSkills":["Laboratory experience","Bachelor's degree"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-CA-Orange/Analyst---Metals_R2204?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Extraction Technician","labName":"Trulieve","location":"United States","age":"7 days ago","salaryMin":"$28,000 ","salaryMax":" $35,000 a year","jobDescriptionCopy":"“Trulieve Grows One Patient at a Time”\n\nIf you have an interest in being part of one of the fastest growing industries in the nation in you may consider wanting to work for Trulieve! If you have a desire to help others in need through your efforts, this may be the role for you!\n\nAt Trulieve, we strive to bring our patients the relief they need in a product they can trust. Our plants are hand-grown in an environment specially designed to reduce unwanted chemicals and pests, keeping the process as natural as possible at every turn.\n\nOur products are designed to alleviate seizures, severe and persistent muscle spasms, pain, nausea, loss of appetite, and other symptoms associated with serious medical conditions such as cancer.\n\nOur specially trained staff works hand-in-hand with physicians to provide the right products and the correct dosage to ensure patients get the compassionate care they need.\n\nRequisition ID: 1452\n\nRemote Work Available: No\n\nTrulieve is looking for an Extraction Technician to support our extraction and production operations. You should be very technically astute in mechanical, electrical, and computer operated systems utilized in production/manufacturing environments. You need to be proactive, quick thinking and innovative in your approach.\n\nKey Duties and Responsibilities:\nPreparation of equipment and plant materials for extraction\nExecution of extraction and processing in accordance with state and local standards\nOperation of sophisticated extraction equipment\nEnsure consistency and efficiency of product through quality control testing and procedures\nCleaning and maintenance of extraction equipment and manufacturing facility\nMaintaining strict inventory records of all plant materials, chemicals, and equipment used in the facility\nOversee day-to-day operations of the entire extraction space beginning with storing the raw cannabis through the extraction process and all the way to fulfillment of orders\nOperating, maintaining, and making adjustments and repairs to extraction equipment\nStoring supplies and equipment and disposal of waste according to guidelines\nComplete the cleaning and sanitization of all production equipment, work surfaces, and tools\nMaintaining inventory records of supplies, materials, and equipment and preparing requisitions as needed\nMaintaining material safety data sheets for all chemicals and products\nFollowing all standard operating procedures regarding product creation and lab safety\nAssist in packaging and labeling of finished products\nWorks with testing laboratory as defined by state guidelines\nFour 10 hour work days and weekends.\nAll other duties as assigned\n\nRequirements\n\nSKILLS AND QUALIFICATIONS:\nBachelor’s or Associate degree or its equivalent, from a recognized college or university, with a major in chemistry or biology preferred\nUnderstanding of state and local laws\nUnderstanding of proper and safe handling of hazardous materials\nFamiliarity with separations, isolations and fractionation\nKnowledge of solvent and non-solvent extraction methods\nStay current of practices and new developments in the cannabis extraction industry\nAbility to work quickly without compromising accuracy\nAbility to discern the quality of plant material and finished products\nStrong computer and social skills\n\nPHYSICAL REQUIREMENTS:\nMust be able to push, pull, move, and/or lift a minimum of 25lbs to a minimum height of 5 feet and able to push, pull, move, and/or carry such weight a minimum distance of 50 feet, with or without mechanical assistance\nMust be able to work seated/standing as appropriate at workstations for extended periods of time, maintain body equilibrium while climbing ladders, stairways, stopping, kneeling, crouching, and reaching, and use hands/fingers to hold, grasp, turn, pick, pinch frequently/constantly to complete tasks\nMust be able to handle organic matter daily, able to wear PPE as appropriate (eye, face, hand, arm, head, foot, body, fall protection), and able to be exposed to hot, cold, wet, humid, or windy conditions while wearing PPE (95 degrees or greater)\nMust have visual acuity with/without job aids to perform activities such as; reading, viewing a computer terminal, visual inspection involving small parts/details. Clarity of vision at 20 ft or more in day and night/dark conditions\nMust be able to speak and communicate verbally at conversation levels with co-workers, vendors, etc. (Moderate noise)\n\nSalary will be commensurate with experience. A comprehensive benefits package including paid time off is offered with this position. This position will work an average of 40 hours per week and will be available “after hours” if an emergency situation should arise.\n\nTrulieve provides equal employment opportunities to all employees and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, pregnancy or any other characteristic protected by federal, state or local laws.","slug":"extraction-technician-3ad40d87-75de-4cd2-a3bd-4e0bb239c7e2","benefits":["Paid time off","Health insurance"],"selectedSkills":["Computer skills","Bachelor's degree","Associate's degree"],"jobType":"free","applyURL":"https://careers.trulieve.com/job/Extraction-Technician/898292500/?feedId=364400&utm_source=Indeed&utm_campaign=Trulieve_Indeed"},{"position":"Technician II - GCMS","labName":"Montrose Environmental Group, Inc.","location":"Richmond, VA","age":"19 hours ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Richmond, VA facility is currently seeking a Full-Time Laboratory Technician II in GCMS.\n\nA Laboratory Technician II is responsible for performing tasks required to meet the expectations of our clients, in addition to efficiently and profitably generating defensible data in a timely manner. The ideal candidate will have experience in working under possibly hazardous conditions (e.g. chemicals).\n\nRole and Responsibilities\n\nCleaning of sampling equipment\nPreparation of sampling equipment for prep orders\nPreparation of samples for analysis\nWeighing samples for analysis\nAssisting with loading canisters and samples for analysis\nMaintaining clean laboratory areas\nMaintaining organized records of equipment cleaning and sample prep\nOverhead projects designed to improve efficiency of, or accuracy of analyses\nAssisting the Group Leaders and analysts in acquiring and inventorying consumables and parts for instrumentation\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Lab Director\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nHigh school diploma or general education degree (GED) required, associate's or Bachelor's degree in a scientific field preferred\nTheir documentation, timeliness, and throughput must meet the standard of the laboratory.\n\nPreferred Skills\n\nPrior Laboratory experience required\nKnowledge general lab practices and lab safety\nAbility to work independently and in a team\nGood organizational skills and strong communication skills\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.\n\n#LI-MEG","slug":"technician-ii-gcms-9be6dcb4-f163-4f51-a8e7-a77782bb80a1","benefits":["401(k)","Disability insurance","Parental leave","Tuition reimbursement"],"selectedSkills":["Laboratory experience","Communication skills","Organizational skills","Bachelor's degree","High school diploma or GED","Associate's degree"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-VA-Richmond-East-Parham-Rd/Technician-II---GCMS_R2213?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Manufacturing Supervisor","labName":"Trulieve","location":"Midway, FL","age":"8 days ago","salaryMin":"$56,000 ","salaryMax":" $72,000 a year","jobDescriptionCopy":"“Trulieve Grows One Patient at a Time”\n\nIf you have an interest in being part of one of the fastest growing industries in the nation in you may consider wanting to work for Trulieve! If you have a desire to help others in need through your efforts, this may be the role for you!\n\nAt Trulieve, we strive to bring our patients the relief they need in a product they can trust. Our plants are hand-grown in an environment specially designed to reduce unwanted chemicals and pests, keeping the process as natural as possible at every turn.\n\nOur products are designed to alleviate seizures, severe and persistent muscle spasms, pain, nausea, loss of appetite, and other symptoms associated with serious medical conditions such as cancer.\n\nOur specially trained staff works hand-in-hand with physicians to provide the right products and the correct dosage to ensure patients get the compassionate care they need.\n\nRequisition ID: 1399\n\nRemote Work Available: No\n\nTrulieve is looking for an Manufacturing Supervisor to support our extraction and production operations night shift. You should be very technically astute in mechanical, electrical, and computer operated systems utilized in production/manufacturing environments. You need to be proactive, quick thinking and innovative in your approach.\n\nEssential functions:\n\nEnsure that team members are properly communicated the goals of the shift, week, and month.\nTraining new team members on concentrate equipment and procedures.\nEnsuring policy and procedure compliance across all processes within the department.\nAchieves and reports 5S standards for equipment and manufacturing area\nChampions incident investigation process and corrective actions\nFacilitates appropriate training for all safety related activities\nEstablish and maintain compliance to current GMP, safety programs\nCommunicate any safety or product issues from the shift\nMonitoring and reporting on employee attendance and performance.\nOversee equipment cleaning and maintenance policies, ensuring equipment is well maintained.\nMaintaining strict inventory records of all concentrates, chemicals, and equipment used in the facility, assisting in improving records when needed\nOversee process flow throughout department, making changes in allocation of resources to meet demand\nOperating, maintaining, and making adjustments and repairs to concentrate equipment\nEnsuring team members store supplies and equipment and disposal of waste according to guidelines\nWorks with testing laboratory as defined by state guidelines\nQualifications:\n\nBachelor’s or Associate degree or its equivalent, from a recognized college or university, with a major in chemistry or biology preferred\nUnderstanding of state and local laws\nUnderstanding of proper and safe handling of hazardous materials\nFamiliarity with separations, isolations and fractionation\nKnowledge of solvent and solvent free extraction methods\nStay current of practices and new developments in the cannabis extraction industry\nAbility to prioritize tasks in order of importance while managing multiple projects, both long term and short term\nAbility to discern the quality of plant material and finished products\nStrong computer and social skills\nVast cannabis knowledge including specifically Ethyl extraction\nStrong leadership skills\nStrong communication skills\nManufacturing experience preferred\n3+ years of management experience\nAdditional Requirements:\n\nPer state law, Must be at least 21 years of age.\nMust successfully complete a comprehensive background check.\nOther Duties\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.\nHourly wage will be commensurate with experience. A comprehensive benefits package including paid time off is offered with this position. This position will work an average of 40 hours per week and will be available “after hours” if an emergency situation should arise.\nWe are an EOE company\n\nSalary will be commensurate with experience. A comprehensive benefits package including paid time off is offered with this position. This position will work an average of 40 hours per week and will be available “after hours” if an emergency situation should arise.\n\nTrulieve provides equal employment opportunities to all employees and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, pregnancy or any other characteristic protected by federal, state or local laws.","slug":"manufacturing-supervisor-365f68bd-c777-4af5-aade-2f09e9b0a110","benefits":["Health insurance","Paid time off"],"selectedSkills":["Manufacturing","Computer skills","Leadership","Communication skills","Management","Bachelor's degree","Associate's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://careers.trulieve.com/job/Midway-Manufacturing-Supervisor-FL-32343/897507500/?feedId=364400&utm_source=Indeed&utm_campaign=Trulieve_Indeed"},{"position":"Technical Director - Environmental","labName":"Montrose Environmental Group, Inc.","location":"Richmond, VA","age":"1 hour ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, part of the larger organization, Montrose Environmental Group, is comprised of 10 laboratories performing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nThe Technical Director is the laboratory’s lead analytical and technical resource, responsible for improving procedures and implementing new technologies to meet quality standards and client requirements, reducing costs, and maximizing operating efficiencies by effectively managing and developing available technology solutions. They will also improve efficiencies by minimizing down-time and maximizing instrument through-put and assisting the Group Leaders in training staff to operate new and existing analytical equipment.\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nJob Responsibilities - This role will be responsible for a full range of activities including:\n\nPosition is the laboratory’s lead test & measurements technical resource, responsible for improving procedures and implementation of new technologies to reduce costs, and maximize operating efficiencies by effectively managing and developing available technology solutions.\nImprove efficiencies by minimizing down-time and maximizing instrument through-put and assisting the Group Leaders in training staff to operate new & existing test and measurement equipment.\nResponsible for production of all Departments by ensuring timely and profitable production of chemical measurement services\nResponsible for technical data review utilizing Laboratory Information System.\nAssist the Group Leaders in training staff to operate new and existing test and measurement equipment\nCoordinate work scheduling and laboratory resource allocation\nMeet TAT, financial, and quality objectives\nSupervise and manage adherence to QA/QC, hold time and turnaround requirements\nAssign and clearly communicating operational priorities\nAllocate lab resources to meet client schedule & requirements\nSupervise Group Leaders, supervisors, and staff\nAssist with and conducting employee performance reviews and audits\nProjecting staffing needs: hiring and firing staff\nOther duties, as assigned by Laboratory Director\n\nMinimum Qualifications\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nBA/BS in Chemistry or Science required. Master’s or PhD degree is a plus.\nEPA, 40CFR and NELAC expertise or background is a plus\nMinimum of 4 years of experience in a laboratory testing environment\nThe Technical Director must meet the requirements of the accrediting body(ies) of the laboratory\n\nPreferred Skills\n\nSuperior time management skills\nRespectful and effective communication skills – ensure positive interactions with the team to build professional relationships;\nEffective training - teach complex topics to team members of varying scientific backgrounds and ensuring their proficiency\nConflict resolution: Removes/Breakdown organizational communication or operational barriers\nAssertion Skills: Sets expectations, provides regular feedback, creates a positive work environment.\nManagement behavior shows serious thought and reliable actions; leads with integrity and honesty\nTeam player – Cooperative and collaborative, focused on the outcome of the group as a whole;\nTakes responsibility, diagnoses problems, assesses corrective action, and does not shift blame\nFlexible – able to shift priorities on short notice\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.\n\n#LI-MEG","slug":"technical-director-environmental-55ae7e82-efe1-4e7e-a474-6688a9cae85e","benefits":["Disability insurance","Tuition reimbursement","401(k)","Parental leave"],"selectedSkills":["Laboratory experience","Communication skills","Time management","Doctoral degree","Bachelor of Science","Bachelor's degree","Master's degree","Doctor of Philosophy"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-VA-Richmond-Reymet-Rd/Technical-Director---Environmental_R2216?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Content Marketing Specialist","labName":"American Association For Laboratory Accreditation","location":"Frederick, MD","age":"20 hours ago","type":"Full-time","salaryMin":"$53,000 ","salaryMax":" $75,000 a year","jobDescriptionCopy":"Description: A2LA is a non-profit, public service membership organization offering compliance and accreditation services to organizations all over the world. A2LA is dedicated to formally recognizing testing, calibration and other laboratories and related organizations for their quality and technical competency with a variety of international standards (ISO/IEC 17025, ISO 15189, etc.), federal requirements (FDA, GLP, FCC, etc.), state (cannabis, etc.), and local requirements (water testing, etc.).\nWhether it is the clean air that you breathe, the water you drink or the vehicle you drive, A2LA helps make the world a better, safer place by working to ensure that organizations are releasing products and services that are meeting testing and quality standards. Detailed information about our services can be found on our website at https://www.a2la.org/about.\nThe Role\nA2LA is seeking a results-driven and engaging professional to develop captivating content and build brand awareness by working closely with our marketing team. This is an exceptional opportunity to grow within a global non-profit organization as a Content Marketing Specialist. This position will report directly to the Marketing Manager.\nAbout You\nYou are someone who is passionate about consumer & marketing trends and thrives in a fast-paced environment. You have proven excellent communication skills and know how to manage your time effectively. You are someone who enjoys developing content strategies through print and digital marketing and works well on a team. You are self-motivated and are able to think big picture.\nResponsibilities\n\n\nManage list building, persona development, and creative messaging.\nOversee campaign execution, producing fresh content, and monitoring analytics.\nTake the lead on drafting communications materials for campaigns, contributing to blog posts, podcasts, press releases, e-letters, and social media posts.\nStay current on the latest marketing news trends through various continuing education outlets and following relevant resources.\nWrite, edit, and proof other content as needed to ensure consistency in quality, style, and brand voice across the business.\nWork closely with digital marketing and graphic design to produce assets that are SEO-friendly, visually appealing, and on-brand.\nProactively share best practices and expertise with the marketing team.\nPerform other duties as assigned.\n\n. Requirements: A2LA may provide exceptions to educational requirements for veterans who demonstrate the ability to perform the duties listed in this job posting.\nA successful candidate for these positions typically meets the following criteria:\n\n\n5+ years of proven experience with web design, graphic design, and creative/copywriting.\nBachelor’s Degree in Business, Marketing, Communications, or Journalism.\nAbility to adapt writing style to engage the target audience.\nExperience with Adobe Suite – InDesign, Illustrator, and Photoshop.\nExcellent written and oral communication skills.\nAbility to translate communication strategy to internal teams.\nCapacity to learn new platforms and tools quickly.\nStrong attention to detail and organizational skills.\nAbility to learn A2LA services.\n\nBenefits and Compensation\nThe salary for this position is commensurate with experience. In addition, A2LA offers a robust 403(b) retirement plan and benefits package including medical, dental, HSA, FSA (medical and dependent), life insurance, short- and long-term disability, employee assistance program (EAP), AFLAC, tuition reimbursement and other pre-taxed benefits, paid-time off, 10 paid government holidays, 1 floating holidays, training and development, career advancement opportunities and much more!\nWorking Environment & Physical Requirements\nThe physical demands and work environment described here reflect those of a person, in this position, will typically encounter.\n\n\nPhysical Demands: While performing the duties of this job, the employee is required to walk; sit for long hours, use fingers for typing; talk and hear. Specific vision abilities required by the job include close vision for reviewing documents on the computer or in hard copy state.\nWork Environment: Work is typically performed in an office setting. Hours are flexible, but they should normally encompass at least the core hours of 9:00AM to 3:00PM, total at least forty (40) hours for each work week, and suit the needs of various training clients, where appropriate.\n\nTo perform this job successfully, an individual must be able to perform the essential duties satisfactorily. The requirements listed above are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\nA2LA is an equal opportunity employer. A2LA does not discriminate in employment based upon race, color, religion, national origin, citizenship status, ancestry, age, sex (including sexual harassment), sexual orientation, marital status, physical or mental disability, military status or unfavorable discharge from military service, or any other federally protected classification.\nMilitary/Military Spouse Personnel are encouraged to apply.\n\n\nJob Type: Full-time\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nFlexible schedule\nFlexible spending account\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nParental leave\nReferral program\nTuition reimbursement\nVision insurance\n\nWork Location: One location\n","slug":"content-marketing-specialist-7a3e3c46-087f-4a6c-b146-bae9b2eb833b","benefits":["Health savings account","Dental insurance","Health insurance","Flexible schedule","Referral program"],"selectedSkills":["Adobe Photoshop","Communication skills","Organizational skills","Writing skills","Graphic design","Bachelor's degree"],"jobType":"free","applyURL":"https://recruiting.paylocity.com/recruiting/jobs/Details/1154435/American-Association-For-Laboratory-Accreditation/Content-Marketing-Specialist"},{"position":"Director of Testing","labName":"Cannabis Control Commission","location":"Worcester, MA","age":"5 days ago","type":"Full-time","salaryMin":"$105,000 ","salaryMax":" $115,000 a year","jobDescriptionCopy":"PURPOSE OF THE JOB\nThe Director of Testing, under the direction of the Chief of Investigations and Enforcement, is responsible for the overall operation and administration of the Independent Testing Laboratories (ITLs), including assisting the Investigations and Enforcement Department staff in ensuring that licensed Marijuana Establishments (ME) and Medical Treatment Centers (MTC) operate safely and securely throughout the Commonwealth and abide by Commission regulations. The Director of Testing will manage the Testing staff within the department and lead the Commission’s efforts to monitor, evaluate and analyze the current status of testing, cultivation, manufacturing, including the protocols and capacity of ITLs.\n\nESSENTIAL FUNCTIONS AND RESPONSIBILITIES\n\nManages Testing staff in partnering with the rest of the Investigations and Enforcement staff to identify regulatory concerns and modify procedures for licensing, inspecting, and investigating ITLs;\nSupervise and participate in the collection of data from the seed-to-sale tracking system and licensing database to identify testing parameters and related results;\nConduct site visits at ITLs to evaluate their standard operating procedures, observe testing methodologies, and inspect the licensed premises to determine compliance with state regulations;\nIn cooperation with Investigations and Enforcement staff, monitor and track the status of ITL licenses, certifications, and mandatory requirements;\nLead efforts in implementing state of the art techniques and approaches for collecting and analyzing testing and research related data by ensuring that ITLs are using a quality system approach to laboratory testing that provides accurate and reliable test results;\nAssist Investigations and Enforcement staff in developing enforcement approach for testing protocols and procedures to ensure that MEs and MTCs, are in compliance with state laws and regulations;\nAssist the Commission with regulations, protocols, and methodologies regarding marijuana testing, which includes, but is not limited to the following: potency, pesticides, residual solvents, heavy metals, microbial, terpenes, water content, and vape products.\nOTHER DUTIES AND RESPONSIBILITIES\n\nMaintain the highest standards of personal, professional, and ethical conduct and support the Commission’s goals for a diverse and culturally aware workforce;\nCollaborate with other state agencies, including, but not limited to, the Department of Agricultural Resources and the Department of Public Health to develop inspection and evaluation protocols.\nStay current with emerging practices and information related to best practices for marijuana testing; and\nPerforms related duties as assigned.\nSUPERVISORY RESPONSIBILITIES\n\nThe Director of Testing will oversee the work of the Laboratory and Testing staff.\nThe safety of our employees, both current and future, is the Commission’s highest priority. At this time, our employees are working remotely.\n\nBenefits Package:\nThe Commission is pleased to offer a comprehensive benefits package to its employees. The specific components and eligibility may vary based upon position classification, hours worked per week and other variables. Therefore, specific benefits for this position may be discussed as part of the interview and offer process. This position is non-civil service. This position is an exempt position.\n\nThe overall benefits available include: paid vacation, sick and personal leave time, health, dental and vision insurance through the Commonwealth’s Group Insurance, and optional pre-tax Health Savings Account plans. In addition, the Commission provides employees the opportunity to elect life insurance, long-term disability insurance, deferred compensation savings, tuition remission and pre-tax commuter account plans, along with other programs. The Commission employees also participate in the Commonwealth’s State Retirement Plan, which can become a defined benefit plan for those that both vest and subsequently retire from State service. Follow this link for additional retirement information: http://www.mass.gov/treasury/retirement/state-board-of-retire/.\n\nCommitment to Diversity:\nThe Commission is committed to building a diverse staff across its entire agency and at all levels. The Commission is an equal opportunity/affirmative action employer.\n\nApplication Process and Deadline:\nThe Commission encourages interested candidates that meet the minimum requirements for experience and skills to apply for this position. Interested candidates should submit a cover letter and resume by e-mail no later than July 8, 2022.\n\nThe application package should be submitted to: careers@cccmass.com.\n\nPlease include the position title in the subject line: CCC – Director of Testing.\n\nSubmissions are due by 5:00 pm (e-mail) on July 8, 2022; late submissions may be considered solely at the discretion of the Commission.\n\nNotice of Required Background Check – Including Tax Compliance:\n\nThe Commission requires a background check on all prospective employees as a condition of employment.\n\nCandidates should be aware of this requirement but should also know that such background check is not initiated until:\n\n1. A candidate is invited to a second or subsequent interview, and\n2. The candidate has signed the Background Check Authorization Form and related releases.\n\nThis background check includes a Criminal Offender Record Information (CORI) check, Federal IRS and Department of Revenue state tax compliance on all prospective employees as a condition of their employment.\n\nCandidates with advanced degrees and professional licenses may have these credentials verified. Individuals other than those references provided by a candidate may be contacted while completing a full background and qualification check.\n\nThose candidates invited to interview will be contacted by the Commission. Unfortunately, due to the anticipated high volume of applicants for this vacancy, we are unable to provide status updates to specific individuals.\n\nQualifications\n\nKNOWLEDGE AND SKILLS\n\nExcellent quantitative statistical knowledge;\nAdvanced experience with at least one high-level statistical software program (R, SAS, Stata, SPSS etc.);\nExperience with SQL;\nAbility to write concisely to express thoughts clearly and to develop ideas in logical sequence;\nAdept at presenting information in an accurate and concise format;\nAbility to think critically and strategically;\nComfortable working independently, as well as with teams;\nAbility to seek opportunities to resolve problems, achieve goals, or otherwise advance the Commission’s mission;\nAbility to operate a motor vehicle and possesses a valid Driver’s License from Massachusetts or another state;\nAbility to work in and travel to the Commissions headquarters in Worcester, along with other locations across the state; and\nApproximately 50% of the time is spent in the field, out of the office.\nEDUCATION AND EXPERIENCE\n\nMaster’s degree in Environmental Science, Chemistry, Biochemistry, Toxicology, Biology, Data Science, or related field from an accredited institution of higher education required;\nMinimum of 7-10 years of related work/graduate experience in Environmental Science, Biochemistry, Toxicology, or related field;\nExperience or familiarity in the cannabis regulatory environment and/or research; and\nSolid background in laboratory informational technology and quantitative data analysis;\nDemonstrated experience at least 3-4 years managing projects and teams; and\nStrong experience using Microsoft Office, case management systems and statistical software.\nOfficial Title: Director, CNB\nPrimary Location: United States-Massachusetts-Worcester-2 Washington Square\nJob: Laboratory Services\nAgency: Cannabis Control Commission\nSchedule: Full-time\nShift: Day\nJob Posting: Jun 17, 2022, 9:24:48 AM\nNumber of Openings: 1\nSalary: 105,000.00 - 115,000.00 Yearly\nIf you have Diversity, Affirmative Action or Equal Employment Opportunity questions or need a Reasonable Accommodation, please contact Diversity Officer / ADA Coordinator: Erika White - 7744150200","slug":"director-of-testing-b4c5e8ab-318a-41a8-90d6-4f9daa3c3f1f","benefits":["Health savings account","Dental insurance","Health insurance","Disability insurance","Paid time off"],"selectedSkills":["SQL","SAS","Laboratory experience","R","Biochemistry","Master's degree","Background check"],"jobType":"free","applyURL":"https://massanf.taleo.net/careersection/ex/jobdetail.ftl?job=220007FL&tz=GMT-05%3A00&tzname=America%2FChicago&src=JB-10080"},{"position":"Marketing Manager","labName":"American Association For Laboratory Accreditation","location":"Frederick, MD","age":"20 hours ago","type":"Full-time","salaryMin":"$71,000 ","salaryMax":" $95,000 a year","jobDescriptionCopy":"Description: A2LA is a non-profit, public service membership organization offering compliance and accreditation services to organizations all over the world. A2LA is dedicated to formally recognizing testing, calibration and other laboratories and related organizations for their quality and technical competency with a variety of international standards (ISO/IEC 17025, ISO 15189, etc.), federal requirements (FDA, GLP, FCC, etc.), state (cannabis, etc.), and local requirements (water testing, etc.).\nWhether it is the clean air that you breathe, the water you drink or the vehicle you drive, A2LA helps make the world a better, safer place by working to ensure that organizations are releasing products and services that are meeting testing and quality standards. Detailed information about our services can be found on our website at https://www.a2la.org/about.\nThe Role\nA2LA is seeking a strong marketing professional who is passionate about leading a dynamic team. The Marketing Manager is also responsible for planning and implementing cross-functional marketing programs, both short and long-range, targeted toward retaining existing and attracting potential customers. This person will work in tandem with the Director of Marketing & Communications to develop and deliver the strategic marketing plan. This is an exceptional opportunity to grow within a global non-profit association as a Marketing Manager.\n\n\nAbout You\nYou’re an action-oriented marketer with experience in B2B/B2C marketing and have experience growing and supporting a team. You know how to identify and define a target audience, craft creative messages, and enjoy working collaboratively to execute an effective marketing strategy. You know your way around various digital platforms, understand digital analytics and most importantly, you are a strong communicator who is especially good at turning technical information into reader-friendly stories with personality. You are a quick learner on unfamiliar topics and are adept at brand storytelling.\nResponsibilities\n\n\nManage day-to-day activities of the team and is responsible for monitoring the performance of team members and review of timesheets, approval of staff vacation requests, overseeing adverse actions, and conducting performance evaluations.\nMaintain an intimate understanding of traditional and emerging marketing channels.\nMotivate, communicate, guide, encourage, coach, assist, and problem solve with staff.\nAssists in the development and implementation of the strategic marketing plan.\nProvides input to the Director of Marketing and Communications (DMC) regarding the marketing budget.\nOversee SEO and marketing analytics; proposes and implement changes based on findings.\nPlans and implements advertising and promotion activities including print, online, digital media, and direct mail.\nReviews and evaluates market research and adjusts marketing strategy to meet changing market and competitive conditions.\nEstablishes and maintains relationships with industry influencers and key strategic partners.\nPrepares marketing activity reports and presents information to the DMC.\nEnsures consistent branding throughout all promotional materials, social media usage, training and accreditation services, and other events.\nRepresent the marketing team in cross-functional groups.\nCoordinates A2LA’s social media & manages the website.\nOther duties, assignments, and projects as assigned.\n\n. Requirements:\n\n\n5-7 years’ work experience in B2B/B2C marketing, communications, or business development.\n3 to 5 years of experience managing teams of three or more.\nBachelor’s Degree in Business, Marketing, Communications, or Journalism.\nSuperb writing moxie; experience developing engaging content.\nDemonstrated experience managing social media campaigns and online communities.\nFamiliar with Google Analytics and social media analytics.\nAbility to translate communications strategy to internal teams.\nExperience with CRMs (preferably Pardot, Salesforce), familiar with Adobe Suite InDesign, Illustrator, Photoshop.\nOutstanding attention to detail and organizational skills.\nYou are optimistic, realistic, practical, and thrive in a fast-paced environment.\n\nBenefits and Compensation\nThe salary for this position is commensurate with experience. In addition, A2LA offers a robust 403(b) retirement plan and benefits package including medical, dental, HSA, FSA (medical and dependent), life insurance, short- and long-term disability, employee assistance program (EAP), AFLAC, tuition reimbursement and other pre-taxed benefits, paid-time off, 10 paid government holidays, 1 floating holidays, training and development, career advancement opportunities and much more!\nWorking Environment & Physical Requirements\nThe physical demands and work environment described here reflect those of a person, in this position, will typically encounter.\n\n\nPhysical Demands: While performing the duties of this job, the employee is required to walk; sit for long hours, use fingers for typing; talk and hear. Specific vision abilities required by the job include close vision for reviewing documents on the computer or in hard copy state.\nWork Environment: Work is typically performed in an office setting. Hours are flexible, but they should normally encompass at least the core hours of 9:00AM to 3:00PM, total at least forty (40) hours for each work week, and suit the needs of various training clients, where appropriate.\n\nTo perform this job successfully, an individual must be able to perform the essential duties satisfactorily. The requirements listed above are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\nA2LA is an equal opportunity employer. A2LA does not discriminate in employment based upon race, color, religion, national origin, citizenship status, ancestry, age, sex (including sexual harassment), sexual orientation, marital status, physical or mental disability, military status or unfavorable discharge from military service, or any other federally protected classification.\nMilitary/Military Spouse Personnel are encouraged to apply.\n\n\nJob Type: Full-time\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nFlexible schedule\nFlexible spending account\nHealth insurance\nHealth savings account\nPaid time off\nParental leave\nReferral program\nTuition reimbursement\nVision insurance\n\nWork Location: One location\n","slug":"marketing-manager-34ed8bd1-d3ad-4b7d-9009-f20e6d77ff77","benefits":["Health savings account","Dental insurance","Health insurance","Flexible schedule","Referral program"],"selectedSkills":["Growing experience","Business development","Adobe Photoshop","B2B marketing","Communication skills","Bachelor's degree"],"jobType":"free","applyURL":"https://recruiting.paylocity.com/recruiting/jobs/Details/1154394/American-Association-For-Laboratory-Accreditation/Marketing-Manager"},{"position":"Environmental Analyst II - Volatile","labName":"Montrose Environmental Group, Inc.","location":"Richmond, VA","age":"2 days ago","type":"Full-time","jobDescriptionCopy":"ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nWe are currently seeking a full-time Volatile Analyst II in our Richmond, VA lab. The Analyst will have shown that they have developed a skill set for some assays that makes them a resource for an entire lab or at least a group of assays. He/She/They will be able to handle the most challenging and most non-routine samples. He/She/They will be able to increase the technical ability of the lab to handle certain assays and have the ability to do significant method development and have well above average troubleshooting skills.\n\nAs a key member of the laboratory team, this role will be responsible for a full range of activities including:\n\nQuantitative sample analysis\nMethod development and troubleshooting\nPreparation of data summaries for inclusion in client reports\nInstrument calibration, validation, and method development\nInstrument maintenance and troubleshooting\nMaintaining organized records of sample preparation and analysis, equipment maintenance and data collected off site\nMaintain consumables and parts for instruments\nOverhead projects designed to improve efficiency of, or accuracy of analyses\nCommunicating relevant updates to applicable people in a timely manner\nPerforming other duties and responsibilities as prescribed by the Company\nCompliance with Enthalpy’s Quality Assurance Program and other policies\nCompliance with Company’s Health and Safety Plan\nOther duties as assigned\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nBachelor’s degree or higher in Chemistry, Biology, or equivalent\nMinimum of 5 years relevant laboratory experience required\nMust have familiarity for the assays performed within laboratory\nThey must be able to handle some non-routine samples or situations\nThey must be able to work with only minimal instruction from their supervisor\nWithout supervision, they must be able to routinely meet QA/QC requirements for the assays they perform\nTheir documentation, timeliness, and throughput must meet the standard of the laboratory\nThey must possess in-depth knowledge and experience on the operation of the instrument or the chemistry involved in the assays they perform\nExceptional troubleshooting skills\n\nPreferred Skills\n\nSuperior knowledge of analytical method, analytical instruments, general lab practices and lab safety\nStrong scientific writing and presentation skills\nAnalytical thinking to solve technical problems\nStrong Research and Development skills\nEffective communication skills\nSuperior time management skills\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.","slug":"environmental-analyst-ii-volatile-f6ee5f9f-4257-4a1a-bee2-bef97016cb6b","benefits":["Disability insurance","Tuition reimbursement","401(k)","Parental leave"],"selectedSkills":["Writing skills","Research","Laboratory experience","Assays","Communication skills","Bachelor's degree"],"jobType":"free","applyURL":"https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-VA-Richmond-Reymet-Rd/Environmental-Analyst-II---Volatile_R2209?mode=job&iis=Job+Board&iisn=Indeed.com"},{"position":"Laboratory Manager","labName":"Adept Life Sciences","location":"Chandler, AZ","age":"7 days ago","type":"Full-time","jobDescriptionCopy":"We're looking for a Laboratory Manager to start up our new state of the art specialized chemistry and microbiology testing solution for the Nutraceutical, Food & Beverage, and Cannabis industries. They will be responsible for the overall operation and administration of the laboratory, including the employment of personnel who are competent to perform test procedures, record and report test results promptly, accurately and proficiently, and for assuring compliance with the applicable regulations.\n\n\nThe ideal candidate will have experience with ISO: 17025, Method development, Performance Tracking, Executive Leadership, Project Management, Regulatory Compliance, Laboratory Design, Operations Management and be a highly motivated self-starter comfortable working independently and with a team.\n\n\nRequired Skills and Experience:\n\n\n· Familiar with the following instrumentation: HPLC/UPLC, LC-MS/MS, GC-FID, GC-MS/MS, ICP-MS, HTPLC,\n\n\n· Validation methods for the above testing.\n· Familiar with LIMS for implementation and data entry and database management Ability to read and interpret documents such as safety rules.\n\n\n· Ground-up development and implementation of lab's required SOPs.\n\n\n· Implementation, management, and monitoring of lab equipment for quality assurance.\n\n\n· Interview, hire and train initial workforce with the intent to conduct 500 samples per month\n· Write SOPs to ensure strict adherence to GLP standards to obtain ISO 17025:2017 accreditation.\n\n\n· Deliver a roadmap for Potency Testing (PT) to upper management to achieve ISO 17025:2017 for select analyses.\n\n\n· Experience working in a heavily regulated industry preferred; Accredited laboratory environment requires strict adherence to safety and Quality Assurance protocols.\n\n\n· Proficiency with Microsoft Office suite required\n\n\n· Background check required\n\n\n· Benefits: Vacation, Paid Sick Leave, Health Benefits, Paid Holidays,\n\n\nJob Type: Full-time\n\n\nPay: From $60,000.00 per year\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\n\nSchedule:\n\n\n8 hour shift\n\nApplication Question(s):\n\n\nWhat is your desired salary?\n\nEducation:\n\n\nBachelor's (Required)\n\nWork Location: One location\n","slug":"laboratory-manager-6f5bcdb7-219d-4695-bcf0-df47f5656256","benefits":["Paid time off","Dental insurance","Paid sick time","Health insurance"],"selectedSkills":["Microsoft Office","Bachelor's degree","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=rNIibFKaeY9Jw5VSfhJH0VuRdgC5F7g8bnrsmWqLfvewAT4tQXbCPg"},{"position":"Marketing Director","labName":"Agricor Labs","location":"Remote","age":"59 minutes ago","type":"Full-time","jobDescriptionCopy":"Agricor and our sister hemp testing lab, Botanacor, have joined forces with SC Laboratories, Inc. based in Santa Cruz, CA, to provide cannabis and hemp brands with access to the most comprehensive, industry-forward testing solutions in North America.\n\n\nThe combination brings together three of the longest standing and most respected cannabis and hemp testing organizations in the U.S. and forms the foundation of a national testing network. The combination will bring value to both the hemp and cannabis industries, ranging from access to a broader range of testing resources, improved data delivery, innovative science, instrument redundancy and increased testing capacity, and improved operations to accelerate turnaround times.\n\n\nWe’re looking for a highly skilled Marketing Director to help us promote our new, greenfield SaaS product offering, and identify what consumers want so we can create quality features that meet their needs. Our ideal candidate will have extensive marketing experience and a comprehensive knowledge of branding; familiarity with the cannabis industry is a big plus. This candidate will have the ability to lead and own the market strategy and execution to support our go-to-market efforts, while working and interacting with 3rdparty vendors on a regular basis. If you enjoy fast paced start-up environments and have an understanding of what makes people tick and want to deliver solutions that make a difference, we would love to meet you.\n\n\nObjectives of this Role\n\n\nCollaborate with the product and business team to uncover insights and strategies to develop and implement marketing and branding strategies for new product, internally and externally.\nOversee and grow the marketing team using internal and external resources.\nConsistently feed the sales funnel with qualified leads.\nIdentify short-term and long-term scheduling, budget, and resource needs, including the development and management of an annual marketing budget, profit/loss projections, expenditure spending, and other financial considerations.\nUnderstand key marketing performance metrics and tracking tools to provide market research, forecasts, competitive analyses, campaign results, and consumer trends in order to translate results into actionable insights for the business.\n\nDaily and Monthly Responsibilities\n\n\nLead the development of our marketing plans working closely with stakeholders, management, creative and content teams, and distribution partners, to create an effective and efficient marketing strategy focused on establishing and growing audiences for our products and services.\nSpearhead the strategic and tactical execution of marketing campaigns, including design of test/control segmentation, implementation of A/B tests, tracking, results reporting, analysis, and recommendations.\nManage conception, development, and implementation of marketing plan and strategies, product concepts, and promotional programs to drive interest and sales.\nHold regular meetings with account managers to review pipeline, resolve challenges, and present possible solutions, and provide ongoing training to ensure team consistently performs above standard.\nAttend and/or participate at conventions, conferences, and tradeshows, preparing engaging displays and collateral as needed, and providing post-event reports and analysis.\n\nSkills and Qualifications\n\n\nBachelor’s degree in marketing, advertising, or communications preferred.\nSuccessful track record in senior marketing roles and creating marketing campaigns.\nExcellent leadership, communication, and decision-making skills.\nExperience with digital and print marketing, content marketing, and social media marketing.\nProven ability to plan and manage budgets.\n\nPreferred Qualifications\n\n\nMaster’s degree\nProficiency with HTML, content management systems, and design software\nEstablished network of media and PR contacts\nDesire to grow professionally with ongoing education\n\nAll employment offers will be contingent upon successful completion of a background check.\n\n\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.\n\n\nSC Laboratories provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.\n\n\nJob Type: Full-time\n\n\nPay: From $100,000.00 per year\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\nMonday to Friday\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nMarketing: 10 years (Required)\n\nWork Location: Remote\n","slug":"marketing-director-cd8d8328-6d8d-45ca-8ba7-099bc6a677dd","benefits":["Dental insurance","Health insurance","Paid time off","401(k)","Vision insurance"],"selectedSkills":["Communication skills","Marketing","Branding","HTML5","Bachelor's degree","Master's degree","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=M5MSWzaGbbiReFWTmk8s4Z2LpC8ceFM8mzmA6oQP_9LYiFb9WDK27Q"},{"position":"Quality Assurance Lead","labName":"Cannabis Testing Lab","location":"Sylmar, CA","age":"6 days ago","type":"Full-time","salaryMin":"$55,000 ","salaryMax":" $75,000 a year","jobDescriptionCopy":"Job Description\n\n\nThe Quality Assurance Lead develops, implements, and coordinates the company’s quality assurance program in accordance with ISO17025 guidelines and the California Department of Cannabis Control regulations.\n\n\nJob Duties\n\n\nJob duties and responsibilities will include, but not be limited to:\n\n\nResponsible for integrity of the quality management system\nManage CAPA system\nImprove upon the QA management system and ensure adherence with ISO17025 requirements and California Department of Cannabis Control regulations\nWork with outside auditors to renew annual ISO17025 accreditation\nMaintain staff training records\nEnsure laboratory logs are up to date\nAudit data packages and ensure they are completed in a timely manner\nDevelop and manage quality measurements for performance improvement\nConduct annual internal audit of laboratory\nRespond to outside audits via email and participate in on-site audits\nPrepare monthly quality reports for Laboratory Director\nManage the proficiency testing system\nUpdate company SOPs\nOther duties as assigned\n\nPreferred qualifications\n\n\nBachelor’s degree or advanced degree in chemistry, biology, or engineering\nExperience in an ISO17025 accredited testing laboratory, preferably a cannabis testing laboratory\nExperience in a quality assurance role\nAudit experience\nStrong verbal and written communications skills\nExperience with Microsoft Office Suite, including Excel and Word\nExperience with LIMS systems and Quality Management software\n\nJob Type: Full-time\n\n\nPay: $55,000.00 - $75,000.00 per year\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nVision insurance\n\nSchedule:\n\n\n8 hour shift\n\nAbility to commute/relocate:\n\n\nSylmar, CA 91342: Reliably commute or planning to relocate before starting work (Required)\n\nExperience:\n\n\nAuditing: 1 year (Preferred)\nISO 17025: 1 year (Preferred)\n\nWork Location: One location\n","slug":"quality-assurance-lead-713f0e63-441b-4c46-9934-a790afb40b80","benefits":["Dental insurance","Health insurance","Vision insurance"],"selectedSkills":["Quality management","Microsoft Excel","Laboratory information management systems","Laboratory experience","Quality assurance","Bachelor's degree","US work authorization"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=lHIpWCsjjlYO0UHQ2eWh-NXlD0B6KbWJSLLcjxPE87BNtXt-qRGbug"},{"position":"Molecular Technologist/Microbiologist","labName":"Apollo Labs","location":"Scottsdale, AZ","age":"4 days ago","type":"Full-time","salaryMin":"$40,000 ","salaryMax":" $50,000 a year","jobDescriptionCopy":"Please only apply if you meet the education requirements as we will not respond to any candidates who do not meet the criteria. Candidates willing to work second shift, third shift, and weekends will receive priority\n\n\nSalary\n\n\nUp to $50,000 per year\n\n\nJob Type\n\n\nFull-time\n\n\nQualifications\n\n\n· Bachelor’s degree from accredited college in related field (Biology, Microbiology, Cellular and Molecular Biology, Biochemistry, Chemistry etc.) is required\n\n\n· 2 years’ job experience in industry is preferred\n\n\nFull Job Description\n\n\nThis position is for the role of Molecular Technologist/Microbiologist at Apollo Labs, the fastest-growing cannabis safety- and potency-analysis laboratory in Arizona.\n\n\nAt Apollo, we are looking for individuals with experience in highly regulated industries with a strong focus on quality, cleanliness, and professionalism. We prioritize data quality and integrity – curious, eager, and ethical scientist are crucial to achieving those goals. Above all, we want to do good science that will build respect and trust for the cannabis industry. Priority is given to individuals with a pharmaceutical-industry, semiconductor-industry, or cGMP-regulated background. Cannabis industry experience is not required.\n\n\nExperience and role for molecular technologists and microbiologists is as follows:\n\n\nPCR/rt-qPCR experience (Mulitplex experience, Data analysis, PCR setup, etc.)\n\\*Two years preferred experience.\nTraditional Microbiology experience (Plating, serial dilutions, colony enumeration, colony identification, etc.)\n\\*Two years preferred experience.\nClean and maintain laboratory equipment, maintain sterility, and clean working conditions in microbiology lab spaces.\nSterile technique and good laboratory practices\nSample processing from drop-off to disposal (logistics, sampling, tracking, storage, disposal, 3rd party biowaste disposal)\nPotential to participate in a wide variety of analyses, to include: analysis of 55+ different pesticides in a variety of challenging matrices, 28+ residual solvents, 12+ cannabinoids, ultra-trace mycotoxins, heavy metals testing, and testing for a variety of microbial contaminants by traditional plate counting and qPCR\nCarefully document all steps of customer sample processing, and provide assistance to other chemists when requested\nFully review analytical data and perform regular deep-dives into data to assess instrument health.\nTake an active role in method improvement and method development\n\nAdditional job requirements:\n\n\nIdentifies opportunities for improvement; works with Department Head to implement new and improved methods and processes\n\n· Scientists will work with their respective Managers to ensure lab efficiencies for prioritization, workflow, and sample preparation, as well as the loading and running of instruments\n\n\nAssists with the upkeep and improvement of the quality management system to include Standard Operating Procedures (SOP’s) and the employee training programs\nPrepares calibrations and verifies quality controls for laboratory instruments and methods; uses data to recognize and/or correct possible processing or instrument errors. Scientists may be asked to assist in sample preparation and operation of a variety of instrumentation platforms and methods\nAcquires and analyzes data used to perform and report analytical laboratory testing of cannabis products\nImports data into LIMS system and into a Seed-to-Sale tracking system; provides for the documentation and tracking of analytical standards, certificates of analysis for chemicals and disposable tools, and daily logging of performance checks for laboratory balances, refrigerators/freezers, incubators, and any other ISO-regulated equipment\nPrepares reports related to cannabinoid potency, terpene potency, residual solvents, heavy metals, pesticides, microbiologic organisms, moisture content and mycotoxins\nSubmits data reports and Certificates of Analysis for Department Head approval \nProvides guidance and support for all duties commonly assigned to Field Samplers and Lab Technicians\nMay also be called upon to perform the same or similar duties at other laboratory facilities, and for other job-related duties as assigned\n\nTraining is provided for all methods, and scientists are given the opportunity to cross train onto any platform and participate in R&D work. Eagerness to learn, a positive attitude, and self-motivation are highly valued attributes. New graduates are invited to apply if they are able to demonstrate thorough knowledge of techniques and principles related to microbiology, in particular plating and RT-qPCR or applicable chemistry knowledge.\n\n\nJob Types: Full-time\n\n\nPay: Up to $50,000 per year, salaried\n\n\nBenefits:\n\n\nDental and Vision\nHealth insurance\nPaid time off\n\nSchedule:\n\n\n8 hour shift, 5 work days per week.\nHires willing to work Sunday to Thursday will receive first priority\nHires willing to work late or early shifts will also receive first priority\n\nApplication Question(s):\n\n\nWork Location: Scottsdale, AZ\n\n\nWork Remotely:\n\n\nNo\n\nJob Type: Full-time\n\n\nPay: $40,000.00 - $50,000.00 per year\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n10 hour shift\n8 hour shift\nWeekend availability\n\nCOVID-19 considerations:\nAll employees are expected to be vaccinated for COVID-19 - we will work to facilitate this if you are not yet vaccinated.\n\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nMicrobiology/ Molecular Biology: 2 years (Preferred)\n\nWork Location: One location\n","slug":"molecular-technologistmicrobiologist-33439425-b885-4fe7-9bf3-1ff162c7c74b","benefits":["Dental insurance","Health insurance","Paid time off","401(k)","Vision insurance"],"selectedSkills":["PCR","Laboratory experience","Molecular biology","Microbiology","Data analysis skills","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=eVWAjvARvOPYj9lrYGB9CVnPNtoueFUrueHJdOJ50KnSA2QnYNEuWw"},{"position":"Post Harvest Manager","labName":"JARS Cannabis","location":"Kingman, AZ","age":"7 days ago","type":"Full-time","jobDescriptionCopy":"Mohave Farms LLC\n\n\nWe are looking for an experienced, well organized, and highly skilled Post-Harvest Manager to help blossom our cultivation efforts. This role is for self-starters, and those who are not fazed by a large challenge in front of them. Previous management experience, extensive knowledge of cannabis cultivation, and a strong work ethic are required, as is a ‘by any means possible’ attitude towards achieving goals set forth in front of them. Additionally, specialized experience in the post-harvest side of production is required, as is advanced knowledge of drying and curing techniques. Experience with large scale (50,000 square feet and more) cultivation operations preferred. If you check all these boxes and are excited about the prospect of growing a company with tremendous potential from its early inception stages, this role might be for you; please read on, below.\n\n\nJob Title: Post Harvest Manager\n\n\nRate: Salaried - $65,000/Year, DOE\n\n\nLocation: Kingman, Arizona\n\n\nHours: 50+ hours/week, available to work six days (if needed)\n\n\nReports to: General Manager\n\n\nOverview\n\n\nThe Post-Harvest Manager plays a vital role in ensuring that our flower is dried, cured, trimmed, and packaged to the highest degree. Months of hard work will all land on your plate, and the final steps of the process – drying and curing – will ultimately determine the quality of our flower. Careful and meticulous attention to detail is integral, as is ensuring proper moisture content, terpene preservation, trichome preservation, and overall bag appeal. The Post-Harvest Manager will coordinate directly with the Greenhouse Manager, and General Manager, to ensure that intakes of harvests are happening on schedule, and that flower is preserved at the highest quality possible. You must have careful attention to detail as it relates to environmental controls of the drying room, and constantly monitor, assess, and adjust to changes around you. A scientific, analytic, and constantly improving mindset should converge with years of personal experience and all lend itself to a Post-Harvest Manager who can successfully reward the operation with the fruits of all our collective labor.\n\n\nYou will be directly responsible for managing, planning, organizing, and executing the goals set forth by management to ensure the overall workflow, and success, of all post-harvest operations, from intake through to packaging. The Post-Harvest Manager will report directly to the General Manager, and together will create a plan of action to meet the goals of upper management.\n\n\nTo best succeed the Post-Harvest Manager should be the type of person who can work in high stress situations while maintaining grace and composure. You are the type of person who can effectively plan, organize, prioritize, lead, and execute a plan from start to finish. Each day will bring its own set of challenges and priorities, and those who can efficiently manage a team under them, solve problems proactively, and hit quotas will thrive in this role. A Post Harvest Manager should have the hard skills of managing a large-scale greenhouse cultivation operation, as well as the soft skills to lead and manage a team of workers under them. Those who are natural born leaders and who can simultaneously teach, motivate, and empower employees are best suited for this role.\n\n\nPersonnel Duties & Responsibilities\n\n\nResponsible for overseeing the day-to-day post-harvest activities and adjusting workflow and procedures to increase yields, efficiency, and overall performance. Oversee proper techniques related to drying and curing, bucking, and trimming, as well as packaging and storing\nLead and manage four supervisors under you, including the Drying Zone Supervisor, the Processing Zone Supervisor, the Trimming Zone Supervisor, and the Curing Zone Supervisor\nMaintain the cleanliness of the facility, ensuring the drying, curing, bucking, trimming, and packaging rooms are cleaned to the highest standards daily (cleanliness is next to godliness)\nEnsure that the optimal temperature, humidity, air movement, etc. are achieved in the drying and curing rooms, and that the environment is carefully monitored, recorded, and maintained on a constant basis.\nCreate an ongoing maintenance schedule to look after HVAC equipment needed in the drying, curing, and storage rooms as well as for other tools and machinery used in the post-harvest production process\nEnsure cultivars are bucked and trimmed according to each plants unique structure, and cater workflow and operation to make sure that we have the highest quality flower possible, period.\nCreate, maintain, and update SOPs as related to ongoing post-harvest efforts, and enforce strict adherence throughout the facility\nOrganize workflow to meet specifications and deadline required by upper management and the needs of our dispensaries. Develop daily, weekly, and monthly plans, and create reports with production completion forecasts, yields, loss, etc. for upper management\nEnsure proper labeling, tagging, and general traceability of plants including plants counts (both physically and in LeafLogix), as well as taking corrective measures to account for plant inventory discrepancies. Ensure strains, and batches, are accounted for and well organized, weights are taken, and all compliance, both AZDHS and in house, is followed\nCoordinate and schedule with state testing laboratories to ensure proper testing is done on a batch basis and that any remediation efforts, if at all needed, are taken. Testing should be organized in a way to minimize the time our product sits at our facility\nAssist with calculating production yields and have a continuous improvement mindset to incrementally get more efficient as we grow in operations\nMonitor stock of post-harvest supplies, equipment, infrastructure, etc. and work with the General Manager and/or Procurement Manager to order supplies, and to make sure we always have the tools needed on hand\nProvide job responsibility, HR management, and task management, as well as work directly with the General Manager on reporting\nAble to lead teams in a way that inspires organizational growth and empowers, nurtures, and cares for employees\nAvailable to work 50+ hours a week, six days per week if needed\n\nIn addition to the above general, and expanded, job descriptions, this position might include other possible work depending on the needs of the facility, taking into account the current workload. Other duties as assigned.\n\n\nJob Requirements & Qualifications\n\n\nMinimum of 21 years of age, must possess a valid drives license or state ID card, and is authorized to work in the U.S.\n\n\nIn addition to the above requirements, one must be able to:\n\n\n- Sit or stand while performing repetitive motions for long periods of time\n\n\n- Work at a fast pace for prolonged periods, with high, sustained energy\n\n\n- Be able to lift at least 45 pounds\n\n\n- Work in hot, sunny, environments for long periods of time\n\n\n- Pass state mandated (ADHS) background check\n\n\nCompensation\n\n\nThis is a salaried position starting at $65,000 per year, depending on experience. Performance reviews will be conducted six months after the date of hire, and any increases in pay and/or bonuses are subject to both the performance of the employee, as well as the overall success of the operations, and are under the discretion of management. In addition to the above, our company provides the option for dental, medical, and vision health insurance, as well as life insurance.\n\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n\nI understand this job description and know that violating any of the requirements is grounds for immediate termination. I also realize that these criteria will be used to assess my suitability for employment, promotions, and raises. All staff are at-will employees, and new hires will have a thirty day ‘trial’ period whereby performance will be evaluated after the first thirty days of employment and a decision to maintain or terminate employment will be decided after said trial period ends.\n\n\nNo cannabis, or other substance use (including, but not limited to, tobacco and alcohol) will be tolerated during work hours, or while on site at our premises. Any indication of use can and will be used as grounds for immediate termination.\n\n\nManagement reserves the right to increase, or decrease, hours based on performance or operational needs.\n\n\nJob Type: Full-time\n\n\nPay: From $65,000.00 per year\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nVision insurance\n\nSchedule:\n\n\n10 hour shift\n12 hour shift\n8 hour shift\n\nAbility to commute/relocate:\n\n\nKingman, AZ 86401: Reliably commute or planning to relocate before starting work (Preferred)\n\nWork Location: One location\n","slug":"post-harvest-manager-da04ede2-9302-4d67-8db7-ab375f5a3a18","benefits":["Dental insurance","Health insurance","Vision insurance","Life insurance"],"selectedSkills":["Management","21 years or older","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=VC5jO_xZkL66JrigrBWMybLPlIlehX27gctR_S2TxyynHVFEMkgtUg"},{"position":"Chief Scientific Officer - Cannabis Testing Solutions","labName":"E4 Bioscience","location":"Chicago, IL","age":"2 days ago","type":"Full-time","salaryMin":"$175,000 ","salaryMax":" $225,000 a year","jobDescriptionCopy":"Chief Scientific Officer – Cannabis Testing Services\n\n\nAbout the Company\n\n\nFounded in 1925 and headquartered in Akron, Ohio, Smithers is a multinational provider of testing, consulting, information, and compliance services. With over 900 employees, it has laboratories and operations in North America, Europe, and Asia, and is currently undergoing a rapid expansion in cannabis safety testing. Currently, Smithers’ Cannabis Testing Services (CTS) business has three (3) testing laboratories and is expected to grow through a combination of greenfield build and acquisitions to 12-14 labs. This CSO position requires a combination of technical laboratory knowledge, business development acumen, and strong interpersonal skills.\n\n\nJob Summary\n\n\nRepresent Smithers to clients and perspective clients. Coordinate client events, attend trade shows, partner with subject matter experts and Sales and Marketing to prepare commercial material.\nHelp Cannabis Testing Services (CTS) President and State Directors prepare technical and commercial proposals for clients and prospects.\nSet standards that are applied across all CTS labs. This will include assisting in drafting job descriptions, participating in the hiring, mentoring, training and development of scientific staff across the CTS business.\nParticipate in the due diligence process for perspective acquisitions. This will include participation in the evaluation and valuation of new sites, evaluating the technical skills of the staff and overseeing the integration of technical staff and processes into Smithers.\nProvide consulting services to clients.\nBackfill critical technical roles should the business experience turnover. Likely positions include state director and operations manager positions.\n\nJob Duties\n\n\nEssential FunctionsThe technical face to the industry. This means participation in:\n\n\nCustomer visits and occasional discussions with clients about unusual results and what they mean.\nTrade shows.\nBreakfast/lunch seminars.\nDevelopment of marketing materials.\nParticipate in technical committees in the Industry as a technical expert.\nThe technical leader and standard setter for the division. This means participation in: Development of job descriptions, recruiting, hiring and mentorship of senior leaders at each site.\nCreating and implementing minimum standards for equipment, methods, and facilities.\nOngoing development of technical skills for him/herself as well as those of site leadership.\nEvaluate new test methods for implementation.\nOversight of the development and approval of analytical testing method development, optimization, and validation, and new technology additions to the division.\nTrouble-shooting suspect results/methods.\nSupporting cross-departmental compliance with all relevant regulations including: ISO 17025, AOAC International, ASTM, USP, etc...\nMust be able to understand and follow laboratory safety standards.\nNew site development. This means participation in: Evaluation and valuation of new sites for acquisition.\nTechnical due diligence.\nTechnical integration.\nAdvisory/project consulting.\nProvide extra support to a site if we have turnover in the site director role.Location: There is a preference for candidates to live in Akron, OH (Assistance will be provided for candidates if needed) but we are flexible to candidates living in any of the primary CTS locations (ex: NY, NJ or IL)\n\nTravel Requirements:\n\n\nOvernight travel: 40% out of office travel. Majority travel is overnight.\n\nJob Specifications and Qualifications\n\n\nMinimum a bachelors, preferably a masters degree or above in either biology or chemistry.\nAt least (2) years and strong preference for (5) plus years working with cannabis technology.\n(10) plus years of cumulative work experience.\nExceptional technical writing skills [written and oral comprehension, written and oral expression].\nExceptional ability to integrate observations [visual and written discrimination] into evaluation process.\nExceptional problem-solving skills [mathematical reasoning].\nAbility to work at a fast pace, prioritize work assignments for assigned staff and handle stress [high productivity].\nComfortable working with standard computer software [word processing, spreadsheets, data bases, statistical software].\n\nJob Type: Full-time\n\n\nPay: $175,000.00 - $225,000.00 per year\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nFlexible schedule\nHealth insurance\nLife insurance\nPaid time off\nRelocation assistance\nVision insurance\n\nSchedule:\n\n\nMonday to Friday\n\nWillingness to travel:\n\n\n25% (Required)\n\nWork Location: On the road\n","slug":"chief-scientific-officer-cannabis-testing-solutions-28ec79bc-ccac-4264-8ec4-31ee6fee4746","benefits":["Dental insurance","Health insurance","401(k) matching","Paid time off","Flexible schedule"],"selectedSkills":["Technical writing","Statistical software","Business development","Bachelor's degree","Master's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=2M6RJjhoBGjSTHmH0HH2uHE1EMu-ZdqI3dZiWe-4ZqrFBQI7CThZtA"},{"position":"Level II Biochemist for cannabis lab","labName":"Keystone State Testing","location":"Harrisburg, PA","age":"6 days ago","type":"Full-time","salaryMin":"$55,000 ","salaryMax":" $80,000 a year","jobDescriptionCopy":"Patients, Growers and Physicians rely on our analytical testing, information and services to help them make better decisions. These are often serious decisions with far reaching consequences, and require sensitivity, tact and a clear dedication to service. It's about providing clarity and hope.\n\n\nAs a team member you will work for the world leader in the industry, with a career where you can expand your skills and knowledge. You'll have a role where you can act with professionalism, you can inspire colleagues, and you can care about the work we do and the people we serve.\n\n\nAt KST, Our team members play an essential role in our success and in the services we provide. As a career, we offer a unique opportunity to develop your career with the #1 testing Lab in the US. We are tech driven, and we're creating the lab of the future - an environment where you can deliver cutting edge analytics and help us drive new discoveries and breakthroughs.\n\n\nBasic Purpose:\n\n\nThe Biochemist position is a level II position for an individual with prior laboratory experience. The individual will perform routine and limited non-routine functions to aid in the preparation of and testing of samples.\n\n\nMUST'S:\n\n\nAbility to follow Instruction (If you are not exceptional at following instruction, this is not for you)\nAbility to travel / relocate as needed\nPass a full FBI background check\n\nDO NOT APPLY IF:\n\n\nYou can not follow instructions\nIf you are not willing to interview in person (We are not holding phone interviews at this time)\nyou can not relocate (we will provide assistance)\n\nResponsibilities include, but are not limited to, the following:\n\n\nPrepare samples for analysis using various methods in accordance with ISO standard operating procedures.\nData handling and report preparation.\nEquipment familiarity preferred but not required (HPLC, LC-MS/MS, GC-MS/MS, ICPMS/MS)\nPerform various microbiological tests for MMJ products such as total plate count, yeast and mold count, ecoli, salmonella, etc.\nPerform various tests for pharmaceutical grade products such as Microbiological Examination of Non Sterile Products, Antimicrobial Effectiveness, Stability, Sterility Test, Environmental Monitoring, etc.\nWork in fast paced, dynamic environment.\nVisit client facilities to perform sampling.\nEvaluate data\n\nAn ideal candidate would possess:\n\n\nAt Minimum a B.S in Bio-Physics, Bio-Chemistry, Micro-Bio, or Chemistry\nAt least 2 years of laboratory experience in a relevant field\nCandidates with strong science backgrounds are encouraged to apply. Bio-Physics/ Chemistry/ Micro-Bio or General Lab experience is preferred.\nMust be fluent with Microsoft Office, specifically Excel and Word.\nFamiliarization with a wide range of analysis methods, sampling equipment and instrumentation a plus.\nSelf-motivated, responsible individual with good communication skills and willingness to learn and progress over time through consistent dedication and training. The position requires the individual to multi-task, be independent/self-sufficient, and be flexible and participate in a team environment.\nQuality Control experience.\nHigh attention to detail.\nAbility to work quickly and efficiently in a high pressure environment, while maintaining the highest level of quality.\nConscientious and responsible.\n\nWe Offer :\n\n\nOpportunity for fast growth and advancement\n\n\nJob Type: Full-time\n\n\nPay: $55,000.00 - $80,000.00 per year\n\n\nBenefits:\n\n\nDental insurance\nFlexible schedule\nFlexible spending account\nHealth insurance\nPaid time off\nParental leave\nRelocation assistance\nVision insurance\n\nSchedule:\n\n\n10 hour shift\n8 hour shift\n\nSupplemental Pay:\n\n\nCommission pay\n\nAbility to commute/relocate:\n\n\nHarrisburg, PA 17109: Reliably commute or planning to relocate before starting work (Required)\n\nExperience:\n\n\nBiochemistry: 1 year (Preferred)\nLaboratory experience: 1 year (Preferred)\n\nWillingness to travel:\n\n\n25% (Preferred)\n\nWork Location: One location\n","slug":"level-ii-biochemist-for-cannabis-lab-9cabc3cd-659e-4a7a-896d-9236eea44b27","benefits":["Dental insurance","Health insurance","Flexible schedule","Flexible spending account","Paid time off"],"selectedSkills":["Microsoft Excel","Laboratory experience","Communication skills","Biochemistry","Quality control","Bachelor of Science","Bachelor's degree","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=U2k8_PthxbHYmxuLa1iS4GWfNkvBkhF_tvPm71NliAbDH6pZpbsbMQ"},{"position":"Chemist II","labName":"Green Leaf Lab","location":"Portland, OR","age":"6 days ago","type":"Full-time","salaryMin":"$22.50 an hour","jobDescriptionCopy":"THE COMPANY: Green Leaf Lab is the nation's first licensed and accredited cannabis analytical laboratory. We are a full-service, production oriented, cannabis and hemp laboratory using cutting-edge technology to characterize the chemical, physical, biological, and microbial properties of a wide range of samples submitted for regulatory compliance and operational purposes. We are team oriented and focused on excellent service. We are looking for a Chemist II to join our team.\n\n\nJOB SUMMARY: The Chemist II is a key collaborative member that supports Green Leaf Labs philosophy and organizational goals. This position will be responsible for running, troubleshooting and analyzing samples with a GC, GCMS, LCMSMS, HPLC and/or ICPMS system utilizing standardized and in-house lab methodology; writing and reviewing standard operating procedures (SOP’s); and performing basic and complex laboratory operations including sampling, chromatographic and material assays. This position will also assist with method development as required.\n\n\nESSENTIAL DUTIES/KEY RESPONSIBILITIES:\n\n\n· Responsible for the setup, running and troubleshooting of GC (GCMS, GCMSMS etc.), LCMSMS, HPLC systems.\n\n\n· Responsible for maintaining validated NELAC TNI 2016 and ISO 17025 standards of performance for analytical chemical testing.\n\n\n· Responsible for daily sample preparation and data analysis to ensure laboratory runs smoothly and meets required turnaround times.\n\n\n· Responsible for ensuring compliance with internal Standard Operating Procedures (SOPs) and quality systems.\n\n\n· Responsible for Developing procedures for documenting results from data collected.\n\n\n· Responsible for ensuring test equipment is clean, maintained and in good working order.\n\n\n· Responsible for maintaining a safe, clean and sanitary work area.\n\n\n· Responsible for maintaining an accurate notebook, logbook and other required documentation protocols.\n\n\n· Responsible for following all safety procedures and documents.\n\n\n· Responsible for ensuring high quality standard are met through performing calibrations, quality checks and proficiency programs.\n\n\n· Responsible for maintaining inventory tracking as required.\n\n\nQUALIFICATIONS:\n\n\n· Bachelor’s degree in biological, chemical, agricultural, environmental, or related sciences from an accredited college or university.\n\n\n· Minimum 2 years analytical laboratory experience with hands on experience with instrument maintenance and troubleshooting.\n\n\n· Experience with data analysis and Laboratory Information Management Systems (LIMS).\n\n\n· Experience with the following instrumentation: HPLC, GCMS, LC-MS/MS, GC-MS/MS, ICP\n\n\n· Experience with Problem solving with ability to see whole picture and impact to data.\n\n\n· Experience with method development and method optimization.\n\n\n· Experience importing, validating, and exporting electronic data in a variety of formats.\n\n\n· Experience monitoring consumable inventory and ordering supplies.\n\n\n· Experience with working under NELAC TNI 2016 and ISO 17025 Standard.\n\n\n· Excellent analytical skills and attention to detail.\n\n\n· Excellent leadership ability and interpersonal skills.\n\n\n· Excellent organizational and problem-solving skills.\n\n\n· Ability to formulate and clearly communicate ideas, both verbally and in writing.\n\n\n· Ability to work independently with little guidance, as well as provide support and training for others in a team environment.\n\n\n· Ability to adapt to a fast-changing work environment.\n\n\n· Ability to be flexible and change as business grows and changes.\n\n\n· Ability to work collaboratively as a team.\n\n\n· Ability to prioritize and meet deadlines.\n\n\n· Ability to stand for long periods.\n\n\n· Ability to lift 40-60lbs.\n\n\n· Ability to pass a background check.\n\n\n· Proficiency with Microsoft Word, Excel and Outlook.\n\n\n· Problem Solving, solution oriented and production driven.\n\n\nEDUCATION:\n\n\n· Bachelor’s degree in biological, chemical, agricultural, environmental, or related sciences from an accredited college or university.\n\n\nEXPERIENCE:\n\n\n· Analytical laboratory: 2 years (Required)\n\n\nJOB TYPE: Full-time, Non-exempt.\n\n\nBENEFITS:\n\n\n· Dental insurance.\n\n\n· Health insurance.\n\n\n· Paid time off.\n\n\n· Vision insurance.\n\n\nSCHEDULE:\n\n\n· Tuesday-Saturday.\n\n\n· Additional evening and weekend work as needed.\n\n\nWORK LOCATION:\n\n\n· Portland\n\n\nCOMPENSATION: $22.50 HR\n\n\nJob Type: Full-time\n\n\nPay: $22.50 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nWeekend availability\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nAnalytical Laboratory: 2 years (Preferred)\n\nWork Location: One location\n","slug":"chemist-ii-0afe27f6-9025-4e78-a47e-1144167b1749","benefits":["Dental insurance","Health insurance","Paid time off","Vision insurance"],"selectedSkills":["Writing skills","Analysis skills","Microsoft Excel","High-performance liquid chromatography","Microsoft Outlook","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=qp1AoGL-CnaLYi9qlDellcRJeUtJ5dyUQ5QMIk2xRjAzvo5cxnvVgA"},{"position":"Analytical Chemist","labName":"US Cannabis Laboratories, Inc.","location":"Needles, CA","age":"7 days ago","type":"Full-time","salaryMin":"$60,000 a year","jobDescriptionCopy":"About us\n\n\nUS Cannabis Laboratories, Inc. is a start up company. We are in process of validation and will provide training. Our goal is to Provide honest cannabis testing results .\n\n\nOur work environment includes:\n\n\nFlexible working hours\nLively atmosphere\nRelaxed atmosphere\nResponsible for ensuring that the laboratory achieves and maintains a laboratory quality assurance program as required by state regulations.\nEnsures ISO 17025 practices are followed at all times.\nManages multiple analytical projects related to the development, qualification and/or troubleshooting of sensitive, efficient, and reliable assays for a wide class of molecules simultaneously.\nPrepares, reviews, and edits method transfer, qualification, and validation protocols, analytical technical reports, and regulatory documentation.\nMaintains equipment and instruments in good operating condition, recognizes any malfunctions and troubleshoots as needed.\nEnsures compliance with all regulatory agency requirements through documentation, audits, and corrective action.\nParticipates in the development of new SOPs, new validations tests.\nPerforms quality control procedures to ensure accuracy of clinical data.\nParticipates in the updating of departmental standard operating procedures and databases to accurately reflect the current practices in the laboratory.\n\nJob Qualifications & Requirements: Knowledge/Skills/Abilities\n\n\nHands-on experience with analytical instruments used in cannabis labs, HPLC, LC-MS, GC, GCMS & ICP-MS & common laboratory equipment.\nExperience in a certified lab and regulated environment, including such things as GLP/GMP, ISO 17025, state or federally licensed laboratories. Examples:\n\no Certified cannabis testing\no Pharmaceutical\no Food chemistry, food testing o Environmental\n\n\nExtensive knowledge and experience with qualitative and quantitative analytical chemistry techniques and principles.\nExperience in following and explaining methods, SOPs, operating principles.\nExperience with preparation of standards, solutions, use of specialty chemicals.\nSkilled at analytical technique troubleshooting.\nLaboratory and instrument maintenance.\n\nCompetencies\n\n\nDemonstrates strong leadership abilities and excellent interpersonal skills.\nSuperior oral and written communication skills.\nExcellent critical thinking skills and detail-oriented.\nMust be flexible and adaptable to shifting priorities.\nProficiency with Microsoft Word, Excel and Outlook.\nProven organizational and problem-solving abilities.\nAbility to work independently and with little guidance.\nAble to stand for long periods of time.\n\nEducation/Experience\n\n\nThe Analytical Chemist must have, at a minimum, a master’s or a bachelor’s degree in biological, chemical, agricultural, environmental or related sciences from an accredited college or university, plus at least two years of full-time practical analytical laboratory experience.\nMust complete a background check. New hires will be subject to a 9-month probationary period with evaluations conducted every 90 days to monitor performance and suitability for continued employment. Training on how to operate laboratory instruments will be conducted at the start of employment.\n\n\nJob Type: Full-time\n\n\nPay: $60,000.00 per year\n\n\nSchedule:\n\n\nMonday to Friday\n\nWork Location: One location\n","slug":"analytical-chemist-736082b6-06bf-47ee-9ed8-607b35e7f433","benefits":["Flexible schedule"],"selectedSkills":["Microsoft Excel","Microsoft Outlook","Laboratory experience","Communication skills","Analytical chemistry","Bachelor's degree","Master's degree","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=k0wxk5-cdY7r9t9BHbhvVyOkSAH6zkOYTE4nfN-S3M5Q39vlxeASLA"},{"position":"Scientist 1","labName":"Green Leaf Lab","location":"Sacramento, CA","age":"7 days ago","type":"Full-time","salaryMin":"$25 an hour","jobDescriptionCopy":"THE COMPANY: Green Leaf Lab is the nation's first licensed and accredited cannabis analytical laboratory. We are a full-service, production oriented, cannabis and hemp laboratory using cutting-edge technology to characterize the chemical, physical, biological, and microbial properties of a wide range of samples submitted for regulatory compliance and operational purposes. We are team oriented and focused on excellent service. We are looking for a Scientist 1 to join our team.\n\n\nJOB SUMMARY:  The California Scientist 1 is a key collaborative member that supports Green Leaf Labs philosophy and organizational goals. This position will be responsible for running, troubleshooting and analyzing samples with a GC, GCMS, LCMSMS, HPLC, and/or ICP system utilizing standardized and in-house lab methodology; writing and reviewing standard operating procedures (SOP’s); and performing basic and complex laboratory operations including sampling, chromatographic and material assays. This position will also assist with method development as required.\n\n\nESSENTIAL DUTIES/KEY RESPONSIBILITIES:\n\n\n· Responsible for the setup, running and troubleshooting of GC (GCMS, GCMSMS etc.), LCMSMS and ICP systems.\n\n\n· Responsible for maintaining validated ISO 17025 standards of performance for analytical chemical testing.\n\n\n· Responsible for daily sample preparation and data analysis to ensure laboratory runs smoothly and meets required turnaround times.\n\n\n· Responsible for ensuring compliance with internal Standard Operating Procedures (SOPs) and quality systems.\n\n\n· Responsible for Developing procedures for documenting results from data collected.\n\n\n· Responsible for ensuring test equipment is clean, maintained and in good working order.\n\n\n· Responsible for maintaining a safe, clean and sanitary work area.\n\n\n· Responsible for maintaining an accurate notebook, logbook and other required documentation protocols.\n\n\n· Responsible for following all safety procedures and documents.\n\n\n· Responsible for ensuring high quality standard are met through performing calibrations, quality checks and proficiency programs.\n\n\n· Responsible for maintaining inventory tracking as required.\n\n\nQUALIFICATIONS:\n\n\n· Bachelor’s degree in biological, chemical, agricultural, environmental, or related sciences from an accredited college or university.\n\n\n· Minimum 2 years analytical laboratory experience with hands on experience with instrument maintenance and troubleshooting.\n\n\n· Experience with data analysis and Laboratory Information Management Systems (LIMS).\n\n\n· Experience with the following instrumentation: HPLC, GCMS, LC-MS/MS, GC-MS/MS, ICP\n\n\n· Experience with Problem solving with ability to see whole picture and impact to data.\n\n\n· Experience with method development and method optimization.\n\n\n· Experience importing, validating, and exporting electronic data in a variety of formats.\n\n\n· Experience monitoring consumable inventory and ordering supplies.\n\n\n· Experience with working under ISO 17025 Standard.\n\n\n· Excellent analytical skills and attention to detail.\n\n\n· Excellent leadership ability and interpersonal skills.\n\n\n· Excellent organizational and problem-solving skills.\n\n\n· Ability to formulate and clearly communicate ideas, both verbally and in writing.\n\n\n· Ability to work independently with little guidance, as well as provide support and training for others in a team environment.\n\n\n· Ability to adapt to a fast-changing work environment.\n\n\n· Ability to be flexible and change as business grows and changes.\n\n\n· Ability to work collaboratively as a team.\n\n\n· Ability to prioritize and meet deadlines.\n\n\n· Ability to stand for long periods.\n\n\n· Ability to lift 40-60lbs.\n\n\n· Ability to pass a background check.\n\n\n· Proficiency with Microsoft Word, Excel and Outlook.\n\n\n· Problem Solving, solution oriented and production driven.\n\n\nEDUCATION:\n\n\n· Bachelor’s degree in biological, chemical, agricultural, environmental, or related sciences from an accredited college or university.\n\n\nEXPERIENCE:\n\n\n· Analytical laboratory: 2 years (Required)\n\n\nJOB TYPE: Full-time, Non-exempt.\n\n\nBENEFITS:\n\n\n· Dental insurance.\n\n\n· Health insurance.\n\n\n· Paid time off.\n\n\n· Vision insurance.\n\n\nSCHEDULE:\n\n\n· Tuesday-Saturday.\n\n\n· Additional evening and weekend work as needed.\n\n\nWORK LOCATION:\n\n\n· Sacramento.\n\n\nCOMPENSATION: $25 HR\n\n\nJob Type: Full-time\n\n\nPay: $25.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nWeekend availability\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nAnalytical Laboratory: 2 years (Required)\ndata analysis: 2 years (Preferred)\nLaboratory Intake Management System: 2 years (Preferred)\n\nWork Location: One location\n","slug":"scientist-1-5b556454-0bf4-48a3-840b-92228f2857d0","benefits":["Dental insurance","Health insurance","Paid time off","Vision insurance"],"selectedSkills":["Writing skills","Analysis skills","Microsoft Excel","High-performance liquid chromatography","Microsoft Outlook","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=M8Tb4WrtUoMOXvnHcDK3c41Pzt4o1oD_QMvDkwwAXFwKnE_dUJn1jA"},{"position":"Microbiologist","labName":"Green Leaf Lab","location":"Sacramento, CA","age":"6 days ago","type":"Full-time","salaryMin":"$25 an hour","jobDescriptionCopy":"THE COMPANY: Green Leaf Lab is the nation's first licensed and accredited cannabis analytical laboratory. We are a full-service, production oriented, cannabis and hemp laboratory using cutting-edge technology to characterize the chemical, physical, biological, and microbial properties of a wide range of samples submitted for regulatory compliance and operational purposes. We are team oriented and focused on excellent service. We are looking for a Microbiologist to join our team.\n\n\nJOB SUMMARY: The Microbiologist is a key collaborative member that supports Green Leaf Labs philosophy and organizational goals. This position will be responsible for running, troubleshooting, and analyzing cannabis and hemp samples for microbiological pathogens utilizing PCR, ELISA and Microscopy utilizing standardized and in-house methodology; writing and reviewing standard operating procedures (SOP’s); and performing basic and complex laboratory operations. This position will also assist with method development as required.\n\n\nESSENTIAL DUTIES/KEY RESPONSIBILITIES:\n\n\n· Responsible for the analysis of cannabis and hemp samples utilizing PCR.\n\n\n· Responsible for media preparation, data entry, reporting for microbiological samples.\n\n\n· Responsible for maintaining validated ISO 17025 standards of performance for microbiological testing.\n\n\n· Responsible for maintaining aseptic techniques in the laboratory.\n\n\n· Responsible for daily sample preparation and data analysis to ensure laboratory runs smoothly and meets required turnaround times.\n\n\n· Responsible for ensuring compliance with internal Standard Operating Procedures (SOPs) and quality systems.\n\n\n· Responsible for Developing procedures for documenting results from data collected.\n\n\n· Responsible for ensuring test equipment is clean, maintained and in good working order.\n\n\n· Responsible for maintaining a safe, clean, and sanitary work area.\n\n\n· Responsible for maintaining an accurate notebook, logbook, and other required documentation protocols.\n\n\n· Responsible for following all safety procedures and documents.\n\n\n· Responsible for ensuring high quality standards are met through performing calibrations, quality checks and proficiency programs.\n\n\n· Responsible for maintaining inventory tracking as required.\n\n\nQUALIFICATIONS:\n\n\n· Bachelor’s degree in biological, chemical, agricultural, environmental, or related sciences from an accredited college or university.\n\n\n· Minimum 2 years microbiological laboratory experience with hands on experience with instrument maintenance and troubleshooting.\n\n\n· Ability to perform effective pipette technique.\n\n\n· Experience with data analysis and Laboratory Information Management Systems (LIMS).\n\n\n· Experience with Problem solving with ability to see whole picture and impact to data.\n\n\n· Experience with method development and method optimization.\n\n\n· Experience importing, validating, and exporting electronic data in a variety of formats.\n\n\n· Experience monitoring consumable inventory and ordering supplies.\n\n\n· Experience with working under ISO 17025 Standard.\n\n\n· Excellent analytical skills and attention to detail.\n\n\n· Excellent leadership ability and interpersonal skills.\n\n\n· Excellent organizational and problem-solving skills.\n\n\n· Ability to formulate and clearly communicate ideas, both verbally and in writing.\n\n\n· Ability to work independently with little guidance, as well as provide support and training for others in a team environment.\n\n\n· Ability to adapt to a fast-changing work environment.\n\n\n· Ability to be flexible and change as business grows and changes.\n\n\n· Ability to work collaboratively as a team.\n\n\n· Ability to prioritize and meet deadlines.\n\n\n· Ability to stand for prolonged periods.\n\n\n· Ability to lift 40-60lbs.\n\n\n· Ability to pass a background check.\n\n\n· Knowledge of routine microbiological methods for the analysis of environmental, agricultural and food samples, including AOAC, FDA, BAM, ISO.\n\n\n· Proficiency with Microsoft Word, Excel, and Outlook.\n\n\n· Problem Solving, solution oriented and production driven.\n\n\nEDUCATION:\n\n\n· Bachelor’s degree in biological, chemical, agricultural, environmental, or related sciences from an accredited college or university.\n\n\nEXPERIENCE:\n\n\n· Microbiological laboratory: 2 years (Required)\n\n\nJOB TYPE: Full-time, Non-exempt.\n\n\nBENEFITS:\n\n\n· Dental insurance.\n\n\n· Health insurance.\n\n\n· Paid time off.\n\n\n· Vision insurance.\n\n\nSCHEDULE:\n\n\n· Tuesday-Saturday.\n\n\n· Additional evening and weekend work as needed.\n\n\nWORK LOCATION:\n\n\n· Sacramento.\n\n\nCOMPENSATION: $25 HR\n\n\nJob Type: Full-time\n\n\nPay: $25.00 per hour\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nWeekend availability\n\nEducation:\n\n\nBachelor's (Required)\n\nExperience:\n\n\nMicrobiological Laboratory: 2 years (Required)\n\nWork Location: One location\n","slug":"microbiologist-e10ea741-9e07-4c22-a321-048cbcdb04dd","benefits":["Dental insurance","Health insurance","Paid time off","Vision insurance"],"selectedSkills":["Writing skills","Analysis skills","Microsoft Excel","Microsoft Outlook","Laboratory experience","Bachelor's degree","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=oCx8ScUbP1dyyp7ld65P9v0Kr9HyEeVl5wAEKtoXfCFggSPd2Wp5SA"},{"position":"Microbiologist","labName":"Greenleaf Labs","location":"Poteau, OK","age":"6 days ago","type":"Full-time","jobDescriptionCopy":"Strong leadership, troubleshooting instrumentation, work with vendors, take direction from management, be organized and prepared, understand and meet timelines. Data management reporting and ability to follow standard operating procedures a must. Chemical extraction, sample preparation and analysis for cannabis using qPCR. Willingness to follow internal quality system requirements. Ensuring SOP's are written or up-to-date for laboratory processes. Familiar with Oklahoma State regulation for cannabis a plus. Implements and maintains appropriate quality control processes and procedures to guarantee accuracy of analysis and quality of results. Performs review of reported data and associated quality control and preparing reports for delivery to client. Responsibilities may include general instrument troubleshooting. Responsible for ensuring that inventory is properly maintained and ordered on time to meet production demands.\n\n\nMust have laboratory experience and be familiar with ISO 17025 requirements. Must have a history of working in a laboratory and an understanding of meeting deadlines. Must understand calculating workflow, turnaround times, and streamlined approaches. Must be able to prioritize and multi-task. MUST HAVE: Minimum Bachelor's Degree applicable to a laboratory testing environment, with a minimum of two (2) years of experience.\n\n\nJob Type: Full-time\n\n\nPay: From $54,000.00 per year\n\n\nBenefits:\n\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\n\nSupplemental Pay:\n\n\nBonus pay\n\nWork Location: One location\n","slug":"microbiologist-995144c1-232d-48b4-8d6c-42904a881cf5","benefits":["Paid time off","Dental insurance","Health insurance","Vision insurance"],"selectedSkills":["Laboratory experience","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=JxhzUgXsriBzTdsm1ZCMPn-9oGj8CZ0TTf4LXlhWvPz29Nzu6gpS6Q"},{"position":"Cannabis Extraction Lab Technician","labName":"Ocean Breeze Cultivators LLC","location":"Gloucester, MA","age":"5 hours ago","type":"Full-time","salaryMin":"$17 ","salaryMax":" $18 an hour","jobDescriptionCopy":"Cannabis Extraction Lab Technician\n\n\nJOB OVERVIEW: The Extraction Lab Technician supports the preparation and execution of the extraction process. This position is responsible for monitoring and maintaining cleanliness, efficacy, and efficiency of the manufacturing processes.\n\n\nThe Extraction LabTechnician will strictly follow the company’s standard operating procedures and quality control measures to maintain production of high-quality products. The position is responsible for carrying out day-to-day tasks including prepping, measuring, extracting, refining, and packaging of cannabis products.\n\n\nThe Extraction Technician must monitor and maintain the laboratory environment in accordance with company needs and state regulations.\n\n\nREPORTS TO: Head of Extraction\n\n\nESSENTIAL RESPONSIBILITIES AND DUTIES • Properly handle pre-extraction plant matter with care and attention. • Perform extractions following standard operating procedures. • Provide vital systematic cleaning and sanitization of the extraction laboratory. • Understand and comply to procedures, methodologies, and compliance steps for tracking cannabis product from seed to sale. • Accurately calibrate scales and balances to ensure proper measurement of products. • Ensure consistency and efficacy of product through quality control testing, standard operating procedures and proper documentation. • Ensure personal hygiene is acceptable before performing any production activities by washing hands, wearing a hair net and other personal protective equipment, etc. • Sanitize all production equipment and tools including workspace, utensils, containers, and machinery. • Assist Head of Extraction with the creation of batch production records and labels in accordance with state regulations. • Assist Head of Extraction with the weighing, packaging, labeling, and documentation of all products, as well as the tracking of batch numbers, lot numbers, and expiration dates. • Ensure the above information is accurate, appropriately documented and listed clearly in accordance with the state regulations and company standard operating procedures. • Additional job duties as assigned.\n\n\nQUALIFICATIONS/ REQUIREMENTS: • Must have knowledge of or in the process of learning about cannabis processing and extraction. • Must have understanding of functions relating to an extraction laboratory. • Familiar with industry terminology and scientific techniques of a commercial cannabis lab. • Ability to work in a fast-paced, changing, and challenging environment. • High level of integrity and a strong work ethic. • Strong interpersonal skills; team player. • Demonstrated ability to work comfortably and effectively within a diverse, multicultural, multigenerational environment. • Must be 21+, with a valid State ID\n\n\nEDUCATION/ EXPERIENCE:\n\n\nRequired: High School Diploma, Bachelor of Science (Preferred)\n\n\nWork Experience: 2 to 3 years working in a team environment.\n\n\nLANGUAGE SKILLS: Ability to read, write and speak English fluently. Ability to read and interpret documents such as standard operating procedures, employee handbook and other company documents.\n\n\nOTHER SKILLS, ABILITIES AND/OR TRAINING: • Knowledge of state medical marijuana regulations • Basic understanding of chemistry. • Committed to providing outstanding service both internally and externally. • Ability to preserve confidentiality of information. • Ability to work as part of a team to achieve company goals. • Ability to work weekends on an occasional basis. • Ability to work extended days on an occasional basis. • Ability to work daytime or evening hours. • Demonstrate accuracy and attention to detail. • Ability to organize and prioritize a variety of tasks/ projects. • Ability to work within strict time frames and resolute deadlines. • Ability to work within the company’s strategic approach as designed by the executive team. Personal transportation.\n\n\nPHYSICAL DEMANDS The physical demands described below are representative of those that must be met to successfully perform the essential responsibilities and duties of this job. Regularly required to do the following activities: • Stand dynamically for long periods without a break. • Use hands to finger, handle, and/or feel; the ability to type, pick, pinch with fingers, seize, hold, grasp or turn with hands and perceive attributes of objects and materials such as size, shape, temperature, or texture, by touching with fingertips • Maintain balance while walking, standing or crouching. • Twist upper torso. • Reach up and out with hands and arms. • Ability to lift 20 to 40 pounds and carry a distance of one hundred feet.\n\n\nJob Type: Full-time\n\n\nPay: $17.00 - $18.00 per hour\n\n\nBenefits:\n\n\nHealth insurance\nPaid time off\n\nSchedule:\n\n\n8 hour shift\n\nAbility to commute/relocate:\n\n\nGloucester, MA 01930: Reliably commute or planning to relocate before starting work (Required)\n\nWork Location: One location\n","slug":"cannabis-extraction-lab-technician-7ff79c5c-699f-4a4f-a67d-c5a1203c3279","benefits":["Paid time off","Health insurance"],"selectedSkills":["Typing","Bachelor of Science","Bachelor's degree","High school diploma or GED","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=hbClrAEz7XPz4gm11cKoxXDIR6aROQE6YKY35_g3zme5K8kHNt1YDA"},{"position":"Lead Lab Technician","labName":"Green Thumb","location":"Paterson, NJ","age":"1 day ago","salaryMin":"$32,000 ","salaryMax":" $44,000 a year","jobDescriptionCopy":"The Role\n\nEvery day in the lab, our team works the magic of distillation, extraction, winterization, and the production of our cannabis-infused products. The Lab Technician is there to grind away at the day to day details that go into running the lab. The ideal candidate is a positive team-player with an extra dab of attention to detail. As a naturally curious human, you will study and comprehend all policies, procedures and operational guidelines set by the management team to help our lab team achieve the high standards we set for ourselves. Provides direction to team in absence of Lab Supervisor.\n\nResponsibilities\nLeads and assures accurate preparation of oil and MIP formulations\nMaintains inventory of respective space\nResponsible for hygiene, organization, and overall appearance of laboratory\nFamiliarity with basic scientific principles and laboratory experience. Can follow written direction and maintain a laboratory notebook\nSolves equipment failures and works with leadership to address more complicated issues and preventative maintenance\nMust follow all applicable policies, procedures and guidelines. This includes the safe and proper operation of any/all applicable machinery, instrumentation, and equipment\nSets up, operates, and maintains laboratory instruments, monitor experiments, makes observations, calculates and records results\nPerforms analytical testing, i.e. HPLC testing, and monitors product disposition to support quality control\nMaintains and enforces Chemical Hygiene Policy and related labeling\nEmployee may also be responsible for monitoring production line and collecting samples for analysis\nFollow SOP and standard analytical procedures to meet Good Laboratory Practices and Good Manufacturing Practices compliance\nRecords data in lab notebooks, computer databases, and test reports\nGood communication skills, verbal and written, with co-workers and management\nPractice good housekeeping habits throughout the facility with focus and personal contributions towards a clean and organized assigned work area at the end of the assigned shift\nCapable of working with hazardous chemicals and is able to identify and report unsafe equipment, conditions and practices so that they may be corrected prior to an incident\nFlexibility and the ability to shift work schedule according to production needs\nProvides direction and supervision to Lab Tech and Lab Tech Senior\nSome technical writing\nOther duties as assigned\nQualifications\nAbility to establish and maintain effective working relationships with all employees\nBasic to intermediate math skills\nFamiliarity with OSHA guidelines for dealing with hazardous chemicals\nUnderstanding & adhering to applicable federal, state and local laws and regulations as they pertain to the industry, safety regulations, local municipal codes and organizational rules, regulations, directives and standard operating procedures\nAbility to use standard office equipment, computer equipment and software including word processing, database management, spreadsheet applications and email\nKnowledge of laboratory best practices\nExperience as a Laboratory Technician\nAssociates or Bachelor's degree in biology, chemistry, or physics\nIntermediate level Laboratory experience\nEquivalent combinations of education and experience may be considered, including internal experience\nAdditional Requirements\nMust pass any and all required background checks\nMust be and remain compliant with all legal or company regulations for working in the industry\nMust be a minimum of 21 years of age\nMust be approved by the D.O.A. to receive an Agent badge\nWorking Conditions\nWhile performing the duties of this job, the employee is regularly required to perform grasping, talking, hearing, seeing and repetitive motions.\nPhysical demands – May be required to stand and/or walk for extended periods of time. Must be able to lift, carry and balance up to 50 pounds (200 pounds with assistance)","slug":"lead-lab-technician-478862ce-203d-4f1f-b625-9f01c97310be","benefits":[],"selectedSkills":["Laboratory experience","Database management","Communication skills","OSHA","Bachelor's degree","Associate's degree","21 years or older"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=czQCPfGib6xHtCOMku6cVh6qdkL4MAAu5mrxa7raG4O2EueHBKsjbg"},{"position":"Laboratory Supervisor","labName":"Holistic Industries","location":"Kansas City, MO","age":"6 days ago","type":"Full-time","salaryMin":"$47,000 ","salaryMax":" $68,000 a year","jobDescriptionCopy":"About Us:\nAt Holistic Industries we are building a great place to work, shop and invest in cannabis. Our mission is to provide patients and customers with the highest quality, safest cannabis medicine possible. As our name suggests, we care for the whole person. Scaling from a seed of inspiration in 2011, Holistic Industries is now one of the largest and fastest growing private MSOs (Multi-State Operators) in the country. We're able to deliver consistent value to employees, patients, and investors because of the values that drive our work - how we do business and why. We have one of the most seasoned teams in the industry, a budding \"Greenhouse of Brands\" and a meaningful model of doing well by doing good. Our company develops and offers a wide range of proprietary strains that increase desired cannabinoids such as CBD. These high CBD strains have become our foundation for growing, packaging, and selling the best cannabis in our markets. We are committed to harvesting and crafting industry-leading strains, consumer brands, and medical-grade products based on the most progressive science in the space. Holistic Industries has a unique model and approach that enables it to win licenses, scale operations and introduce national brands successfully in highly regulated markets. The company has proven to be responsible stewards of capital since its inception by sourcing licenses on merit rather than simply acquiring them on the open market. A \"GREENHOUSE OF BRANDS\" beginning with our flagship retail and wholesale brand, Liberty Cannabis, we continue to prove our ability to launch new brands from scratch and attract noteworthy partners.\nWe are deeply and actively committed to the communities we serve; our efforts under Liberty Cannabis Cares are focused on four pillars: Social Equity, Diversity, Community, and Cannabis Literacy.\nOur team includes the nation’s most knowledgeable experts in cultivation and medical dispensing, along with professionals who are top of their fields in medical professions, security, agriculture, real estate, and the legal distribution of other highly controlled substances. We are a team of best-in-class executives and staff from within and outside the industry who share a passion for advancing cannabis products and retail experience at scale.\nOur well-established company is growing rapidly and adding to our team of professionals and specialists. Our employees receive PTO, paid Sick Leave, medical, dental, vision and other leave benefits as part of our highly competitive compensation package. Join us as we build a great place to work, shop, and invest.\nHolistic Industries is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.\n\nAbout the Job:\nThe Laboratory Supervisor acts as an assistant to the Processing Manager. This position will work to organize and maintain laboratory operations and procedures, handle daily operations with a focus on efficiency and time management, maintain intra-office/lab communication protocols, streamline administrative procedures, inventory control, and task delegation.\nAssist Processing Manager in management of day-to-day laboratory operations\nSupervise and assign daily tasks of laboratory technicians, packaging supervisor and packaging laborers\nAssist with production scheduling to ensure turnaround times are maintained, coordinated and communicated among laboratory, sales and administrative personnel\nResponsible for ensuring adherence to all laboratory scheduling including, but not limited to: production, equipment maintenance, sanitation SOPs, annual personnel training and safety inspections\nEnsure the lab is well organized, workflows are streamlined, and hold regular meetings with laboratory staff to set work priorities\nAssist Processing Manager to identify and implement procedural and policy changes to improve lab operational efficiency\nOversees Quality Assurance of all batch records and data collection for laboratory and packaging processes\nMaintains laboratory and packaging reports, records and files\nEnsure personnel are trained on SOPs\nMaintain laboratory consumables inventory and manages ordering\nPerforms data and inventory audits to ensure accuracy and adherence to corporate and state mandated regulations\nCoordinate workflow and work schedules from sampler dispatch through testing and reporting of data to customers\nWork with 3rd party laboratories to submit samples and interpret data results\nRequired to maintain strict adherence to safety and Quality Assurance protocols\nPhysical Demands: VERY LABOR INTENSIVE. Must be able to lift, carry and balance up to 75 pounds (125 pounds with assistance), may include walking or standing for extended periods of time, as well as stooping, bending over and/or crouching. Moderate to loud exposure to noise level.\n\nAbout You:\nGeneral\nRegulations require that incumbent be able to obtain and maintain state marijuana work credentials.\nHolistic Industries hires at least 21 years of age and up.\n\nEducation/Experience:\nBachelor’s Degree in a related field required\nPrevious marijuana industry experience preferred with priority given to candidates with experience in licensed facilities\n3+ yrs experience in laboratory operations\n1+ yrs management experience preferred\n\nTechnological Skills:\nAbility to use standard office equipment, computer equipment and software including word processing, database management, spreadsheet applications and email\n\nRequired Knowledge and Skills:\nExcellent management skills with demonstrated ability to manage complex projects and technical team\nHighly detail oriented and organized, critical eye for optimizing workflows\nExcellent communication skills with ability to clearly and succinctly explain organizational goals and specific tasks\nAbility to inspire and motivate employees; encourage productivity, teamwork, and a collaborative environment\nDemonstrate effective delegation of tasks\nAbility to manage and develop key performance indicators of staff members\nExcellent problem solving and critical thinking skills with demonstrated ability to gather information and develop solutions\nEffectively manage changing priorities and remain calm under pressure\nStrong organizational and planning skills\nDemonstrate responsibility, accountability, and dependability toward assigned tasks and duties\nDisplays professionalism and positive attitude toward assigned tasks, projects and colleagues\nStrong ethics and sound judgment\nMust be able to successfully pass a thorough internal and external background check.","slug":"laboratory-supervisor-e6af3b90-fa8e-4baf-80f7-593cd7b12faf","benefits":["Dental insurance","Health insurance","Paid time off","Paid sick time","Vision insurance"],"selectedSkills":["Database management","Laboratory procedures","Data collection","Laboratory experience","Communication skills","Bachelor's degree","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=c747zW3Tlu6OlSOhP-xKGBpCsbDjqjwXadCGHc1eu-DwAA7FOv20sw"},{"position":"Lab Technician","labName":"PharmLabs LLC","location":"San Diego, CA","age":"2 days ago","type":"Full-time | Part-time","salaryMin":"$19 ","salaryMax":" $24 an hour","jobDescriptionCopy":"The PharmLabs brand is a rapidly expanding DEA and ISO 17025 accredited scientific cannabis analytical testing laboratories. PharmLabs scientifically tests purity and potency of cannabis, hemp and related products to ensure product safety and State/Federal legal compliance. We are looking for a laboratory Technician to join the lab team that has a high attention for detail and able to prepare testing samples for analytical instrument runs.\n\n\nGreat opportunity to get into an amazing company in the cannabis and hemp testing industry and start on the ground and grow lightning fast.\n\n\nCore Responsibilities:\n\n\nUnderstands and adheres to strict PharmLabs' Standard Operating Procedures regarding California compliance and quality testing of cannabis and cannabis products;\nComplies with and supports continuous improvement of the ISO 17025 accredited laboratory Quality Management System;\nConducts analytical laboratory investigations, experiments and/or research activities, applies statistical techniques to validate methods, analyzes testing data, and prepares a report of findings;\nUtilizes solvent extraction, solid phase extraction and sample preparation techniques for testing analysis.\nAdds internal standards, prepares quality control samples, and conducts other quality control functions;\nPerforms system suitability checks, preventive maintenance, and calibrates analytical instrumentation.\nProcesses, organizes and summarizes data and computerized results of analysis through the Laboratory Information Management System (LIMS);\nConsults with the Laboratory Director to develop and implement new laboratory methods, techniques, and protocols;\nAssists Laboratory Director with special studies in sample preparation;\nPrepares and conducts quality checks on laboratory equipment;\nAssists in the security and cleanliness of laboratory and equipment;\nConducts supply inventory to ensure availability of consumable laboratory materials;\nPerforms other duties as assigned.\nCleans and organizes the lab\nAssists with ordering lab supplies\n\nMinimum Qualifications:\n\n\n1 year lab experience\nMUST have a positive attitude\n\nJob Types: Full-time, Part-time\n\n\nPay: $19.00 - $24.00 per hour\n\n\nBenefits:\n\n\n401(k)\nFlexible schedule\nHealth insurance\nHealth savings account\nPaid time off\n\nSchedule:\n\n\n4 hour shift\n8 hour shift\nDay shift\nMonday to Friday\nWeekend availability\n\nEducation:\n\n\nAssociate (Preferred)\n\nExperience:\n\n\nLaboratory: 1 year (Preferred)\n\nWork Location: One location\n","slug":"lab-technician-0d56b3d4-3c4e-4f4b-aaa6-a584ce93e425","benefits":["Health savings account","Health insurance","Paid time off","Flexible schedule","401(k)"],"selectedSkills":["Laboratory experience","Associate's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=JTNGnVZ24a6iPDRZyxtDcoPpP3xfLi0eY-vcXBNOHUHIrK6pMpeYsw"},{"position":"Lab Technician (cannabis lab)","labName":"rhino labs","location":"Norman, OK","age":"6 days ago","type":"Full-time | Part-time","jobDescriptionCopy":"APPLICANTS MUST currently live within a reasonable commute of business location. OUT OF AREA candidates and/or those requiring a relocation will NOT be considered.\n\n\nPOSITION SUMMARY: This is a technical position responsible for the collection and testing of samples of various chemical compounds and biological specimens. Daily work involves the routine and repetitive use of various types of machinery, lab equipment and programs to perform tests, record data or findings and present information.\n\n\nESSENTIAL FUNCTIONS:\n\n\nPrepares and weighs product samples; performs repetitive/routine testing activities to include accessioning and pipetting\nDocuments results pertaining to strength, stability, purity, chemical content, and other characteristics\nAssembles data and other pertinent information into groups, charts, graphs, reports, and the like for others to evaluate\nHelps to set up laboratory equipment and instrumentation required for testing activities under the supervision of team analysts\nUtilizes problem-solving skills to help to determine when an apparatus may need to be recalibrated or requires servicing\nRestocks inventory supplies used in various testing activities; provides for the weekly cleaning of glassware\nRecords and verifies log entries for various pieces of equipment/apparatus including balances, incubator, refrigerator/freezer, etc.\nComplies with all established safety, health, and environmental rules and regulations designed to ensure a safe work environment\nExpected to perform other job-related duties as assigned\n\nJob Types: Full-time, Part-time\n\n\nPay: From $15.00 per hour\n\n\nSchedule:\n\n\n4 hour shift\n8 hour shift\n\nAbility to commute/relocate:\n\n\nNorman, OK: Reliably commute or planning to relocate before starting work (Required)\n\nWork Location: One location\n","slug":"lab-technician-cannabis-lab-d1a90bc6-24a9-44a9-bcae-3b8f7c4e00fe","benefits":[],"selectedSkills":[],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=xd7er-qX0eEbEaHAldUezQAFqirlMDF3Lyt8TLoY-QaKWFzjNhnE7w"},{"position":"Entry Level Lab Technician","labName":"SJ Labs and Analytics, LLC","location":"Macon, GA","age":"2 days ago","type":"Part-time | Temporary","salaryMin":"$18 an hour","jobDescriptionCopy":"Description\n\n\nSJ Labs and Analytics, LLC is looking for a seasonal part-time entry level lab technician. SJ Labs and Analytics, LLC is the first Cannabis Testing Lab in the state of Georgia. This position is perfect for a new graduate looking for lab experience. The job will be from now until November with the possibility of permanent employment following the season. The schedule and hours are M-F 8-12.\n\n\nThe lab technician will be responsible for preparing and extracting samples for HPLC, GC, an LC/MS/MS and Microbial Analysis. The workload will be ~80% benchtop and 20% lab specific administrative duties.\n\n\nEducation and Experience Requirement\n\n\nBachelor's degree (or last semester) in\n\n\nChemistry\nBiology\nor any other related lab based Science\n\nOR\n\n\nAssociates Degrees in\n\n\nChemistry\nBiology\nor any other related lab based Science\nAND 2+ years of laboratory experience\n\nOR\n\n\nHigh school diploma AND 4+ years of laboratory experience\n\n\nDuties\n\n\nPrepare Plant Sample for Analysis\nPrepare Tincture, Edible, Concentrate, and Topical Samples for Analysis\nFollow ISO 17025 procedures and document deviations, issues etc that arise from sample prep\nMaintain lab housekeeping\nTrack retained sample and dispose of samples according to procedure\n\nKey Skills\n\n\nSelf Starter\nAttention to detail\nOrganized\nAbility to stand for long periods\nCritical thinker\nSolution oriented\nMust be comfortable with cannabis smell\n\nJob Types: Part-time, Temporary\n\n\nPay: $18.00 per hour\n\n\nSchedule:\n\n\n4 hour shift\n\nAbility to commute/relocate:\n\n\nMacon, GA 31201: Reliably commute or planning to relocate before starting work (Required)\n\nApplication Question(s):\n\n\nHave you ever been convicted of a felony involving scheduled substances or alcohol?\nAre you willing to submit to a background check?\nAre you comfortable with the smell of cannabis?\nAre you comfortable touching and working with cannabis and related products.\n\nWork Location: One location\n","slug":"entry-level-lab-technician-4ba59e0f-e6ce-424e-af85-a4a4bedcaa2a","benefits":[],"selectedSkills":["Laboratory experience","Bachelor's degree","High school diploma or GED","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=vwVCj2SIsLE7ehdEHwwFRGT_6SG2jPqYSCxV7J95za4vrlrjBV7Anw"},{"position":"Cannabis Lab Formulation Tech","labName":"Abstrax Tech, Inc.","location":"Long Beach, CA","age":"5 days ago","type":"Full-time","jobDescriptionCopy":"JOB SUMMARY\n\n\nThe Formulation Tech is responsible for the blending of weighed raw materials to make a finished product with the highest quality and done in a timely manner. This position will work in conjunction with other departments, such as Operations and R&D to ensure we process and execute all orders in timely fashion. Duties include weighing microgram to kilograms quantities of individual raw materials, calibrating equipment, following safety policies and procedures, operating milling equipment, performing sterile filtration, and any other tasks required to complete cell culture media manufacturing.\n\n\nCOMPLIANCE\n\n\nAssure that operation adheres to all business and industry license requirements\nMaintain strict inventory records of all plant materials, chemicals, and equipment used in the laboratory and documents production by completing forms, reports, logs, and records\n\nESSENTIAL FUNCTIONS\n\n\nDuties may include, but are not limited to:\n\n\nAssist with creating and reviewing production schedule\nDocument formulation specifications and calculate requirements\nAssemble and accurately weigh materials and supplies\nConduct QA/QC analytical testing for quality, consistency, and data review\nOperate highly sophisticated equipment and process concentrates\nFollow all SOP's and enter data into systems daily\nWork with Operations Managers to maintain proper inventory levels\nClean and maintain equipment and laboratory facility following current good manufacturing practices (cGMP) and standard operating procedures; comply with legal regulations and monitor environment\nPerforms cleaning, inspection, calibration and assists in the maintenance of equipment: pumps, balances, centrifuges, and other laboratory equipment\nMaintain inventory records of supplies, materials, and equipment\nMaintain and stock supplies and equipment, dispose of waste according to guidelines, and keep laboratory, storerooms, and working areas immaculate\nWash and sterilize laboratory glassware\nHelp create SOPs, training records, and related documentation\nWork with packaging team to help meet deadlines when necessary\nMaintain material safety data sheets for all department chemicals and products\nEnsures weights, measures and raw materials are managed appropriately to assure batches manufactured contain proper ingredients and quantities\nMaintain a log of raw isolate inventory\nEnsure weights, measures and raw materials are managed appropriately to assure batches manufactured contain proper ingredients and quantities\nMixing/blending of isolates to make a finished product with tight error margins\nAdjust machine settings to ensure that the product quality will be within specifications\nMolecularly distill terpenes to further increase purity\nCheck the purity of molecularly distilled terpenes via GC-FID\nContinuously inspect product quality and make sure that all products being packed is within the company’s standard. Reports product deviation greater than 0.5% to supervisor for corrective action\nSanitation of equipment and removal of all leftover flavor/fragrance isolates\nPractice Good manufacturing and Housekeeping\nMaintain a safe work environment\nReview completed production documentation (batch records, logbooks, etc.) for quality and compliance\nMaintain records and a clean environment to comply with regulatory requirements\nPrepare batches for following shifts\nWork cooperatively with co-workers and Supervisors\nMaintain regular and punctual attendance at work\n\nADDITIONAL QUALIFICATIONS\n\n\nMinimum Formulation experience\n3-5 years of laboratory or manufacturing experience\nEquivalent combination of education, training, and relevant work experience maybe considered\nAcumatica ERP systems knowledge or similar\ncGMP and ISO experience required\nDeep knowledge of production management\nBasic math skills and mechanical aptitude\nStrong attention to detail and accuracy\nGood verbal and written communication skills\n\nEDUCATIONAL REQUIREMENTS\n\n\nBS in Chemistry, Biochemistry, Analytical Chemistry, or related field/equivalent work preferred\n1+ years Formulation or related experience\n\nADDITIONAL REQUIREMENTS\n\n\nUS work authorization (Required)\nSuccessfully complete a background check\n\nJob Type: Full-time\n\n\nPay: From $20.00 per hour\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nMonday to Friday\nNight shift\nWeekend availability\n\nCOVID-19 considerations:\nWe comply with guidelines provided by the CDC, CDPH, and Cal OSHA.\n\n\nAbility to commute/relocate:\n\n\nLong Beach, CA 90813: Reliably commute or planning to relocate before starting work (Required)\n\nApplication Question(s):\n\n\nPlease share one interesting or fun fact about yourself.\n\nEducation:\n\n\nBachelor's (Preferred)\n\nExperience:\n\n\nLaboratory: 1 year (Preferred)\nCannabis Industry: 1 year (Preferred)\n\nWork Location: One location\n","slug":"cannabis-lab-formulation-tech-c9ee8882-e575-4cf7-8651-2b346069f545","benefits":["Dental insurance","Health insurance","Paid time off","401(k)","Vision insurance"],"selectedSkills":["Manufacturing","Basic math","CGMP","Mechanical knowledge","Production management","Bachelor of Science","Bachelor's degree","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=6UFf_6pHHU1JNeRsQWvM5FCvuca3K8MCGBhjOSQwQpwTlv9Rp6FceA"},{"position":"Cannabis Testing Laboratory Director","labName":"CDS","location":"Los Angeles, CA","age":"8 days ago","type":"Full-time","jobDescriptionCopy":"We are a Licensed Cannabis Testing Laboratory in Los Angeles working on DCC and ISO certification requirements including but not limited to:\n\n\nFinal validation and correspondence with DCC policy\nLIMS selection and implementation\n\nCandidates should have already successfully led one or more Cannabis Testing Laboratories through City, State and ISO 17025 certification processes.\n\n\nCandidates have extensive working knowledge and experience in DCC and ISO certification processes.\n\n\nQualifications:\n\n\nBachelors of Science or greater\n\n\nCA Cannabis Laboratory Management experience of 3+ years\n\n\nLIMS knowledge and experience\n\n\nExperience in Metrix, Accela and Microsoft business tools\n\n\nManagerial experience in ALL aspects of a California Cannabis Testing Laboratory\n\n\nJob Responsibilities include:\n\n\nMethod development\n\n\nProcess creation and process flow development and optimization\n\n\nPolicy Development and optimization\n\n\nSOP creation, development and editing per FDA/ISO standards\n\n\nValidation processes per DCC requirements\n\n\nLearn, run, optimize, trouble shoot and train employees on all necessary aspects of LCMS, ICP-MS, GCMS and HPLC equipment for Perkin Elmer\n\n\nLearn, run, optimize and train employees on Agilent PCR machine\n\n\nManaging, supervising and optimizing laboratory personal and vendors\n\n\nPurchasing of all laboratory supplies and equipment as needed\n\n\nResponsible for oversight of all building maintenance issues and reporting these to the Executive Team\n\n\nEnsure all equipment and applications are in clean, well-maintained and in good working order\n\n\nEnsuring compliance with laboratory policies, procedures and state regulations\n\n\nCandidates should have already successfully led one or more Cannabis Testing Laboratories through City, State and ISO 17025 certification processes.\n\n\nCandidates have extensive working knowledge and experience in DCC and ISO certification processes.\n\n\nQualifications:\n\n\nBachelors of Science or greater\n\n\nCA Cannabis Laboratory Management experience of 3+ years\n\n\nLIMS knowledge and experience\n\n\nExperience in Metrix, Accela and Microsoft business tools\n\n\nManagerial experience in ALL aspects of a California Cannabis Testing Laboratory\n\n\nJob Responsibilities include:\n\n\nMethod development\n\n\nProcess creation and process flow development and optimization\n\n\nPolicy Development and optimization\n\n\nSOP creation, development and editing per FDA/ISO standards\n\n\nValidation processes per DCC requirements\n\n\nLearn, run, optimize, trouble shoot and train employees on all necessary aspects of LCMS, ICP-MS, GCMS and HPLC equipment for Perkin Elmer\n\n\nLearn, run, optimize and train employees on Agilent PCR machine\n\n\nManaging, supervising and optimizing laboratory personal and vendors\n\n\nPurchasing of all laboratory supplies and equipment as needed\n\n\nResponsible for oversight of all building maintenance issues and reporting these to the Executive Team\n\n\nEnsure all equipment and applications are in clean, well-maintained and in good working order\n\n\nEnsuring compliance with laboratory policies, procedures and state regulations\n\n\nJob Type: Full-time\n\n\nPay: From $100,000.00 per year\n\n\nSchedule:\n\n\n10 hour shift\n8 hour shift\nMonday to Friday\n\nAbility to commute/relocate:\n\n\nLos Angeles, CA 90021: Reliably commute or planning to relocate before starting work (Preferred)\n\nEducation:\n\n\nDoctorate (Preferred)\n\nExperience:\n\n\nResearch: 1 year (Preferred)\n\nLicense/Certification:\n\n\nASCP Certification (Preferred)\n\nWork Location: One location\n","slug":"cannabis-testing-laboratory-director-80319997-222c-40de-9396-dcd00e340b1a","benefits":[],"selectedSkills":["Research","ASCP Certification","FDA regulations","Laboratory information management systems","Laboratory management","Doctoral degree","Bachelor of Science","Bachelor's degree"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=IH_7sXcximd09MaH9rfIhmtV6PPmyRF3dt-YzTkuRx2GJ0YQe21uyA"},{"position":"Field Sampler (Driver)","labName":"Kaycha Labs","location":"Orlando, FL","age":"1 day ago","type":"Full-time","salaryMin":"$28,000 ","salaryMax":" $38,000 a year","jobDescriptionCopy":"Company Overview:\n\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\n\nJob Purpose:\n\n\nThe Field Sampler is responsible for conducting routine pickups and processing of regulatory compliance samples for laboratory analysis. This includes accurately recording sample and chain of custody documentation and the safe and secure transportation of all samples to the laboratory. Candidates must be located in the Orlando, FL area or close proximity.\n\n\nEssential Duties & Responsibilities:\n\n\nPerform onsite field sampling pickups in accordance with all laws and regulations related to the legal cannabis market and laboratory operating procedures.\nCollect and forward weekly inventory requests to the laboratory team.\nCollect payment from clients.\nInterface effectively between customers and the laboratory team.\nContact clients in conjunction with the Client Service Rep(s) to determine if their sampling needs to create a sampling plan (e.g., number of batches, requested analyses, sample information)\nInput orders with required sample information into METRC and the lab’s LIMS system as required.\nFollow detailed procedural requirements as outlined in the Kaycha Labs Sampling and Chain of Custody SOP.\nSafely drive throughout an assigned region, which may include multi-hour destination pickups.\nCollect detailed data in the field according to SOPs.\nMaintain current knowledge of our products and services.\nConsistently maintain customer confidentiality.\nOther duties and special projects as assigned.\n\nKnowledge, Skills, and Abilities:\n\n\nAbility to maintain a high degree of attention to detail and accuracy.\nExcellent communication skills and ability to effectively work, problem solve, and communicate with internal and external customers.\nDemonstrate keen attention to detail and punctuality.\nAbility to work in a dynamic, fast-paced deadline environment while successfully managing multiple tasks.\nDemonstrated ability to be professional, pleasant, and presentable.\nFamiliarity with the assigned geographic area.\nBuild long-lasting customer relationships.\n\nEducation & Experience\n\n\nHigh School Diploma (or GED required.)\nA valid driver’s license and clean driving record (with at least three years of driving experience).\nExposure to the Cannabis industry is a plus.\n\nOther:\n\n\nMust be over 21 years old\nPre-Employment Verifications: Must pass Level 2 background check.\nKaycha Labs offers a competitive and comprehensive benefits package.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.\n\nEssential Functions:\n\n\nThe physical demands described here are representative of those that an employee must meet to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nWhile performing the duties of this job the employee is frequently required to stand, handle or feel, to speak, and to hear. The employee is occasionally required to walk, sit, reach with hands and arms, bend, kneel, crouch, or crawl. The employee must frequently lift and/or move up to thirty-five (35) pounds.\n\n\nSpecific vision abilities required for this job include close (proximity) vision, depth perception, and the ability to adjust focus.\n\n\nWork Environment:\n\n\nThe work environment described here is representative of that which an employee may encounter while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nThe standard analytical laboratory environment is one in which potential health hazards do exist. Administrative, operations, technical, and professional staff are expected to safely operate in accordance with applicable and appropriate health and safety policies and procedures, as prescribed by the applicable Kaycha manuals and policies and/or federal, state, or local standards.\n\n\nLaboratory staff can be expected to work in areas where hazards associated are with, but not limited to, airborne pathogens. Biological materials, hazardous substances, and radioactive material exist and are handled. Appropriate training is provided regarding these hazards and staff are expected to adhere to all health and safety policies at all times, whether they are in writing or verbalized by a supervisor.\n\n\nJob Type: Full-time\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nEmployee discount\nFlexible schedule\nHealth insurance\nLife insurance\nPaid sick time\nPaid time off\nReferral program\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nHome daily\nMonday to Friday\nOvertime\nWeekend availability\n\nTrucking Driver Type:\n\n\nTeam driver\n\nTrucking Route:\n\n\nLocal\n\nCOVID-19 considerations:\nEmployees must wear masks if unvaccinated.\n\n\nApplication Question(s):\n\n\nDesired compensation?\nWhat is the best email/phone number to reach you at?\n\nEducation:\n\n\nHigh school or equivalent (Preferred)\n\nExperience:\n\n\nCustomer service: 1 year (Preferred)\n\nLicense/Certification:\n\n\nDriver's License with a clean driving record? (Required)\n\nWork Location: On the road\n","slug":"field-sampler-driver-135312a0-5d59-4e43-ac56-53eace2ec41e","benefits":["Dental insurance","Employee discount","Health insurance","Flexible schedule","Referral program"],"selectedSkills":["Driving","Communication skills","Customer service","Driver's License","High school diploma or GED","Clean driving record","21 years or older","US work authorization","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=Ixbo1vM-CGok0NpzqtbTmRqisHWxO7ZTd5dZHhUY1QQufu3nZsHypA"},{"position":"Operations Associate","labName":"E1011 Labs","location":"Pasadena, CA","age":"5 days ago","type":"Full-time","jobDescriptionCopy":"Job title\n\n\nOperations Associate\n\n\nReports to\n\n\nDirector of Operations\n\n\nFLSA Status\n\n\nExempt Non-Exempt\n\n\nE1011 Labs, based in Pasadena, California, has a mission to create and deliver the next generation of flower consumption with innovative design and cutting-edge technology. E1011 Labs is known for its exemplary customer service, unique product offering, competitive pricing, unparalleled educational resources, and market leadership. E1011 Labs is looking for a passionate and professional individual to fill the role of Operations Associate. We are looking for an individual who will be working with a variety of Laboratory/production tasks. This individual must be able to multi-task, work quickly and efficiently, and be adaptable to change priorities and tasks as needed. We have a very fast- paced environment as we continue to grow and expand. Must be motivated, trustworthy, and a team player.\n\n\nAdditional responsibilities include: Carrying out laboratory production; intake raw material; enter and track material quantities in our internal system; create batch records a given process; troubleshooting and resolving problems; maintaining logs and record books; maintaining glassware; daily lab cleanup.\n\n\nDuties and responsibilities\n\n\nFollow Standard Operating Procedures (SOP)\nIntake and Process raw hemp material\nDocument information by creating and maintaining accurate batch records.\nKeep equipment operational by following operating instructions; troubleshooting breakdowns; performing preventive maintenance.\nKeep laboratory inventorying in stock; placing orders; verifying receipt.\nParticipate in planning personnel safety and warehouse protection activities.\nOperating, maintaining, and making adjustments and repairs to laboratory\nResolves problems by examining and evaluating data; selecting corrective steps.\nUpdates job knowledge by participating in educational opportunities; reading technical publications.\nEnhances laboratory and organization reputation by accepting ownership for accomplishing new and different requests; exploring opportunities to add value to job accomplishments.\nMaintains glassware by picking-up, cleaning, washing, sterilizing, and organizing.\n\nQualifications & Skills Required\n\n\nChemistry Techniques,\nLab Environment,\nCannabis Knowledge,\nChemical Properties of Cannabinoids,\nRecord Keeping,\nData Tracking, Safe\nLab Practices,\nEquipment Calibration and Maintenance,\nChemical Safety,\nSupply Management,\nSelf- Development.\nMust have reliable transportation.\n\nPhysical requirements\n\n\nWork is performed while standing, sitting and/or walking\nALL APPLICANTS MUST BE OVER THE AGE OF 21 YEARS TO BE ELIGIBLE FOR EMPLOYMENT\n\nBenefits/Perks\n\n\nCompetitive wage\nComprehensive medical & dental benefits coverage\nA highly innovative and enjoyable team culture\nFun and casual work environment, monthly lunches, and more\nWork hours 8 a.m. – 5 p.m. or 9 a.m. – 6 p.m. (one hour lunch)\n\nBy applying for this role I understand that if I’m offered a position with the company I will be required to submit to the pre-employment aptitude testing, and background screening as a condition of employment.\n\n\nE1011 Labs provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, disability or genetics. In addition to federal law requirements, E1011 Labs complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, transfer, leaves of absence, compensation and training.\n\n\nJob Type: Full-time\n\n\nPay: From $15.00 per hour\n\n\nBenefits:\n\n\n401(k)\nDental insurance\nHealth insurance\n\nSchedule:\n\n\n10 hour shift\n12 hour shift\n8 hour shift\nDay shift\nEvening shift\nMonday to Friday\nNight shift\nOvernight shift\nWeekend availability\n\nAbility to commute/relocate:\n\n\nPasadena, CA 91107: Reliably commute or planning to relocate before starting work (Required)\n\nWork Location: One location\n","slug":"operations-associate-0fd77d93-b520-4a9a-bcde-737675d5b7b0","benefits":["Dental insurance","Health insurance","401(k)"],"selectedSkills":["21 years or older","Reliable transportation"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=WZYuOn41gwRPaMdRfZ8PU8kKA97dK2d3tvmUMLazZqphljMxSGXzQg"},{"position":"Field Technician","labName":"Viridis Laboratories","location":"Lansing, MI","age":"1 day ago","type":"Full-time","salaryMin":"$17.00 ","salaryMax":" $21.50 an hour","jobDescriptionCopy":"LOCATION: Lansing, MI\n\n\nREPORTS TO: Field Technician Supervisor\n\n\nThe mission of Viridis Laboratories is to ensure health and safety within the cannabis industry by testing cannabis products for potency and purity, and to report results of this testing to consumers, manufacturers and regulatory agencies. As a growing company, we are looking for a full-time Field Technician with cannabis industry experience or experience in random sampling protocols, sample intake, sample tracking and sample storage.\n\n\nESSENTIAL DUTIES AND RESPONSIBILITIES:\n\n\nSample collection, receipt, accessioning and storage.\nFamiliarity/compliance with the chain-of-custody process.\nFamiliarity/compliance with personal protective equipment and its use for safety and in the prevention of cross-contamination of collected samples.\nAssisting scientific staff with ensuring test results are reported through the laboratory information management system to clients, government agencies and other involved or mandated parties.\nAssisting with maintenance of laboratory records and documentation.\nAssisting clients, government agencies and other involved or mandated parties with requests related to laboratory testing or results.\nAssisting with meeting accreditation requirements.\nAssisting with research or inquiries as requested.\nOther duties as assigned.\n\nEDUCATION AND EXPERIENCE REQUIRED:\n\n\nMinimum of high school diploma or relative Military experience\nOne years’ experience in an analytical or academic laboratory setting and/or two years' experience in cannabis industry.\nFamiliarity with data entry and throughput.\nAttention to detail and excellent communication skills.\n\nCOMPENSATION AND BENEFITS PACKAGE:\n\n\nSalary negotiable and commensurate with experience and education (range $17.00 - $21.50/hour). This position is eligible for a matching 401K program and health care benefits.\n\n\nApplicant screening will include a background check. This position requires compliance with random drug testing and on-going random drug testing.\n\n\nApplicants must be at least 21-years-old to be eligible for employment within Michigan's Cannabis industry.'\n'\nWork Location:\n\n\nOne location\n\nWork Remotely\n\n\nNo\n\nJob Type: Full-time\n\n\nPay: $17.00 - $21.50 per hour\n\n\nBenefits:\n\n\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n\n8 hour shift\nOvertime\nWeekend availability\n\nCOVID-19 considerations:\nCompany provided PPE\n\n\nAbility to commute/relocate:\n\n\nLansing, MI 48912: Reliably commute or planning to relocate before starting work (Required)\n\nLicense/Certification:\n\n\nDriver's License (Preferred)\n\nWork Location: One location\n","slug":"field-technician-d7fc3123-dfde-4f4f-b8b2-50df9504b3e5","benefits":["Dental insurance","Health insurance","401(k) matching","Paid time off","401(k)"],"selectedSkills":["Driver's License","Military","Laboratory experience","Communication skills","Data entry","High school diploma or GED","21 years or older","Background check"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=8qGFeLidU6jInLG5T3IQ_eAl7mjbNZfF0BJm-Ork3b4cIfW1hRskcA"},{"position":"Business Development Specialist","labName":"HighRes Labs, Inc.","location":"Oklahoma City, OK","age":"6 days ago","type":"Full-time | Part-time | Contract","salaryMin":"$10 ","salaryMax":" $20 an hour","jobDescriptionCopy":"Job description\n\n\nHighRes Labs has an opening for a team player in the dynamic new industry of medical marijuana testing in Oklahoma. Position yourself as a business professional in the fast paced field of cannabis quality control by leading the sales and marketing for a successful testing laboratory in Edmond, Oklahoma.\n\n\nHighRes Labs is an ISO-17025 accredited testing laboratory licensed by the Oklahoma State Department of Health and Oklahoma Medical Marijuana Authority. You bring your business development interests, chemistry intrigue, and team player mentality and we will train you in the field of MMJ testing.\n\n\nResponsibilities:\n\n\nThe Business Development Specialist will manage marketing initiatives, sales strategies, and business development operations. Honesty and ethics are paramount for this position. This role will be directly responsible for driving revenue through customer acquisition, sales execution and customer relationship management.\n\n\nRequirements:\n\n\nProven sales leadership experience and success selling B2B\nAbility to work independently with little oversight\nA valid driver’s license and clean driving record\nPersonal transportation to visit existing and potential customers\nExcellent verbal and interpersonal communication skills\nClean criminal history\n\nJob Duties:\n\n\nDevelop and establish key customer relationships with Medical Cannabis growers, processors, and dispensaries.\nTravel as necessary within Oklahoma for in-person meetings with customers and prospects to develop key relationships.\nMake recommendations for sales strategy within the Oklahoma territory in order to maximize sales productivity.\nDesign, implement and manage sales forecasting, planning, and budgeting processes to establish high levels of quality, accuracy, and process consistency.\nMaintain a CRM of the target customers in Oklahoma.\n\nAdditional Preferences:\n\n\n1+ years in a similar sales role within the cannabis industry.\nAssociate degree.\nExperience creating and operating a sales pipeline management system.\nRecent sales experience in Oklahoma with existing Medical Cannabis growers, processors and dispensaries will be a plus.\nDirect, no-nonsense communication style that emphasizes transparency and integrity.\n\nWhat we offer:\n\n\nCompensation: Salary $10/hr ~ $20/hr + commissions.\n\n\nCommissions ranging from 5% to 10% or more depending on the base salary, prior experience and working performance.\n\n\nAnd untapped opportunity to develop cannabis testing sales in Oklahoma.\n\n\nThe candidate will be hired on a probationary basis for three months.\n\n\nJob Type: Full-time\n\n\nJob Types: Full-time, Part-time, Contract\n\n\nPay: $10.00 - $20.00 per hour\n\n\nBenefits:\n\n\nHealth insurance\n\nSchedule:\n\n\n8 hour shift\nDay shift\nMonday to Friday\n\nSupplemental Pay:\n\n\nBonus pay\nCommission pay\n\nAbility to commute/relocate:\n\n\nOklahoma City, OK: Reliably commute or planning to relocate before starting work (Required)\n\nExperience:\n\n\nBusiness development: 1 year (Preferred)\n\nWork Location: One location\n","slug":"business-development-specialist-628ded83-e818-42d5-b327-43a03b12ecb1","benefits":["Health insurance"],"selectedSkills":["Driver's License","Sales","Customer relationship management","Business development","Sales pipeline","Associate's degree","Clean driving record"],"jobType":"free","applyURL":"https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=O7oV4chbM0ZQP9o7KPu5BYNna74dD4bVg8U4_blVO1KekplQdiUbYw"}]