[
  {
    "position": "Manufacturing Associate",
    "labName": "The Verdes Foundation",
    "location": "Albuquerque, NM",
    "age": "14 hours ago",
    "type": "Full-time",
    "salaryMin": "Estimated: $29,000 - $41,000 a year",
    "jobDescriptionCopy": "Non-Exempt /Full-time (40 weekly hours)\n\nReports To: VP of Operations\n\nCollaborates With: All Operations Teams (Packaging, Kitchen, Laboratory, Production and Project Management), Dispensary Operations, Marketing\n\nJob Summary:\nThe Manufacturing Associate is a position cross-trained to perform daily tasks in all Operations Departments. This role commits to spend the first 6 months training in all Departments.\n\nResponsibilities/Essential Functions:\nEnsure high quality, consistent, reliable, compliant and safe manufacturing processes.\nSupport the manufacturing schedule to ensure product availability.\nPackaging: Process flower, preroll and specialty product precisely and according to department guidelines and SOP. Maintain high quality processing and safety standards. Keep accurate and detailed records. Clean and sanitize work tools, equipment and workspace. Label, audit, and organize product for transport. Operate production equipment according to manufacturer instruction. Maintain inventory and perform inspections.\nKitchen: Prepare a variety of products according to established recipes. Keep a consistent and accurate stock of ingredients and supplies. Complete production sheets and other records as required. Package and label finished baked goods. Observe necessary commercial kitchen hygiene. Clean and maintain work areas, utensils and equipment.\nLaboratory: Observe Lab Standard Procedures.?Extract cannabis oil to be used for edible production?and maintain quality and yields for oil and distillate production.?Produce a variety of lab products (tinctures, concentrates, beverages, etc). Prepare and submit samples for testing.?Conform to all standard safety requirements. Maintain lab in a safe and clean manner.?Perform routine housekeeping responsibilities (sweep, mop, clean glassware and equipment, surface cleaning). Order?and procure?supplies unique to this operation.?\nProduction: Prepare and manifest product orders. Print product labels and barcodes. Apply product labels and barcodes, manually and using automated equipment. Assist all departments with product packaging and labeling. Maintain inventory to ensure product availability.\nOther duties as assigned\n\nRequired Skills and Qualifications:\nAcquire and maintain certification in Food Service Safety and Sanitation\nStrong attention to detail and quality.\nAble to perform basic math and algebraic equations.\nGood problem-solving, organizational, analytical and critical thinking skills. Ability to prioritize work and make simple decisions.\nAbility to listen, follow directions, communicate and support your team.\nAble to use a computer to track inventory, print labels and UPC codes/tags.\nAble to perform basic tasks in Outlook, Teams, Word and Excel.\nUnderstanding of regulations and compliance in the cannabis industry.\n\nPreferred Qualifications:\nManufacturing experience\n\nGeneral Housekeeping:\nPerform routine housekeeping activities to maintain a safe work space\n\nComputer Preferred Qualifications:\nRobust Excel knowledge and experience\n\nPhysical and Emotional Requirements:\nMust be able to stand for long periods of time, 8 – 10 hours multiple days in a row\nMust be able to lift at least 50 lbs.\nAbility to work in a confined area.\nMust be able to bend/stoop/climb/reach\nMust be able to present complex information to groups of people\nMust be able to be physically present in the dispensary locations and administrative office\nAbility to handle high stress situations, ambiguity and changing priorities\nMust be able to tolerate a reasonable amount of work stress\n\nCompensation/Hours:\nCompensation - DOE; 40 hours/wk., Required Mon – Fri, some weekends and Holidays, 8:00am to 5:00pm\n\nIt is the policy of The Verdes Foundation to provide equal employment (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, sexual orientation, gender identity, and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, The Verdes Foundation, will provide reasonable accommodations for qualified individuals with disabilities.",
    "slug": "manufacturing-associate",
    "benefits": [],
    "selectedSkills": [
      "Analysis skills",
      "Manufacturing",
      "Microsoft Excel",
      "Cleaning"
    ],
    "applyURL": "https://secure2.entertimeonline.com/ta/VerdesFound.careers?ShowJob=436386578"
  },
  {
    "position": "Laboratory Manager",
    "labName": "INSA",
    "location": "Auburndale, FL",
    "age": "7 days ago",
    "type": "Full-time",
    "salaryMin": "Estimated: $52,000 - $72,000 a year",
    "jobDescriptionCopy": "Job Title: Laboratory Manager\nDepartment: Laboratory\nSupervisor: Director of Operations\nHome Location: Auburndale, FL\nFLSA Classification: Exempt\n\nPosition Summary:\nThe Laboratory Manager is responsible for managing the daily operations of the Laboratory department, including ensuring process efficiency, that necessary supplies are stocked, and that talent is allocated appropriately to suit production needs. This person is responsible for meeting production goals by supporting Associates in a high-volume production facility. Furthermore, the Laboratory Manager can identify areas for Continuous Process Improvement and can effectively present action plans to senior leadership.\nEssential Functions:\n\nEnsures Associates are meeting daily, weekly, and monthly production goals to meet consumer demand; maintains virtual and physical inventory of product\nManages daily operations of department, including assigning tasks and stations, ensuring process efficiency, that necessary supplies are stocked, and that talent is allocated appropriately to suit production needs\nManages Associates by monitoring attendance, performance, and adherence to company policies and procedures; conducting annual performance evaluations; providing coaching and support; and providing corrective action as needed\nOversees sampling of production batches to be sent for testing and entering results\nCompletes periodic departmental audits as needed; complies with related recordkeeping requirements including movement logs, production logs, and waste logs\nResponsible for maintenance of equipment and machines including ordering parts when needed\nCreates and modifies Standard Operating Procedures according to state regulations and production needs\nCoordinates with other department managers on a routine basis\nMaintains or obtains industry credentials as needed\nTraining: process, people, & equipment\nSafety: ensuring safe work area, update, enforce, train on laboratory safety plan\nCreation of new products: quality control, industry standards, testing\n\nQualifications:\n\nBachelor’s degree in the natural sciences (biology, chemistry, plant science, etc.) required\nKnowledge of lab safety procedures and protocol\n3-5 years of experience as a department manager in a laboratory or production-based environment required\nProficient in Windows 10 operating system, Microsoft Office suite of products, Google Apps for Work and knowledge of MJ Freeway platform\nExperience in Lean/Six Sigma work environment a plus\nMust feel comfortable working with hydrocarbons or other volatile compounds or substances in a controlled environment, with PPE provided, to extract cannabinoids for product manufacturing\nWilling and able to work a flexible schedule with some weekend work and occasional travel\nStrong people management skills required\nAbility to communicate ideas and resolutions in a clear, concise, friendly manner\nStrong written and verbal communication skills\nMechanical aptitude and/or comfortable troubleshooting machines and equipment\nDemonstrated ability to effectively multi-task and manage time both independently as well as within a team environment\nContinuous Process Improvement mindset\nMust be at least 18 years of age\nMust have a reliable personal vehicle\nMust be able to pass a background check in accordance with state regulations\n\nPhysical Requirements:\n\nAbility to sit, stand, and walk as needed\nAbility to bend at the waist, kneel, crouch to access equipment\nAbility to lift and carry up to 50lbs\nClose visual acuity needed for viewing screens and fine print\n\nWorkplace Environment\n\nConsistent moderate background noise level due to HVAC and machinery\nExposure to cannabis odor\nExposure to skin contact with plants, to which some individuals may be allergic\n\nJob Type: Full-time",
    "slug": "laboratory-manager",
    "benefits": ["Safety equipment provided"],
    "selectedSkills": [
      "Laboratory procedures",
      "Windows",
      "Mechanical knowledge",
      "Laboratory experience",
      "Communication skills",
      "Bachelor's degree",
      "18 years or older",
      "Background check"
    ],
    "applyURL": "https://insa-inc.checkwritersrecruit.com/job/372373/laboratory-manager?s=in"
  },
  {
    "position": "Data Entry Specialist - Laboratory",
    "labName": "Montrose Environmental Group, Inc.",
    "location": "El Dorado Hills, CA",
    "age": "2 days ago",
    "type": "Full-time",
    "jobDescriptionCopy": "ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicity testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur El Dorado Hills, CA facility is currently seeking a Full-Time Data Entry Specialist to join our team.\n\nAs a key member of the laboratory team, this role will be responsible for a full range of activities including:\n\nAssisting with data reporting through comparison of multiple data sets\nReviewing each data point for accuracy\nUploading data into Vista’s Laboratory Information Management System (LIMS)\nUtilizing LIMS to create sample reports\nWorking collaboratively with team members to ensure sample data meets all requirements\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nBachelor's degree or equivalent and relevant formal academic / vocational qualification\n\nPREFERRED SKILLS\n\nDetail oriented\nGood knowledge of word processing, spreadsheets, table and graph generation and use of applicable computer software\nEffective written and oral communication skills\nGood time management and organizational skills\nGood editorial and proofreading skills\nGood problem solving and troubleshooting abilities\nAbility to function both independently and in a team environment\nAbility to follow all standard operating procedures\nPrior laboratory experience preferred but not required\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.",
    "slug": "data-entry-specialist---laboratory",
    "benefits": [
      "Disability insurance",
      "Tuition reimbursement",
      "401(k)",
      "Parental leave"
    ],
    "selectedSkills": [
      "Word processing",
      "Laboratory experience",
      "Communication skills",
      "Time management",
      "Organizational skills",
      "Bachelor's degree"
    ],
    "applyURL": "https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-CA-El-Dorado-Hills/Data-Entry-Specialist----Laboratory_R1847?mode=job&iis=Job+Board&iisn=Indeed.com"
  },
  {
    "position": "Quality Control/ Quality Assurance Manager",
    "labName": "Demetrix",
    "location": "Raleigh, NC",
    "age": "6 days ago",
    "type": "Full-time",
    "salaryMin": "Estimated: $75,000 - $95,000 a year",
    "jobDescriptionCopy": "Quality Control Description\nThe Quality Control is responsible for developing, implementing, and managing quality control (QC) systems designed to ensure the continuous production of high-quality products that are consistent with established standards, customer specifications, and production goals. Managers and leads a team of QC personnel responsible for incoming raw materials through finished goods release, as well as the timely generation of batch production records (BPRs).\n\nAs a long-term opportunity - When a Quality Control Laboratory is established in Raleigh this individual would lead the team\nQuality Assurance Description\nQuality Assurance is responsible for guaranteeing the quality of products and services. The work involves careful inspections and the enforcement of quality standards. Other essential duties and responsibilities in quality assurance include ensuring compliance with all good manufacturing procedures, working with key personnel in the facility on quality assurance issues, responsible for ensuring compliance of all regulatory requirements, product quality, micro testing, formula integrity, allergen control program, HACCP, GMP program, hold and release program, and self-inspection program.\n\nYour Impact:\nBe responsible for establishing and implementing the necessary programs of facilities personnel including the GMP, HACCP, Allergen, and training programs ensuring they have the required competencies to carry out the functions affecting product legality, safety, and quality.\nConduct audits of vendor/CMO facilities and product ingredients.\nAssist in setting quality standards and ensure that CMO production is maintained at such standards\nOversee that FDA, EU, and ISO standard requirements are documented to maintain compliance.\nEnsuring that all quality policies and procedures meet national and international standards, devising, improving, and reviewing new specifications and procedures for products or processes, and training staff to use them.\nBe responsible for the ingredient specification program, supplier vendor program, regulatory 3rd party audit program, labeling program, pre/post inspection program, verification, and validation program retain sample program and code date adherence program.\nTechnical experience with HPLC, Gas Chromatograph, and other laboratory equipment. Competences to oversee, perform and sustain analytical method transfers to our various CMOs and 3rd party analytical laboratories as required.\nInspecting the final output, comparing it to the requirements, and approving or rejecting the final products.\n\nYour Experience:\nBachelor’s or master’s degree (preferred) in Chemistry Science, Food Technology, Nutrition, or related field. 8 years’ experience in Quality Assurance/Quality Control in the food or dietary supplement industry. 3 years’ management/supervisory experience.\nProficiency with quality systems and techniques such as statistical process control (SPC), process validation, Corrective and Corrective Actions (CAPAs).\nStrong communication, leadership, process development, training, organization, and prioritization skills.\nStrong attention to detail, observation, organizational, and leadership skills.\nIn-depth knowledge of quality control procedures, equipment, and industry standards.\nStrong knowledge of mathematics, data analysis, and statistical methods. Good technical and IT skills.\nExcellent communication and listening skills.\nLiaising closely with other managers and departments in Demetrix and CMOs.\n\nWe’ve got you covered:\nOur employees are the most important part of what makes our company what it is and we want to provide our team with the best benefits we can. Demetrix offers a variety of benefits to help support our employees and their families outside of work, including:\nHealth Benefits\nRetirement\nFlexible Vacation\nFood on campus\nEAP Resources\nHeadspace App\nCommuter Benefit\nEducation Allowance Benefit\nVoluntary Benefits including Pet Insurance\n\nSome other points:\nWe welcome applicants of any and all backgrounds with demonstrated abilities in the skills needed to meet our mission. We are always on the lookout for new talent who embrace change and are willing to push the boundaries of what’s possible in life.\nDemetrix is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.\nEmployment with Demetrix is at will. This means your employment is for an indefinite period of time and it is subject to termination by you or Demetrix, with or without cause, with or without notice, and at any time.\nThe job posting highlights the most critical responsibilities and requirements of the job. It’s not all-inclusive.\n\nSome more about Demetrix:\nNature is a rich source of ingredients. Inconsistent quality and supply, along with inaccessibility of rare substances, mean it’s not always an ideal source to meet the world’s needs.\n\nDemetrix helps customers across the globe produce more for less.\n\nBiotechnology can help by enabling access to more rare and powerful products. With less environmental impact and less cost than traditional methods. Which can lead to more happy, healthy lives.\n\nDemetrix gives you:\nExpensive and hard-to-find ingredients at your fingertips, sustainably and affordably\nHigh ingredient purity without residual chemicals or pesticides\nAffordable access that is quickly scalable as your business grows\nProduct consistency and a reliable, global supply\nA sustainable solution with a small environmental footprint\n\nCurrently, we’re building a product pipeline of cannabinoids, the active compounds in the cannabis plant. Humans have been relying on cannabinoids for health and medicinal purposes for centuries.\nAlthough there are more than 113 unique cannabinoids, very few have been studied. That’s because they are present in such low quantities in the plant. We can produce even the rarest cannabinoids at high purity and volumes. What this will do is enable research for health benefits and, ultimately, provide affordable access to the compounds.",
    "slug": "quality-control-quality-assurance-manager",
    "benefits": [
      "Commuter assistance",
      "Health insurance",
      "Employee assistance program",
      "Pet insurance"
    ],
    "selectedSkills": [
      "QA/QC",
      "High-performance liquid chromatography",
      "Quality systems",
      "Quality assurance",
      "Leadership",
      "Bachelor's degree",
      "Master's degree"
    ],
    "applyURL": "https://jobs.lever.co/demetrixbio/18cbb376-e8d4-4d97-bfa7-5de26df89b07"
  },
  {
    "position": "Laboratory Technician - SVOA extraction",
    "labName": "Montrose Environmental Group, Inc.",
    "location": "Orange, CA",
    "age": "1 day ago",
    "type": "Full-time",
    "jobDescriptionCopy": "ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicity testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Orange, CA facility is currently seeking a Full-Time Laboratory Technician to join our team.\n\nAs a key member of the laboratory team, this role will be responsible for a full range of activities including:\n\nPreparation of samples for analysis\nPreparation of reagents for lab use and/or shipment\nSample extractions\nDetermining the volume of samples\nCleaning of laboratory glassware\nMaintaining clean laboratory areas\nMaintaining organized records of sample preparation and analysis\nCourier supplies to and/or samples from client sites\nOverhead projects designed to improve efficiency of, or accuracy of analyses\nAssisting the Group Leaders and analysts in acquiring and inventorying consumables, chemicals, and parts for instrumentation\nDispose of laboratory waste in a safe manner following prescribed procedures\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Lab Director\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nHigh School diploma or equivalent required\n\nPREFERRED SKILLS\n\nPrior Laboratory experience preferred but not required as this is an entry level position\nKnowledge of analytical method, analytical instruments, general lab practices and lab safety\nAbility to work independently and in a team\nGood organizational skills and strong communication skills\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.",
    "slug": "laboratory-technician---svoa-extraction",
    "benefits": [
      "401(k)",
      "Disability insurance",
      "Parental leave",
      "Tuition reimbursement"
    ],
    "selectedSkills": [
      "Laboratory experience",
      "Communication skills",
      "Organizational skills",
      "High school diploma or GED"
    ],
    "applyURL": "https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-CA-Orange/Laboratory-Technician---SVOA-extraction_R1855?mode=job&iis=Job+Board&iisn=Indeed.com"
  },
  {
    "position": "Processing Lab Manager",
    "labName": "Sozo Health Inc",
    "location": "Warren, MI",
    "age": "2 days ago",
    "type": "Full-time",
    "salaryMin": "Estimated: $41,000 - $58,000 a year",
    "jobDescriptionCopy": "Location: Warren, Michigan\nRole: Processing/Lab Manager\n\nA successful company needs passionate employees. Sozo offers competitive compensation, paid time off, employer-subsidized health plans, and opportunities for advancement.\n\nCompany Overview:\nSozo Health, Inc. (“Sozo”) is a vertically integrated cannabis company based in Warren, Michigan. Sozo’s operations include all stages from cultivation to sale, both in the medical and adult use markets. Sozo prides itself on producing the consistently highest-quality cannabis, while embracing socially and environmentally responsible practices. In 2022, Sozo expects to expand operations beyond Michigan. Since its formation in 2018, Sozo has supported charitable priorities of education, food security, shelter, and racial justice.\n\nJob Summary:\nThe Processing/Lab Manager facilitates and supervises the process of concentrate production. The Processing/Lab Manager will manage a small production team, setting a culture of continuous improvement, to achieve production goals set by the Company. The Manager is also responsible for gathering critical data to evaluate each process and present weekly productivity reports to Executives. This position is responsible for the development of standard operating procedures for each machine and station and integrating proprietary processing techniques to maintain a competitive advantage amongst cannabis processors. The role will operate under the direction of the Chief Operating Officer.\n\nJob Responsibilities:\n\nPlan, direct, and organize day-to-day operations to optimize production outputs and meet companywide production and revenue expectations\nEnsure the team has all resources needed to complete the tasks for the week/month/quarter\nImplement, monitor, and perform calibration of all lab equipment by establishing and ensuring consistent standards of use. Perform preventative maintenance of all equipment as required to ensure the lab is always fully operational\nCreate, maintain, and update SOPs as they relate to laboratory operations, documenting planned deviations or non-conformities when required\nCreate accurate cost of goods analysis, production estimates, projected process/cycle times, financial models, budgetary requirements/commitments, staffing/personnel requirements/needs, etc.\nAccurately track daily production and usage of raw materials utilized in the final finished product\nReviewing and making calculated decisions based on laboratory results\nOversee third party testing through selected partners.\nReview and develop current and future extraction operations to improve efficiency and productivity\nDirect and monitor all products are labeled and inputted into METRC as well as internal platforms\nEnsure all finished products meet compliance and regulatory requirements as well as internally set quality expectations.\nProperly train all staff\nJob Requirements:\n\n1+ years’ experience managing teams in a lab setting\n2+ years’ experience in cannabis extraction (hydrocarbon, ethanol or solventless)\nExperience with data entry and data management\nMaintain a high level of integrity, motivation and urgency to complete tasks\nStrong written and oral communication skills, organizational, innovative problem-solving, attention to detail, and time management\nFamiliarity with local, state, and federal laws and regulations pertinent to the operation\nMust be and remain compliant with all legal or company regulations for working in the cannabis industry\nAbility to use standard office equipment, Microsoft Office applications, computer software, and an in-depth understanding of the METRC tracking system\nMinimum of 21 years of age\nPossess valid driver’s license or state ID\nMust pass all background checks\nSozo is an equal opportunity employer. We do not discriminate on the basis of race, color, religion, marital status, age, national origin, ancestry, physical or mental disability, medical condition, pregnancy, genetic information, gender, sexual orientation, gender identity or expression, veteran status, or any other status protected under federal, state or local law.\n\nSozo is committed to modeling diversity and inclusion for the entire cannabis industry and to maintaining an inclusive environment that provides for equitable treatment for all.",
    "slug": "processing-lab-manager",
    "benefits": [
      "Paid time off",
      "Opportunities for advancement",
      "Health insurance"
    ],
    "selectedSkills": [
      "Laboratory experience",
      "Communication skills",
      "Data management",
      "Driver's License",
      "Data entry",
      "21 years or older"
    ],
    "applyURL": "https://secure2.entertimeonline.com/ta/SozoCo.careers?ShowJob=436384587"
  },
  {
    "position": "Laboratory Technician I - Metals",
    "labName": "Montrose Environmental Group, Inc.",
    "location": "Richmond, VA",
    "age": "3 days ago",
    "type": "Full-time",
    "jobDescriptionCopy": "ABOUT YOU\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Richmond, VA laboratory is looking for a Laboratory Technician who will be responsible for performing tasks required to meet the expectations of our clients, in addition to efficiently and profitably generating defensible data in a timely manner. These tasks will be performed under the direction of a Group Leader.\n\nResponsibilities Include:\nPreparation of tobacco, cigar(ette), eliquid, or aerosol samples for analysis\nPreparation of reagents for lab use and/or shipment\nCleaning of laboratory glassware\nMaintaining clean laboratory areas\nMaintaining organized records of sample preparation and analysis\nAssisting the Group Leaders and analysts in acquiring and inventorying consumables, chemicals, and parts for instrumentation\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Technical Director\nComfortable working with chemicals and glassware\nAbility to remain flexible and handle changing priorities\nPosition requires attention to detail, ability to handle multiple tasks simultaneously, and a desire to worth both as part of a team and independently\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Lab Director\n\nNECESSARY QUALIFICATIONS\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nAssociates or Bachelor's degree in Chemistry, Biology, Environmental Science, or related field preferred\n\nPreferred Skills:\nPrior Laboratory experience preferred but not required as this is an entry level position\nKnowledge of analytical method, analytical instruments, general lab practices and lab safety\nAbility to work independently and in a team\nGood organizational skills and strong communication skills\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nThis position requires employee to be fully vaccinated for COVID-19, unless the employee receives a reasonable accommodation for a valid medical, religious, spiritual exemption. The Company will review requests for a reasonable accommodation for any such exemptions on a case-by-case basis. You are considered \"fully vaccinated\" at more than two (2) weeks after receiving the second dose in a 2-dose series or more than two (2) weeks after receiving a single dose vaccine.\n\nMAKE THE MOVE\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.",
    "slug": "laboratory-technician-i---metals",
    "benefits": [
      "Disability insurance",
      "Tuition reimbursement",
      "401(k)",
      "Parental leave"
    ],
    "selectedSkills": [
      "Laboratory experience",
      "Communication skills",
      "Organizational skills",
      "Bachelor's degree",
      "Associate's degree"
    ],
    "applyURL": "https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-VA-Richmond-East-Parham-Rd/Laboratory-Technician-I---Metals_R1842?mode=job&iis=Job+Board&iisn=Indeed.com"
  },
  {
    "position": "Technician I - GCMS",
    "labName": "Montrose Environmental Group, Inc.",
    "location": "Durham, NC",
    "age": "1 day ago",
    "type": "Full-time",
    "jobDescriptionCopy": "ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Durham, NC facility is currently seeking a Full-Time Laboratory Technician I in GCMS.\n\nA Laboratory Technician I is responsible for performing tasks required to meet the expectations of our clients, in addition to efficiently and profitably generating defensible data in a timely manner. The ideal candidate will have experience in working under possibly hazardous conditions (e.g. chemicals).\n\nRole and Responsibilities\n\nCleaning of sampling equipment\nPreparation of sampling equipment for prep orders\nPreparation of samples for analysis\nWeighing samples for analysis\nAssisting with loading canisters and samples for analysis\nMaintaining clean laboratory areas\nMaintaining organized records of equipment cleaning and sample prep\nOverhead projects designed to improve efficiency of, or accuracy of analyses\nAssisting the Group Leaders and analysts in acquiring and inventorying consumables and parts for instrumentation\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Lab Director\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nHigh school diploma or general education degree (GED) required, associate's or Bachelor's degree in a scientific field preferred\nA Tech I has shown that they understand the physical and chemical principles underlying why procedures are specified the way they were for each method with which they work.\nTheir documentation, timeliness, and throughput must meet the standard of the laboratory.\n\nPreferred Skills\n\nPrior Laboratory experience required\nKnowledge general lab practices and lab safety\nAbility to work independently and in a team\nGood organizational skills and strong communication skills\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.",
    "slug": "technician-i---gcms",
    "benefits": [
      "401(k)",
      "Disability insurance",
      "Parental leave",
      "Tuition reimbursement"
    ],
    "selectedSkills": [
      "Laboratory experience",
      "Communication skills",
      "Organizational skills",
      "Bachelor's degree",
      "High school diploma or GED",
      "Associate's degree"
    ],
    "applyURL": "https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-NC-Durham-Capitola-Drive/Technician-I---GCMS_R1857?mode=job&iis=Job+Board&iisn=Indeed.com"
  },
  {
    "position": "Smithers Cannabis Testing Services Division - Associate Microbiologist",
    "labName": "Smithers Cannabis Testing Services Division",
    "location": "Chicago, IL",
    "age": "8 days ago",
    "type": "Full-time",
    "salaryMin": "Estimated: $44,000 - $58,000 a year",
    "jobDescriptionCopy": "Job Summary\n\nThe individual will be responsible for maintenance of microbiology equipment, primarily automated instrumentation as well as other standard and non-standard microbiological instrumentation. The Microbiologist will conduct, troubleshoot and oversee microbiological analysis of cannabis flower, concentrates and infused products as required by state cannabis regulatory body regulations within an ISO 17025 accredited laboratory. The Microbiologist will be responsible for coordinating scheduling with the Laboratory Manager, conducting sample analysis, identifying areas where efficiencies can be implemented into laboratory process workflows, and supporting sales meetings as requested by laboratory management. As time allows, the Microbiologist will also be cross-trained to conduct sample preparation and extraction for subsequent chemical analyses.\n\nThe Microbiologist will be responsible for training and oversight of employees working in the microbiology area.\n\nPast job experience or training gained obtaining a master’s degree appropriate to microbiology are preferred. The Microbiologist is expected to have developed an ability to optimize the laboratory workflows to maximize throughput and efficiency while maintaining a high level of quality. Additionally, the individual must be able to represent Smithers to clients both over the phone and in person and transmit a professional image.\n\nA. Job Duties\n\nEssential Functions:\n1. Conduct sample analysis in accordance with validated methods and SOPs\n\n2. Ensure timely reporting of results to meet deadlines.\n\n3. Ensure results meet all quality requirements.\n\n4. Analyze microbiology data, and where necessary, troubleshoot unexpected results.\n\n5. Subject matter expert for microbiological analysis.\n\n6. Record and organize data in the Laboratory Information Management System (LIMS) and/or laboratory notebooks\n\n7. Train and oversee employees working in the microbiology function.\n\n8. Maintenance and upkeep of instrumentation.\n\n9. Ensure state regulatory compliance of tests. Advise Smithers on changes to regulatory requirements for microbiological testing of cannabis and cannabis products.\n\n10. Ensure ISO 17025 compliance of relevant studies and processes.\n\n11. Additional duties as assigned, including cross-training to conduct chemical analyses\n\nGood technical writing skills in microbiology [written and oral comprehension, written and oral expression]. Ability to integrate observations (visual and written, discrimina¬tion) into evaluation process. College math [mathematical reasoning, memorizing]. Ability to work at a fast pace without compromising accuracy or completeness, prioritize work assignments and handle stress [high productivity].\n\nPhysical Functions\n\nSitting - 30%\n\nStanding - 70%\n\nWalking - 30%\n\nWriting - 50%\n\nVisual - 100%\n\nB. Chemical Safety\n\n1. Must be able to comprehend the potential hazards of the chemicals in use and adhere to the proper safety techniques as dictated by the Safety Manual and/or Management.\n\nC. Laboratory Safety\n\n1. Must be able to wear gloves, lab coat, eye protection, sleeves, hearing protection, pesticide suit, plastic booties, dust masks, a respirator, and a face mask.\n\n2. Must be able to understand and follow laboratory safety standards.\n\nJob Specifications\n\nB.S. degree in microbiology or related field required, Master’s degree in microbiology or related field preferred, 2-3 years of relevant laboratory experience. Previous experience in a cannabis testing lab is a plus. Proficiency in documentation and procedures required by ISO 17025 preferred.\n\nNext Position Level – Senior Microbiologist\n\nEducation\nRequired\nBachelors or better in Microbiology",
    "slug": "smithers-cannabis-testing-services-division---associate-microbiologist",
    "benefits": [],
    "selectedSkills": [
      "Laboratory experience",
      "Technical writing",
      "Microbiology",
      "Bachelor of Science",
      "Bachelor's degree",
      "Master's degree"
    ],
    "applyURL": "https://recruiting.ultipro.com/SMI1007SMGR/JobBoard/dde2327c-90a5-4557-a8b1-951901232c23/OpportunityDetail?opportunityId=5dbeb50a-05a0-48bb-91ca-3b8357122304&postingId=8525d850-f482-48b2-8d55-ee124e1da16e"
  },
  {
    "position": "Operations Manager - Laboratory",
    "labName": "Montrose Environmental Group, Inc.",
    "location": "El Dorado Hills, CA",
    "age": "3 days ago",
    "type": "Full-time",
    "jobDescriptionCopy": "ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur El Dorado Hills, CA facility is currently seeking a Full-Time Operation Manager to join our team.\n\nAs a key member of the laboratory team, this role will be responsible for a full range of activities including:\n\nThe Operations Manager is responsible for the day-to-day operations of the laboratory, ensuring the timely delivery of analytical data reports to clients and the QA department.\nThe Operations Manager works closely with the Laboratory Director and Technical Director to troubleshoot and solve both technical and procedural issues to ensure efficient processing of client samples through the laboratory.\nCoordinate work scheduling and laboratory resource allocation\nSupervise and manage adherence to project, SOP/method, and turnaround requirements\nAssess production capacity and provide solutions for scheduling, technical, and quality issues\nProvide mentorship to staff and ensure they are developing necessary skills and abilities for the work today and in the future\nAssist in personnel supervision, time management, and operational efficiency, as well as conflict resolution, personnel skills development and team building\nAccurate and timely communication with internal and external clients and occasionally review and sign client reports as needed\nMay assist in development of analytical methods\nCommunicate with client’s questions or concerns\nInitiate and address non-conformance issues\nOverhead projects designed to improve efficiency and/or accuracy of analyses\nComply with Enthalpy’s Quality Assurance Program and other policies\nMonitor costs and usage of lab consumables to make informed decisions for purchasing\nEnsure staff comply with Enthalpy’s Health and Safety Plan\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nBachelor's Degree in a physical science or equivalent\nMinimum of 4 years laboratory experience\nMust have familiarity with environmental sample analysis, chromatography, and mass spectrometry\nMust have the ability to manage people effectively\n\nPreferred Skills\n\nEffectiveness-Positive outcomes & results of communication skills\nConflict resolution skills: Removes/Breakdown organizational communication barriers\nAssertion Skills-Problem diagnosis, assess corrective action\nAbility to handle multiple tasks simultaneously and maintain composure during stressful times\nComplete documentation and attention to detail\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.",
    "slug": "operations-manager---laboratory",
    "benefits": [
      "401(k)",
      "Disability insurance",
      "Parental leave",
      "Tuition reimbursement"
    ],
    "selectedSkills": [
      "Laboratory experience",
      "Communication skills",
      "Conflict management",
      "Safety plans",
      "Bachelor's degree"
    ],
    "applyURL": "https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-CA-El-Dorado-Hills/Operations-Manager---Laboratory_R1844?mode=job&iis=Job+Board&iisn=Indeed.com"
  },
  {
    "position": "Animal Research Technician",
    "labName": "Johns Hopkins University",
    "location": "Baltimore, MD",
    "age": "7 days ago",
    "type": "Full-time",
    "salaryMin": "$15 - $20 an hour",
    "jobDescriptionCopy": "We are seeking an Animal Research Technician who will assist with experimental protocols in a laboratory focused on behavioral pharmacology and neuroscience research into cannabis, cannabinoids, opioids, alcohol, and nicotine in the Division of Behavioral Biology (faculty supervisors: Elise Weerts, PhD and Cassie Moore, PhD) in the Department of Psychiatry and Behavioral Sciences. The Animal Research Technician will contribute to scientific research projects. There is opportunity for interested individuals for participation in writing and co-authorship of research papers.\n\nSpecific Duties & Responsibilities:\nParticipate as a member of collaborative team in study design and development\nIndependently carry out daily experimental protocols with rodents, including running behavioral sessions, recording data, and maintaining behavioral equipment (checking, and as necessary, troubleshooting and making repairs/arranging for repairs to be made)\nAssist with preparation and administration of experimental drug solutions to laboratory animals\nData entry and management\nMaintaining drug accountability records\nProviding daily care for laboratory animals\nLaboratory maintenance according to USDA and AALAC guidelines\nOrdering supplies as needed\nPerforms miscellaneous related duties as assigned by the PI\n\nMinimum Qualifications (Mandatory):\nBachelor's Degree in a related field such as Biology, Chemistry, Neuroscience.\nAdditional related experience may substitute for required education, to the extent permitted by the JHU equivalency formula.*\n\n\nJHU Equivalency Formula: 30 undergraduate degree credits (semester hours) or 18 graduate degree credits may substitute for one year of experience. Additional related experience may substitute for the required education on the same basis. For jobs where equivalency is permitted, up to two years of non-related college course work may be applied towards the total minimum education/experience required for the respective job.\n** Applicants who do not meet the posted requirements but are completing their final academic semester/quarter will be considered eligible for employment and may be asked to provide additional information confirming their academic completion date.\n\nPreferred Qualifications:\n1- year work experience in veterinary or animal research environment.\nExperience with handling laboratory animals, drug injections, behavioral experiments, and aseptic surgery.\n\nSpecial Knowledge, Skills & Abilities:\nMicrosoft Office (word, excel).\nExcellent organization skills, conscientious in following directions, attentive to details.\nMust be reliable in attendance, able to work well with others.\nMust be available to work limited hours on some weekends and holidays.\n\nPhysical Requirements:\nAble to sit in a normal seated position for extended periods.\nAble to reach by extending hand(s) or arm(s) in any direction.\nFinger dexterity required, able to manipulate objects with fingers rather than entire hand(s) or arm(s), e.g., use of computer keyboard.\nCommunication skills using the spoken word.\nAbility to see within normal parameters.\nAbility to hear within normal range.\nAbility to lift weights up to 30 lbs.\n\nClassified Title: Animal Research Technician\nRole/Level/Range: ACRO40/E/02/CC\nStarting Salary Range: $15.00 - $20.00/hr (commensurate with experience)\nEmployee group: Full Time\nSchedule: M-F 8:30 am - 5:00pm\nExempt Status: Non-Exempt\nLocation: Johns Hopkins Bayview\nDepartment name: SOM Psy Bay Behavioral Biology\nPersonnel area: School of Medicine\n\nThe successful candidate(s) for this position will be subject to a pre-employment background check.\n\nIf you are interested in applying for employment with The Johns Hopkins University and require special assistance or accommodation during any part of the pre-employment process, please contact the HR Business Services Office at jhurecruitment@jhu.edu . For TTY users, call via Maryland Relay or dial 711.\n\nJohns Hopkins has mandated COVID-19 and influenza vaccines, as applicable. Exceptions to the COVID and flu vaccine requirements may be provided to individuals for religious beliefs or medical reasons. Requests for an exception must be submitted to the JHU vaccination registry. For additional information, applicants for SOM positions should visit https://www.hopkinsmedicine.org/coronavirus/covid-19-vaccine/ and all other JHU applicants should visit https://covidinfo.jhu.edu/health-safety/covid-vaccination-information/ .\n\nThe following additional provisions may apply, depending on campus. Your recruiter will advise accordingly.\n\nThe pre-employment physical for positions in clinical areas, laboratories, working with research subjects, or involving community contact requires documentation of immune status against Rubella (German measles), Rubeola (Measles), Mumps, Varicella (chickenpox), Hepatitis B and documentation of having received the Tdap (Tetanus, diphtheria, pertussis) vaccination. This may include documentation of having two (2) MMR vaccines; two (2) Varicella vaccines; or antibody status to these diseases from laboratory testing. Blood tests for immunities to these diseases are ordinarily included in the pre-employment physical exam except for those employees who provide results of blood tests or immunization documentation from their own health care providers. Any vaccinations required for these diseases will be given at no cost in our Occupational Health office.\n\nEqual Opportunity Employer\nNote: Job Postings are updated daily and remain online until filled.\n\nEEO is the Law\n\nLearn more:\nhttps://www.eeoc.gov/sites/default/files/migrated_files/employers/poster_screen_reader_optimized.pdf",
    "slug": "animal-research-technician",
    "benefits": [],
    "selectedSkills": [
      "Veterinary experience",
      "Research",
      "Microsoft Excel",
      "Computer skills",
      "Animal handling",
      "Doctoral degree",
      "Bachelor's degree",
      "Background check"
    ],
    "applyURL": "https://apptrkr.com/get_redirect.php?id=2955278"
  },
  {
    "position": "Laboratory Technician",
    "labName": "COLUMBIA LABORATORIES, INC",
    "location": "Portland, OR",
    "age": "7 days ago",
    "type": "Full-time",
    "salaryMin": "$16 - $18 an hour",
    "jobDescriptionCopy": "Columbia Laboratories is looking for a Laboratory Technician to join our growing team. We are a long standing, accredited food safety, cannabis/hemp, and water testing laboratory in Portland, OR. Columbia Labs is a proud member of the Tentamus Group, a global team of laboratories focused on human wellness.\n\nPrimary Responsibilities:\n\nPerform sample preparation for ICP, IC, Flow Analyzer, and water distillation.\nWork with the supervisor to determine priority of samples, including;\nStandard preparation\nSample extraction\nInstrument setup\nData entry\nProperly handle and dispose of laboratory hazardous waste.\nSeek opportunities to reduce routine laboratory costs by increased efficiency (higher throughput, decreased cost of supplies).\nExecute projects as assigned to meet changing laboratory needs and requirements.\nShared responsibility for general laboratory organization and cleanliness.\nCommunication of relevant work details to Lab Supervisor and coworkers.\nOther duties as assigned.\n\nBasic Qualifications:\n\nStrong computer, scientific, and organizational skills\nExcellent communication (oral & written) and attention to detail\nAbility to work independently and as part of a team, self-motivation, adaptability, and a positive attitude\nAbility to learn new techniques, perform multiple tasks simultaneously, keep accurate records, follow instructions, and comply with company policies\nAble to stand for long periods of time and regularly lift 20 pounds.\n\nEducation and Experience:\n\nHigh School Graduate or GED with preference for candidates with experience working in a production laboratory.\nGood knowledge of Environmental laboratory terminology, wet chemistry, bench work, equipment, materials, and the techniques/procedures commonly used in a production laboratory.\nKnowledge of LIMS, Microsoft Word, Excel, and Outlook.\nFamiliarity with EPA methodologies, regulations, and environmental data compliance.\nAuthorization to work in the United States indefinitely without restriction or sponsorship.\nPosition is full-time with overtime as needed. Day Shift Monday-Friday.\n\nWho we are:\n\nTentamus Group is a global product and safety firm with a core presence in Europe, Israel, China, Japan, and North America. Tentamus evaluates and consults on products involving the human body with strong focus on food, nutraceuticals, and cosmetics. Tentamus is represented in over 80 locations worldwide with more than 3,500 highly trained staff members.\n\nwww.tentamus.com\n\nwww.columbialaboratories.com\n\nhttps://www.linkedin.com/company/tentamus-group/\n\nJob Type: Full-time\n\nPay: $16.00 - $18.00 per hour\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nFlexible schedule\nFlexible spending account\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\nDay shift\nOvertime\n\nEducation:\n\nHigh school or equivalent (Required)\n\nExperience:\n\nLaboratory Experience: 1 year (Preferred)\n\nWork Location: One location",
    "slug": "laboratory-technician",
    "benefits": [
      "Health savings account",
      "Dental insurance",
      "Health insurance",
      "401(k) matching",
      "Paid time off"
    ],
    "selectedSkills": [
      "Microsoft Excel",
      "Microsoft Outlook",
      "Laboratory information management systems",
      "Laboratory experience",
      "Organizational skills",
      "High school diploma or GED",
      "US work authorization"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=sHfH49-wtABpq8MDcYDQNUY5o6QnYonok0iFqh9WPZrv8j8AbqxMrg"
  },
  { "age": "", "benefits": [], "selectedSkills": [] },
  {
    "position": "Laboratory Technician (PA)",
    "labName": "Steep Hill Pennsylvania",
    "location": "Harrisburg, PA",
    "age": "3 days ago",
    "type": "Full-time | Part-time",
    "jobDescriptionCopy": "APPLICANTS MUST currently live within a 45-minute commute of business location. OUT OF AREA candidates and/or those requiring a relocation will NOT be considered.\n\nPOSITION SUMMARY: This is a technical position responsible for the collection and testing of samples of various chemical compounds and biological specimens. Daily work involves the routine and repetitive use of various types of machinery, lab equipment and programs to perform tests, record data or findings and present information.\n\nESSENTIAL FUNCTIONS:\n\nPrepares and weighs product samples; performs repetitive/routine testing activities to include accessioning and pipetting\nDocuments results pertaining to strength, stability, purity, chemical content, and other characteristics\nAssembles data and other pertinent information into groups, charts, graphs, reports, and the like for others to evaluate\nHelps to set up laboratory equipment and instrumentation required for testing activities under the supervision of team analysts\nUtilizes problem-solving skills to help to determine when an apparatus may need to be recalibrated or requires servicing\nRestocks inventory supplies used in various testing activities; provides for the weekly cleaning of glassware\nRecords and verifies log entries for various pieces of equipment/apparatus including balances, incubator, refrigerator/freezer, etc.\nComplies with all established safety, health, and environmental rules and regulations designed to ensure a safe work environment\nExpected to perform other job-related duties as assigned\n\nPOSITION REQUIREMENTS:\n\nGeneral Knowledge/Abilities\n\nAbility to fluently speak and read the English language along with understanding and following both written and verbal direction\nAbility to function independently, have personal integrity, flexibility and the ability to work effectively with fellow employees\nAnalytical and numerical skills: ability to perform mathematical calculations in different units of measurement\nAbility to use concepts such as fractions, percentages, and ratios; demonstrated abilities in troubleshooting and problem-solving\nBasic knowledge of modern office practices and use of Microsoft Office Suite for Word and Excel\nExperience in driving tasks and meeting deadlines; accountable for the completion of assigned goals and objectives\nAbility to build relationships to strengthen partnerships with a focus on customer service\nAbility to perform physically demanding work such as moving and lifting equipment, standing for long periods of time, etc.\n\nEducation, Licenses/Certifications\n\nBachelor’s degree in Chemistry or a related field from an accredited college or university\nPrior experience in the Cannabis Industry and/or applicable laboratory experience may be substituted in place of degree\n\nPreferred Experience\n\n1-2 years in experience in service based/customer-facing position\n2 years academic experience in an analytical laboratory setting\n\nSUPERVISORY RESPONSIBILITIES: None\n\nJob Types: Full-time, Part-time\n\nPay: From $18.00 per hour\n\nBenefits:\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\nDay shift\nHolidays\nNight shift\nWeekend availability\n\nCOVID-19 considerations:\nVaccination against COVID-19 is required for ALL employees.\n\nEducation:\n\nBachelor's (Preferred)\n\nExperience:\n\nLaboratory: 2 years (Preferred)\n\nWork Location: One location",
    "slug": "laboratory-technician-(pa)",
    "benefits": [
      "Dental insurance",
      "Health insurance",
      "Paid time off",
      "401(k)",
      "Vision insurance"
    ],
    "selectedSkills": [
      "Analysis skills",
      "Microsoft Excel",
      "Laboratory experience",
      "Microsoft Office",
      "Microsoft Word",
      "Bachelor's degree",
      "US work authorization"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=De73uNKakcbQaA0fqS-8GtsFZNj4tlJlJyMQYGfTywb6ihN-6QQKHA"
  },
  {
    "position": "Lab Technician - Cannabis Industry",
    "labName": "Oklahoma",
    "location": "Oklahoma City, OK",
    "age": "2 days ago",
    "type": "Full-time",
    "salaryMin": "Estimated: $37,000 - $50,000 a year",
    "jobDescriptionCopy": "Job Title: Lab Technician\n\nReports To: Processing Manager\n\nDepartment: Processing\n\nFLSA Status: Non-Exempt\n\nSupervisory Responsibility: NA\n\nPosition Summary:\nThe Lab Tech will execute a variety of laboratory and manufacturing tasks under the direction and supervision of our Lab Director. The Lab Technician will be responsible for assisting in product processing and formulation. The Lab Technician completes tasks assigned by the Lab Manager to operate lab equipment, monitor and maintain cleanliness and efficiency, and drives quality control while always being compliant. This individual must be able to multitask, work quickly and efficiently, and be adaptable to changing priorities and tasks as needed.\n\nFurthermore, the successful candidate will be expected to interact with managers and supervisors to set manufacturing schedules and ensure proper execution of workflow tasks by other employees. We have a very fast- paced environment as we continue to grow and expand. The individual must be motivated, trustworthy, and able to operate both independently and within a team environment.\n\nEssential Functions:\nOperate laboratory, extraction, and manufacturing equipment\nFollow all company policies and procedures to ensure product integrity and quality control\nAssist with testing and calibrating lab equipment in preparation for specific tasks\nPerform quality control tests on ingredients, completed products, and product samples\nWork closely with logistics team to deliver the highest quality products, on-time, accurately, and compliantly\nMaintain accurate inventory of all products\nProvide feedback to Lab Director and fellow team members in support of our continuous improvement operating priority\nRecognize and report any issues, large or small\nPerform all tasks as directed by the Lab Director\n\nManufacturing\n\nResponsible for the preparation and execution of Cure s extraction and processing of product in accordance with the company s Standard Operating Procedures\nEnsures consistency and efficacy of product through close attention to detail\nPerform lab bench work and product filtrations\nAssist in packaging department as needed\nCreate distilled, high purity concentrate medical marijuana for use in a variety of products including vape, edibles, topicals, and tinctures\nExecute the preparation and production of extracted products\nExecute proper labeling and storage of extracted products\nComplete all orders for extracted products in an efficient and timely manner, meeting all necessary deadlines\nCoordinate equipment maintenance, purchases, and repairs with the Lab Director as needed\nExecute and enforce compliance of all local and state regulations\nFollow weekly schedules to ensure there is proper coverage based on the business needs\n\nFacility Cleaning\n\nPerform all assigned duties required to ensure a clean and safe production facility\nEnsure personal hygiene is acceptable under standards set by Cure before performing any production activities by washing hands, wearing a hair net, changing clothes\nComplete the sanitation of all production equipment and tools including workspace, lab equipment, containers, and appliances.\nMonitor, clean, and maintain all equipment and operate all equipment safely in its intended manner\nEnsure compliance at all times with all sanitation regulations and safety standards in the production of all products\nPerform duties as needed outlined in the daily, weekly, and monthly cleaning schedules\n\nRequirements\n\nPast experience in a highly regulated field producing pharmaceutical or nutraceutical products preferred\nEffective time-management skills and ability to multi-task\nAbility to work in a fast-paced, changing and challenging environment\nProficiency in windows-based software and Metrc experience a plus\n\nCompetencies:\nTechnically focused\nIntegrity and trust\nAttention to detail\nApproachability\nCommunication skills\n\nWorking Conditions:\nWhile performing the duties of this job, the employee is regularly required to perform grasping, talking, hearing, seeing and other repetitive motions.\n\nThe employee is frequently is required to stand for long periods of time, use hands for detailed work.\n\nSpecific vision abilities required by this job include close vision, distance vision, peripheral vision, depth perception and ability to adjust focus. This position requires the ability to occasionally lift products and supplies, up to 75 pounds (or more with assistance). Strong odors and varying room temperatures will occur on a daily basis. This position setting is in a general Lab setting.\n\nPosition Type/Expected Hours of Work\n\nThis is a full-time position, and hours of work and days will vary due to business needs. Some holidays and overtime maybe required.\n\nTravel\n\nNone.\n\nEEO\n\nOur organization does not discriminate against our employees or applicants because of race, color, religion, sex, pregnancy, national origin, ancestry, age, marital status, sexual orientation, veteran status, physical or mental disability, medical condition, or any other status or classification protected by applicable federal, state, and/or local laws. Equal employment opportunity will be extended to all persons in all aspects of the employer-associate relationships, including recruitment, hiring, advancement, compensation, benefits, training, promotion, transfer, discipline, layoff, recall and termination. Every reasonable accommodation will be made for qualified disabled employees/applicants.\n\nOther Duties\n\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.\n\nBy signing this job description, I acknowledge that I am able to perform the scope of duties listed with or without reasonable accommodation.",
    "slug": "lab-technician---cannabis-industry",
    "benefits": [],
    "selectedSkills": ["Communication skills", "Windows", "Time management"],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=bWWVYsWhT55cF3ev6qkkuVhCeu6FcAGT9vMgeaeVTDfiUNLN1_vcUA"
  },
  {
    "position": "ICPMS operator",
    "labName": "CP Labs Ohio",
    "location": "Columbus, OH",
    "age": "6 days ago",
    "type": "Full-time",
    "salaryMin": "$25 - $28 an hour",
    "jobDescriptionCopy": "CP Labs Ohio is hiring an experienced ICPMS operator for our new cannabis testing facility in Columbus. Candidates should have hands on experience with ICPMS prep and operation in a professional lab environment.\n\nEssential Duties:\n\nWorks with Laboratory Director to ensure lab efficiencies for prioritization, workflow, and sample preparation, as well as the loading and running of instruments\nIdentifies opportunities for improvement; works with laboratory members to implement new and improved methods and processes\nAssists with the upkeep and improvement of the quality management system to include Standard Operating Procedures (SOP’s) and the employee training programs\nPrepares calibrations and verifies quality controls for laboratory instruments and methods; uses data to recognize and/or correct possible processing or instrument errors\nAcquires and analyzes data used to perform and report analytical laboratory testing of cannabis products\nAssists with the validation of test methods and with Research and Development (R&D) related activities\nImports data into LIMS and Seed-to-Sale systems; provides for the documentation and tracking of Continuing Calibration Verification (CCV) Standards for Quality Assurance\nPrepares reports related to cannabinoid potency, terpene potency, residual solvents, heavy metals, pesticides, microbiologic organisms, water activity and mycotoxins\nSubmits data reports and Certificates of Analysis (COA) for approval\n\nJob Type: Full-time\n\nPay: $25.00 - $28.00 per hour\n\nBenefits:\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\nMonday to Friday\n\nAbility to commute/relocate:\n\nColumbus, OH 43228: Reliably commute or planning to relocate before starting work (Preferred)\n\nEducation:\n\nBachelor's (Required)\n\nExperience:\n\nICPMS: 1 year (Preferred)\n\nWork Location: One location",
    "slug": "icpms-operator",
    "benefits": [
      "Paid time off",
      "Dental insurance",
      "Health insurance",
      "Vision insurance"
    ],
    "selectedSkills": ["Bachelor's degree"],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=KJy3tLQnHBnYIXDcqPZUIYf5fYUs-siACKQKfyDr-FH-z1ewsFMpgQ"
  },
  {
    "position": "Microbiologist",
    "labName": "Hawaii Lab",
    "location": "‘Aiea, HI",
    "age": "5 hours ago",
    "type": "Full-time | Part-time",
    "salaryMin": "$19 - $25 an hour",
    "jobDescriptionCopy": "Job Summary\n\nThe Microbial Analyst, working within a team of industry professionals, will be responsible for assisting in the day to day upkeep and support of the laboratory by cleaning the lab and laboratory equipment; data entry; assisting with batch homogenization and sampling; restocking and verifying laboratory supply inventory; disposing of completed sample materials; and sample batch preparation and analysis. Primary focus is the testing of bacteria (Aerobic, Bile-Tolerant Gram-Negative Bacteria, Coliforms, Salmonella, STECs, mycotoxins, and other biological organisms to ensure that all medical cannabis samples are safe.\nRole and Responsibilities\n\n· Interpret and evaluate data in terms of accuracy, precision, trends, and potential GMP impact and recommend appropriate corrective action where necessary.\n\n· High productivity and the ability to multi-task coupled with a low error rate and attention to detail are critical characteristics of this position.\n\n· Demonstrates flexibility/agility and engagement in a changing environment. Expected to display good laboratory technique to avoid cross contamination or misidentification of samples.\n\n· Able to comprehend and perform both routine and non-routine analyses from compendial and internal sources.\n\n· Functional applications of the Quality Control Management System Application to include addressment of data review, out of specification reporting and Correction/Preventative actions.\n\n· Conduct in house Instrument Maintenance as needed and monitoring of Consumable Inventory.\n\n· Successfully complete proficiency testing and initial demonstration of competency as required.\n\n· Participate in method revisions and deviations as needed.\n\n· Train others employees should incumbent be primary subject matter expert on particular skill sets and knowledge.\n\n· Execute assigned workload on a daily basis in coordination with management and team; members to effectively schedule multiple assignments;\n\n· Contribute to a cohesive team environment;\n\n· Meet project and service deadlines in collaboration with colleagues;\n\n· Prepare samples for analysis; and\n\n· Other Duties as assigned. These duties, responsibilities and activities may change at any time with or without notice.\nQualifications and Education Requirements\n\nAbility to understand and scientifically interpret data utilizing analytical skills and practical\n\nexperience.\n\nAbility to interface and communicate effectively with a variety of levels of personnel from bench\n\nlevel to upper management levels.\n\nAbility to manage multiple, changing priorities while maintaining department efficiencies.\nAbility to maintain confidentiality of frequently sensitive information.\nAbility to clean, disinfect, and sterilize is preferred.\nBachelor’s degree in a physical or life science with a minimum of two years of experience in an analytical laboratory or Four years of experience in an analytical laboratory.\nEducation and experience in Microbiology or equivalent preferred.\n\nPreferred Skills\n\nExperience with analytical techniques and instrumentation including, but not limited to: qPCR, PCR/ Thermal-Cycler, Micro-Array, LCMS, & Standard Culture and Count.\nExperience working in an ISO/IEC 17025 Accredited Laboratory or similar.\n\nCore operational hours of the laboratory will be from 9:00 a.m.- 3:00 p.m. Monday through Friday(excluding holidays).\n\nJob Types: Full-time, Part-time\n\nPay: $19.00 - $25.00 per hour\n\nBenefits:\n\n401(k)\nDental insurance\nHealth insurance\nVision insurance\n\nSchedule:\n\n8 hour shift\n\nAbility to commute/relocate:\n\nAiea, HI 96701: Reliably commute or planning to relocate before starting work (Required)\n\nEducation:\n\nBachelor's (Preferred)\n\nExperience:\n\nlaboratory: 1 year (Preferred)\n\nWork Location: One location",
    "slug": "microbiologist",
    "benefits": [
      "Dental insurance",
      "401(k)",
      "Health insurance",
      "Vision insurance"
    ],
    "selectedSkills": [
      "Laboratory experience",
      "Analysis skills",
      "Bachelor's degree"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=2&job=87KxC26q46hARxCZLn7FemaE3pMw8MJJUVybNm64J3Qx6Oz4w6OlTw"
  },
  {
    "position": "Research Assistant I",
    "labName": "Illa Canna",
    "location": "Sylmar, CA",
    "age": "5 hours ago",
    "type": "Full-time",
    "salaryMin": "$18 - $24 an hour",
    "jobDescriptionCopy": "Position Summary: The selected candidate will report to Director of R&D. The role of the Research Assistant I will be to help in a variety of tasks including product development, quality assurance, agronomy and breeding activities.\n\nEssential Responsibilities:\n\nWorking with interdisciplinary teams as appropriate to understand on-going processes and product specifications\nPreparing and/or updating standard operating procedures\nCollect and label material samples for internal and external testing\nUsing lab equipment to test raw material or intermediate products, including, but not limited to, scales, microscopes, environmental sensors, and mid-infrared testing equipment\nReview product development procedures to identify deviations from quality standards\nWork closely with other lab personnel in a support role\nApprove acceptable products and reject defective products\nKeep accurate documentation and perform statistical analyses\nWork with plants throughout their growth lifecycle\nProvide updates at weekly meetings\n\nQualifications/Skills and Knowledge Requirements:\n\nAssociate’s Degree or higher in a science-based field\nConscientious and responsible\nAbility to maintain accurate records\nExcellent communication skills\nExcellent organizational skills\nAbility to understand quality control procedures\nExcellent math skills and working knowledge of data analysis/statistical methods\nMicrosoft or Google suite software platforms\nKnowledge of Cannabis cultivation and manufacturing procedures is a plus\nApplicants with molecular biology, chemistry, and/or microbiology training will be given strong consideration\n\nPhysical Demand\n\nThe overall physical exertion of this position may include moderate work on a limited basis. Moderate work involves lifting objects weighing 15-35 pounds and may require standing up to two or more hours at a time. If an applicant is deemed fit to do moderate work, then we automatically assume they can do light work or sedentary work.\n\nWorking Environment\n\nOffice, laboratory, manufacturing and grow-room environments.\nExposure to high-density plantings that may have significant aroma\nMay be required to travel for business reasons, e.g. training and meetings.\nMust be able to work in controlled or clean room environments requiring special gowning. May be required to follow gowning requirements and wear protective clothing over the head, face, hands, feet and body.\nPossible exposure to cold storage conditions.\nMay be around moving equipment and machinery.\nMay be working in a loud area that requires hearing protection and other protective equipment to be worn.\nMay work around chemicals such as alcohol, acids, buffers\nPace may be fast and job completion demands may be high\n\nGeneral Information:\n\nThe above statements are intended to describe the general nature and level of work being performed by those assigned to this position. They are not intended to be an exhaustive list of all duties, responsibilities, and skills required of personnel so classified.\n\nJob Type: Full-time\n\nPay: $18.00 - $24.00 per hour\n\nBenefits:\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\nMonday to Friday\n\nEducation:\n\nBachelor's (Required)\n\nExperience:\n\nQuality Control: 1 year (Preferred)\ncannabis: 1 year (Preferred)\n\nWork Location: One location",
    "slug": "research-assistant-i",
    "benefits": [
      "Dental insurance",
      "Health insurance",
      "Paid time off",
      "Vision insurance"
    ],
    "selectedSkills": [
      "Google Suite",
      "Communication skills",
      "Math",
      "Quality control",
      "Organizational skills",
      "Bachelor's degree",
      "Associate's degree"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=c4Y2y9sYoLzNBoLGF6UY2G3pjB-9HD5XjvEOo6KsYsXMkEjdarp-tw"
  },
  {
    "position": "LI entry level Chemistry Technician for Food/BioScience Testing Lab",
    "labName": "Deibel Laboratories",
    "location": "Lincolnwood, IL",
    "age": "7 days ago",
    "type": "Full-time",
    "salaryMin": "$16 - $18 an hour",
    "jobDescriptionCopy": "Deibel Labs is a private food and cannabis testing facility providing services in both food Microbiology and Chemistry testing. We play an integral role in food and product safety for industry-leading producers, as well as family run operations much like our own. Our location in Lincolnwood, LI is currently looking to hire a full-time Chemistry Technician (40 hours/week and benefits included). We offer a competitive salary based upon knowledge and experience. Deibel pays 100% of health insurance premiums for employee and 50% for dependence. Deibel also offers a self-funded dental plan, vision plan, and 401K option along with profit sharing. Please submit a resume for consideration.\nCheck out our website at www.DeibelLabs.com.\nCompensation: Starting hourly rates at $16 - $18/hr plus competitive benefits package.\nSchedule Offered:\nSunday - Thursday, Tuesday - Saturday, Monday - Friday(with rotating weekends) 9am to 5pm\nJob Description\nResponsibilities\n\nReagent login, makeup, storage, and disposal.\nChemistry Proximate testing which will include liquid-liquid extractions, dilutions, titrations, proper use of a balance.\nAssist in sample preparation, data analysis and paperwork for various instrumental methods used for Protein Leco, spectrometer, HPLC, GC etc.\nGeneral laboratory maintenance and house keeping.\n\nQualifications\nRequirements for Applicant:\n\nHigh School Diploma\n0-1 Years Experience.\nMust be able to stand and work efficiently in a fast paced environment.\nMust be highly motivated, detail oriented, critical thinker with good math skills.\nMust be able to lift 10lbs with each hand and pick up to 50lbs.\nMust be willing to learn Good Documentation Practices.\nMust work occasional holidays.\nMust be willing to have a flexible schedule for days that require overtime.\nMust also live within 40 miles of Lincolnwood IL. No relocation packages available.\nPrior experience working in a fast paced environment\n\nJob Type: Full-time",
    "slug": "li-entry-level-chemistry-technician-for-food-bioscience-testing-lab",
    "benefits": [
      "Health insurance",
      "401(k)",
      "Vision insurance",
      "Profit sharing"
    ],
    "selectedSkills": ["Math", "Spectrometer", "High school diploma or GED"],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=4I0hS9KfoUcICfGeXaB-l-4geVf55PnRbUfF9lNyBF3HPiShfr0WCg"
  },
  {
    "position": "Courier and Accessioning Technician",
    "labName": "Rm3 Labs",
    "location": "Broomfield, CO",
    "age": "8 days ago",
    "type": "Full-time",
    "salaryMin": "$17 an hour",
    "jobDescriptionCopy": "Company Description\n\nSince our founding in 2009, Rm3 Labs has been a leader in providing scientific analysis for the cannabis community of Colorado. As a fully independent, analytical laboratory located in Broomfield, we bring state-of-the-art scientific expertise and technology to help our clients produce safe, pure, and effective cannabis products. We are ISO/IEC 17025 accredited and licensed and certified by the State.\n\nJob Summary\n\nWe are looking for a full-time Courier and Accessioning Technician to plan routes, pick up samples from client facilities in the Denver metro area, Fort Collins/Boulder, and/or Colorado Springs/Pueblo, accession samples in-house, and provide excellent customer service.\n\nThis position will require driving in a personal vehicle (mileage reimbursement paid when using personal vehicle) or the company car, if available. It is estimated that a personal vehicle will need to be used for 150 - 200 miles per week. After courier routes, the rest of the workday will be spent in the lab accessioning samples into our system.\n\nThe schedule for this position is Mondays through Fridays from 8:30am - 5pm, unless assigned the south route, in which case the scheduled hours will be from 5:30am - 2pm.\n\nBenefits include three weeks of paid time off, six paid holidays, maternity/paternity leave, subsidized healthcare and dental insurance, holiday bonus based on performance, and professional development assistance.\n\nResponsibilities\n\nMaintain Rm3 Labs’ brand essence when communicating with clients and lab visitors by demonstrating professional, courteous and cooperative behavior.\nMaintain general knowledge on Rm3 Labs’ services, METRC, and current testing and sampling rules.\nComply with State, Local, OSHA, and ISO 17025 requirements.\nPlan and follow the most efficient routes for picking up samples and drive safely to client facilities to pick up samples.\nReceive samples from client facilities and accession samples into our system in-house.\nCheck samples for accuracy, tampering and/or possible adulteration and ensure all pertinent information is documented.\nLabel samples with the internal Rm3 Labs ID and test analyses required and deliver samples to the appropriate department inbox.\nOther administrative tasks, as assigned.\nReport concerns or manifest questions to the Accessioning Lead or Client Service Lead.\n\nRequirements\n\nMust pass an extensive background check with no felony convictions and obtain a Colorado Department of Revenue – Marijuana Enforcement Division (DOR-MED) employee license prior to or at the time of hire.\nExcellent driving record and a reliable vehicle.\nExperience in customer service, data entry, and/or similar high-volume, detailed work.\nAble to work independently and part of a team in a fast-paced environment.\nAble to interact professionally with colleagues and bring up concerns immediately when you are faced with them.\nGood written and verbal communication skills.\nDetail and accuracy oriented.\n\nThe Ideal Candidate\n\nEnjoys driving.\nThrives in a fast-paced, professional, and fun work environment.\nIs self-motivated and focused on continual improvement.\nHas a passion for the cannabis industry.\nCannabis industry experience and/or METRC experience is a strong plus.\nHaving a current MED employee badge is a strong plus.\nComputer skills and experience in Windows and Microsoft Office is a plus.\n\nJob Type: Full-time\n\nPay: $17.00 per hour\n\nBenefits:\n\nDental insurance\nHealth insurance\nPaid sick time\nPaid time off\nParental leave\n\nSchedule:\n\nDay shift\nMonday to Friday\n\nSupplemental Pay:\n\nPerformance bonus\n\nTrucking Driver Type:\n\nCompany driver\n\nTrucking Route:\n\nLocal\nRegional\n\nCOVID-19 considerations:\nWe require employees to wear masks.\n\nApplication Question(s):\n\nAre you a Colorado resident? Unfortunately, we can only consider Colorado residents at this time.\nAre you comfortable driving your own vehicle with a mileage reimbursement for about 150 - 200 miles per week?\nPlease list all the times you are available for a 15-30 min phone interview over the next two weeks.\nDo you already have a MED badge?\n\nLicense/Certification:\n\nDriver's License (Required)\n\nWork Location: One location",
    "slug": "courier-and-accessioning-technician",
    "benefits": [
      "Dental insurance",
      "Health insurance",
      "Mileage reimbursement",
      "Paid time off",
      "Professional development assistance"
    ],
    "selectedSkills": [
      "Customer service",
      "Driver's License",
      "Computer skills",
      "Communication skills",
      "Data entry",
      "Background check",
      "Reliable transportation"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=9fsDq4n__MKWRVHkHm5dAwQu2b90lkBDSzFv_JpNlbnacnITOV6KqQ"
  },
  {
    "position": "Lab Analyst",
    "labName": "Sonoma Lab Works, LLC",
    "location": "Santa Rosa, CA",
    "age": "7 days ago",
    "type": "Full-time",
    "salaryMin": "Estimated: $39,000 - $55,000 a year",
    "jobDescriptionCopy": "Description:\nABOUT US:\nSonoma Lab Works is a state-of-the-art licensed laboratory facility in Santa Rosa, California. We engage in testing of cannabis and hemp products for both compliance and research & development purposes.\n\nWe work in a highly regulated industry that requires close adherence to rules & regulations set forth by the state. We are an equal opportunity employer who is dedicated to providing a safe, professional, and productive work environment for our team members.\n\nWHO YOU ARE:\nYou have an interest and experience in lab science and are comfortable working in a fast-paced laboratory environment. You are flexible, communicate well, are quick to learn and follow procedures, and enjoy interacting with a team.\n\nDUTIES & RESPONSIBILITIES\n\nFollows established high-complexity analysis methods and procedures\nWorks closely with lab technicians to ensure samples are analyzed shortly after preparation\nFollows sample progress with LIMS/record keeping\nEnsures all data is transferred accurately to LIMS and identifies any data errors\nAssists with Quality Assurance\nPrepares samples for high complexity testing, including routine sample preparation and breaking down samples\nParticipates in monitoring levels of inventory and preventing stock-outs\nAssures proper calibration and function of laboratory equipment, including routine and preventative maintenance\nAssists in the upkeep of cleanliness in the laboratory, including workspace organization, disposal of waste, and cleaning of glassware\nAssists in training and onboarding of new Lab Technicians\nAssists in daily prioritization of samples depending on rush status\n\nADDITIONAL DETAILS\n\nPosition is full-time hourly with opportunities for overtime\nAs a small business, all employees are expected to assist in cross-department duties as needed\nCompetitive benefits package includes paid vacation, holidays and sick time, company-paid health insurance, and company-matched 401(k) plan\n\nSonoma Lab Works is an Equal Opportunity Employer\n\n. Requirements:\nREQUIRED QUALIFICATIONS & EXPERIENCE\n\nMust be minimum 21 years old\nBachelor’s degree in chemistry or related field of study or minimum 2 years of experience using the below instrumentation types\nProficiency with one or more of the following instrumentation types: HPLC, GC, GC-MS, GC-MS/MS, ICP-MS, LC-MS/MS\nKnowledge of sample preparation techniques\nMust be proficient with computer and mobile phone applications\nMust be able to lift/move items up to 35 lbs\nMust be able to stand/sit for extended periods of time\n\nDESIRED ATTRIBUTES\n\nAbility to thrive in a fast-paced, high-volume environment with an emphasis on accuracy and timeliness\nSelf-motivation, accountability, adaptability, and a positive attitude\nInitiative to ask questions to overcome obstacles and find solutions\nRemaining composed and calm under pressure\nAbility to laugh and have a good time without losing your focus while working really hard\nExcellent written and verbal communications skills\nAbility to work independently and as part of a team\nProducing quality work under tight deadlines",
    "slug": "lab-analyst",
    "benefits": [
      "Paid time off",
      "401(k)",
      "Health insurance",
      "401(k) matching"
    ],
    "selectedSkills": ["Bachelor's degree", "21 years or older"],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=kwKt1mZGEr_WkwVFLHtBdiRCi-EhC3ozWsGfSijAY7lQVPluyPzsHA"
  },
  {
    "position": "A/P Clerk",
    "labName": "Kaycha Labs",
    "location": "Fort Lauderdale, FL",
    "age": "6 days ago",
    "type": "Full-time",
    "jobDescriptionCopy": "Company Overview:\n\nKaycha Labs is a leading provider of innovative Cannabis and Hemp testing technologies and methods. We perform product testing to help ensure compliance with state and federal regulations. We provide comprehensive cannabis testing for potency, homogeneity, heavy metals, microbial contamination, mycotoxins, residual solvents, terpenes, and pesticides.\n\nEssential Duties & Responsibilities:\n\nEnter A/P invoices\nMatch supporting documentation to Credit Card transactions\nFiling\nMail payments\nOther duties as assigned to support Accounting Manager\n\nEducation & Experience:\n\nBachelor’s degree in accounting, finance or general business administration preferred.\nSage X3 Experience (2-3 years)\n\nSkills, Abilities and Competencies:\n\nExcellent verbal and written communication skills.\nTeam-oriented individual with strong attention to detail\nSolid organization skills, such as multitasking and effective time-management\nMulti-tasker who can prioritize tasks to achieve time-sensitive deadlines\n\nOther:\n\nMust pass Level 2 background check.\nKaycha Labs offers a competitive and comprehensive benefits package including health, dental, vision and time off.\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.f.\n\nEssential Functions:\n\nThe physical demands described here are representative of those that an employee must meet to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nWhile performing the duties of this job the employee is frequently required to stand, handle or feel, to speak, and to hear. The employee is occasionally required to walk, sit, reach with hands and arms, bend, kneel, crouch, or crawl. The employee must frequently lift and/or move up to thirty-five (35) pounds.\n\nSpecific vision abilities required for this job include close (proximity) vision, depth perception, and the ability to adjust focus.\n\nWork Environment:\n\nThe work environment described here is representative of that which an employee may encounter while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nThe standard analytical laboratory environment is one in which potential health hazards do exist. Administrative, operations, technical, and professional staff are expected to safely operate in accordance with applicable and appropriate health and safety policies and procedures, as prescribed by the applicable Kaycha manuals and policies and/or federal, state, or local standards.\n\nLaboratory staff can be expected to work in areas where hazards associated are with, but not limited to, airborne pathogens. Biological materials, hazardous substances, and radioactive material exist and are handled. Appropriate training is provided regarding these hazards and staff are expected to adhere to all health and safety policies at all times, whether they are in writing or verbalized by a supervisor.\n\nKaycha Labs is an Equal Opportunity Employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.\n\nThe above is intended to describe the general content of and requirements for the performance of this job. It is not to be construed as an exhaustive statement of duties, responsibilities, or physical requirements. Nothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions\n\nJob Type: Full-time\n\nPay: From $16.00 per hour\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nDisability insurance\nEmployee assistance program\nFlexible spending account\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\nDay shift\nMonday to Friday\nOvertime\n\nApplication Question(s):\n\nBest email and phone number to reach you at?\n\nEducation:\n\nBachelor's (Required)\n\nExperience:\n\nSage X3: 2 years (Required)\nAccounts payable: 2 years (Preferred)\n\nWork Location: One location",
    "slug": "ap-clerk",
    "benefits": [
      "Dental insurance",
      "Health insurance",
      "401(k)",
      "Flexible spending account",
      "Employee assistance program"
    ],
    "selectedSkills": [
      "Sage",
      "Accounts payable",
      "Communication skills",
      "Time management",
      "Bachelor's degree",
      "Background check"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=3&job=BzR_NMwZSyPQwbH474hXGc0kXLSoriKQIkvCUbIL3pc-hvZYZK--fw"
  },
  {
    "position": "Lead Microbiologist",
    "labName": "Coverton Labs",
    "location": "Monterey, CA",
    "age": "6 days ago",
    "type": "Full-time",
    "salaryMin": "$60,000 - $90,000 a year",
    "jobDescriptionCopy": "Looking for a Microbiologist with several years of cannabis laboratory experience that understands how to efficiently operate the microbial process.\n\nExperience in PathogenDx or Medicinal Genomics is highly preferred.\n\nEducation Requirements/Experience Requirements\n\nBachelor’s degree in Microbiology, Chemistry, Biochemistry, Analytical Chemistry or a related field.\n2 years of full-time practical experience\n\nPractical Laboratory Experience\n\nDetailed understanding of current ISO 17025 standards for laboratory procedures.\nFamiliar with high complexity testing instrumentation including but not limited to PCR, (Medicinal Genomics, PathogenDx, ect.) . Including preparing samples as well as routine and non-routine maintenance on instrumentation.\nFamiliar with LIMS system for reporting client samples\nHighly knowledgeable of the rules and regulations for testing laboratories defined in Chapter 6 in the Bureau of Cannabis Control Text of Regulations\nPrevious experience creating, reviewing and updating Standard Operating Procedures\nMust be willing to have a flexible schedule\nAbility to follow protocol and perform tasks according to specifications\nComputer literacy and the ability to learn quickly\nStrong analytical judgment and scientific integrity\nRecordkeeping and organization skills\nEffective communication and presentation skills\nLaboratory techniques in microbiology\nCreating a safe and effective laboratory environment\nBiohazard and chemical safety\nSelf-development\nExcellent judgment and decision making capabilities\n\nJob Type: Full-time\n\nPay: $60,000.00 - $90,000.00 per year\n\nBenefits:\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\nMonday to Friday\n\nExperience:\n\nMicrobiology: 2 years (Preferred)\n\nWork Location: One location",
    "slug": "lead-microbiologist",
    "benefits": [
      "Dental insurance",
      "Health insurance",
      "Paid time off",
      "401(k)",
      "Vision insurance"
    ],
    "selectedSkills": [
      "Analysis skills",
      "Laboratory procedures",
      "Laboratory experience",
      "Laboratory techniques",
      "Communication skills",
      "Bachelor's degree"
    ],
    "applyURL": "https://www.simplyhired.com/search?q=cannabis+testing+laboratory&fdb=8&pn=4&job=bYhhHxokJ3p_vrF5T3BUdSQm3XEUOks37wokvJ_m5gHmjs4eQLYplQ"
  }
]
