[
  {
    "name": "Laboratory Technician (Extraction)",
    "slug": "laboratory-technician-(extraction)",
    "company": "Montrose Environmental Group, Inc. - 2.9",
    "location": "Orange, CA",
    "age": "",
    "type": "Full-time",
    "salary": "Estimated: $33,000 - $43,000 a year",
    "description": "ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicity testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Orange, CA facility is currently seeking a Full-Time Laboratory Technician to join our team.\n\nAs a key member of the laboratory team, this role will be responsible for a full range of activities including:\n\nPreparation of samples for analysis\nPreparation of reagents for lab use and/or shipment\nSample extractions\nDetermining the volume of samples\nCleaning of laboratory glassware\nMaintaining clean laboratory areas\nMaintaining organized records of sample preparation and analysis\nCourier supplies to and/or samples from client sites\nOverhead projects designed to improve efficiency of, or accuracy of analyses\nAssisting the Group Leaders and analysts in acquiring and inventorying consumables, chemicals, and parts for instrumentation\nDispose of laboratory waste in a safe manner following prescribed procedures\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Lab Director\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nHigh School diploma or equivalent required\n\nPREFERRED SKILLS\n\nPrior Laboratory experience preferred but not required as this is an entry level position\nKnowledge of analytical method, analytical instruments, general lab practices and lab safety\nAbility to work independently and in a team\nGood organizational skills and strong communication skills\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.",
    "benefits": [
      "Disability insurance",
      "Health insurance",
      "401(k)",
      "Parental leave",
      "Tuition reimbursement",
      "Laboratory experience",
      "Communication skills",
      "Organizational skills",
      "High school diploma or GED"
    ],
    "sourceUrl": "https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-CA-Orange/Laboratory-Technician--Extraction-_R1181-1?mode=job&iis=Job+Board&iisn=LabOverflow.com"
  },
  {
    "name": "Lab Supervisor",
    "slug": "lab-supervisor",
    "company": "Green Thumb - 3.4",
    "location": "Centreville, MD",
    "age": "",
    "type": "",
    "salary": "Estimated: $59,000 - $80,000 a year",
    "description": "The Role\nWe're looking for a Laboratory Supervisor to assist in the management of our laboratory team. This position is responsible for Lab Production, which includes but is not limited to distillation, extraction, winterization, compliance requirements, and workplace safety. Every day in the lab, our team works the magic of distillation, extraction, winterization, and the production of our cannabis-infused products. As Laboratory Supervisor, you'll grind away at some of the details of running a lab—enforcing safety and security regulations, maintaining equipment, keeping detailed records, and generally keeping everything up to snuff. But here's the bigger picture: we're looking for someone with a serious leadership strain who loves to motivate, organize, and rally a team. You'll use your people skills and your passion for collaboration to help take care of your colleagues who work their magic every day for GTI!\nResponsibilities\nSupervise the laboratory production operations of our infused products and/or extraction products\nEnsures all equipment is operational and communicates with leadership to solve failures resulting in down time\nResponsible for accurate preparation of oil and MIP formulations\nResponsible for hygiene, organization, and overall appearance of laboratory\nSupport the lab leadership to maintain high standards of quality by assisting with document management, program development and laboratory testing\nSet up, operate, and maintain laboratory instruments, monitor experiments, make observations, calculate and records results notifying the Operations Manager of any deviations\nFollow SOP and standard analytical procedures to meet Good Laboratory Practices and Good Manufacturing Practices compliance\nSupport the documentation of lab standards, inventory management, Chemical Hygiene Policy and related labeling, and other SOPs as assigned by Operations Manager.\nExcellent communication skills, verbal and written, with co-workers and management\nCapable of working with hazardous chemicals and is able to identify and report unsafe equipment, conditions and practices so that they may be corrected prior to an incident\nAssist lab manager in personnel management with scheduling, training, onboarding, performance reviews as necessary\nOther duties as assigned\nQualifications\nAssociates degree in Life Sciences required, Bachelors degree preferred\n3+ years of working in an analytical or production lab\nFamiliarity with OSHA guidelines for dealing with hazardous chemicals\nBackground in cannabis extraction or distillation highly desirable, not required\nPossesses a high level of critical thinking\nAdapts and thrives in a demanding, start-up, fast-paced environment\nHighly motivated, self-directed, innovative and able to work independently or among teams with keen judgement, common sense and resourcefulness\nKnowledge of laboratory best practices including data entry, cleanliness, and systems\nAbility to use standard office equipment, computer equipment and software including word processing, database management, spreadsheet applications and email\nMust understand and comply with the rules, regulations, policies, and procedures of GTI\nMust have a solid understanding of the Medical Marijuana laws, rules and regulations set forth by the state and the D.O.A.; a pursuit to further their understanding and knowledge of the industry and the laws is appreciated and commendable\nAdditional Requirements\nMust pass any and all required background checks\nMust be and remain compliant with all legal or company regulations for working in the industry\nMust be a minimum of 21 years of age\nMust be approved by the state badging agency to receive an Agent badge\nWorking Conditions\nWhile performing the duties of this job, the employee is regularly required to perform grasping, talking, hearing, seeing and repetitive motions.\nPhysical demands – May be required to stand and/or walk for extended periods of time. Must be able to lift, carry and balance up to 50 pounds (200 pounds with assistance).",
    "benefits": [
      "Communication skills",
      "OSHA",
      "Bachelor's degree",
      "Associate's degree",
      "21 years or older"
    ],
    "sourceUrl": "https://boards.greenhouse.io/greenthumbindustries/jobs/3561420?gh_src=1fdd836d1us"
  },
  {
    "name": "Chemist III",
    "slug": "chemist-iii",
    "company": "Curaleaf - 2.2",
    "location": "Ravena, NY",
    "age": "",
    "type": "",
    "salary": "Estimated: $43,000 - $58,000 a year",
    "description": "Curaleaf Holdings, Inc. (CSE: CURA) (OTCQX: CURLF) (\"Curaleaf\") is a leading international provider of consumer products in cannabis, with a mission to improve lives by providing clarity around cannabis and confidence around consumption. As a high-growth cannabis company known for quality, expertise, and reliability, the company and its brands, including Curaleaf and Select provide industry-leading service, product selection, and accessibility across the medical and adult-use markets. In the United States, Curaleaf currently operates in 23 states with 108 dispensaries, 22 cultivation sites, and over 30 processing sites, and employs over 5,000 team members. Curaleaf International is the leading vertically integrated cannabis company in Europe with a unique supply and distribution network throughout the European market, bringing together pioneering science and research with cutting-edge cultivation, extraction, and production. Home | Curaleaf | Cannabis with Confidence\n\nOur corporate social responsibility is Rooted In Good Diversity, Equity, Inclusion + Social Equity + Sustainability Social Responsibility | Curaleaf | Cannabis with Confidence We believe in taking corporate and social responsibility very seriously, from our educational outreach to national partnerships, state-wide initiatives and local causes. Giving back to the communities where we operate is important to us, and helps to change old attitudes by showing the positive impact of cannabis in creating jobs, changing lives, and helping local communities.\n\nWe educate. We advocate. We give.\n\nabcabcabc\n\nResponsibilities:\nConduct chemical and physical laboratory tests on raw materials, in-process goods and finished products to determine if they meet quality specifications. Evaluates raw materials, in-process goods, and finished products for compliance to Company specifications and applicable New York State specifications.\nPerform QC sampling of materials and products.\nPerform routine quantitative HPLC analysis on a variety of sample matrices.\nRetain samples for future evaluations.\nPrepare and/or standardize solutions for testing.\nCompile inventory and maintain stock of laboratory supplies and chemicals.\nMaintain logbook records of testing analysis, research of raw materials and products and material retains, as well as other records as required.\nMaintain routine repair of instruments and calibration of required equipment.\nTrain new laboratory personnel.\nKeep equipment and work area neat, clean, and orderly.\nClean glassware, refill/replace items/solutions as needed.\nMaintaining inventory records of supplies, materials, and equipment, and preparing requisitions as needed.\nStoring supplies and equipment, disposing of waste per state regulations.\nMaintaining material safety data sheets for all department chemicals and products.\nComplete all microbiological analysis and record as required. Report results as necessary.\nResponsible for analyzing and reporting product issues, including requesting manual orders, separation of good and bad product, issuing non-conformance reports and upkeep of QA logs.\nConduct stability tests and studies following approved stability protocols.\nAssist in approving and releasing of materials for use in product manufacture and/or clear products for sale.\nAssist in the investigation of product complaints, including recording all testing information.\nProcure R&D requested samples as required.\nCleaning and maintenance of laboratory equipment and laboratory facility following current good manufacturing practices (cGMP) and standard operating procedures (SOPs), complying with legal regulations; monitoring environment.\nFollow standard operating procedures (SOPs) and create and/or update as necessary.\nAbide by the facility rules.\nHandle and track documentation.\nLearn new procedures and complete training in the operation and use of new equipment as required.\nSupport laboratory manufacturing as needed.\nPerform any other job-related tasks or duties as assigned by management.\n\nCompliance:\nEnsure processing operation is fully compliant with state regulations and federal and state law.\nAssure that all operations adhere to business and industry license requirements.\nMaintaining strict inventory records of all plant materials, chemicals and equipment used in the laboratory and document production by completing forms, reports, logs and records as required.\n\nJob Qualification Requirements:\nBachelor's Degree in a science field\n2 years' experience in a regulated laboratory environment\nExperience conducting downstream processing and oil refinement\nMust be at least 21 years of age\nPass a background check\nMust have valid NYS license with reliable transportation\nMust be able to work weekends and holidays as required\n\nJob Skills and Abilities:\nAnalytical with the ability to collect and interpret data with a high level of accuracy\nStrong organizational skills with the ability to multitask and prioritize competing demands\nCapabilities with computer systems, software, and hardware common to laboratories recordkeeping procedures\nMust be able to work in a challenging fast-paced environment while maintaining a strong attention to details.\nAbility to keep precise, highly detailed, and accurate records of calculations, procedures, and inventory of equipment, chemicals, consumables, and production\nAbility to comply with established safety standards for the proper use, safe handling and disposal of harmful chemicals, substances, and hazardous wastes\nAbility to effectively train others\nScientific laboratory procedures and techniques as used in a chemistry laboratory\nScientific laboratory equipment and apparatus\nScientific methods of measurements\nHealth and safety practices and precautions applicable to a chemistry laboratory\nAbility to maintain confidentiality\nAbility to work with regulated material in a fast-paced environment\nAbility to focus & attention to detail\nAbility to communicate both verbally and written\nWork with Microsoft Office including Excel, Word, and Outlook\nWork with BioTrack THC and other inventory management software systems\n\nPhysical Requirements:\nMust be able to stand for long periods of time, along with frequent bending and reaching\nClose visual focus required (clear vision at 20 inches or less)\nManual dexterity sufficient to reach/handle items, work with fingers to manipulate small objects\nAbility to lift and carry up to 50 pounds and push up to 100 pounds with assistance\n\nCuraleaf is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.",
    "benefits": [
      "Microsoft Excel",
      "Laboratory experience",
      "Organizational skills",
      "Microsoft Office",
      "Microsoft Word",
      "Bachelor's degree",
      "Reliable transportation",
      "21 years or older"
    ],
    "sourceUrl": "https://boards.greenhouse.io/curaleaf/jobs/5614848002?gh_src=27ad64a52us"
  },
  {
    "name": "Lab Technician - Wet Chemistry",
    "slug": "lab-technician---wet-chemistry",
    "company": "Montrose Environmental Group, Inc. - 2.9",
    "location": "Deer Park, TX",
    "age": "",
    "type": "Full-time",
    "salary": "Estimated: $38,000 - $54,000 a year",
    "description": "ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 2,000 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 10 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Houston, TX facility is currently seeking a Full-Time Laboratory Technician to join our Wet Chemistry Department.\n\nAs a key member of the laboratory team, this role will be responsible for a full range of activities including:\n\nAnalyze water and soil samples for alkalinity, conductivity (EC), pH, settlable solids, total dissolved solids (TDS), total suspended solids (TSS), and turbidity.\nAnalyze water and soil samples for Oil & grease, Oil & Grease with silica cleanup, cyanide, sulfides, BTU, corrosivity, Ferrous iron, Flash point, Ignitability, MBAS, Phenols, Ortho and total phosphates, Reactive Cyanide, Reactive Sulfide, Salinity.\nAnalyze water and soil samples for Ammonia, BOD, COD, Hexavalent Chromium, and TOCWB\nCleaning of laboratory glassware\nMaintaining clean laboratory areas\nMaintaining organized records of sample preparation and analysis\nOverhead projects designed to improve efficiency of, or accuracy of analyses\nAssisting the Group Leaders and analysts in acquiring and inventorying consumables, chemicals, and parts for instrumentation\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Lab Director\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nBachelor's degree in Chemistry, Biology, Environmental Science, or related field preferred1 year of relevant lab experience allows direct advancement to Tech II (academic lab counts)\nPreferred Skills\n\nKnowledge of analytical method, analytical instruments, general lab practices and lab safety\nAbility to work independently and in a team\nGood organizational skills and strong communication skills\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.",
    "benefits": [
      "Disability insurance",
      "Health insurance",
      "401(k)",
      "Parental leave",
      "Tuition reimbursement",
      "Laboratory experience",
      "Communication skills",
      "Organizational skills",
      "Bachelor's degree"
    ],
    "sourceUrl": "https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-TX-Deer-Park-Seaco-Ct/Lab-Technician---Wet-Chemistry_R1184?mode=job&iis=Job+Board&iisn=LabOverflow.com"
  },
  {
    "name": "Code Compliance Inspector I/II (City-Wide Promotional)",
    "slug": "code-compliance-inspector-i/ii-(city-wide-promotional)",
    "company": "City of Oxnard - 3.9",
    "location": "Oxnard, CA",
    "age": "",
    "type": "Full-time",
    "salary": "$53,489 - $79,638 a year",
    "description": "This employment opportunity is only open to current City of Oxnard employees*\nThe City of Oxnard's Community Development Department is seeking a Code Compliance Inspector I/II with strong technical and customer service skills to be part of the Community Development team. This individual must be comfortable applying technical knowledge while following proper inspection techniques. The ideal candidate will have the ability to inspect and identify code and ordinance violations and determine the most effective method of alleviating violations, and must be able to effectively communicate verbally and in writing. This person is able to investigate and resolve problems diplomatically and calmly, while thriving in a fast-paced environment. The ideal candidate will be detail-oriented and able to work with accuracy and careful attention to detail. This position will be responsible for providing code enforcement relating to public health, nuisance abatement, code enforcement activities and related municipal enforcement activities.\n\nUnder direct supervision, performs the full array of duties assigned to classes in the Code Compliance Inspector series including the investigation of potential violations of state and local public health and safety, and nuisance ordinances, codes and regulations and the enforcement, through mitigation and issuance of citations, of pertinent codes and ordinances; demonstrates a full understanding of all applicable policies, procedures and work methods associated with assigned duties; performs related duties as required.\n\nDISTINGUISHING CHARACTERISTICS:\nThe Code Compliance Inspector I is the entry-level position in the Code Compliance Inspector series. Initially under closer supervision, this class is responsible for the more routine and standardized investigations, inspections and enforcement activities. This classification is distinguished from the next higher classification of Code Compliance Inspector II by the performance of the more routine tasks.\n\nThe Code Compliance Inspector II is the journey level class in the Code Compliance Inspector series responsible for performing the full range of investigations, inspections, and code enforcement of a variety of City ordinances relating to abandoned vehicles, business tax certificates, zoning requirements, nuisances, weed abatement, short term rentals, cannabis, etc. All positions assigned to this class require the ability to work independently, exercising judgment and initiative.\n\nSUPERVISION RECEIVED/EXERCISED:\nGeneral supervision may be provided by higher-level code compliance personnel. Incumbents of this class do not routinely exercise supervision.\n\nWORK SCHEDULE: The normal work week is Monday-Thursday, 8:00am - 6:00pm, and alternating Fridays, 8:00am - 5:00pm. This position may be required to be available to work additional hours as needed to respond to workload needs. This position is eligible for overtime pay.\n\nEssential Functions\n\n(include but are not limited to the following)\n\nInvestigates complaints of violations of ordinances, and/or codes relating to full range of investigations, inspections, and enforcement of a variety of City ordinances relating to abandoned vehicles, business tax certificates, zoning requirements, nuisances, weed abatement, short term rentals, cannabis, etc.\nDemonstrates a full understanding of applicable policies, procedures and work methods associated with assigned duties.\nIdentifies abandon, illegally stored or inoperable vehicles and issues abatement citations; issues notice of violation and abatement.\nEnforces temporary use permit, business license (or business tax certificate) and related permit ordinances; inspects pertinent location for violations.\nPrepares, presents and defends infraction citations in court.\nPrepares, presents and defends administrative citations in hearings.\nInvestigates instances of construction without required permits and illegal garage conversions, illegal subletting, violations of conditions of approval, illegal changes in use of property, illegal home occupancy and similar zoning violations.\nAssists in the weed abatement program including periodically inspecting property, issuing abatement notices, and overseeing abatements.\nCommunicates effectively with customers and the general public, verbally and in writing, with excellent customer service skills.\nPrepares a variety of reports, memos, and correspondence; documents and maintains records of code enforcement activities; prepares and executes inspection and abatement warrants.\nMonitors, reviews and issues mooring permits in the inland waterway; inspects and enforces applicable codes pertaining to the inland waterways.\nResponds to questions and concerns from the general public; provides information as is appropriate and resolves complaints.\n\nMinimum Qualifications\n\nThe following are minimal qualifications necessary for entry into the classification:\n\nEducation:\nGraduation from an accredited college with an Associate's degree with major course work in engineering, business or public administration, or a closely related field..\n\nSubstitution:\nAdditional related work experience may be substituted for the Associate's degree on a year for year basis.\nSixty (60) semester units or the equivalent of college level coursework in engineering, business, or public administration may be substituted for the Associate's degree with 30 semester units or the equivalent being comparable to one (1) year of work experience.\n\nExperience:\nCode Compliance Inspector I: One (1) year of recent, paid work experience in general code enforcement and/or building inspection involving significant public contact. Recent related municipal experience is desirable.\n\nCode Compliance Inspector II: Two (2) years of recent, paid work experience in general code enforcement and/or building inspection involving significant public contact at a level comparable to City of Oxnard's classification Code Compliance Inspector I.\n\nSpecial Requirements:\nPossession of, or ability to obtain and maintain, a valid class C California driver's license.\nPossession of, or ability to obtain within one (1) year and maintain, a valid PC 832 – Arrest, Search and Seizure course certificate.\nCode Compliance Inspector I: Possession of, or ability to obtain within one (1) year and maintain, a valid Basic Level module certificate issued by the California Association of Code Enforcement Officers (CACEO).\nCode Compliance Inspector II: Possession of, or ability to obtain within one (1) year and maintain, a valid Intermediate Level module certificate issued by the California Association of Code Enforcement Officers (CACEO).\nApplicants must be employed with the City of Oxnard*\nGeneral Information\n\nThe selected candidate must pass a thorough background investigation.\n\nUNION MEMBERSHIP: Positions in this classification are represented by International Union of Operating Engineers (IUOE).\n\nAPPLICATION PROCESS:\nSubmit NEOGOV/Government Jobs on-line application.\nComplete and submit responses to the supplemental questions, if required.\nUpload resume, cover letter, proof of degree (transcript) or other requested documents.\nYour application may be rejected as incomplete if you do not include the relevant information in the online application and include the information only on the resume. Applications and/or Supplemental Questionnaires that state \"see my resume\" or \"see my personnel file\" are considered incomplete and will not be accepted. Cover letters and/or optional resumes are not accepted in lieu of a completed application.\n\nNOTE: For most positions, the City of Oxnard relies on office automation (Microsoft Office) and web-based enabled tools, therefore candidates must be proficient and comfortable with computer use to perform functions associated with on-going work.\n\nRegular and reliable attendance, effective communication skills, and development of effective working relationships are requirements of all positions.\n\nCity staff may be required to play an active role in the event of an emergency, which may include changes in responsibilities and working hours.\n\nThe list of qualified candidates that is established from this recruitment may be used to fill other full-time, part-time and temporary assignments as vacancies arise.\n\nThis position requires a twelve (12) month probationary period.\n\nEmployees are required to participate in the City's direct deposit plan and are paid on a bi-weekly basis.\n\nPursuant to California Government Code Section 3100, all public Employees are required to serve as disaster service workers subject to such disaster service activities as may be assigned to them.\n\nEQUAL OPPORTUNITY: The City of Oxnard is an Equal Opportunity Employer and welcomes applications from all qualified applicants. We do not discriminate on the basis of race, color, religion, sex, national origin, age, marital status, medical condition, disability or sexual orientation.\n\nREASONABLE ACCOMMODATION: The City of Oxnard makes reasonable accommodation for the disabled. If you believe you require special arrangements to participate in the testing process, you must inform the Human Resources Department in writing no later than the filing date. Applicants who request such accommodation must document their request with an explanation of the type and extent of accommodation required.\n\nLEGAL REQUIREMENT: On the first day of employment, new employees must provide proof of citizenship or documentation of legal right to work in the United States in compliance with the Immigration Reform and Control Act of 1986, as amended. The City participates in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S. If E-Verify cannot confirm that you are authorized to work, this employer is required to give you written instructions and an opportunity to contact Department of Homeland Security (DHS) or Social Security Administration (SSA) so you can begin to resolve the issue before the employer can take any action against you, including terminating your employment. Employers can only use E-Verify once you have accepted a job offer and completed the Form I-9. For more information on E-Verify, please contact DHS. 888-897-7781 dhs.gov/e-verify\n\nIf you have any questions regarding this recruitment please contact Ashley Costello at ashley.costello@oxnard.org or (805) 385-5445.\n\nNOTE: The provisions of this bulletin do not constitute an expressed or implied contract. Any provision contained in this bulletin may be modified or revoked without notice.\nRetirement Contributions: New members (as defined by PEPRA), 2% @ 62; \"Classic\" members 2% @ 55. The employee will be required to pay a portion of their annual earnings toward their retirement. The City of Oxnard does not participate in social security. Vacation Time: Full time employees accrue vacation time at a rate of 4.08 - 7.77 hours per pay period based on years of service.Sick Time:Full time employees accrue sick time at a rate of 3.70 hours per pay period.Bilingual Pay: A regular full time employee may receive bilingual pay at the rate of $50.00-$125.00 bi-weekly depending on the level the employee is required to provide bilingual services as determined by the City Manager or designee.Educational Incentive:For positions that do not require a Bachelor's Degree, the City offers an educational incentive award of 2.5% for employees that complete 30 work-related college semester units above the minimum education requirements for the position.Health and Dental: The City contributes $1,185.44 per month toward medical insurance premiums and an additional $66.80 per month for dental insurance premiums. For those employees who waive the medical the City will contribute $985.44 per month. Any unused dental premium monies are paid to the employee.Life Insurance: City employees receive Basic Life Coverage and have the option to purchase additional insurance.Deferred Compensation: The City contributes 1% to a deferred compensation program. Tuition Reimbursement: Full-time employees receive reimbursement of educational expenses including the costs of tuition, registration fees, laboratory fees, and books at a rate of 50% for work related coursework up to a maximum of $500 per fiscal year.Holidays: The City observes 12 holidays per year\nSalary\n$53,488.66 - $79,637.79 Annually\nLocation\nCA 93030, CA\nJob Type\nFull Time\nDepartment\nCommunity Development\nJob Number\n13232/13233-CD-2110-MK\nClosing\n10/25/2021 5:00 PM Pacific",
    "benefits": [
      "Life insurance",
      "Health insurance",
      "Dental insurance",
      "Tuition reimbursement",
      "Paid time off",
      "Communication skills",
      "Writing skills",
      "Microsoft Office",
      "Non-CDL Class C",
      "Customer service",
      "Bachelor's degree",
      "Associate's degree",
      "US work authorization"
    ],
    "sourceUrl": "https://www.governmentjobs.com/careers/cityofoxnard/jobs/3246868/code-compliance-inspector-i-ii-city-wide-promotional"
  },
  {
    "name": "Solventless Technician",
    "slug": "solventless-technician",
    "company": "Ayr Wellness - ",
    "location": "Akron, OH",
    "age": "",
    "type": "",
    "salary": "Estimated: $23,000 - $31,000 a year",
    "description": "ABOUT AYR WELLNESS\n\nWe’re a new kind of cannabis company, aiming higher in everything we do. We grow and sell the highest-quality cannabis products available anywhere, inspiring wellness and wonder in our customers, wherever they are on their cannabis journey. We operate with a sense of responsibility to our customers and patients, building stronger and more socially responsible communities everywhere we go.\n\nJOB DESCRIPTION\n\nThe Solventless Tech is responsible for the operations of the solventless extractions department, which consist of producing bubble hash while maintaining a clean work environment. Post processing which consists of producing rosin, and other additional products. This position will be labor intensive during bubble hash extractions, which will take up most of the work week.\n\nRESPONSIBILITIES\n\nTech I:\nPreparation of equipment and plant materials for extraction\nCleaning and maintenance of extraction equipment and manufacturing facility\nPerform post-processing and clean-up of extracts\nPerform basic troubleshooting on extraction instrumentation and other equipment\nPerform basic calculations and assess mathematical-based data\nUtilize laboratory balance/scales and computer systems to maintain organized documentation of data and batch production records\nExecution of extraction and processing in accordance with state and local standards\nOperation of solventless extraction equipment\nEnsure consistency and efficiency of product through quality control testing and procedures\nMaintaining strict inventory records of all plant materials, chemicals, and equipment used in the facility\nFollowing all standard operating procedures regarding product creation and lab safety\nAssist in packaging and labeling of finished products\nAssist other departments as necessary\nAssist in fostering a positive work environment, treating everyone with dignity and respect while perpetuating a curiosity for “everything cannabis”\n\nTech II:\nMeets all requirements of Tech I\nRegularly exceeds minimum productivity expectations.\nMinimum of 1-year solventless experience\nAbility to work independently\nOffers mentorship to new employees\nIs proficient in multiple departmental zones\n\nTech III:\nMeets all requirements of Tech II\nMinimum of 2 years solventless experience\nPoint of contact for new employees\nConducts new hire department training\nAble to perform duties of all departmental zones\n\nSKILLS/ABILITIES REQUIRED\n\nAttention to detail\nMechanically inclined\nEffective communication skills\nStrong work ethic\nWillingness to learn and improve each operation\nAbility to perform repetitive tasks for long periods of time\nAvailability to work occasional weekends and holidays\nAbility to work in a fast-paced environment and multi-task\nCommitment to arrive for scheduled shifts on time and maintain consistent attendance\n\nREQUIREMENTS/PREFERRED EXPERIENCE\n\nHigh school diploma or General Education Diploma (GED)\nStrong knowledge of solventless extraction methods preferred\nStay current of practices and new developments in the cannabis extraction industry\nMust be able to maintain strong attention to detail and situational awareness.\nMaintain regular and punctual attendance.\nAbility to discern the quality of plant material and finished products\nUnderstanding of proper and safe handling of materials\nExperience working in a regulated environment\nAbility to work quickly without compromising accuracy\nMust possess basic math and computer skills\nMust be 21 years of age as required by the Ohio Medical Marijuana Control Program\nAble to pass a background check as mandated by the Ohio Medical Marijuana Control Program\n\nPHYSICAL REQUIREMENTS\n\nGrasping, lifting, walking, standing, talking, hearing, seeing, and repetitive motions\nStanding, bending, and lifting to 50 pounds by themselves and 80+ pounds with a buddy, carrying product totes, pushing carts, moving, and adjusting processing equipment\nMust be able to wash large amounts of cannabis for multiple hours (Washing consists of a repetitive rowing motion)\n\nAtmospheric Exposures: exposed to dusts, fumes, vapors, or mists that could affect the occupational health of the employee\nToxic Chemicals: may be exposed to some toxic or caustic chemicals\nMay include walking or standing for extended periods of time, as well as stooping, bending over and/or crouching\nModerate to loud exposure to noise level\nModerate periods of prolonged use of office equipment including computers\n\nNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.\n\nWORK ENVIRONMENT\n\nWork is performed in several locations that include a cannabis cultivation and production facility. The working area may be odorous at times and loud due to fans and filtration systems, fluctuating between cold and warm temperatures. Involves frequent contact with staff. Work may include dealing with law enforcement and occasional State inspectors.\n\nDISCLAIMER\n\nAll the above duties and responsibilities are essential job functions subject to reasonable accommodation. All job requirements listed indicate the minimum level of knowledge, skills and/or ability deemed necessary to perform the job proficiently. Employees may be required to perform any other job-related instructions as requested by their supervisor, subject to reasonable accommodation. This document does not create an employment contract, implied or otherwise, other than an “at will” employment relationship.\n\nAyr Wellness is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, veteran status, or any other characteristic protected by federal, state, or local law.\n\nEmployee Name (printed): _______________________________________________________________________\n\nEmployee Signature: ____________________________________________________________________________\n\nDate: ______________________________________",
    "benefits": [
      "Communication skills",
      "Computer skills",
      "High school diploma or GED",
      "21 years or older"
    ],
    "sourceUrl": "https://jobs.jobvite.com/careers/ayrwellness/job/oRubhfwx?__jvst=job+board&__jvsd=LabOverflow"
  },
  {
    "name": "Technician I (GCMS)",
    "slug": "technician-i-(gcms)",
    "company": "Montrose Environmental Group, Inc. - 2.9",
    "location": "Richmond, VA",
    "age": "",
    "type": "Full-time",
    "salary": "Estimated: $37,000 - $48,000 a year",
    "description": "ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Richmond, VA laboratory is currently seeking a Full-Time GC/MS Laboratory Technician who will be responsible for performing tasks required to meet the expectations of our clients, in addition to efficiently and profitably generating defensible data in a timely manner. These tasks will be performed under the direction of a Group Leader.\n\nPreparation of samples for GC/MS analysis\nPreparation of reagents for lab use and/or shipment\nSample extractions\nDetermining the volume of samples\nCleaning of laboratory glassware\nMaintaining clean laboratory areas\nMaintaining organized records of sample preparation and analysis\nOverhead projects designed to improve efficiency of, or accuracy of analyses\nAssisting the Group Leaders and analysts in acquiring and inventorying consumables, chemicals, and parts for instrumentation\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Lab Director\n\nQualifications:\nAssociates or Bachelor's degree in Chemistry, Biology, Environmental Science, or related field preferred\n\nPreferred Skills:\nPrior Laboratory experience preferred but not required as this is an entry level position\nPrevious GC/MS experience, highly preferred\nKnowledge of analytical method, analytical instruments, general lab practices and lab safety\nAbility to work independently and in a team\nGood organizational skills and strong communication skills\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nAssociates or Bachelor's degree in Chemistry, Biology, Environmental Science, or related field preferred\n\nPreferred Skills:\nPrior Laboratory experience preferred but not required as this is an entry level position\nPrevious GC/MS experience, highly preferred\nKnowledge of analytical method, analytical instruments, general lab practices and lab safety\nAbility to work independently and in a team\nGood organizational skills and strong communication skills\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.",
    "benefits": [
      "Disability insurance",
      "Health insurance",
      "401(k)",
      "Parental leave",
      "Tuition reimbursement",
      "Laboratory experience",
      "Communication skills",
      "Organizational skills",
      "Safety plans",
      "Bachelor's degree",
      "Associate's degree",
      "Master's degree"
    ],
    "sourceUrl": "https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-VA-Richmond-East-Parham-Rd/Technician-I--GCMS-_R1183?mode=job&iis=Job+Board&iisn=LabOverflow.com"
  },
  {
    "name": "Staff Research Associate III",
    "slug": "staff-research-associate-iii",
    "company": "UC San Diego - 4.2",
    "location": "San Diego, CA",
    "age": "",
    "type": "",
    "salary": "Estimated: $45,000 - $65,000 a year",
    "description": "Payroll Title:\nSRA 3\n\nDepartment:\nSCH OF PHARMACY AND PHARM. SCI\nSalary Range\nCommensurate with Experience\n\nWorksite:\nCampus\n\nAppointment Type:\nCareer\n\nAppointment Percent:\n100%\n\nUnion:\nRX Contract\n\nTotal Openings:\n2\n\nWork Schedule:\nDays, 8 hrs/day, Monday - Friday\n\nAs a federally-funded institution, UC San Diego Health maintains a marijuana and drug free campus. New employees are subject to drug screening.\n\n#108591 Staff Research Associate III\nFiling Deadline: Tue 10/19/2021\nFor the safety and well-being of the entire university community, the University of California requires, with few exceptions, that all students, faculty and staff be vaccinated against the COVID-19 virus before they will be allowed on campus or in a facility or office. For more information visit: https://ucnet.universityofcalifornia.edu/news/2021/10/flu-vaccination-requirement-for-uc-students,-faculty-and-staff-issued-for-2021-2022.html\n\nUCSD Layoff from Career Appointment: Apply by 04/02/21 for consideration with preference for rehire. All layoff applicants should contact their Employment Advisor.\n\nSpecial Selection Applicants: Apply by 04/13/21. Eligible Special Selection clients should contact their Disability Counselor for assistance.\n\nDESCRIPTION\n\nUCSD Skaggs School of Pharmacy and Pharmaceutical Sciences is growing in the diverse areas of professional educational programs, cutting-edge research, and pharmacy services. Research areas specific to this position posting are related to analytical chemistry and microbiology testing of cannabis products. The school is committed to offering a dynamic learning environment and growing opportunities to its talented and dedicated employees.\n\nUnder general supervision and in accordance with laboratory SOPs, the Staff Research Associate III will prepare samples, perform analytical or microbiological testing, and report data. Analytical chemistry staff researchers will use a variety of state-of-the art instrumentation including LC/MS, GC/MS, ICP/MS, and HPLC. Microbiology staff researchers will be involved in microbial testing including use of qPCR and ELISA. Testing of cannabis products is performed for cannabinoids, terpenes, heavy metals, pesticides, residual solvents, mycotoxins, and microorganisms. Contributes original ideas in the development of assays to support new applications of tandem mass spectrometry, liquid chromatography, PCR, and other technologies as appropriate. Oversees the operation and maintenance of analytical instrumentation within the laboratory. Ensures compliance with lab, department, university, state, and federal safety-related mandates and guidelines for the use of chemical and biological hazards.\n\nMINIMUM QUALIFICATIONS\n\nAdvanced theoretical knowledge of Biology, Cell Biology, Molecular Biology, or related field as typically attained by a Bachelors Degree or an equivalent combination of education and experience.\n\nTheoretical knowledge, and a minimum of three (3) years of practical experience in either LC-MS, GC-MS, or qPCR, with ability to proficiently and independently operate one or more of these instruments.\n\nExtensive experience in a research laboratory.\n\nProven ability in laboratory organization and management.\n\nSkills necessary to operate state-of-the art laboratory instrumentation.\n\nAbility to understand the specific protocol of each experiment and the procedures for calculating the primary data.\n\nProven knowledge of molecular biology techniques and microbiology techniques.\n\nDemonstrated ability to supervise and instruct in a professional and constructive manner and to adapt to the demands of the diverse research projects in the laboratory.\n\nProficient knowledge of computers and use of scientific software for data analysis.\n\nDemonstrated ability to perform standard assays.\n\nStrong ability to communicate and interact effectively with all levels of faculty, staff, students and vendors.\n\nPREFERRED QUALIFICATIONS\nProven skills in supervising staff and trainees providing work direction and maintaining an efficient research team.\nKnowledge of UC procedures for ordering, purchasing, shipping and inventory of supplies and equipment.\nKnowledge of UC and EH&S laboratory safety procedures (particularly concerning radioactive material).\nSPECIAL CONDITIONS\nEmployment is subject to a criminal background check.\nMust be willing to work hours some evenings and/or weekends, if necessary.\nMust be willing to work with hazardous materials.\n\nJob offer is contingent on successful engagement in the UC COVID-19 Vaccination program (fully vaccinated with documented proof or approved exception/deferral).\n\nUC San Diego Health is the only academic health system in the San Diego region, providing leading-edge care in patient care, biomedical research, education, and community service. Our facilities include two university hospitals, a National Cancer Institute-designated Comprehensive Cancer Center, Shiley Eye Institute, Sulpizio Cardiovascular Center, and several outpatient clinics. UC San Diego Medical Center in Hillcrest is a designated Level I Trauma Center and has the only Burn Center in the county. We invite you to join our dynamic team!\n\nApplications/Resumes are accepted for current job openings only. For full consideration on any job, applications must be received prior to the initial closing date. If a job has an extended deadline, applications/resumes will be considered during the extension period; however, a job may be filled before the extended date is reached.\n\nUC San Diego Health is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, age, protected veteran status, gender identity or sexual orientation. For the complete University of California nondiscrimination and affirmative action policy see: http://www-hr.ucsd.edu/saa/nondiscr.html\n\nUC San Diego is a smoke and tobacco free environment. Please visit smokefree.ucsd.edu for more information.",
    "benefits": [
      "EHS",
      "Cell biology",
      "Microbiology",
      "Molecular biology",
      "Research laboratory experience",
      "Bachelor's degree",
      "Pass drug screening",
      "Criminal background check"
    ],
    "sourceUrl": "https://employment.ucsd.edu/108591-staff-research-associate-iii/job/17850767?emid=3640"
  },
  {
    "name": "Quality Assurance Specialist",
    "slug": "quality-assurance-specialist",
    "company": "Vireo Health Inc. - ",
    "location": "Amado, AZ",
    "age": "",
    "type": "",
    "salary": "Estimated: $36,000 - $46,000 a year",
    "description": "Who we are\n\nHere at Vireo Health, Inc. ( Vireo ) our mission is to bring the best of technology, science, and engineering to the cannabis industry. We are a physician-led, customer-focused team of more than 500 dedicated employees creating best-in-class cannabis products and customer experiences. Vireo is proud to have one of the most diverse workforces in cannabis, promoting diversity, equity, and inclusion through engaging employee outreach programs, community events, and non-profit partnerships. We are rapidly expanding nationwide, and we are looking for talented, compassionate, and dedicated people to join our team and help us grow. From Cultivation to Operations to Sales & Marketing, we are hiring people who share our vision and passion for improving people s lives. If you are looking for a positive work environment where your contributions truly make a difference, click apply and let us learn about you!\n\nWhat you will do\n\nWe are seeking an experienced and energetic Quality Assurance Specialist to join our growing dynamic team! The ideal candidate will be driven, innovative, compassionate, believe in the goodness of people and cannabis, and enjoys the one team, one dream motto! The Quality Assurance Specialist is responsible for quality inspections of Medical Cannabis products and monitoring the processes and procedures in the medical cannabis manufacturing operation. This position will report directly to the Quality Manager.\n\nHighlighted Responsibilities\n\nPerform Quality Control inspections on Products, Equipment and procedures. Ensure package integrity and accuracy.\nMay perform or assist inventory management personnel with inventory audits when needed.\nResponsible for monitoring product cannabis safety and quality throughout the manufacturing process.\nEnsure all cannabis and cannabis containing products produced at the facility are properly tested in accordance with company procedures and guidelines, at appropriate frequencies, and meet specifications prior to release. Ensure testing data is appropriately recorded and maintained.\nResponsible for performing verification on equipment and other areas required.\nResponsible for ensuring the correct recording and filing of all relevant record logs and documentation completed by staff.\nEnsures the correct guidelines for production are followed during operations.\nEnsures employees are following all SOPs, Work Instructions and worker safety practices.\nEnsure the facility follows applicable Quality Management directives such as SOP s, manuals, policies and procedures, work instructions, etc.\nAssist Quality Manager with instructing employees on Quality Improvements and Issues.\nAnalyze quality data to recommend quality and process improvements.\nCollect product samples for Product Development, lab retains and the laboratory when directed.\nAssist in aligning the company with all state, federal and 3rd party requirements. Compliance will work with QA to ensure compliance with government regulatory agencies and third-party audits.\nSupport QA Manager and assist other QA Specialists as needed.\n\nQualifications\n\n21 years or older.\nExperience with record keeping/internal auditing.\n2+ years of experience in a manufacturing or quality control setting.\nAbility to follow existing inventory/inspection procedures accurately.\nWorking knowledge of general computer operation and competency with Microsoft Office Products.\nExperience operating in a quality-centric setting (Medical/Manufacturing/Health related industries).\nGood writing/reading/arithmetic skills.\nBasic physical ability to walk back and forth across facility and lift/move up to 50lbs if necessary.\nSelf-motivated with proven leadership skills and attention to detail.\nStrong interpersonal skills for multitasking and interacting with team member.\n\nEEO Statement\n\nVireo Health, Inc. is an equal opportunity employer, and all qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. www.vireohealth.com",
    "benefits": [
      "Quality assurance",
      "Leadership",
      "Internal audits",
      "Writing skills",
      "Microsoft Office",
      "21 years or older"
    ],
    "sourceUrl": "http://jobs.ourcareerpages.com/job/660219~Primary?source=LabOverflow"
  },
  {
    "name": "Technician - Wet Chemistry",
    "slug": "technician---wet-chemistry",
    "company": "Montrose Environmental Group, Inc. - 2.9",
    "location": "Orange, CA",
    "age": "",
    "type": "Full-time",
    "salary": "Estimated: $54,000 - $72,000 a year",
    "description": "ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Orange, CA facility is currently seeking a Full-Time Laboratory Technician to join our Wet Chemistry Department.\n\nAs a key member of the laboratory team, this role will be responsible for a full range of activities including:\n\nAnalyze water and soil samples for alkalinity, conductivity (EC), pH, settlable solids, total dissolved solids (TDS), total suspended solids (TSS), and turbidity.\nAnalyze water and soil samples for Oil & grease, Oil & Grease with silica cleanup, cyanide, sulfides, BTU, corrosivity, Ferrous iron, Flash point, Ignitability, MBAS, Phenols, Ortho and total phosphates, Reactive Cyanide, Reactive Sulfide, Salinity.\nAnalyze water and soil samples for Ammonia, BOD, COD, Hexavalent Chromium, and TOCWB\nCleaning of laboratory glassware\nMaintaining clean laboratory areas\nMaintaining organized records of sample preparation and analysis\nOverhead projects designed to improve efficiency of, or accuracy of analyses\nAssisting the Group Leaders and analysts in acquiring and inventorying consumables, chemicals, and parts for instrumentation\nComply with Enthalpy’s Quality Assurance Program and other policies\nComply with Enthalpy’s Health and Safety Plan\nOther duties as assigned by the Group Leader or Lab Director\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nBachelor's degree in Chemistry, Biology, Environmental Science, or related field preferred\n1 year of relevant lab experience allows direct advancement to Tech II (academic lab counts)\n\nPreferred Skills\n\nKnowledge of analytical method, analytical instruments, general lab practices and lab safety\nAbility to work independently and in a team\nGood organizational skills and strong communication skills\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.",
    "benefits": [
      "Disability insurance",
      "Health insurance",
      "401(k)",
      "Parental leave",
      "Tuition reimbursement",
      "Laboratory experience",
      "Communication skills",
      "Organizational skills",
      "Bachelor's degree"
    ],
    "sourceUrl": "https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-CA-Orange/Technician---Wet-Chemistry_R1180-1?mode=job&iis=Job+Board&iisn=LabOverflow.com"
  },
  {
    "name": "Staff Researcher",
    "slug": "staff-researcher",
    "company": "UC San Diego - 4.2",
    "location": "San Diego, CA",
    "age": "",
    "type": "",
    "salary": "Estimated: $33,000 - $45,000 a year",
    "description": "Payroll Title:\nSRA 2 NEX\n\nDepartment:\nSCH OF PHARMACY AND PHARM. SCI\nSalary Range\nCommensurate with Experience\n\nWorksite:\nCampus\n\nAppointment Type:\nCareer\n\nAppointment Percent:\n100%\n\nUnion:\nRX Contract\n\nTotal Openings:\n2\n\nWork Schedule:\nDays, 8 hrs/day, Monday - Friday\n\nAs a federally-funded institution, UC San Diego Health maintains a marijuana and drug free campus. New employees are subject to drug screening.\n\n#108586 Staff Researcher\nFiling Deadline: Wed 10/20/2021\nFor the safety and well-being of the entire university community, the University of California requires, with few exceptions, that all students, faculty and staff be vaccinated against the COVID-19 virus before they will be allowed on campus or in a facility or office. For more information visit: https://ucnet.universityofcalifornia.edu/news/2021/10/flu-vaccination-requirement-for-uc-students,-faculty-and-staff-issued-for-2021-2022.html\n\nUCSD Layoff from Career Appointment: Apply by 04/01/21 for consideration with preference for rehire. All layoff applicants should contact their Employment Advisor.\n\nSpecial Selection Applicants: Apply by 04/12/21. Eligible Special Selection clients should contact their Disability Counselor for assistance.\n\nDESCRIPTION\n\nUCSD Skaggs School of Pharmacy and Pharmaceutical Sciences is growing in the diverse areas of professional educational programs, cutting-edge research, and pharmacy services. Research areas specific to this position posting are related to analytical chemistry and microbiology testing of cannabis products. The school is committed to offering a dynamic learning environment and growing opportunities to its talented and dedicated employees.\n\nUnder general supervision and in accordance with laboratory SOPs, the Staff Researcher will prepare samples, perform analytical or microbiological testing, and report data. Analytical chemistry staff researchers will use a variety of state-of-the art instrumentation including LC/MS, GC/MS, ICP/MS, and HPLC. Microbiology staff researchers will be involved in microbial testing including use of qPCR and ELISA. Testing of cannabis products is performed for cannabinoids, terpenes, heavy metals, pesticides, residual solvents, mycotoxins, and microorganisms. Contributes ideas in the development of assays to support new applications of tandem mass spectrometry, liquid chromatography, PCR, and other technologies as appropriate. Participates in the operation and maintenance of analytical instrumentation within the laboratory. Contributes toward compliance with lab, department, university, state, and federal safety-related mandates and guidelines for the use of chemical and biological hazards.\n\nMINIMUM QUALIFICATIONS\n\nTheoretical knowledge of Biology, Cell Biology, Molecular Biology, or related field as typically attained by a Bachelors Degree; or an equivalent combination of education and experience.\n\nMinimum of two (2) years of practical experience in either LC-MS, GC-MS, or qPCR, with ability to proficiently and independently operate one or more of these instruments.\n\nExperience in a research laboratory. Demonstrated ability in laboratory organization..\n\nSkills necessary to operate state-of-the art laboratory instrumentation.\n\nAbility to learn new techniques and to adapt them to ongoing research projects.\n\nProven ability to understand the specific protocol of each experiment and the procedures for calculating the primary data.\n\nThorough knowledge of molecular biology techniques and microbiology techniques.\n\nProficient knowledge of computers and use of scientific software for data analysis.\n\nDemonstrated ability to perform standard assays.\n\nSkills necessary to perform calculation of experimental results.\n\nPREFERRED QUALIFICATIONS\nKnowledge of UC procedures for ordering, purchasing, shipping and inventory of supplies and equipment.\nKnowledge of UC and EH&S laboratory safety procedures (particularly concerning radioactive material).\nSPECIAL CONDITIONS\nEmployment is subject to a criminal background check.\nMust be willing to work a hours some evenings and/or weekends, if necessary.\nMust be willing to work with hazardous materials.\n\nJob offer is contingent on successful engagement in the UC COVID-19 Vaccination program (fully vaccinated with documented proof or approved exception/deferral).\n\nUC San Diego Health is the only academic health system in the San Diego region, providing leading-edge care in patient care, biomedical research, education, and community service. Our facilities include two university hospitals, a National Cancer Institute-designated Comprehensive Cancer Center, Shiley Eye Institute, Sulpizio Cardiovascular Center, and several outpatient clinics. UC San Diego Medical Center in Hillcrest is a designated Level I Trauma Center and has the only Burn Center in the county. We invite you to join our dynamic team!\n\nApplications/Resumes are accepted for current job openings only. For full consideration on any job, applications must be received prior to the initial closing date. If a job has an extended deadline, applications/resumes will be considered during the extension period; however, a job may be filled before the extended date is reached.\n\nUC San Diego Health is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, age, protected veteran status, gender identity or sexual orientation. For the complete University of California nondiscrimination and affirmative action policy see: http://www-hr.ucsd.edu/saa/nondiscr.html\n\nUC San Diego is a smoke and tobacco free environment. Please visit smokefree.ucsd.edu for more information.",
    "benefits": [
      "EHS",
      "Cell biology",
      "Microbiology",
      "Laboratory experience",
      "Molecular biology",
      "Bachelor's degree",
      "Pass drug screening",
      "Criminal background check"
    ],
    "sourceUrl": "https://employment.ucsd.edu/108586-staff-researcher/job/17824432?emid=3640"
  }
]
