[
  {
    "name": "Lab Technician - Cannabis Tissue Culture",
    "slug": "lab-technician---cannabis-tissue-culture",
    "company": "Dark Heart Nursery - 2.8",
    "location": "Davis, CA",
    "age": "",
    "type": "Full-time",
    "salary": "Estimated: $36,000 - $46,000 a year",
    "description": "Dark Heart Nursery, the leader in cannabis clone production in California, is looking for a Lab Technician to join our team in our Lab in Davis, CA.\n\nThis is a Full Time Position.\n\nPOSITION SUMMARY\n\nUnder the direction of the Lab Manager and in alignment with the Company Core Values, the Lab Technician assists in all day to day lab activities in a tissue culture production environment, including, but not limited to, processing plant materials, preparing media, employing aseptic technique, capturing data, sanitizing tools and equipment, and maintaining lab cleanliness.\n\nEssential Duties and Responsibilities:\nFollow standard operating procedures at all times in a safe and compliant manner.\n\nSubculture plants and tissues using aseptic technique.\n\nPrepare media suitable for plants or tissues to be cultured.\n\nPrepare plants or tissues for initiation into culture.\n\nCollect and process tissues for diagnostic testing.\n\nRecord data for inventory management, KPI's, and R&D.\n\nSet up and operate equipment, including autoclave, microscope, pumps, and centrifuges.\n\nMaintain clean lab area, glassware, and equipment.\n\nCollaborate with and provide support to lab staff.\n\nContribute to process improvement and R&D efforts.\n\nPromptly report breaches in compliance, safety, and sanitation to management.\n\nOther duties may be assigned as required.\n\nQUALIFICATIONS\n\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily (with or without accommodations). The requirements listed below are representative of the knowledge, skill, and ability required.\n\nEducation and Experience:\nHS diploma or equivalent required, Bachelor’s degree in a relevant scientific discipline preferred\n\n6+ months of applicable laboratory and/or plant propagation experience preferred\n\nPrevious micropropagation and/or aseptic technique experience strongly preferred\n\nCompetencies:\nStrong analytical and problem-solving skills\n\nAbility to work independently and in collaboration with teams\n\nProven ability to perform a variety of tasks under time constraints and strict deadlines\n\nDemonstrated efficiency, productivity, attention to detail, accuracy, and organization\n\nExcellent written and verbal communication skills\n\nAbility to accurately enter data in a spreadsheet or form\n\nPHYSICAL DEMANDS:\nRemaining in a seated or standing position for extended periods of time\n\nPerforming delicate, repetitive tasks with hands, fingers, and wrists\n\nExercising a consistently high degree of accuracy when using fine motor skills\n\nReach overhead and/or use step stool\n\nAble to lift/carry up to 50 pounds\n\nMust wear PPE, including gloves, mask/respirator, eye protection, and lab coat\n\nGood eyesight (may be corrected)\n\nExpressing or exchanging ideas by means of the spoken word\n\nWORK ENVIRONMENT:\nClimate controlled laboratory conditions\n\nConfined space and secured area\n\nStrong odors from machinery, culture media, plant matter, alcohol, bleach, and other chemicals\n\nLoud noises from machinery\n\nExposure to hazardous chemicals\n\nNormal hours of operation Monday through Friday, 8:00 a.m. – 4:30 p.m. (may be subject to change depending on operational needs)\n\nEEOC STATEMENT:\nDark Heart Nursery, Inc. provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, disability, genetic information, marital status, amnesty, or status as a covered veteran in accordance with applicable federal, state and local laws. Dark Heart Nursery complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including, but not limited to, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.",
    "benefits": [
      "Analysis skills",
      "Communication skills",
      "Aseptic technique",
      "Bachelor's degree",
      "High school diploma or GED"
    ],
    "sourceUrl": "https://dhjobs.hiringthing.com/job/117582/lab-technician-cannabis-tissue-culture?s=in"
  },
  {
    "name": "CDP (Cannabis Derived Product) Manager",
    "slug": "cdp-(cannabis-derived-product)-manager",
    "company": "The Verdes Foundation - 3.8",
    "location": "Albuquerque, NM",
    "age": "",
    "type": "Full-time",
    "salary": "Estimated: $52,000 - $75,000 a year",
    "description": "Exempt /Full-time (40 weekly hours)\n\nReports To: VP Operations\n\nCollaborates With: All Operations Teams, Cultivation/Harvest, Marketing, Product Manager and Dispensary Operations\n\nJob Summary:\nOversee the manufacturing, labeling and inventory control of cannabis derived products for distribution through dispensaries. This position is responsible for effectively managing a small team and manufacturing schedule for edibles, cartridges and topicals. This department will also support cannabis extraction process and oil/distillate production. This position is expected to execute research and development of new products, flavors and configurations. The CDP Manager is expected to audit the quality of products being manufactured and developed.\n\nThis role must be engaged in increasing efficiency through implementation of automation, leveraging best practices and ensuring product availability for all retail locations. This position is expected to implement and audit inventory control measures to reduce risk and product loss.\n\nThis role commits to spend the first 6 months training on all product manufacturing, extraction, distillation and development processes.\n\nResponsibilities/Essential Functions:\nBuild, train and maintain a high-performing, collaborative and adaptable team.\nSupervise staff and processes to ensure high-quality, consistent, reliable, compliant and safe product manufacturing.\nDevelop and execute the manufacturing schedule to ensure product availability.\nTrack and manage key performance metrics including productivity, margins, and quality.\nPartner with Marketing to support specials and promotions.\nInnovate and create new CDP products and processes that align with the Verdes brand.\nPartner with Process Engineer to ensure equipment is properly used and maintained.\nMaintain updated processes, procedures, and batch record to support GMP-like manufacturing.\nEnsure raw materials and supplies are maintained to support consistent manufacturing schedules.\nManage LeafLogix for inventory, recipes, labels, transfers, manifests and seed-to-sale controls.\nMaintain a safe and clean work environment.\nEdibles: Oversee the preparation of a variety of products according to established recipes. Keep a consistent and accurate stock of ingredients and supplies. Complete production sheets and other records as required. Package and label finished baked goods. Observe necessary commercial kitchen hygiene. Clean and maintain work areas, utensils and equipment.\nLab: Observe Lab Standard Procedures.?Extract cannabis oil to be used for edible production?and maintain quality and yields for oil and distillate production.?Produce a variety of lab products (tinctures, concentrates, beverages, etc). Prepare and submit samples for testing.?Conform to all standard safety requirements. Maintain lab in a safe and clean manner.?Perform routine housekeeping responsibilities (sweep, mop, clean glassware and equipment, surface cleaning). Order?and procure?supplies unique to this operation.?\nProduction: Oversee preparation and manifesting of product orders. Ensure product labels and barcodes are printed properly and applied to products manually or using automated equipment. Assist all departments with product packaging and labeling. Maintain inventory to ensure product availability.\nOther duties as assigned, including delivery of product to manufacturing and/or retail locations.\n\nRequired Skills and Qualifications:\nBachelor’s degree and experience managing a team\nExperience working in highly regulated industries. Understanding of regulations and compliance in the cannabis industry.\nAcquire and maintain certification in Food Service Safety and Sanitation\nStrong attention to detail and quality.\nAble to perform basic math and algebraic equations.\nExcellent problem-solving, organizational, analytical and critical thinking skills. Ability to prioritize work and make complex decisions.\nAbility to listen, develop strategy and tactics, communicate and direct your team.\nAble to use a computer to track inventory, print labels and UPC codes/tags.\nAble to perform basic tasks in Outlook, Teams, Word and Excel.\n\nPreferred Qualifications:\nManufacturing experience, specifically experience with GMP, GDP or GLP\nContinuous improvement certification (Lean, Six Sigma, Agile, Design Thinking, etc.)\nCooking and baking experience\nExperience or awareness with laboratory equipment and processes\n\nGeneral Housekeeping:\nPerform routine housekeeping activities to maintain a safe workspace\n\nComputer Preferred Qualifications:\nRobust Excel knowledge and experience\n\nPhysical and Emotional Requirements:\nMust be able to stand for long periods of time, 8 – 10 hours multiple days in a row\nMust be able to lift at least 50 lbs.\nAbility to work in a confined area.\nMust be able to bend/stoop/climb/reach\nMust be able to present complex information to groups of people\nMust be able to be physically present in work location\nAbility to handle high stress situations, ambiguity and changing priorities\nMust be able to tolerate a reasonable amount of work stress\n\nCompensation/Hours:\nCompensation - DOE; 40 hours/wk., Required Mon – Fri, some weekends and Holidays, 8:00am to 5:00pm\n\nIt is the policy of The Verdes Foundation to provide equal employment (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, sexual orientation, gender identity, and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, The Verdes Foundation, will provide reasonable accommodations for qualified individuals with disabilities.",
    "benefits": [
      "Six Sigma Certification",
      "Analysis skills",
      "Team management",
      "Microsoft Excel",
      "Design thinking",
      "Bachelor's degree"
    ],
    "sourceUrl": "https://secure2.entertimeonline.com/ta/VerdesFound.careers?ShowJob=419605061"
  },
  {
    "name": "Analytical Chemist - Metals",
    "slug": "analytical-chemist---metals",
    "company": "Montrose Environmental Group, Inc. - 2.9",
    "location": "Orange, CA",
    "age": "",
    "type": "Full-time",
    "salary": "Estimated: $65,000 - $86,000 a year",
    "description": "ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nOur Orange, CA facility is currently seeking a Full-Time Analyst to join our Metals Department.\n\nAs a key member of the laboratory team, this role will be responsible for a full range of activities including:\n\nDaily monitoring of sample scheduling to ensure that samples are analyzed within EPA's and methods’ holding time\nSchedule workload in order to report data within clients expected due dates\nRoutine sample preparation and analysis according to Standard Methods 846 and EPA methods\nPerforms analyst's review of data and QC\nReviews of QA/QC criteria for batch acceptance\nAdheres to Standard Operating Procedures and follow safe work practices\nParticipates in instruments' preventative maintenance and trouble shooting\nParticipates in focus teams to improve efficiency\nBe flexible in work schedule including overtime when needed\nReact to change productively and handle other essential tasks as assigned\nPerforming other duties and responsibilities as prescribed by the Company\nCompliance with Enthalpy's Quality Assurance Program and other policies\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nBachelor's degree in Chemistry, Biology, Environmental Science, or related field\nMinimum 2-4 years of lab experience preferred\nKnowledge of analytical method, analytical instruments, general lab practices and lab safety\nExperience in ICP, ICPMS or IC is a plus\n\nPreferred Skills\n\nKnowledge of analytical method, analytical instruments, general lab practices and lab safety\nMust be flexible in work schedule (including Saturday) and able to work overtime\nWell organized and have an attention to detail\nAble to multi-task\nAbility to work independently and make sound decisions\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.",
    "benefits": [
      "Health insurance",
      "Disability insurance",
      "Tuition reimbursement",
      "401(k)",
      "Parental leave",
      "Laboratory experience",
      "Bachelor's degree"
    ],
    "sourceUrl": "https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-CA-Orange/Analytical-Chemist---Metals_R1529?mode=job&iis=Job+Board&iisn=LabOverflow.com"
  },
  {
    "name": "LC/MS Chemist - Cannabis Testing",
    "slug": "lc/ms-chemist---cannabis-testing",
    "company": "Hunter Care Health - ",
    "location": "Oklahoma City, OK",
    "age": "",
    "type": "",
    "salary": "Estimated: $43,000 - $55,000 a year",
    "description": "Demeter of Oklahoma / Metis QA Lab is a medical marijuana testing lab located in North Oklahoma City. We are a premier state-of-the-art laboratory with extensive expertise in cannabis testing and analysis. We utilize standardized scientific instrumentation for all cannabis testing and screening procedures including cannabinoid potency, residual solvents, pesticides, mycotoxins, microbial, and heavy metal.\n\nResponsibilities:\nThe LC/MS Chemist will be responsible for processing and analyzing medical marijuana samples to provide information on pesticides, mycotoxins and other compounds present using Shimadzu 8050 and SciEx 4500 LC-MS/MS.\n\nEssential Job Duties Include:\nPrepare and analyze samples from various cultivators, processors, and dispensaries to meet the rules and regulations governing medical marijuana testing in the State of Oklahoma.\nResponsible for operating, troubleshooting both Shimadzu 8050 and SciEx 4500 LC-MS/MS.\nPrepare chemical solutions for use in processing samples, following standardized formulas or experimental procedures.\nDocuments results of tests and analyses in an organized and timely manner.\nInterpret data and communicate specimen results with cultivators, processors, dispensaries, and laboratory staff with complete confidentiality.\nDemonstrates basic knowledge of laboratory quality control and assurance procedures in compliance with ISO regulations.\nResponsible for testing, calibrating, and performing quality control tests on lab equipment.\nPromotes a positive and safe work environment through understanding of safety (OSHA) regulations, practices, and procedures, including but not limited to biological and chemical hazards.\nFollows all company policies and procedures to ensure product integrity and quality control.\nWorks with laboratory information management system (LIMS).\nReports directly to the laboratory manager.\nWilling to meet on-call obligations as needed.\n\nKnowledge, Skills and Abilities:\nB.S. in technical science, MS preferred.\nChemistry lab experience using a variety of analytical techniques and instrumentation.\nExcellent listening and communication skills, self-motivated with strong organizational and teamwork skills; and strong written and verbal communication skills.\nMust be customer service oriented.\nLC-MS experience required, particularly operating Shimadzu and Sciex platforms.\n\nSpecial Requirements:\nCandidate must retain confidentiality and all reasonable precautions to keep clients’ data and other information confidential.\nValid Driver’s License\nMust be able to legally work in the United States.\n\nPhysical Requirements:\nAble to lift/carry up to 25 pounds.\nAbility to bend at the waist, squat.\nAbility to work with hands, see and hear.\n\nConditions of Employment:\nContingent upon a favorable background check.\nContingent on passing a pre-employment drug screening.\nMust maintain a valid driver’s license.\n\nThe above primary duties, responsibilities, and position requirements are not all inclusive.",
    "benefits": [
      "Laboratory experience",
      "Communication skills",
      "Customer service",
      "Driver's License",
      "Quality control",
      "Bachelor of Science",
      "Bachelor's degree",
      "Master's degree",
      "Pass drug screening",
      "US work authorization"
    ],
    "sourceUrl": "https://huntercarehealth.bamboohr.com/jobs/view.php?id=199&source=indeed&src=indeed&postedDate=2022-01-10"
  },
  {
    "name": "Dispensary Inventory Supervisor",
    "slug": "dispensary-inventory-supervisor",
    "company": "deep roots harvest - 2.3",
    "location": "Las Vegas, NV",
    "age": "",
    "type": "",
    "salary": "$39,000 a year",
    "description": "Reports to:Retail Store Manager\n\nDepartment:Retail\n\nRequired Permits/Licensing/Registration: Marijuana Establishment Agent Card\n\nFLSA Status:Exempt\n\nSupervisory Responsibilities:\nDispensary Inventory Lead\n\nDispensary Hosts\n\nOverview:\nFollowing policies set forth by the Company in concert with the Retail Manager and Sales, provide support in the general operation of the company through the organization and management of Dispensary inventory to maximize operational efficiency.\n\nEssential Functions:\nSupport the operations of the Retail Department by accurate and efficient management of all merchandise and cannabis product inventories.\n\nFulfill daily obligations to the satisfaction of supervisory staff\n\nThorough communication of any obstacle which limits their capability to see individual duties through to completion\n\nRelay to superiors any conditions observed that may affect the successful completion of that day’s work.\n\nComplete or oversee everyday inventory control responsibilities including but not limited to;\n\nAssignment, generation, and application of required packaging tags\n\nIncoming internal and external product transfers (acceptance upon intake)\n\nTransfer manifest acceptance (upon verification of physical inventory received)\n\nVerification of the receipt of all required transfer specific supporting documentation for all products received including:\n\nIndependent Testing Laboratory Certificates of Analysis\n\nSoil Amendments/Disclosures\n\nAddition of saleable products to POS inventory\n\nPerformance of periodic, monthly, and quarterly inventory reconciliations\n\nAll matters related to compliance of State and Federal regulations.\n\nUtilizes internal and Department of Taxation mandated databases to ensure accuracy of incoming shipments and corresponding manifests/invoices\n\nFulfill assigned responsibilities in line with procedures set forth by all department Standard Operating Procedures and subsequent training\n\nOther duties as assigned\n\nJob Specifications:\nOperate under the guidelines provided by company policies and procedures.\n\nAbility to understand and complete all given directives in a timely manner.\n\nAbility to communicate clearly whether verbally or in writing\n\nBasic understanding of compliance software and job specific information technology\n\nAdherence to all industry standards set forth by Local, State, and Federal regulations.\n\nCapacity to work autonomously to achieve daily directives and department goals.\n\nFlexible work schedule required; to include covering a vacant shift and/or facility issues in emergency situations as needed.\n\nRepresent the company in a professional manner when communicating or interacting with all local community, state, or federal officials.\n\nObserve and maintain all safety procedures and protocols\n\nAdditional Functions:\nAbility to be flexible and work in various sectors of the department or company as needed and/or requested by their direct supervisor.\n\nAbility to listen well and communicate effectively orally and in writing with various audiences.\n\nAbility to use initiative and independent judgment appropriately.\n\nAbility to apply appropriate public relations skills in various situations and circumstances and to facilitate change as needed.\n\nThe ability to work in a fast-paced, changing and challenging environment.\n\nMust be proficient in Windows based software and point of sale applications.\n\nMust have excellent communications skills and attention to detail.\n\nAbility to interpret, understand, and comply with complex statutes, ordinances, regulations, standards, and laws.\n\nUnderstanding of applicable federal, state and local laws and regulations as they pertain to the industry, personnel law, safety regulations, local municipal codes and organizational rules, regulations, directives and standard operating procedures.\n\nAbility to establish and maintain effective working relationships with employees, management, governmental agencies, community members and the general public.\n\nAbility to use standard office equipment, computer equipment and software including word processing, database management, spreadsheet applications and electronic mail.\n\nAdditional Requirements:\nMust be a minimum of 21 years of age\n\nMust pass any and all required background checks\n\nMust be and remain compliant with any and all legal or company regulations for working in the industry\n\nMinimum Education and Experience:\nPrevious retail experience preferred\n\nPrevious inventory experience preferred\n\nEquivalent combinations of education and experience may be considered, including internal experience.\n\nWorking Conditions:\nWhile performing the duties of this job, the employee is regularly required to perform grasping, talking, hearing, seeing, standing, sitting, bending, twisting, lifting, climbing, and repetitive motions.\n\nPHYSICAL DEMANDS: Must be able to lift, carry and balance up to 40 pounds (100 pounds with assistance)\n\nMust be able to tolerate dusty, strong smelling marijuana odors, and be able to tolerate exposure to the product.",
    "benefits": [
      "Writing skills",
      "Windows",
      "Public relations",
      "21 years or older"
    ],
    "sourceUrl": "https://secure6.saashr.com/ta/6156038.careers?rnd=DVV&ShowJob=419849685&%40rtm=1"
  },
  {
    "name": "CDP (Cannabis Derived Product) Associate",
    "slug": "cdp-(cannabis-derived-product)-associate",
    "company": "The Verdes Foundation - 3.8",
    "location": "Albuquerque, NM",
    "age": "",
    "type": "Full-time",
    "salary": "Estimated: $22,000 - $31,000 a year",
    "description": "Non-Exempt /Full-time (40 weekly hours)\n\nReports To: CDP Manager\n\nCollaborates With: All Operations Teams and Dispensary Operations\n\nJob Summary:\nThe CDP Associate is a product manufacturing position for cannabis derived products including edibles, cartridges and topicals. This position will also support cannabis extraction process and oil/distillate production. This role commits to spend the first 6 months training on all product manufacturing processes.\n\nResponsibilities/Essential Functions:\nEnsure high quality, consistent, reliable, compliant and safe manufacturing processes.\nSupport the manufacturing schedule to ensure product availability.\nKitchen: Prepare a variety of products according to established recipes. Keep a consistent and accurate stock of ingredients and supplies. Complete production sheets and other records as required. Package and label finished baked goods. Observe necessary commercial kitchen hygiene. Clean and maintain work areas, utensils and equipment.\nLaboratory: Observe Lab Standard Procedures.?Extract cannabis oil to be used for edible production?and maintain quality and yields for oil and distillate production.?Produce a variety of lab products (tinctures, concentrates, beverages, etc). Prepare and submit samples for testing.?Conform to all standard safety requirements. Maintain lab in a safe and clean manner.?Perform routine housekeeping responsibilities (sweep, mop, clean glassware and equipment, surface cleaning). Order?and procure?supplies unique to this operation.?\nProduction: Prepare and manifest product orders. Print product labels and barcodes. Apply product labels and barcodes, manually and using automated equipment. Assist all departments with product packaging and labeling. Maintain inventory to ensure product availability.\nOther duties as assigned, including delivery of product to retail locations.\n\nRequired Skills and Qualifications:\nAcquire and maintain certification in Food Service Safety and Sanitation\nStrong attention to detail and quality.\nAble to perform basic math and algebraic equations.\nGood problem-solving, organizational, analytical and critical thinking skills. Ability to prioritize work and make simple decisions.\nAbility to listen, follow directions, communicate and support your team.\nAble to use a computer to track inventory, print labels and UPC codes/tags.\nAble to perform basic tasks in Outlook, Teams, Word and Excel.\nUnderstanding of regulations and compliance in the cannabis industry.\n\nPreferred Qualifications:\nManufacturing experience, specifically experience with GMP, GDP or GLP\nCooking and baking experience\nExperience or awareness with laboratory equipment and processes\nCannabis experience not required or preferred\n\nGeneral Housekeeping:\nPerform routine housekeeping activities to maintain a safe workspace\n\nComputer Preferred Qualifications:\nRobust Excel knowledge and experience\n\nPhysical and Emotional Requirements:\nMust be able to stand for long periods of time, 8 – 10 hours multiple days in a row\nMust be able to lift at least 50 lbs.\nAbility to work in a confined area.\nMust be able to bend/stoop/climb/reach\nMust be able to present complex information to groups of people\nMust be able to be physically present in the dispensary locations and administrative office\nAbility to handle high stress situations, ambiguity and changing priorities\nMust be able to tolerate a reasonable amount of work stress\n\nCompensation/Hours:\nCompensation - DOE; 40 hours/wk., Required Mon – Fri, some weekends and holidays, 8:00am to 5:00pm\n\nIt is the policy of The Verdes Foundation to provide equal employment (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, sexual orientation, gender identity, and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, The Verdes Foundation, will provide reasonable accommodations for qualified individuals with disabilities.",
    "benefits": [
      "Analysis skills",
      "Cooking",
      "Microsoft Excel",
      "GLP",
      "CGMP"
    ],
    "sourceUrl": "https://secure2.entertimeonline.com/ta/VerdesFound.careers?ShowJob=419605059"
  },
  {
    "name": "Microbiologist 3",
    "slug": "microbiologist-3",
    "company": "State of Washington Dept. of Agriculture - 3.4",
    "location": "Olympia, WA",
    "age": "",
    "type": "Full-time",
    "salary": "$61,224 - $80,292 a year",
    "description": "Description\n\nAGRICULTURE - A Cornerstone of Washington's Economy\n\nThe Washington State Department of Agriculture has been serving the state for more than 100 years. Through service, regulation and advocacy, we keep agriculture viable and vital in Washington State, while protecting consumers, public health, and the environment. We work extensively with farmers and ranchers, but our responsibilities – from ensuring food safety to environmental protection – touch the lives of millions of people locally, nationally, and abroad.\n\nThe agency includes 780 employees approximately and grows close to 1,000 employees at the peak of seasonal work. To learn more and view additional openings, please visit our Employment Page.\n\nApply Early! We will do first review of candidates for this role on 1/24/2022.\n\nABOUT THE POSITION:\nThe mission of the Food Safety and Consumer Services Laboratory is to provide laboratory testing to protect the public’s health by conducting analyses of dairy, human food, animal feed, produce, cannabis, and environmental samples for regulatory purposes. The Laboratory’s data also allows for the shipment of dairy products and provides information for food borne pathogen surveillance. The position: 1) supports the use of the quality system that is evidence that the laboratory is capable of delivering reliable laboratory test results; 2) serve as a Laboratory Evaluation Officer (LEO) in the state and acts on behalf of FDA to regulate dairy plant appendix N labs as needed, OR serves as one of the microbiologists in non-dairy products testing; and3) serves as a primary back-up microbiologist in one of the lab’s technical sections\n\nDuties\n\nServes as the Lead in Dairy Section, one of the main technical sections in the laboratory.\nConducts analysis of dairy and water samples.\nServes as one of the primary analysts in cannabis and fresh produce testing.\nDesigns and coordinates ad-hoc research projects within the laboratory sections.\nCoordinates activities of personnel within the laboratory sections to ensure that the laboratories are adequately staffed at all time.\n\nQualifications\n\nRequired Education & Experience:\nA Bachelor's degree with a major in microbiology, public health, biochemistry, medical technology or closely allied field which includes at least 20 semester or 30 quarter credit hours in microbiology.\n\nAND\n\nFour years of professional experience in a microbiology lab or similar lab science laboratory.\n\nOR Equivalent education/experience.\n\nNote:\nA Master’s degree in one of the aforementioned fields may be substituted for one year of experience. A Ph.D. degree in one of the aforementioned fields may be substituted for one year of experience.\n\nDesired:\nAn advanced degree (Masters or Ph.D.) in microbiology, molecular biology, biochemistry, public health or closed allied fields.\nFive years of professional experience in a microbiology or similar lab science laboratory at a Microbiologist-2 or equivalent level. This experience should be at least a Microbiologist 2 or equivalent position level. A Master’s degree may be substituted for one year of experience, and a Ph.D. degree may be substituted for two years of experience.\nBe able to obtain certification as an analyst in the Interstate Milk Shippers program\nExperience with microbiological testing of dairy, feed/food in a regulatory laboratory, and experience with microbiological research projects and quality assurance projects.\nExperience with ISO/IEC 17025 accreditation and Laboratory Information Management System\nExperience with grant writing and applications.\nStrong background in advanced laboratory analytical instrument\n\nSupplemental Information\n\nHow to Apply:\nYou must complete your careers.wa.gov profile and answer the supplemental questions. In addition to completing the online application, and supplemental questions applicants must attach the following documents to their profile in order to be considered for this position:\n\nA letter of interest to describe why you are the best candidate and how you meet the specific qualifications for this position.\nCurrent resume detailing experience and education\nBy submitting these materials, you are indicating that all information is true and correct. The state may verify information. Any untruthful or misleading information is cause for removal from the applicant pool or dismissal if employed.\n\nPlease Note:\nApplications with comments \"see attachments\" will be considered incomplete\nThis job posting will remain active until filled. Human Resources may use this post to fill similar positions for up to 6 months.\nIf you are having technical difficulties creating, accessing or completing your application, please call NEOGOV toll-free at (855)524- 5627 or email support@neogov.com.\nShould you have any questions regarding this position or the online application, contact the Human Resource Office at Recruitment@agr.wa.gov.\nPrior to a new appointment into the Department of Agriculture, a background check including criminal record history will be conducted. Information from the background check will not necessarily preclude employment, but will be considered in determining the applicant's suitability and competence to perform in the position. We will consider qualified applicants with criminal histories, consistent with applicable federal, state and local laws.\nThe initial screening will be solely based on the contents and completeness of your application and the materials submitted. All information may be verified and documentation may be required. Applications received via e-mail will not be accepted in lieu of applying through the state's on-line recruitment system.\nThe Human Resources Division may use referrals from this recruitment to help fill future similar vacancies for up to six months.\n\nCOVID-19 VACCINATION:\nPursuant to Washington State Governor Inslee’s Proclamation on August 9, 2021 all employees who work for the Washington State Department of Agriculture must be fully vaccinated against COVID-19. Proof of fully vaccinated status against COVID-19 must be shown to WSDA’s human resource office prior to employment.\n\nSupporting Veterans, Diversity & Disability\n\nVeteran's Preference: Applicants who meet the minimum qualifications and wish to claim Veteran's Preference MUST attach a copy of their DD214, or other verification of military service. Please blackout any personally identifiable data such as social security numbers. For additional information on Veteran's Preference and guidance on how to determine if you are eligible, click here.\nMilitary Spouse Preference: To take advantage of military spouse preference, you will have an opportunity to identify your status in the questionnaire. We thank you and are grateful for your service!\nThe Department of Agriculture celebrates our differences and we are committed to a workplace that supports equal opportunity employment and inclusion regardless of race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity diversity, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.\nPersons with a disability, who need assistance with their application or need this announcement in an alternative format, may call 664-1960 or toll free (877) 664-1960. TTY users should first call 711 to access the Washington Relay Service.",
    "benefits": [
      "Research",
      "Grant writing",
      "Laboratory experience",
      "Public health",
      "Quality assurance",
      "Doctoral degree",
      "Bachelor's degree",
      "Master's degree",
      "Doctor of Philosophy"
    ],
    "sourceUrl": "https://www.governmentjobs.com/careers/washington/jobs/3383417/microbiologist-3"
  },
  {
    "name": "Lab Analyst",
    "slug": "lab-analyst",
    "company": "Sonoma Lab Works - ",
    "location": "Santa Rosa, CA",
    "age": "",
    "type": "Full-time",
    "salary": "Estimated: $35,000 - $48,000 a year",
    "description": "ABOUT US:\nSonoma Lab Works is a state-of-the-art licensed laboratory facility in Santa Rosa, California. We engage in testing of cannabis and hemp products for both compliance and research & development purposes.\n\nWe work in a highly regulated industry that requires close adherence to rules & regulations set forth by the state. We are an equal opportunity employer who is dedicated to providing a safe, professional, and productive work environment for our team members.\n\nWHO YOU ARE:\nYou have an interest and experience in lab science and are comfortable working in a fast-paced laboratory environment. You are flexible, communicate well, are quick to learn and follow procedures, and enjoy interacting with a team.\n\nDUTIES & RESPONSIBILITIES\n\nFollows established high-complexity analysis methods and procedures\nWorks closely with lab technicians to ensure samples are analyzed shortly after preparation\nFollows sample progress with LIMS/record keeping\nEnsures all data is transferred accurately to LIMS and identifies any data errors\nAssists with Quality Assurance\nPrepares samples for high complexity testing, including routine sample preparation and breaking down samples\nParticipates in monitoring levels of inventory and preventing stock-outs\nAssures proper calibration and function of laboratory equipment, including routine and preventative maintenance\nAssists in the upkeep of cleanliness in the laboratory, including workspace organization, disposal of waste, and cleaning of glassware\nAssists in training and onboarding of new Lab Technicians\nAssists in daily prioritization of samples depending on rush status\n\nREQUIRED QUALIFICATIONS & EXPERIENCE\n\nMust be minimum 21 years old\nBachelor’s degree in chemistry or related field of study or minimum 2 years of experience using the below instrumentation types\nProficiency with one or more of the following instrumentation types: HPLC, GC, GC-MS, GC-MS/MS, ICP-MS, LC-MS/MS\n\nKnowledge of sample preparation techniques\nMust be proficient with computer and mobile phone applications\nMust be able to lift/move items up to 35 lbs\nMust be able to stand/sit for extended periods of time\n\nDESIRED ATTRIBUTES\n\nAbility to thrive in a fast-paced, high-volume environment with an emphasis on accuracy and timeliness\nSelf-motivation, accountability, adaptability, and a positive attitude\nInitiative to ask questions to overcome obstacles and find solutions\nRemaining composed and calm under pressure\nAbility to laugh and have a good time without losing your focus while working really hard\nExcellent written and verbal communications skills\nAbility to work independently and as part of a team\nProducing quality work under tight deadlines\n\nADDITIONAL DETAILS\n\nPosition is full-time hourly with opportunities for overtime\nAs a small business, all employees are expected to assist in cross-department duties as needed\nCompetitive benefits package includes paid vacation, holidays and sick time, company-paid health insurance, and company-matched 401(k) plan\n\nSonoma Lab Works is an Equal Opportunity Employer",
    "benefits": [
      "Paid time off",
      "401(k)",
      "Health insurance",
      "401(k) matching",
      "Bachelor's degree",
      "21 years or older"
    ],
    "sourceUrl": "https://sonomalabworks.bamboohr.com/jobs/view.php?id=50&source=indeed&src=indeed&postedDate=2022-01-10"
  },
  {
    "name": "Extraction Manager",
    "slug": "extraction-manager",
    "company": "BPN-RPC Staffing and SPARC - ",
    "location": "Santa Rosa, CA",
    "age": "",
    "type": "Full-time",
    "salary": "",
    "description": "Extraction Manager*Job DescriptionBPN-RPC Staffing, Inc.**JOB TITLE: Extraction Manager**STATUS: Exempt (Full-time)**COMPENSATION: Salary + full medical, dental, long-term disability and life benefits, paid vacation, and paid sick time accrual**GENERAL SUMMARY OF DUTIES: The Extraction Manager will create product formulations and production formulation SOPs which will be used to create products for our vertically integrated cannabis business. The Extraction Manager will be responsible for the research of equipment and methods of emerging manufacturing, extractions and infusions in the industry.The Extraction Manager must understand and embrace the mission of SPARC, affiliate organization(s), and their role in the industry and local and greater communities.**SUPERVISION RECEIVED: Chief Operating Officer**SUPERVISION EXERCISED: Extraction and manufacturing staff.**EXAMPLE OF DUTIES: (This list may not include all of the duties assigned.)Create SOPs, refine, and develop procedures for the extraction of cannabis via supercritical CO2, cold water, ethanol, mechanical, and various other methods.Create SOPs, refine, and develop procedures for the manufacturing of cannabis infused products.Coordinate the maintenance of the extraction and refinement equipment that extracts cannabinoids from a variety of cannabis plant material.Accurately and precisely measure and record all inputs and fractional products in the extraction process.Analyze raw, in-process, and finished products utilizing quality control testing procedures as established by company SOP and in accordance with CA law.Document the throughput of all solvents and consumables needed for the extraction process.Document test results, batch performance, and variable events, report findings and suggest improvements.Calculate and reformulate raw materials or finished products that are out of specifications.Maintain accurate inventory record on all raw, in-process, and finished product allocated to manufacturing operations, perform regular cycle counts and investigate discrepancies.Records all analytical data within each step of the extraction process and input the data.Work with necessary parties to formulate, refine, and produce infused cannabis products, both ingestible and topical.Analyze chemical makeup of related products to assist with product development.Maintain proper care and assess working order of all equipment and utensils in extraction and post-processing lab, calibrate and perform regular quality checks on equipment and storage conditions.Maintain functionality and cleanliness of lab and all equipment, tend to the cleaning and maintenance of all equipment related to the extraction process.Collect products from distribution and manufacturing for safety and potency analysis as neededAssist in the development and optimization of SOP’s according to new methods of extraction.Communicate with CA Bureau of Cannabis and other regulating bodies as needed.Perform all work in accordance with all legal and regulatory requirements, policies/procedures, and strictly observe all lab safety rules, including the proper handling/disposal of hazardous materials.Any other reasonable request by company leadership.Maintain a positive work environment conducive to trust and respect.Maintain strictest confidentiality.Perform other related work as required.**PERFORMANCE REQUIREMENTS:Knowledge, Skills and AbilitiesWorking knowledge of extraction methods, recipes and products.Strong mathematics skillsAble to articulate complex matters professionally with various levels of individuals in both verbal and written formatDemonstrates good listening skills, builds strong relationships, is flexible and open-minded.Breaks down problems into smaller components, understands underlying issues, can simplify and process complex issues, and understands the difference between critical details and unimportant facts.Is attentive to detail, understanding the difference between and the importance of precision and accuracyCommitted to excellence, looks for improvements continuously, monitors quality levels, finds root cause of quality problems, owns/acts on quality problems.Highly organized with the ability to work under time constraints.Highly independent and self-motivated.Comfortable in a fast-paced environment, and possess the ability to communicate clearly and prioritize multiple tasksWorking knowledge of computers and Microsoft Office software.Must have an interest in working in a laboratory setting and comfortable working with cannabis and hazardous chemicals.Able to stand 60% of each day.Moderate physical demand; may include carrying empty and loaded extraction columns, as well as ice and water containers.PreferredPrevious experience with analytical instrumentation (particularly GC-MS) highly preferred.Experience or working knowledge with extraction and infusion methodology.Working knowledge of cannabis, cannabinoids, plant terpenes, and other phytochemicals.**EDUCATION/EXPERIENCE: Candidates with Bachelor's degree and 1-2 years of relevant extractions lab experience OR an Associate’s degree and 2+ years prior laboratory experience (non-academic) in a relevant area (an equivalent combination of experience and education may be considered as a substitute). Must be at least 21 years old and willing to submit to a criminal background check.**CERTIFICATES/LICENSES: None.**TYPICAL PHYSICAL DEMANDS: Work may require prolonged sitting, some bending, stooping and stretching. Requires eye‐hand coordination and manual dexterity sufficient to operate a computer, photocopier, telephone, calculator and other office equipment. Requires normal range of hearing. Requires close vision with the ability to see color and adjust focus. Requires lifting up to 50 pounds.**TYPICAL WORKING CONDITIONS: Work is performed in both a laboratory and office setting. Involves frequent contact with staff. Work may be stressful at times and may include dealing with law enforcement. Available to work varied hours/days, including nights, weekends, holidays, and/or events.*Job Type: Full-timePay: From $65,000.00 per yearBenefits:Dental insuranceEmployee assistance programEmployee discountHealth insuranceLife insurancePaid time offReferral programRetirement planVision insuranceSchedule:8 hour shiftCOVID-19 considerations:Masks are mandated indoor. SPARC is required to confirm that all team members are vaccinated and request for proof. If you are in need of religious or medical accommodation, we can provide you a form to see if you qualify for exemptionWork Location: One location",
    "benefits": [
      "Dental insurance",
      "Employee discount",
      "Health insurance",
      "Referral program",
      "Employee assistance program",
      "Laboratory experience",
      "Math",
      "Microsoft Office",
      "Gas chromatography",
      "Computer skills",
      "Bachelor's degree",
      "Associate's degree",
      "Master's degree",
      "Criminal background check",
      "21 years or older"
    ],
    "sourceUrl": "https://secure2.entertimeonline.com/ta/SPARC.Cannabis.careers?ApplyToJob=419598337"
  },
  {
    "name": "Business Development Manager",
    "slug": "business-development-manager",
    "company": "Montrose Environmental Group, Inc. - 2.9",
    "location": "Richmond, VA",
    "age": "",
    "type": "Full-time",
    "salary": "Estimated: $61,000 - $83,000 a year",
    "description": "ABOUT YOU\n\nAre you passionate and ready to join an inclusive work environment, committed to leading new ideas and pathways, and to delivering value? If the answer is, “Yes!” then we have an exciting career opportunity for you. Who are we? We are Montrose, a leading environmental services company with 1,600 employees across 70 locations worldwide, focused on supporting clients as they deal with the environmental challenges of today, and prepare for what’s coming tomorrow.\n\nWHAT WE CAN OFFER YOU\n\nOur Mission is: To help protect the air we breathe, the water we drink, and the soil that feeds us, and is supported by our Principles: We Value Our People, We Value Our Community, We Value Our Clients, We Value Our Shareholders. We care for the well-being of our people and offer:\n\nCompetitive compensation packages\nIndustry leading benefits packages including company paid life and disability insurance\nPaid parental leave benefits\nProgressive vacation policies and company holidays including floating holidays to meet the diverse needs of our people.\n401(k) plan offered\nA financial assistance program to help support peers in need\nAn educational reimbursement program\nAccess to best rates in the industry to bring your student loan debt down to size\n\nA DAY IN THE LIFE\n\nEnthalpy Analytical, is part of the larger organization, Montrose Environmental Group, is comprised of over 9 laboratories servicing air, water, soil, tobacco, cannabis, and toxicology testing. Regulations drive the need for our services, but our unique capabilities allow us to add value to clients beyond environmental compliance.\n\nWe are currently seeking a Full-Time Business Development Manager to be based in Richmond, VA or Durham, NC. This position will require up to 25% travel.\n\nAs a key member of the business team, the Business Development Manager performs a wide range of duties associated with increasing sales of services as well as being a point of contact between customers and the Company. The role will also will be responsible for selling tobacco, nicotine and cannabis work worldwide.\n\nAdditional duties are:\nThis role includes all aspects of business development across nicotine and cannabis product testing.\nResponsible for obtaining new clients\nManaging strategic client relationships in regions around the world, in support of revenue achievement and business development.\nComply with Enthalpy’s Quality Assurance Program and other policies\nOther duties as assigned by the Lab Supervisor or Lab Director\nEnsure staff comply with Enthalpy’s Health and Safety Plan\nOther duties and responsibilities as assigned\n\nNECESSARY QUALIFICATIONS\n\nTo perform this job successfully, individuals must be able to perform each duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the duties and responsibilities.\n\nBS/BA in Chemistry/Sciences, Business Administration, related field, and/or equivalent experience required.\nKnowledge of ISO 17025\nKnowledge of OECD guidelines\nMay be required to work long hours and some weekends, including overnight travel (up to 25%).\n\nPreferred Skills\n\nKnowledge of ISO 17025\nKnowledge of OECD guidelines\nMay be required to work long hours and some weekends, including overnight travel (up to 25%).\n\nThe above statements are intended to describe the general nature of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of employees so classified.\n\nThis position requires employee to be fully vaccinated for COVID-19, unless the employee receives a reasonable accommodation for a valid medical, religious, spiritual exemption. The Company will review requests for a reasonable accommodation for any such exemptions on a case-by-case basis. You are considered \"fully vaccinated\" at more than two (2) weeks after receiving the second dose in a 2-dose series or more than two (2) weeks after receiving a single dose vaccine.\n\nMAKE THE MOVE\n\nFrom comprehensive air measurement and laboratory services to regulatory compliance, emergency response, permitting, engineering, and remediation, Montrose delivers innovative and practical design, engineering and operational solutions that keep its clients on top of their immediate needs – and well ahead of the strategic curve. We are a fast-paced and dynamic team. At Montrose, you are your own boss, but you will get tons of guidance and plenty of support from talented, super-smart colleagues. Therefore, if freedom, autonomy, head-scratching professional challenges attract you, we’d love to speak with you.\n\nWant to know more about us? Visit montrose-env.com and have fun!\n\nMontrose is an Equal Opportunity Employer. Montrose is committed to providing access and reasonable accommodation in its employment for individuals with disabilities.",
    "benefits": [
      "Health insurance",
      "Disability insurance",
      "Tuition reimbursement",
      "401(k)",
      "Parental leave",
      "Bachelor of Science",
      "Bachelor's degree"
    ],
    "sourceUrl": "https://montrose.wd1.myworkdayjobs.com/en-US/MEG/job/USA-VA-Richmond-East-Parham-Rd/Business-Development-Manager_R1551?mode=job&iis=Job+Board&iisn=LabOverflow.com"
  },
  {
    "name": "Research Scientist 4",
    "slug": "research-scientist-4",
    "company": "Office of Cannabis Management - ",
    "location": "Albany, NY",
    "age": "",
    "type": "Full-time",
    "salary": "$95,908 - $118,129 a year",
    "description": "Bachelor's degree and five years of professional environmental research experience in a field relevant to professional cannabis testing/research including Environmental, Public Health, or Natural Sciences; OR a Master's degree in the field of Environmental Science or Natural Sciences and four years of professional environmental research experience in a field relevant to professional cannabis testing/research including Environmental, Public Health, or Natural Sciences; OR a Doctoral degree in the field of Environmental Science and three years of professional environmental research experience in a field relevant to professional cannabis testing/research including Environmental, Public Health, or Natural Sciences.\n\nDuties DescriptionWithin the Clinical unit, the incumbent of this position will provide oversight to ensure cannabis products are safe for consumers and comply with regulations for medical, adult-use (retail) and hemp cannabis.\n\nDuties include, but are not limited to:\nResearch quality standards, policies, and procedures for quality and product safety.Provide analysis and input on New York State legislative and regulation development.Coordinate with the Wadsworth Center for Laboratories and Research and state approved independent laboratories and review laboratory testing reports.Coordinate approval of independent laboratories to conduct cannabis testing in NYSReview and approval Standard Operating Procedures.Ensure corrective actions and precautions are taken for statement of findings reports issued and prevent reoccurrence according to established standards.Serve as subject matter expert and liaison to laboratories certified to conduct testing of cannabis in New York State and provide Quality Assurance oversight.Evaluate quality control and quality assurance procedures for deviations or deficiencies in policy and regulatory compliance.Research and oversee quality related Key Performance Indicator (KPI) reporting and performance.Direct and oversee analysis systems of statistical data to predict trends that will affect product quality.Direct and oversee staff conducting trend quality analysis to direct decisions over the quality assurance unit.Evaluate performance and quality metrics and ensure key metrics are met.Lead quality review meetings.Development of reports, summaries and presentations to senior staff, members of the Cannabis Control Board, the legislature, and other organizations on Office of Cannabis Management programs.Collaborate with other Research Scientists within OCM and across state agencies to compare and evaluate the impact of cannabis policies and programs based on available data.Perform full range of supervisory functions.\nAdditional CommentsWork location and telecommuting opportunities to be discussed at interview. All Office of Cannabis Management (OCM) employees are required to be tested weekly for COVID-19 unless they are fully vaccinated. Employees who are vaccinated must provide proof of vaccine status through a secure online portal. Salary will be commensurate with experience.",
    "benefits": [
      "Research",
      "Bachelor's degree",
      "Master's degree",
      "Doctoral degree"
    ],
    "sourceUrl": "https://statejobs.ny.gov/employees/vacancyDetailsView.cfm?id=97384#jobspecifics"
  }
]
